// @strict-types

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПрочитатьПараметрыФормы();
	ЗапуститьДлительнуюОперациюПолученияИдентификаторов();
	ОбновитьОтображениеФормыПриСозданииНаСервере();
	ОбновитьОтображениеФормы(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	НачатьОжиданиеПолученияИдентификаторовЭПД();
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	МассивНепроверяемыхРеквизитов = Новый Массив; // Массив из Строка
	
	Если Не ИдентификаторыУникальны() Тогда
		ТекстСообщения =
			НСтр(
				"ru = 'Идентификаторы участников не должны совпадать'",
				ОбщегоНазначения.КодОсновногоЯзыка());
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , , , Отказ);
	КонецЕсли;
	
	Если Не ИспользоватьКонтрагента Тогда
		МассивНепроверяемыхРеквизитов.Добавить("ИдентификаторКонтрагента");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(МассивНепроверяемыхРеквизитов) Тогда
		ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ИдентификаторОрганизацииАвтоПодбор(
	Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	ИдентификаторАвтоПодбор(Текст, ДанныеВыбора, ИдентификаторОрганизацииСписокВыбора, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ИдентификаторКонтрагентаАвтоПодбор(
	Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	ИдентификаторАвтоПодбор(Текст, ДанныеВыбора, ИдентификаторКонтрагентаСписокВыбора, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ИдентификаторПеревозчикаАвтоПодбор(
	Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	ИдентификаторАвтоПодбор(Текст, ДанныеВыбора, ИдентификаторПеревозчикаСписокВыбора, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ИдентификаторОрганизацииПриИзменении(Элемент)
	СервисEDIСлужебныйКлиентСервер.НормализоватьИдентификатор(ИдентификаторОрганизации);
КонецПроцедуры

&НаКлиенте
Процедура ИдентификаторКонтрагентаПриИзменении(Элемент)
	СервисEDIСлужебныйКлиентСервер.НормализоватьИдентификатор(ИдентификаторКонтрагента);
КонецПроцедуры

&НаКлиенте
Процедура ИдентификаторПеревозчикаПриИзменении(Элемент)
	СервисEDIСлужебныйКлиентСервер.НормализоватьИдентификатор(ИдентификаторПеревозчика);
КонецПроцедуры

&НаКлиенте
Процедура НадписьВернутьсяНаОсновнуюНажатие(Элемент)
	ОтобразитьСтраницуИнформации = Ложь;
	ОбновитьОтображениеФормы(ЭтотОбъект);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОрганизацияУказатьВручную(Команда)
	ОжидаетсяПолучениеИдентификатораОрганизации = Ложь;
	ВыполнитьКонтрольДлительнойОперации();
	ОбновитьОтображениеФормы(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентУказатьВручную(Команда)
	ОжидаетсяПолучениеИдентификатораКонтрагента = Ложь;
	ВыполнитьКонтрольДлительнойОперации();
	ОбновитьОтображениеФормы(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ПродолжитьОтправку(Команда)
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	ЗаписатьДанныеНаСервере();
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область НастройкиОбмена

// Параметры:
//  НастройкиОбмена - См. НастройкиОтправкиЭДО.НастройкиОтправки
// 
// Возвращаемое значение:
//  Булево
&НаСервереБезКонтекста
Функция УстановленыИдентификаторыНастроекОбмена(Знач НастройкиОбмена)
	
	Если НастройкиОбмена = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Не ПустаяСтрока(НастройкиОбмена.ИдентификаторОтправителя)
		И Не ПустаяСтрока(НастройкиОбмена.ИдентификаторПолучателя);
	
КонецФункции

&НаСервере
Процедура ПрочитатьНастройкиОбмена()
	
	ИдентификаторыОрганизации = Новый Массив; // Массив Из Строка
	
	Если ИспользоватьКонтрагента Тогда
		НастройкиОбменаКонтрагент = СервисEDIСлужебный.НастройкиОбмена(Организация, Контрагент, ВидДокумента);
		
		Если УстановленыИдентификаторыНастроекОбмена(НастройкиОбменаКонтрагент) Тогда
			
			ИдентификаторыОрганизации.Добавить(НастройкиОбменаКонтрагент.ИдентификаторОтправителя);
			ИдентификаторКонтрагента = НастройкиОбменаКонтрагент.ИдентификаторПолучателя;
			УстановленИдентификаторКонтрагента = Истина;
			
		КонецЕсли;
	КонецЕсли;
	
	НастройкиОбменаПеревозчик = СервисEDIСлужебный.НастройкиОбмена(Организация, Перевозчик, ВидДокумента);
	
	Если УстановленыИдентификаторыНастроекОбмена(НастройкиОбменаПеревозчик) Тогда
		
		ИдентификаторыОрганизации.Добавить(НастройкиОбменаПеревозчик.ИдентификаторОтправителя);
		ИдентификаторПеревозчика = НастройкиОбменаПеревозчик.ИдентификаторПолучателя;
		УстановленИдентификаторПеревозчика = Истина;
		
	КонецЕсли;
	
	ИдентификаторыОрганизации = ОбщегоНазначенияКлиентСервер.СвернутьМассив(ИдентификаторыОрганизации);
	
	Если ИдентификаторыОрганизации.Количество() = 1 Тогда
		ИдентификаторОрганизации = ИдентификаторыОрганизации[0];
		УстановленИдентификаторОрганизации = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПараметрыФормы

// Параметры:
//  Контекст          - Строка
//  ИмяПараметра      - Строка
//  ЗначениеПараметра - ЛюбаяСсылка
&НаСервере
Процедура ПроверитьЗаполненность(Знач Контекст, Знач ИмяПараметра, Знач ЗначениеПараметра)
	
	ОбщегоНазначенияКлиентСервер.Проверить(
		ЗначениеЗаполнено(ЗначениеПараметра),
		СтрШаблон(
			НСтр(
				"ru = 'Значение обязательного параметра формы %1 не заполнено'",
				ОбщегоНазначения.КодОсновногоЯзыка()),
			ИмяПараметра),
		Контекст);
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьПараметрыФормы()
	
	ПроверитьЗаполненность("ПроверитьПараметрыФормы", "Организация" , Организация);
	ПроверитьЗаполненность("ПроверитьПараметрыФормы", "Перевозчик"  , Перевозчик);
	
	Если ИспользоватьКонтрагента Тогда
		ПроверитьЗаполненность("ПроверитьПараметрыФормы", "Контрагент", Контрагент);
	КонецЕсли;
	
	ПоддерживаемыеВидыДокументов = Новый Массив; //Массив из СправочникСсылка.ВидыДокументовЭДО
	ПоддерживаемыеВидыДокументов.Добавить(ИнтерфейсДокументовЭДО.ВидДокументаПоТипу(Перечисления.ТипыДокументовЭДО.ЭЗЗ));
	ПоддерживаемыеВидыДокументов.Добавить(ИнтерфейсДокументовЭДО.ВидДокументаПоТипу(Перечисления.ТипыДокументовЭДО.ЭТрН));
	
	Если ПоддерживаемыеВидыДокументов.Найти(ВидДокумента) = Неопределено Тогда
		ТекстИсключения = СтрШаблон(НСтр(
			"ru = 'Вид документа ""%1"" не поддерживатеся.'",
			ОбщегоНазначения.КодОсновногоЯзыка()), ВидДокумента);
		ВызватьИсключение ТекстИсключения; 	
	КонецЕсли;
	
КонецПроцедуры

// Параметры:
//  ДанныеУчастников - См. СервисEDIСлужебный.НовыеДанныеУчастников
//  Участник         - ЛюбаяСсылка
//  Представление    - Строка
&НаСервере
Процедура ПрочитатьДанныеУчастника(
	Знач ДанныеУчастников, 
	Знач Участник,
	Представление)
	
	ДанныеУчастника = СервисEDIСлужебный.ДанныеУчастника(ДанныеУчастников, Участник);
	
	Представление = ДанныеУчастника.Представление;
	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьДанныеУчастников()
	
	ТаблицаУчастников = СервисEDIСлужебный.НоваяТаблицаУчастников();
	
	СервисEDIСлужебный.ДобавитьОрганизацию(ТаблицаУчастников, Организация);
	Если ИспользоватьКонтрагента Тогда
		СервисEDIСлужебный.ДобавитьКонтрагента(ТаблицаУчастников, Контрагент);
	КонецЕсли;
	СервисEDIСлужебный.ДобавитьКонтрагента(ТаблицаУчастников, Перевозчик);
	
	ДанныеУчастников = СервисEDIСлужебный.ДанныеУчастников(ТаблицаУчастников);
	
	ПрочитатьДанныеУчастника(
		ДанныеУчастников,
		Организация,
		ОрганизацияПредставление);
	Если ИспользоватьКонтрагента Тогда
		ПрочитатьДанныеУчастника(
			ДанныеУчастников,
			Контрагент,
			КонтрагентПредставление);
	КонецЕсли;
	ПрочитатьДанныеУчастника(
		ДанныеУчастников,
		Перевозчик,
		ПеревозчикПредставление);
	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьПараметрыФормы()
	
	//@skip-check statement-type-change - Параметры формы не поддерживают определяемые типы
	Организация  = Параметры.Организация;
	//@skip-check statement-type-change - Параметры формы не поддерживают определяемые типы
	Контрагент   = Параметры.Контрагент;
	//@skip-check statement-type-change - Параметры формы не поддерживают определяемые типы
	Перевозчик   = Параметры.Перевозчик;
	ВидДокумента = Параметры.ВидДокумента;
	
	ИнициализироватьИспользованиеКонтрагента();
	ПроверитьПараметрыФормы();
	ПрочитатьНастройкиОбмена();
	ПрочитатьДанныеУчастников();
	
КонецПроцедуры

&НаСервере
Процедура ИнициализироватьИспользованиеКонтрагента()
	
	ИспользоватьКонтрагента = СервисEDIСлужебный.ИспользуетсяКонтрагентДляВидаДокументаЭПД(ВидДокумента); 
	
КонецПроцедуры

#КонецОбласти

#Область Отображение

// Параметры:
//  Форма     - ФормаКлиентскогоПриложения
//  Элемент   - ГруппаФормы
//  Видимость - Булево
&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимость(Форма, Знач Элемент, Знач Видимость)
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы, 
		Элемент.Имя,
		"Видимость",
		Видимость);
КонецПроцедуры

// Параметры:
//  Форма                                                - ФормаКлиентскогоПриложения
//  ЭтоДлительнаяОперация                                - Булево
//  ЭлементФормыСтраницы                                 - ГруппаФормы
//  ЭлементФормыСтраницаИспользоватьДлительнуюОперацию   - ГруппаФормы
//  ЭлементФормыСтраницаНеИспользоватьДлительнуюОперацию - ГруппаФормы
&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьСтраницуДлительнойОперации(
	Форма,
	Знач ЭтоДлительнаяОперация,
	Знач ЭлементФормыСтраницы,
	Знач ЭлементФормыСтраницаИспользоватьДлительнуюОперацию,
	Знач ЭлементФормыСтраницаНеИспользоватьДлительнуюОперацию)
	
	ТекущаяСтраница = 
		?(ЭтоДлительнаяОперация,
			ЭлементФормыСтраницаИспользоватьДлительнуюОперацию,
			ЭлементФормыСтраницаНеИспользоватьДлительнуюОперацию);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы, 
		ЭлементФормыСтраницы.Имя,
		"ТекущаяСтраница",
		ТекущаяСтраница);
	
КонецПроцедуры

// Параметры:
//  Форма        - ФормаКлиентскогоПриложения
//  ЭлементФормы - ПолеФормы
//  СписокВыбора - СписокЗначений Из Строка
&НаКлиентеНаСервереБезКонтекста
Процедура ПоказатьКнопкуВыбора(Форма, ЭлементФормы, СписокВыбора)
	
	//@skip-check property-return-type - Особенность строгой типизации
	//@skip-check dynamic-access-method-not-found - Особенность строгой типизации
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы,
		ЭлементФормы.Имя,
		"КнопкаВыпадающегоСписка",
		СписокВыбора.Количество() > 0);
	
КонецПроцедуры

// Параметры:
//  Форма - ФормаКлиентскогоПриложения
&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьОтображениеФормы(Форма)
	
	// Скрываем данные по известным идентификаторам
	УстановитьВидимость(Форма, Форма.Элементы.Организация , Не Форма.УстановленИдентификаторОрганизации);
	УстановитьВидимость(Форма, Форма.Элементы.Контрагент, Не Форма.УстановленИдентификаторКонтрагента
		И Форма.ИспользоватьКонтрагента);
	УстановитьВидимость(Форма, Форма.Элементы.Перевозчик  , Не Форма.УстановленИдентификаторПеревозчика);
	
	// Устанавливаем страницу ввода идентификатора / длительной операции 
	УстановитьСтраницуДлительнойОперации(
		Форма,
		Форма.ФоновоеЗаданиеЗапущено И Форма.ОжидаетсяПолучениеИдентификатораОрганизации,
		Форма.Элементы.ОрганизацияСтраницы,
		Форма.Элементы.ОрганизацияСтраницаДлительнаяОперация,
		Форма.Элементы.ОрганизацияСтраницаВводаИдентификатора);
	УстановитьСтраницуДлительнойОперации(
		Форма,
		Форма.ФоновоеЗаданиеЗапущено И Форма.ОжидаетсяПолучениеИдентификатораКонтрагента,
		Форма.Элементы.КонтрагентСтраницы,
		Форма.Элементы.КонтрагентСтраницаДлительнаяОперация,
		Форма.Элементы.КонтрагентСтраницаВводаИдентификатора);
	
	ПоказатьКнопкуВыбора(Форма, Форма.Элементы.ИдентификаторОрганизации, Форма.ИдентификаторОрганизацииСписокВыбора);
	ПоказатьКнопкуВыбора(Форма, Форма.Элементы.ИдентификаторКонтрагента, Форма.ИдентификаторКонтрагентаСписокВыбора);
	ПоказатьКнопкуВыбора(Форма, Форма.Элементы.ИдентификаторПеревозчика, Форма.ИдентификаторПеревозчикаСписокВыбора);
	
	// Видимость подсказки длительной операции
	УстановитьВидимость(Форма, Форма.Элементы.ИнформацияДлительнаяОперация, Форма.ФоновоеЗаданиеЗапущено);
	
	ОтобразитьСтраницуИнформации = Форма.ОтобразитьСтраницуИнформации;
	ТекущаяСтраница = ?(ОтобразитьСтраницуИнформации,
		Форма.Элементы.СтраницаИнформация,
		Форма.Элементы.СтраницаОсновная);
	УстановитьСтраницуФормы(Форма, Форма.Элементы.СтраницыФормы, ТекущаяСтраница);
	УстановитьВидимость(Форма, Форма.КоманднаяПанель, Не ОтобразитьСтраницуИнформации);
	
КонецПроцедуры

// Параметры:
//  Элемент       - ГруппаФормы
//  Роль          - Строка
//  Представление - Строка
&НаСервере
Процедура УстановитьЗаголовокУчастника(Элемент, Знач Роль, Знач Представление)
	
	ТекстЗаголовка =
		СтрШаблон(
			НСтр(
				"ru = '%1 (%2)'",
				ОбщегоНазначения.КодОсновногоЯзыка()),
			Роль,
			Представление);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		Элемент.Имя,
		"Заголовок",
		ТекстЗаголовка);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьОтображениеФормыПриСозданииНаСервере()
	
	УстановитьЗаголовокУчастника(
		Элементы.Организация, 
		НСтр("ru = 'Грузоотправитель'", ОбщегоНазначения.КодОсновногоЯзыка()), 
		ОрганизацияПредставление);
	УстановитьЗаголовокУчастника(
		Элементы.Контрагент, 
		НСтр("ru = 'Грузополучатель'", ОбщегоНазначения.КодОсновногоЯзыка()), 
		КонтрагентПредставление);
	УстановитьЗаголовокУчастника(
		Элементы.Перевозчик, 
		НСтр("ru = 'Перевозчик'", ОбщегоНазначения.КодОсновногоЯзыка()), 
		ПеревозчикПредставление);
	
КонецПроцедуры

// Параметры:
//  Форма                       - ФормаКлиентскогоПриложения
//  ЭлементФормыСтраницы        - ГруппаФормы
//  ЭлементФормыТекущаяСтраница - ГруппаФормы
&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьСтраницуФормы(Форма, ЭлементФормыСтраницы, ЭлементФормыТекущаяСтраница)
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы, 
		ЭлементФормыСтраницы.Имя,
		"ТекущаяСтраница",
		ЭлементФормыТекущаяСтраница);
	
КонецПроцедуры

#КонецОбласти

#Область ДлительнаяОперация

&НаСервере
Процедура ЗапуститьДлительнуюОперациюПолученияИдентификаторов()
	
	Если Не УстановленИдентификаторОрганизации Тогда
		ОжидаетсяПолучениеИдентификатораОрганизации = Истина;
	КонецЕсли;
	
	Если Не УстановленИдентификаторКонтрагента И ИспользоватьКонтрагента Тогда
		ОжидаетсяПолучениеИдентификатораКонтрагента = Истина;
	КонецЕсли;

	Если Не ОжидаетсяПолучениеИдентификатораКонтрагента
		И Не ОжидаетсяПолучениеИдентификатораОрганизации Тогда
		Возврат;
	КонецЕсли;
	
	Если ИспользоватьКонтрагента Тогда
		НаборУчастников = СервисEDIСлужебный.НовыеУчастникиЭТрН();
		НаборУчастников.Организация = Организация;
		НаборУчастников.Контрагент = Контрагент;
		
		НачатьПолучениеСвязиИдентификаторовУчастниковЭТрН(НаборУчастников);
	Иначе
		ОжидаетсяПолучениеИдентификатораКонтрагента = Ложь;
		
		НаборУчастников = СервисEDIСлужебный.НовыеУчастникиЭТрН();
		НаборУчастников.Организация = Организация;
		
		НачатьПолучениеИдентификаторовУчастниковПровайдераЭПД(НаборУчастников);
	КонецЕсли;
	
КонецПроцедуры

// Начать получение идентификаторов участников провайдера ЭПД.
// 
// Параметры:
//  НаборУчастников - см.СервисEDIСлужебный.НовыеУчастникиЭТрН
&НаСервере
Процедура НачатьПолучениеИдентификаторовУчастниковПровайдераЭПД(НаборУчастников)
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = 
		НСтр(
			"ru = 'Получение идентификаторов ЭПД из сервиса 1С:EDI'", 
			ОбщегоНазначения.КодОсновногоЯзыка());
	ПараметрыВыполнения.УточнениеОшибки = 
		НСтр(
			"ru = 'Не удалось получить идентификаторы участников ЭПД из сервиса 1С:EDI по причине:'", 
			ОбщегоНазначения.КодОсновногоЯзыка());
	
	ДлительнаяОперация = ДлительныеОперации.ВыполнитьФункцию(
		ПараметрыВыполнения, 
		"СервисEDIСлужебный.ИдентификаторыУчастниковЭТрН",
		Организация,
		НаборУчастников);
	
	ФоновоеЗаданиеЗапущено = Истина;

КонецПроцедуры

// Начать получение связи идентификаторов участников ЭТрН.
// 
// Параметры:
//  НаборУчастников - см.СервисEDIСлужебный.НовыеУчастникиЭТрН
&НаСервере
Процедура НачатьПолучениеСвязиИдентификаторовУчастниковЭТрН(НаборУчастников)
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = 
		НСтр(
			"ru = 'Получение идентификаторов ЭПД из сервиса 1С:EDI'", 
			ОбщегоНазначения.КодОсновногоЯзыка());
	ПараметрыВыполнения.УточнениеОшибки = 
		НСтр(
			"ru = 'Не удалось получить связи идентификаторов участников ЭПД из сервиса 1С:EDI по причине:'", 
			ОбщегоНазначения.КодОсновногоЯзыка());
	
	ДлительнаяОперация = ДлительныеОперации.ВыполнитьФункцию(
		ПараметрыВыполнения, 
		"СервисEDIСлужебный.СвязьИдентификаторыУчастниковЭТрН",
		НаборУчастников);
	
	ФоновоеЗаданиеЗапущено = Истина;
		
КонецПроцедуры

&НаКлиенте
Процедура НачатьОжиданиеПолученияИдентификаторовЭПД()
	
	Если Не ФоновоеЗаданиеЗапущено Тогда
		Возврат;
	КонецЕсли;
	
	ИмяОбработчика = ?(ИспользоватьКонтрагента, "ПриПолученииИдентификаторовСвязиУчастниковЭПД",
		"ПриПолученииИдентификаторовУчастниковЭПД");
	
	Оповещение = Новый ОписаниеОповещения(ИмяОбработчика, ЭтотОбъект);
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
	
	СервисEDIСлужебныйКлиент.ОжидатьЗавершение(
		ДлительнаяОперация,
		Оповещение,
		ПараметрыОжидания);
	
	ВыполнитьКонтрольДлительнойОперации();
	
КонецПроцедуры

// Параметры:
//  СведенияОбУчастникеСвязи         - См. СервисEDIСлужебный.НовыеСведенияОбУчастникеСвязи
//  ОжидаетсяПолучениеИдентификатора - Булево
//  Участник                         - ЛюбаяСсылка
//  ИдентификаторУчастника           - Строка
//  СписокВыбора                     - СписокЗначений Из Строка
&НаСервере
Процедура ЗаполнитьИдентификаторУчастникаПоДаннымСервиса(
	Знач СведенияОбУчастникеСвязи,
	Знач ОжидаетсяПолучениеИдентификатора,
	Знач Участник,
	ИдентификаторУчастника,
	СписокВыбора)

	Если Не ОжидаетсяПолучениеИдентификатора Тогда
		Возврат;
	КонецЕсли;
	
	ОжидаетсяПолучениеИдентификатора = Ложь;
	
	ИдентификаторУчастника = СведенияОбУчастникеСвязи.Идентификатор;
	
	СписокВыбора.Очистить();
	
	Если СведенияОбУчастникеСвязи.Идентификаторы.Количество() > 0 Тогда
		//@skip-check property-return-type - Свойства расширения элемента формы
		СписокВыбора.Очистить(); // СписокЗначений Из Строка
		
		Для Каждого Идентификатор Из СведенияОбУчастникеСвязи.Идентификаторы Цикл
			ИдентификаторЭПД = Идентификатор.Идентификатор;
			Наименование     = Идентификатор.Наименование;
			Комментарий      = Идентификатор.Комментарий;
			
			ЧастиПредставления = Новый Массив; // Массив Из Строка
			
			Если Не ПустаяСтрока(ИдентификаторЭПД) Тогда
				ЧастиПредставления.Добавить(ИдентификаторЭПД);
			КонецЕсли;
			Если Не ПустаяСтрока(Наименование) Тогда
				ЧастиПредставления.Добавить(Наименование);
			КонецЕсли;
			Если Не ПустаяСтрока(Комментарий) Тогда
				ЧастиПредставления.Добавить(Комментарий);
			КонецЕсли;
			
			Представление = СтрСоединить(ЧастиПредставления, " - ");
			
			СписокВыбора.Добавить(ИдентификаторЭПД, Представление);
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

// Параметры:
//  АдресРезультата - Строка
&НаСервере
Процедура ОбработатьСвязьИдентификаторовУчастников(Знач АдресРезультата)
	
	Связь = ПолучитьИзВременногоХранилища(
			АдресРезультата); // См. СервисEDIСлужебный.НоваяСвязьИдентификаторовУчастниковЭТрН
		
	ЗаполнитьИдентификаторУчастникаПоДаннымСервиса(
		Связь.Организация, 
		ОжидаетсяПолучениеИдентификатораОрганизации,
		Организация,
		ИдентификаторОрганизации, 
		ИдентификаторОрганизацииСписокВыбора);
	ЗаполнитьИдентификаторУчастникаПоДаннымСервиса(
		Связь.Контрагент, 
		ОжидаетсяПолучениеИдентификатораКонтрагента,
		Контрагент,
		ИдентификаторКонтрагента, 
		ИдентификаторКонтрагентаСписокВыбора);
	
КонецПроцедуры

// Параметры:
//  АдресРезультата - Строка
&НаСервере
Процедура ОбработатьИдентификаторыУчастниковЭПД(Знач АдресРезультата)
	
	ИдентификаторыУчастников = ПолучитьИзВременногоХранилища(
			АдресРезультата); // См. СервисEDIСлужебный.ИдентификаторыУчастниковЭТрН
			
	Для Каждого СтрокаУчастник Из ИдентификаторыУчастников Цикл
		СведенияОбУчастнике = СервисEDIСлужебный.НовыеСведенияОбУчастникеСвязи();
		СведенияОбУчастнике.Идентификатор = СтрокаУчастник.ИдентификаторЭПД;
		
		СтрокаИдентификаторыУчастника = СведенияОбУчастнике.Идентификаторы.Добавить();
		СтрокаИдентификаторыУчастника.Идентификатор = СтрокаУчастник.ИдентификаторЭПД;
		СтрокаИдентификаторыУчастника.Комментарий = СтрокаУчастник.Комментарий;
		
		ЗаполнитьИдентификаторУчастникаПоДаннымСервиса(
			СведенияОбУчастнике, 
			ОжидаетсяПолучениеИдентификатораОрганизации,
			Организация,
			ИдентификаторОрганизации, 
			ИдентификаторОрганизацииСписокВыбора);
	КонецЦикла;		
	
КонецПроцедуры

// Параметры:
//  АдресРезультата         - Строка
//                          - Неопределено
//  ДополнительныеПараметры - Произвольный
&НаКлиенте
Процедура ПриПолученииИдентификаторовСвязиУчастниковЭПД(Знач АдресРезультата, Знач ДополнительныеПараметры) Экспорт
	
	ДлительнаяОперация = Неопределено;
	ФоновоеЗаданиеЗапущено = Ложь;
	
	Если АдресРезультата = Неопределено Тогда
		ОбновитьОтображениеФормы(ЭтотОбъект);
		Возврат;
	КонецЕсли;
	
	ОбработатьСвязьИдентификаторовУчастников(АдресРезультата);
	
	ОтобразитьСтраницуИнформации = ОжидаетсяПолучениеИдентификатораОрганизации
		И Не ЗначениеЗаполнено(ИдентификаторОрганизации);
	ОбновитьОтображениеФормы(ЭтотОбъект);
	
КонецПроцедуры

// Параметры:
//  АдресРезультата         - Строка
//                          - Неопределено
//  ДополнительныеПараметры - Произвольный
&НаКлиенте
Процедура ПриПолученииИдентификаторовУчастниковЭПД(Знач АдресРезультата, Знач ДополнительныеПараметры) Экспорт
	
	ДлительнаяОперация = Неопределено;
	ФоновоеЗаданиеЗапущено = Ложь;
	
	Если АдресРезультата = Неопределено Тогда
		ОбновитьОтображениеФормы(ЭтотОбъект);
		Возврат;
	КонецЕсли;
	
	ОбработатьИдентификаторыУчастниковЭПД(АдресРезультата);
	
	ОтобразитьСтраницуИнформации = ОжидаетсяПолучениеИдентификатораОрганизации
		И Не ЗначениеЗаполнено(ИдентификаторОрганизации);
	ОбновитьОтображениеФормы(ЭтотОбъект);
	
КонецПроцедуры

// Параметры:
//  ИдентификаторЗадания - УникальныйИдентификатор
&НаСервереБезКонтекста
Процедура ПрерватьДлительнуюОперациюНаСервере(Знач ИдентификаторЗадания)
	ДлительныеОперации.ОтменитьВыполнениеЗадания(ИдентификаторЗадания);
КонецПроцедуры

&НаКлиенте
Процедура ПрерватьДлительнуюОперацию()
	
	ФоновоеЗаданиеЗапущено = Ложь;
	
	Если ДлительнаяОперация <> Неопределено Тогда
		//@skip-check property-return-type
		//@skip-check invocation-parameter-type-intersect
		ПрерватьДлительнуюОперациюНаСервере(ДлительнаяОперация.ИдентификаторЗадания);
		ДлительнаяОперация = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьКонтрольДлительнойОперации()
	
	Если Не ФоновоеЗаданиеЗапущено Тогда
		Возврат;
	КонецЕсли;
	
	ТребуетсяФоновоеЗадание = 
		ОжидаетсяПолучениеИдентификатораОрганизации
			Или ОжидаетсяПолучениеИдентификатораКонтрагента;
	
	Если ТребуетсяФоновоеЗадание Тогда
		Возврат;
	КонецЕсли;
	
	ПрерватьДлительнуюОперацию();
	
КонецПроцедуры

#КонецОбласти

#Область ЗаписьДанных

&НаСервере
Процедура ЗаписатьДанныеНаСервере()
	
	Если ВидДокумента = ИнтерфейсДокументовЭДО.ВидДокументаПоТипу(Перечисления.ТипыДокументовЭДО.ЭЗЗ) Тогда
		ЗаписатьДанныеЭЗЗ();
	ИначеЕсли ВидДокумента = ИнтерфейсДокументовЭДО.ВидДокументаПоТипу(Перечисления.ТипыДокументовЭДО.ЭТрН) Тогда
		ЗаписатьДанныеЭТрН();
	Иначе
		ТекстИсключения = СтрШаблон(НСтр(
			"ru = 'Вид документа ""%1"" не поддерживатеся.'",
			ОбщегоНазначения.КодОсновногоЯзыка()), ВидДокумента);
		ВызватьИсключение ТекстИсключения; 	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьДанныеЭЗЗ()
	
	Настройки = СервисEDIСлужебный.НовыеНастройкиЭЗЗ();
	
	Настройки.Организация               = Организация;
	Настройки.Перевозчик                = Перевозчик;
	Настройки.ИдентификаторОрганизации  = ИдентификаторОрганизации;
	Настройки.ИдентификаторПеревозчика  = ИдентификаторПеревозчика;
	Настройки.Сертификат                = Сертификат;
	Настройки.Доверенность              = Доверенность;
	
	СервисEDIСлужебный.ЗаписатьНастройкиЭЗЗ(Настройки);
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьДанныеЭТрН()
	
	Настройки = СервисEDIСлужебный.НовыеНастройкиЭТрН();
	
	Настройки.Организация               = Организация;
	Настройки.Контрагент                = Контрагент;
	Настройки.Перевозчик                = Перевозчик;
	Настройки.ИдентификаторОрганизации  = ИдентификаторОрганизации;
	Настройки.ИдентификаторКонтрагента  = ИдентификаторКонтрагента;
	Настройки.ИдентификаторПеревозчика  = ИдентификаторПеревозчика;
	Настройки.Сертификат                = Сертификат;
	Настройки.Доверенность              = Доверенность;
	
	СервисEDIСлужебный.ЗаписатьНастройкиЭТрН(Настройки);
	
КонецПроцедуры

#КонецОбласти

#Область АвтоПодбор

// Параметры:
//  СписокПриемник - СписокЗначений Из Строка
//  СписокИсточник - СписокЗначений Из Строка
&НаКлиентеНаСервереБезКонтекста
Процедура СкопироватьСписок(СписокПриемник, Знач СписокИсточник)
	
	СписокПриемник.Очистить();
	
	Для каждого ЭлементСписка Из СписокИсточник Цикл
		СписокПриемник.Добавить(
			ЭлементСписка.Значение,
			ЭлементСписка.Представление,
			ЭлементСписка.Пометка,
			ЭлементСписка.Картинка);
	КонецЦикла;
	
КонецПроцедуры

// Параметры:
//  Текст                - Строка
//  ДанныеВыбора         - СписокЗначений Из Строка
//  СписокВыбора         - СписокЗначений Из Строка
//  СтандартнаяОбработка - Булево
&НаКлиенте
Процедура ИдентификаторАвтоПодбор(Знач Текст, ДанныеВыбора, Знач СписокВыбора, СтандартнаяОбработка)
	
	Если СписокВыбора.Количество() = 0 Тогда
		Возврат;
	ИначеЕсли ПустаяСтрока(Текст) Тогда
		ДанныеВыбора = Новый СписокЗначений; // СписокЗначений Из Строка
		СтандартнаяОбработка = Ложь;
		СкопироватьСписок(ДанныеВыбора, СписокВыбора);
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	ДанныеВыбора = Новый СписокЗначений; // СписокЗначений Из Строка
	ПодстрокаПоиска = ВРег(Текст);
	
	ЦветВыделения  = WebЦвета.ТемноЗеленый;
	//@skip-check new-font - Шрифт Авто
	ШрифтВыделения = Новый Шрифт(, , Истина);
	
	Для Каждого ЭлементСписка Из СписокВыбора Цикл
		
		Позиция = СтрНайти(ВРег(ЭлементСписка.Представление), ПодстрокаПоиска);
		
		Если Позиция = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		ТекстВхождения = Сред(ЭлементСписка.Представление, Позиция, СтрДлина(Текст));
		
		Начало    = Лев(ЭлементСписка.Представление, Позиция - 1);
		Вхождение = Новый ФорматированнаяСтрока(ТекстВхождения, ШрифтВыделения, ЦветВыделения);
		Конец     = Сред(ЭлементСписка.Представление, Позиция + СтрДлина(Текст));
		
		Представление = Новый ФорматированнаяСтрока(Начало, Вхождение, Конец);
		
		ДанныеВыбора.Добавить(
			ЭлементСписка.Значение,
			Представление,
			ЭлементСписка.Пометка,
			ЭлементСписка.Картинка);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ПроверкаЗаполнения

// Параметры:
//  НаборИдентификаторов - Массив из Строка
//  Идентификатор        - Строка
&НаСервере
Процедура ДобавитьИдентификатор(НаборИдентификаторов, Знач Идентификатор)
	
	Если ПустаяСтрока(Идентификатор) Тогда
		Возврат;
	КонецЕсли;
	
	СервисEDIСлужебныйКлиентСервер.НормализоватьИдентификатор(Идентификатор);
	НаборИдентификаторов.Добавить(Идентификатор);
	
КонецПроцедуры

// Возвращаемое значение:
//  Булево
&НаСервере
Функция ИдентификаторыУникальны()
	
	Идентификаторы = Новый Массив; // Массив Из Строка
	
	ДобавитьИдентификатор(Идентификаторы, ИдентификаторОрганизации);
	ДобавитьИдентификатор(Идентификаторы, ИдентификаторПеревозчика);
	
	Если ИспользоватьКонтрагента Тогда
		ДобавитьИдентификатор(Идентификаторы, ИдентификаторКонтрагента);
	КонецЕсли;
	
	УникальныеЗначения = ОбщегоНазначенияКлиентСервер.СвернутьМассив(Идентификаторы);
	
	Возврат Идентификаторы.Количество() = УникальныеЗначения.Количество();
	
КонецФункции

#КонецОбласти

#КонецОбласти
