&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	                                                           
	ОбменСГИСЭПД.ПриСозданииНаСервереПодчиненнойФормы(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	
	Если Параметры.Свойство("ФормаБезОбработки") = Ложь Тогда
		
		Если ЭтотОбъект.ЗапретитьИзменение = Ложь Тогда
			ОрганизацияОписаниеТипов = Метаданные.ОпределяемыеТипы.Организация.Тип;
			КонтрагентОписаниеТипов = Метаданные.ОпределяемыеТипы.КонтрагентБЭД.Тип; 
			
			Элементы.СсылкаГрузоотправитель.ОграничениеТипа = КонтрагентОписаниеТипов;   
			Элементы.СсылкаГрузополучатель.ОграничениеТипа = КонтрагентОписаниеТипов;
			Элементы.СсылкаСвСтрахРекИдентСтрах.ОграничениеТипа = КонтрагентОписаниеТипов;
			
		КонецЕсли;
		
		Для Каждого Груз Из ТитулЗаказчикаГрузы Цикл
			ОбменСГИСЭПДКлиентСервер.ЗаполнитьПредставлениеАдреса("ПредставлениеАдрГрузАдрес", ЭтотОбъект, Груз);	
			ОбменСГИСЭПДКлиентСервер.ЗаполнитьПредставлениеАдреса("ПредставлениеАдрПунктНазнАдрес", ЭтотОбъект, Груз);
			ОбменСГИСЭПДКлиентСервер.ЗаполнитьПредставлениеАдреса("ПредставлениеСвСтрахАдрСтрахОргАдрес", ЭтотОбъект, Груз);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Сохранить(Команда)
		
	ОбменСГИСЭПДКлиент.СохранитьПараметрыПодчиненнойФормы(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбменСГИСЭПДКлиент.ПриОткрытииПодчиненнойФормы(ЭтотОбъект);
																		
КонецПроцедуры
			
&НаКлиенте
Функция ОписаниеРеквизитовФормы() Экспорт
	
	Возврат ОписаниеРеквизитовФормыСервер();
	
КонецФункции

&НаСервере
Функция ОписаниеРеквизитовФормыСервер()
	
	Возврат ОбменСГИСЭПД.ОписаниеРеквизитовФормы(ЭтаФорма);
		
КонецФункции

&НаКлиенте
Процедура ТитулЗаказчикаГрузыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
		
	ИменаПолей = Новый Массив;
	ИменаПолей.Добавить("ЗаполнитьТитулЗаказчикаГрузыУказКлнт"); 
	ИменаПолей.Добавить("ЗаполнитьТитулЗаказчикаГрузыСвТС");
	ИменаПолей.Добавить("ЗаполнитьТитулЗаказчикаГрузыСвКонтейн");
	ИменаПолей.Добавить("ЗаполнитьТитулЗаказчикаГрузыСопрДокПарт");
	ИменаПолей.Добавить("ЗаполнитьТитулЗаказчикаГрузыРеквЗакПост"); 
	ИменаПолей.Добавить("ЗаполнитьТитулЗаказчикаГрузыСвУсл");
	ИменаПолей.Добавить("ЗаполнитьТитулЗаказчикаГрузыСвУведСторон"); 	
	ИменаПолей.Добавить("ЗаполнитьТитулЗаказчикаГрузыСвСтрахПолис");
	ИменаПолей.Добавить("ЗаполнитьТитулЗаказчикаГрузыСвСтрахУслСтрах"); 
	ИменаПолей.Добавить("ЗаполнитьТитулЗаказчикаОписаниеГруза");
	
	Если ИменаПолей.Найти(Поле.Имя) <> Неопределено Тогда
		ОбменСГИСЭПДКлиент.ВывестиФормуВводаДанных(ЭтотОбъект, Поле.Имя, Элемент.ТекущиеДанные);
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТитулЗаказчикаГрузыПередУдалением(Элемент, Отказ)
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		ИдентификаторСтроки = Неопределено;
		ТекущиеДанные.Свойство("ИдентификаторСтроки", ИдентификаторСтроки);
		ОбменСГИСЭПДКлиент.ОчиститьПодчиненныеТаблицы(ЭтотОбъект, Элемент.Имя, ИдентификаторСтроки, Отказ);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ТитулЗаказчикаГрузыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)

	ОбменСГИСЭПДКлиент.ТаблицаПриНачалеРедактирования(Элемент, ЭтотОбъект, НоваяСтрока, Копирование);
	
	Если НоваяСтрока Тогда
		ТекущиеДанные = Элемент.ТекущиеДанные; 
		ТекущиеДанные.ПрУведСторон = Ложь;
		ТекущиеДанные.ПрзПрвз = "0";
	КонецЕсли;

КонецПроцедуры 

&НаКлиенте
Процедура СсылкаГрузоотправительПриИзменении(Элемент)
	ПараметрыЗаполнения = Новый Структура ("АдресВСвободнойФорме", Истина);
	ОбменСГИСЭПДКлиентСервер.ЗаполнитьРеквизитыПоСсылке(Элемент, ЭтотОбъект,
		Элементы.ТитулЗаказчикаГрузы.ТекущиеДанные , "ТитулЗаказчикаГрузы", ПараметрыЗаполнения);
КонецПроцедуры

&НаКлиенте
Процедура СсылкаГрузополучательПриИзменении(Элемент) 
	ПараметрыЗаполнения = Новый Структура ("АдресВСвободнойФорме", Истина);
	ОбменСГИСЭПДКлиентСервер.ЗаполнитьРеквизитыПоСсылке(Элемент, ЭтотОбъект,
		Элементы.ТитулЗаказчикаГрузы.ТекущиеДанные , "ТитулЗаказчикаГрузы", ПараметрыЗаполнения);
КонецПроцедуры

&НаКлиенте
Процедура СсылкаСвСтрахРекИдентСтрахПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ТитулЗаказчикаГрузы.ТекущиеДанные;
	
	ПараметрыЗаполнения = Новый Структура ("АдресВСвободнойФорме", Истина);
	ОбменСГИСЭПДКлиентСервер.ЗаполнитьРеквизитыПоСсылке(Элемент, ЭтотОбъект,
		ТекущиеДанные , "ТитулЗаказчикаГрузы", ПараметрыЗаполнения); 
		
	ТекущиеДанные.СвСтрахНаимСтрахОрг = Строка(ТекущиеДанные.СсылкаСвСтрахРекИдентСтрах);
		
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеАдрГрузАдресНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПараметрыЗаполнения = Новый Структура ("АдресВСвободнойФорме", Истина);
	ОбменСГИСЭПДКлиент.ВводАдреса(Элемент.Имя, ЭтотОбъект
		,, Элементы.ТитулЗаказчикаГрузы.ТекущиеДанные, ПараметрыЗаполнения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеАдрГрузАдресОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПараметрыЗаполнения = Новый Структура ("АдресВСвободнойФорме", Истина);
	ОбменСГИСЭПДКлиентСервер.ЗаполнитьРеквизитыАдреса(ЭтотОбъект, ВыбранноеЗначение,
		Элемент.Имя, Элементы.ТитулЗаказчикаГрузы.ТекущиеДанные, ПараметрыЗаполнения); 
	
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеАдрГрузАдресАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.КонтактнаяИнформация") Тогда
		МодульУправлениеКонтактнойИнформациейКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("УправлениеКонтактнойИнформациейКлиент");
		МодульУправлениеКонтактнойИнформациейКлиент.АвтоПодборАдреса(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеАдрПунктНазнАдресНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ПараметрыЗаполнения = Новый Структура ("АдресВСвободнойФорме", Истина);
	ОбменСГИСЭПДКлиент.ВводАдреса(Элемент.Имя, ЭтотОбъект
	,, Элементы.ТитулЗаказчикаГрузы.ТекущиеДанные, ПараметрыЗаполнения);
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеАдрПунктНазнАдресОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПараметрыЗаполнения = Новый Структура ("АдресВСвободнойФорме", Истина);
	ОбменСГИСЭПДКлиентСервер.ЗаполнитьРеквизитыАдреса(ЭтотОбъект, ВыбранноеЗначение,
		Элемент.Имя, Элементы.ТитулЗаказчикаГрузы.ТекущиеДанные, ПараметрыЗаполнения); 

КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеАдрПунктНазнАдресАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.КонтактнаяИнформация") Тогда
		МодульУправлениеКонтактнойИнформациейКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("УправлениеКонтактнойИнформациейКлиент");
		МодульУправлениеКонтактнойИнформациейКлиент.АвтоПодборАдреса(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ТитулЗаказчикаГрузыПредставлениеСвСтрахАдрСтрахОргАдресНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПараметрыЗаполнения = Новый Структура ("АдресВСвободнойФорме", Истина);
	ОбменСГИСЭПДКлиент.ВводАдреса(Элемент.Имя, ЭтотОбъект,, Элементы.ТитулЗаказчикаГрузы.ТекущиеДанные, ПараметрыЗаполнения);
	
КонецПроцедуры

&НаКлиенте
Процедура ТитулЗаказчикаГрузыПредставлениеСвСтрахАдрСтрахОргАдресОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПараметрыЗаполнения = Новый Структура ("АдресВСвободнойФорме", Истина);
	ОбменСГИСЭПДКлиентСервер.ЗаполнитьРеквизитыАдреса(ЭтотОбъект, 
		ВыбранноеЗначение, Элемент.Имя, Элементы.ТитулЗаказчикаГрузы.ТекущиеДанные, ПараметрыЗаполнения); 

КонецПроцедуры

&НаКлиенте
Процедура ТитулЗаказчикаГрузыПредставлениеСвСтрахАдрСтрахОргАдресАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.КонтактнаяИнформация") Тогда
		МодульУправлениеКонтактнойИнформациейКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("УправлениеКонтактнойИнформациейКлиент");
		МодульУправлениеКонтактнойИнформациейКлиент.АвтоПодборАдреса(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТитулЗаказчикаГрузыИдентПартГрузПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ТитулЗаказчикаГрузы.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		СтрДлина = СтрДлина(ТекущиеДанные.ИдентПартГруз);
		Если СтрДлина <> 36 Тогда
			ТекущиеДанные.ИдентПартГруз = "";	
		КонецЕсли;	
	КонецЕсли;

	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ОтметитьОбязательныеНеЗаполненныеЭлементыФормы" Тогда
		Если УникальныйИдентификатор <> Параметр Тогда
			Возврат;
		КонецЕсли;
		ОтметитьОбязательныеНеЗаполненныеЭлементыФормы(Параметр);
	ИначеЕсли ИмяСобытия = "ИзменитьОформлениеКнопокФормы" Тогда
		Если УникальныйИдентификатор <> Параметр.УникальныйИдентификаторОбновляемойФормы Тогда
			Возврат;
		КонецЕсли;
		ИзменитьОформлениеКнопок(Параметр);	 
	ИначеЕсли СтрНачинаетсяС(ИмяСобытия, "Запись_") Тогда
		Если ТипЗнч(Источник) = Тип("СправочникСсылка.КлассификаторДОПОГЭПД") Тогда
			Для Каждого СтрокаГруз Из ТитулЗаказчикаГрузы Цикл
				Если Источник = СтрокаГруз.СсылкаСведенияОбОпасномГрузе Тогда
					ВходящийКонтекст = Новый Структура;
					ВходящийКонтекст.Вставить("ЗапретитьИзменение", Ложь);
					ВходящийКонтекст.Вставить("Форма", ЭтотОбъект);
					ВходящийКонтекст.Вставить("ГруппаДанных", "СведенияОбОпасномГрузе");
					ВходящийКонтекст.Вставить("ТекущиеДанные", СтрокаГруз);
					ОбменСГИСЭПДКлиент.ОткрытиеФормыПоГиперссылке_Завершение(Источник, ВходящийКонтекст);	
				КонецЕсли;	
			КонецЦикла;	
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#Область ОбъектыОбязательныеДляЗаполнения

&НаКлиенте
Процедура ИзменитьОформлениеКнопок(Параметр) Экспорт

	Если Не ЭтотОбъект.НачальноеОформлениеВыполнено Тогда
		ЭтотОбъект.ТребуетсяДополнительноеОформлениеКнопок = Истина;
		Если ЭтотОбъект.СтруктураДополнительногоОформленияКнопок <> Неопределено Тогда
			ЭтотОбъект.СтруктураДополнительногоОформленияКнопок = 
				Новый ФиксированнаяСтруктура("ИмяКнопки, ИдентификаторСтроки");
		Иначе
			ЭтотОбъект.СтруктураДополнительногоОформленияКнопок = Параметр;
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	СтруктураСТекущимиДаннымиРеквизитов = ОбменСГИСЭПДКлиентСервер.ПолучитьСтруктуруПоТитулуИВерсии(ЭтотОбъект);
	СтруктураДанныхОбъекта = ОбменСГИСЭПДКлиентСервер.ПолучитьСериализуемыйОбъектСДаннымиДокумента(ЭтотОбъект);
	СтруктураСДаннымиФормыДляОформленияКнопок = 
		ОбменСГИСЭПДКлиентСервер.СтруктураСДаннымиФормыДляОформленияКнопок(ЭтотОбъект);
	
	Результат = ИзменитьОформлениеКнопокНаСервере(СтруктураСТекущимиДаннымиРеквизитов,
		Параметр.ИмяКнопки,
		Параметр.ИдентификаторСтроки,
		СтруктураДанныхОбъекта,
		СтруктураСДаннымиФормыДляОформленияКнопок);
		
	Если Результат.Успешно Тогда
		ЭтотОбъект.АдресДереваСоответствийИтаблицыКнопок = Результат.НовыйАдресВХранилище;	
		МассивОформления = Результат.МассивОформления;
		ОбменСГИСЭПДКлиентСервер.ОформлениеКнопокНаФорме(ЭтотОбъект,
			СтруктураСТекущимиДаннымиРеквизитов, МассивОформления);	
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ИзменитьОформлениеКнопокНаСервере(Знач СтруктураСТекущимиДаннымиРеквизитов,
	ИмяКнопки = Неопределено,
	ИдентификаторСтроки = Неопределено,
	Знач СтруктураДанныхОбъекта,
	Знач СтруктураСДаннымиФормыДляОформленияКнопок)
	
	НовыйАдресВХранилище = ОбменСГИСЭПД.ЗапуститьИзменениеОформленияКнопок(СтруктураСДаннымиФормыДляОформленияКнопок,
		СтруктураСТекущимиДаннымиРеквизитов, ИмяКнопки, ИдентификаторСтроки, СтруктураДанныхОбъекта);

	Результат = ОбменСГИСЭПД.ОбработатьРезультатИзмененияОформленияКнопок(НовыйАдресВХранилище);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ОтметитьОбязательныеНеЗаполненныеЭлементыФормы(Параметр)
	
	СтруктураСТекущимиДаннымиРеквизитов = ОбменСГИСЭПДКлиентСервер.ПолучитьСтруктуруПоТитулуИВерсии(ЭтотОбъект);
	ОтметитьОбязательныеНеЗаполненныеЭлементыФормыНаСервере(СтруктураСТекущимиДаннымиРеквизитов);
	
КонецПроцедуры

&НаСервере
Процедура ОтметитьОбязательныеНеЗаполненныеЭлементыФормыНаСервере(Знач СтруктураСТекущимиДанными)
	
	ОбменСГИСЭПД.ОтметитьОбязательныеНеЗаполненныеЭлементыФормы(ЭтотОбъект, СтруктураСТекущимиДанными);
	
КонецПроцедуры



#КонецОбласти