// @strict-types

#Область СлужебныйПрограммныйИнтерфейс

// Нормализует значение идентификатора участника ЭДО
// 
// Параметры:
//  Идентификатор - Строка - Идентификатор участника ЭДО
Процедура НормализоватьИдентификатор(Идентификатор) Экспорт
	Идентификатор = НормализованныйИдентификатор(Идентификатор);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция НормализованныйИдентификатор(Знач Идентификатор)
	
	Результат = Идентификатор;
	
	Результат = СокрЛП(Результат);
	Результат = СтрЗаменить(Результат, " ", "");
	Результат = СтрЗаменить(Результат, Символы.ВК, "");
	Результат = СтрЗаменить(Результат, Символы.ВТаб, "");
	Результат = СтрЗаменить(Результат, Символы.НПП, "");
	Результат = СтрЗаменить(Результат, Символы.ПС, "");
	Результат = СтрЗаменить(Результат, Символы.ПФ, "");
	Результат = СтрЗаменить(Результат, Символы.Таб, "");
	Результат = ВРег(Результат);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
