///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2026, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Функция возвращает созданный ТС ПИоТ по подключаемому оборудованию
//
// Параметры:
//  ПодключаемоеОборудование - СправочникСсылка.ПодключаемоеОборудование.
//
// Возвращаемое значение:
//  - Произвольный
//
Функция ПолучитьТСПИоТ(ПодключаемоеОборудование) Экспорт
	
	Возврат Справочники.ТСПИоТ.ПолучитьТСПИоТ(ПодключаемоеОборудование);
	
КонецФункции

// Процедура создает элемент в справочнике ТС ПИоТ.
//
// Параметры:
//  ПараметрыСоздания - Структура - параметры создания подключаемог оборудования.
//
// Возвращаемое значение:
//  СправочникСсылка.ТСПИоТ - 
//        
Функция СоздатьНовыйТСПИоТ(ПараметрыСоздания) Экспорт
	
	Возврат Справочники.ТСПИоТ.СоздатьНовыйТСПИоТ(ПараметрыСоздания);
	
КонецФункции             

Функция ПараметрыСозданияСПИоТ() Экспорт
	
	ПараметрыСоздания = Новый Структура();
	ПараметрыСоздания.Вставить("УровеньЛога", 0);
	ПараметрыСоздания.Вставить("ФискальноеУстройство");
	ПараметрыСоздания.Вставить("Тип");       
	ПараметрыСоздания.Вставить("Наименование");     
	ПараметрыСоздания.Вставить("РабочийКаталог");  
	ПараметрыСоздания.Вставить("ОИСМПоведениеЕслиОтветНеполучен", 2);  
	ПараметрыСоздания.Вставить("ОИСМПроверка", Истина);  
	
	Возврат ПараметрыСоздания;
	
КонецФункции

Функция СформироватьПутиВнутреннегоПИоТ(ИдентификаторЭкземпляра, РабочийКаталогДанныхПользователя) Экспорт 
	
	РабочийКаталог = Лев(РабочийКаталогДанныхПользователя, СтрНайти(РабочийКаталогДанныхПользователя, "\1cv8"));      
	
	Если ОбщегоНазначенияБПО.ЭтоУчебнаяПлатформа() Тогда
		ПутьКДрайверу = РабочийКаталог + "1cv8t\ExtCompT";   
	Иначе
		ПутьКДрайверу = РабочийКаталог + "1cv8\ExtCompT";
	КонецЕсли;
	
	ПутьДанныхЭкземпляра = РабочийКаталог + "1CPIoT\" + ИдентификаторЭкземпляра;
	
	Результат = Новый Структура();
	Результат.Вставить("ПутьКДрайверу", ПутьКДрайверу);
	Результат.Вставить("ПутьДанныхЭкземпляра", ПутьДанныхЭкземпляра);
	Возврат Результат;
	
КонецФункции

// Получить параметры подключения ПИоТ в XML
//
// Параметры:    
//   ПодключаемоеОборудование - СправочникСсылка.ПодключаемоеОборудование.
//   ИдентификаторОбъекта - Строка -
//   ТСПИоТ - Структура -     
// Возвращаемое значение:
//   Структура -
//
Функция ПолучитьПараметрыПИоТXML(ПодключаемоеОборудование, ИдентификаторОбъекта, ТСПИоТ) Экспорт
	
	ПараметрыТСПИоТ = Новый Структура();    
	ПараметрыТСПИоТ.Вставить("DriverProgID", ИдентификаторОбъекта); // ProgID подключаемый интеграционный компоненты для работы с ТС ПИоТ     
	ПараметрыТСПИоТ.Вставить("DriverFileName", ""); // Имя подключаемый интеграционный компоненты для работы с ТС ПИоТ
	ПараметрыТСПИоТ.Вставить("DriverMainDLLPath", "%Path%"); // Путь (включая имя) к главной DLL основной поставки драйвера.
	ПараметрыТСПИоТ.Вставить("DriverPath"  , ТСПИоТ.ПутьКДрайверу); // Путь расположения подключаемый интеграционный компоненты для работы с ТС ПИоТ
	ПараметрыТСПИоТ.Вставить("InstancePath", ТСПИоТ.ПутьДанныхЭкземпляра); // Папка данных экземпляра ТС ПИоТ
	ПараметрыТСПИоТ.Вставить("GUID"        , ТСПИоТ.ИдентификаторЭкземпляра); // Статический уникальный идентификатор экземпляра ТС ПИоТ  
	ПараметрыТСПИоТ.Вставить("LogLevel"    , ТСПИоТ.УровеньЛога); // Уровень логирования
	ПараметрыТСПИоТ.Вставить("NodeAddress" , ТСПИоТ.АдресУзлаГИСМТ); // Адрес узла ГИС МТ  (если не указан используется по умолчанию)
	
	ПроверкаКорневыхСертификатов = ТСПИоТ.ИсключитьПроверкуКорневыхСертификатов;
	ПараметрыТСПИоТ.Вставить("CheckRootCertificates", ПроверкаКорневыхСертификатов); // Проверять корневые сертификаты
	
	Если ОбщегоНазначенияБПО.ИспользуетсяГосИС() Тогда
		// ЛМ ЧЗ, если есть используется ГосИС
		ПараметрыЛМЧЗ = ПолучитьПараметрыЛМЧЗ(ПодключаемоеОборудование, ТСПИоТ);
		ЛМЧЗАдрес        = ПараметрыЛМЧЗ.Сервер;     
		ЛМЧЗПорт         = ПараметрыЛМЧЗ.Порт;     
		ЛМЧЗПользователь = ПараметрыЛМЧЗ.Пользователь;   
		ЛМЧЗПароль       = ПараметрыЛМЧЗ.Пароль;  
	Иначе
		ЛМЧЗАдрес        = ТСПИоТ.ЛМЧЗАдрес;     
		ЛМЧЗПорт         = ТСПИоТ.ЛМЧЗПорт;     
		ЛМЧЗПользователь = ТСПИоТ.ЛМЧЗПользователь;   
		ЛМЧЗПароль       = ТСПИоТ.ЛМЧЗПароль;  
	КонецЕсли;
	
	ПараметрыТСПИоТ.Вставить("LMCHZAdress"  , ЛМЧЗАдрес); // Адрес подключения ЛМ ЧЗ        
	ПараметрыТСПИоТ.Вставить("LMCHZPort"    , ЛМЧЗПорт); // Порт подключения ЛМ Ч        
	ПараметрыТСПИоТ.Вставить("LMCHZUser"    , ЛМЧЗПользователь); // Пользователь ЛМ ЧЗ        
	ПараметрыТСПИоТ.Вставить("LMCHZPassword", ЛМЧЗПароль); // Пароль пользователя ЛМ ЧЗ    
	ПараметрыТСПИоТ.Вставить("LMCHZTokenRefreshRate", ТСПИоТ.ПериодОбновленияТокенаЛМЧЗ);   
	
	ЛМЧЗПроверкаОтключена =?(ПрохожденияСертификацииТСПИоТ(), Ложь, ПараметрыТСПИоТ.ЛМЧЗПроверкаОтключена);
	ПараметрыТСПИоТ.Вставить("LMCHZDisable" , ЛМЧЗПроверкаОтключена);       

	ОИСМПроверка = ?(ПрохожденияСертификацииТСПИоТ(), Истина, ПараметрыТСПИоТ.ОИСМПроверка);
	ПараметрыТСПИоТ.Вставить("OISMCheck"       , ОИСМПроверка);

	ПараметрыТСПИоТ.Вставить("OISMCheckTimeout", ТСПИоТ.ОИСМТаймаутПроверки);
	
	ОИСМПоведениеЕслиОтветНеполучен = ?(ТСПИоТ.ОИСМПоведениеЕслиОтветНеполучен = 0, 1, ТСПИоТ.ОИСМПоведениеЕслиОтветНеполучен);
	ПараметрыТСПИоТ.Вставить("OISMSkipAnswer", ОИСМПоведениеЕслиОтветНеполучен);   
	
	ПараметрыТСПИоТ.Вставить("CodesCheckTimeout", ТСПИоТ.ВремяОтветаГИСМТ);
	ПараметрыТСПИоТ.Вставить("EventsReportsSendInterval", ТСПИоТ.ИнтервалПосылкиСобытийЭксплуатации);
	
	Если ОбщегоНазначенияБПО.ИспользуетсяБСП() Тогда 
		// Прокси, если есть используется БСП
		НастройкиПрокси = ОбщегоНазначенияБПО.НастройкиПроксиНаКлиенте();
		ПроксиСервер       = НастройкиПрокси.Сервер;
		ПроксиПорт         = НастройкиПрокси.Порт;
		ПроксиПользователь = НастройкиПрокси.Пользователь;
		ПроксиПароль       = НастройкиПрокси.Пароль;   
	Иначе
		ПроксиСервер       = ТСПИоТ.ПроксиСервер;
		ПроксиПорт         = ТСПИоТ.ПроксиПорт;     
		ПроксиПользователь = ТСПИоТ.ПроксиПользователь; 
		ПроксиПароль       = ТСПИоТ.ПроксиПароль;
	КонецЕсли;
	
	ПараметрыТСПИоТ.Вставить("Proxy"        , ПроксиСервер); // Адрес прокси сервера        
	ПараметрыТСПИоТ.Вставить("ProxyPort"    , ПроксиПорт); // Порт прокси сервера        
	ПараметрыТСПИоТ.Вставить("ProxyUser"    , ПроксиПользователь); // Пользователь прокси сервера        
	ПараметрыТСПИоТ.Вставить("ProxyPassword", ПроксиПароль); // Пароль прокси сервера    
	
	РегистрационнаяИнформация = РегистрационнаяИнформацияТСПИоТ();
	ПараметрыТСПИоТ.Вставить("LibraryName"   , РегистрационнаяИнформация.БиблиотекаНазвание); 
	ПараметрыТСПИоТ.Вставить("LibraryVersion", РегистрационнаяИнформация.БиблиотекаВерсия);
	ПараметрыТСПИоТ.Вставить("LibraryGUID"   , РегистрационнаяИнформация.КонфигурацииИдентификатор);
	ПараметрыТСПИоТ.Вставить("ConfigurationGUID"   , РегистрационнаяИнформация.КонфигурацииИдентификатор);
	ПараметрыТСПИоТ.Вставить("ConfigurationName"   , РегистрационнаяИнформация.КонфигурацииНазвание);     
	ПараметрыТСПИоТ.Вставить("ConfigurationVersion", РегистрационнаяИнформация.КонфигурацииВерсия);    
	
	ТСПИоТПараметрыXML = МенеджерОборудования.ПолучитьПараметрыXML(ПараметрыТСПИоТ, Неопределено, Ложь);    
	Возврат ТСПИоТПараметрыXML;
	
КонецФункции       

// Получить параметры подключения ЛМЧЗ
//
// Параметры:    
//   ПодключаемоеОборудование - СправочникСсылка.ПодключаемоеОборудование
//   ТСПИоТ - СправочникСсылка.ТСПИоТ
// Возвращаемое значение:
//   Структура -
//
Функция ПолучитьПараметрыЛМЧЗ(ПодключаемоеОборудование, ТСПИоТ) Экспорт
	
	ПараметрыЛМЧЗ = Новый Структура();
	ПараметрыЛМЧЗ.Вставить("Использовать", Ложь);
	ПараметрыЛМЧЗ.Вставить("Сервер");
	ПараметрыЛМЧЗ.Вставить("Порт");
	ПараметрыЛМЧЗ.Вставить("Пользователь");
	ПараметрыЛМЧЗ.Вставить("Пароль");

	Если ОбщегоНазначенияБПО.ИспользуетсяГосИС() Тогда
		
		СтруктураРеквизитовПодключаемогоОборудования = ОбщегоНазначенияБПО.ЗначенияРеквизитовОбъекта(ПодключаемоеОборудование, "Организация, РабочееМесто");
		Организация  = СтруктураРеквизитовПодключаемогоОборудования.Организация;
		РабочееМесто = СтруктураРеквизитовПодключаемогоОборудования.РабочееМесто;
		
		МодульОбщегоНазначенияИС = ОбщегоНазначенияБПО.ОбщийМодуль("ОбщегоНазначенияИС");
		ВерсияБГосИС             = МодульОбщегоНазначенияИС.ВерсияБиблиотеки();
		
		Если ЗначениеЗаполнено(ВерсияБГосИС)
			И СтрРазделить(ВерсияБГосИС, ".")[0] = "3"
			И ОбщегоНазначенияБПОКлиентСервер.СравнитьВерсии(ВерсияБГосИС, "3.0.8.1") >= 0
			
			Или ЗначениеЗаполнено(ВерсияБГосИС)
			И СтрРазделить(ВерсияБГосИС, ".")[0] = "2"
			И ОбщегоНазначенияБПОКлиентСервер.СравнитьВерсии(ВерсияБГосИС, "2.0.8.1") >= 0 Тогда
			
			МодульОбщегоНазначенияИСМП = ОбщегоНазначенияБПО.ОбщийМодуль("ОбщегоНазначенияИСМП");
			НастройкиЛокальногоМодуля = МодульОбщегоНазначенияИСМП.НастройкиОсновногоПодключенияЛокальномуМодулюЧестныйЗнакПоОрганизацииРабочемуМесту(Организация, РабочееМесто, ТСПИоТ);
			
		Иначе
			
			МодульОбщегоНазначенияИСМП = ОбщегоНазначенияБПО.ОбщийМодуль("ОбщегоНазначенияИСМП");
			НастройкиЛокальногоМодуля = МодульОбщегоНазначенияИСМП.НастройкиОсновногоПодключенияЛокальномуМодулюЧестныйЗнакПоОрганизацииРабочемуМесту(Организация, РабочееМесто);
			
		КонецЕсли;
		
		НастроеноПодключениеЛМЧЗ = НастройкиЛокальногоМодуля.НастроеноПодключение;
		Если НастроеноПодключениеЛМЧЗ Тогда
			ПараметрыЛМЧЗ.Использовать = Истина;
			ПараметрыЛМЧЗ.Сервер       = НастройкиЛокальногоМодуля.Настройки.Сервер;   
			ПараметрыЛМЧЗ.Порт         = НастройкиЛокальногоМодуля.Настройки.Порт;   
			ПараметрыЛМЧЗ.Пользователь = НастройкиЛокальногоМодуля.Настройки.Логин;   
			ПараметрыЛМЧЗ.Пароль       = НастройкиЛокальногоМодуля.Настройки.Пароль;   
		КонецЕсли;
		
	КонецЕсли;  
	
	Возврат ПараметрыЛМЧЗ;
	
КонецФункции 

// Сохранить cобытия эксплуатации ТС ПИоТ
// 
// Параметры:
//  ПодключаемоеОборудование - СправочникСсылка.ПодключаемоеОборудование
// 
Процедура ЗаписатьСобытиеЭксплуатацииТСПИоТ(ПодключаемоеОборудование, ВременнаяМетка, СобытиеЭксплуатации) Экспорт
	
	РегистрыСведений.СобытияЭксплуатацииТСПИоТ.ЗаписатьСобытиеЭксплуатацииТСПИоТ(ПодключаемоеОборудование, ВременнаяМетка, СобытиеЭксплуатации);
	
КонецПроцедуры    

// Записать аутентификацию пользователя ПИоТ регистр
// 
// Параметры:
//  ПодключаемоеОборудование - СправочникСсылка.ПодключаемоеОборудование -
//  ПараметрыАутентификации - Структура -
//
Процедура ЗаписатьАутентификациюПользователяПИоТ(ПодключаемоеОборудование, ПараметрыАутентификации) Экспорт
	
	РегистрыСведений.АутентификацияПользователяПИоТ.ЗаписатьАутентификациюПользователяПИоТ(ПодключаемоеОборудование, ПараметрыАутентификации);
	
КонецПроцедуры                     

Функция ЗаписиАутентификацииПользователяПИоТ(ПодключаемоеОборудование) Экспорт    
	
	Возврат РегистрыСведений.АутентификацияПользователяПИоТ.ЗаписиАутентификацииПользователяПИоТ(ПодключаемоеОборудование);
	
КонецФункции

// Очищает cобытия эксплуатации ТС ПИоТ для указанного подключаемого оборудования.
//
// Параметры:
//   ПодключаемоеОборудование - СправочникСсылка.ПодключаемоеОборудование - 
//     ссылка на подключаемое оборудование, для которого необходимо очистить архив логов
//
Процедура ОчиститьСобытияЭксплуатацииТСПИоТ(ПодключаемоеОборудование) Экспорт
	
	РегистрыСведений.СобытияЭксплуатацииТСПИоТ.ОчиститьСобытияЭксплуатацииТСПИоТ(ПодключаемоеОборудование);
	
КонецПроцедуры      

// Очищает аутентификации пользователя ПИоТ для указанного подключаемого оборудования.
//
// Параметры:
//   ПодключаемоеОборудование - СправочникСсылка.ПодключаемоеОборудование - 
//     ссылка на подключаемое оборудование, для которого необходимо очистить архив логов
//
Процедура ОчиститьАутентификацииПользователяПИоТ(ПодключаемоеОборудование) Экспорт
	
	РегистрыСведений.АутентификацияПользователяПИоТ.ОчиститьАутентификацииПользователяПИоТ(ПодключаемоеОборудование);
	
КонецПроцедуры   

// Архив cобытия эксплуатации
// Параметры:
//   ПодключаемоеОборудование - СправочникСсылка.ПодключаемоеОборудование - 
//     ссылка на подключаемое оборудование, для которого необходимо очистить архив логов
//
Функция АрхивСобытияЭксплуатации(ПодключаемоеОборудование = Неопределено) Экспорт
	
	Возврат РегистрыСведений.СобытияЭксплуатацииТСПИоТ.АрхивСобытияЭксплуатации(ПодключаемоеОборудование);
	
КонецФункции    

// Проверяет наличие внутреннего ТСПИоТа
Функция СуществуетВнутреннийТСПИоТ()Экспорт
	
	НаличиеПИоТ = Истина;
	
	Запрос = Новый Запрос();
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТСПИоТ.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ТСПИоТ КАК ТСПИоТ
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПодключаемоеОборудование КАК ПодключаемоеОборудование
		|		ПО ТСПИоТ.ФискальноеУстройство = ПодключаемоеОборудование.Ссылка
		|ГДЕ
		|	ТСПИоТ.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыТСПИоТ.Внутренний1С)
		|	И НЕ ПодключаемоеОборудование.ПометкаУдаления
		|	И НЕ ТСПИоТ.ПометкаУдаления";
	
	ВыборкаТСПИоТ = Запрос.Выполнить();
	Если ВыборкаТСПИОТ.Пустой() Тогда
		НаличиеПИоТ = Ложь;
	КонецЕсли;
	
	Возврат НаличиеПИоТ;
	
КонецФункции

// Функция параметры ПИоТ по подключаемому оборудованию
//
// Параметры:
//  ПодключаемоеОборудование - СправочникСсылка.ПодключаемоеОборудование.
//
// Возвращаемое значение:
//  - Структура 
//
Функция ПолучитьПараметрыТСПИоТ(ПодключаемоеОборудование) Экспорт
	
	ТСПИоТ = ПолучитьТСПИоТ(ПодключаемоеОборудование);    
	Если ЗначениеЗаполнено(ТСПИоТ) Тогда 
		ПараметрыТСПИоТ = Новый Структура();
		ПараметрыТСПИоТ.Вставить("Тип"           , ТСПИоТ.Тип);       
		ПараметрыТСПИоТ.Вставить("Наименование"  , ТСПИоТ.Наименование);     
		ПараметрыТСПИоТ.Вставить("ПутьКДрайверу"          , ТСПИоТ.ПутьКДрайверу); 
		ПараметрыТСПИоТ.Вставить("ПутьДанныхЭкземпляра"   , ТСПИоТ.ПутьДанныхЭкземпляра);
		ПараметрыТСПИоТ.Вставить("ИдентификаторЭкземпляра", ТСПИоТ.ИдентификаторЭкземпляра);  
		ПараметрыТСПИоТ.Вставить("УровеньЛога"   , ТСПИоТ.УровеньЛога);
	Иначе
		ПараметрыТСПИоТ = Неопределено;   
	КонецЕсли;
		
	Возврат ПараметрыТСПИоТ;
	
КонецФункции

Функция ПрохожденияСертификацииТСПИоТ() Экспорт  
	
	Результат = Истина;
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Получить регистрационню информацию ТС ПИоТ
//
// Возвращаемое значение:
//  Структура -
//  * БиблиотекаИдентификатор - Строка -
//  * БиблиотекаНазвание - Строка -
//  * БиблиотекаВерсия - Строка -
//  * КонфигурацииИдентификатор - Строка -
//  * КонфигурацииНазвание - Строка -
//
Функция РегистрационнаяИнформацияТСПИоТ();
	
	РегистрационнаяИнформация = Новый Структура();   
	РегистрационнаяИнформация.Вставить("БиблиотекаИдентификатор");
	РегистрационнаяИнформация.Вставить("БиблиотекаНазвание");
	РегистрационнаяИнформация.Вставить("БиблиотекаВерсия");
	РегистрационнаяИнформация.Вставить("КонфигурацииИдентификатор");
	РегистрационнаяИнформация.Вставить("КонфигурацииНазвание", Метаданные.КраткаяИнформация);
	РегистрационнаяИнформация.Вставить("КонфигурацииВерсия"  , Метаданные.Версия);
	
	МенеджерОборудованияТСПИоТПереопределяемый.РегистрационнаяИнформацияТСПИоТ(РегистрационнаяИнформация);
	
	Возврат РегистрационнаяИнформация;
	
КонецФункции       

#КонецОбласти

#КонецЕсли