// @strict-types

#Область ОбработчикиСобытийФормы

// Код процедур и функций
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ДоступноИспользованиеСервисовМобильногоПодписания = ИнтеграцияБСПБЭД.ДоступноИспользованиеСервисовМобильногоПодписания();
	
	Если Не ДоступноИспользованиеСервисовМобильногоПодписания Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru ='Сервисы мобильного подписания не доступны'"));
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ПроверятьСертификат = КриптографияБЭДСлужебныйКлиентСервер.РежимыПроверкиСертификата().ПроверятьКвалифицированные;
	
	Элементы.Подписант.ТолькоПросмотр = Параметры.Свойство("Подписант", Подписант);
	
	Параметры.Свойство("ВидМобильнойПодписи", ВидМобильнойПодписи);

	ТекущаяВерсияБСП = СтандартныеПодсистемыСервер.ВерсияБиблиотеки();
	
	Если ВидМобильнойПодписи = Перечисления.ВидыМобильныхПодписей.МояПодпись Тогда
	
		СоглашениеНаЗагрузкуСертификата =
			Обработки.ПодписаниеИШифрованиеДанныхВМобильномЭДО.ПолучитьМакет("СоглашениеНаЗагрузкуСертификатаСервисаМояПодпись");
		
		Элементы.СтраницыПодписанияСоглашения.ТекущаяСтраница = Элементы.СтраницаИнформацияОПодписанииСоглашенияМояПодпись;

	ИначеЕсли ВидМобильнойПодписи = Перечисления.ВидыМобильныхПодписей.ГосключУКЭП Или
			ВидМобильнойПодписи = Перечисления.ВидыМобильныхПодписей.ГосключУКЭП Тогда

		СоглашениеНаЗагрузкуСертификата =
			Обработки.ПодписаниеИШифрованиеДанныхВМобильномЭДО.ПолучитьМакет("СоглашениеНаЗагрузкуСертификатаСервисаГосКлюч");
		
		Элементы.СтраницыПодписанияСоглашения.ТекущаяСтраница = Элементы.СтраницаИнформацияОПодписанииСоглашенияГосключ;
	
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПодписантПриИзменении(Элемент)
	
	// СтандартныеПодсистемы.СервисМобильнойПодписи
	ПодписантПриИзмененииНаСервере();
	// Конец СтандартныеПодсистемы.СервисМобильнойПодписи
	
КонецПроцедуры

&НаКлиенте
Процедура ВидПодписиПриИзменении(Элемент)
	
	// СтандартныеПодсистемы.СервисМобильнойПодписи
	ЗаполнитьНастройкуОтправки();
	// Конец СтандартныеПодсистемы.СервисМобильнойПодписи
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

// Код процедур и функций
&НаКлиенте
Асинх Процедура Подписать(Команда)
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	ОписаниеДанных = Новый Структура();
	СтруктураПредставления = Новый Структура();
	СтруктураПредставления.Вставить("Представление", НСтр("ru = 'Соглашение на загрузку сертификата'"));
	СтруктураПредставления.Вставить("ИмяФайла", НСтр("ru = 'Соглашение на загрузку сертификата.txt'"));

	ОписаниеДанных.Вставить("Представление", СтруктураПредставления);
	ОписаниеДанных.Вставить("Данные", ПолучитьДвоичныеДанныеИзСтроки(СоглашениеНаЗагрузкуСертификата.ПолучитьТекст()));
	
	ОписаниеДанных.Вставить("ПодписаниеВЭтомПриложении", Ложь);
	
	ПараметрыПодписанта = ИнтеграцияБСПБЭДВызовСервера.ПараметрыПодписантаМобильнойПодписи(Подписант);
	
	ОписаниеДанных.Вставить("ВыбранныйПодписант", ПараметрыПодписанта);

	ПараметрыВыполнения = Новый Структура("ОписаниеДанных, ИдентификаторФормы, Форма",
		ОписаниеДанных,
		УникальныйИдентификатор,
		ЭтотОбъект);
	
	КонтекстПодписания = Новый Структура("ПараметрыВыполнения, Подписант, ИдентификаторФормы",
		ПараметрыВыполнения,
		ПараметрыПодписанта,
		УникальныйИдентификатор);
		
	ПараметрыПодписания = СервисМобильнойПодписиКлиентСервер.ПараметрыПодписания();
	ПараметрыПодписания.ПакетнаяОтправкаНаПодписание = Ложь;
	ПараметрыПодписания.ВидМобильнойПодписи = ВидМобильнойПодписи;
	ПараметрыПодписания.НастройкаОтправки = НастройкаОтправки;
	
	ПараметрыПодписания.Вставить("ТекущаяВерсияБСП", ТекущаяВерсияБСП);
	
	ПодписатьЗавершение = Новый ОписаниеОповещения("ПодписатьЗавершение", ЭтотОбъект, КонтекстПодписания);
	
	ИнтеграцияБСПБЭДСлужебныйКлиент.ПодписатьДанныеВСервисеМобильнойПодписи(ПодписатьЗавершение,
		КонтекстПодписания,
		ПараметрыПодписания);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПодписантПриИзмененииНаСервере()
	
	МодульСервисМобильнойПодписиСлужебный = ОбщегоНазначения.ОбщийМодуль("СервисМобильнойПодписиСлужебный");
	МодульСервисМобильнойПодписиСлужебный.ПодписантПриИзмененииНаСервере(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНастройкуОтправки()
	
	МодульСервисМобильнойПодписиСлужебный = ОбщегоНазначения.ОбщийМодуль("СервисМобильнойПодписиСлужебный");
	МодульСервисМобильнойПодписиСлужебный.ЗаполнитьНастройкуОтправки(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодписатьЗавершение(Результат, Контекст) Экспорт
	
	Если ТипЗнч(Результат) <> Тип("Структура") Или Результат.Свойство("ОтменаПодписания") Тогда
		Возврат;
	КонецЕсли;

	Ошибка = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Результат, "Ошибка");
	Если Ошибка <> Неопределено Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(Ошибка);
		Возврат;
	КонецЕсли;

	ОписаниеДанных = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Контекст.ПараметрыВыполнения, "ОписаниеДанных");
	
	Если ОписаниеДанных = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СертификатПодписанта = КриптографияБЭДСлужебныйКлиент.НайтиСоздатьСертификатПодписантаИзСвойствПодписи(
		ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ОписаниеДанных, "СвойстваПодписи"),
		Подписант,
		ВидМобильнойПодписи);
	
	Закрыть(СертификатПодписанта);
	
КонецПроцедуры

#КонецОбласти
