///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

// @strict-types

#Область СлужебныйПрограммныйИнтерфейс

#Область ТокенРутокен

//Продолжает обработку операцию Рутокен после преобразования Данных из ОписаниеОповещения
// Параметры:
//  Результат - Структура
//  Контекст - Структура - С Параметрами:
//  * ОписаниеДанных - Структура - Структура с ключами:
//    ** Данные - ДвоичныеДанные - Данные для подписи
//    ** НаборДанных - Структура - Структура с ключами:
//      *** Данные - ДвоичныеДанные - Данные для подписи
//  * ПараметрыКомпоненты - Структура - Структура с ключами:
//    ** Форма - ФормаКлиентскогоПриложения:
//    ** ТекущаяОперация - Строка
//    ** ИдентификаторТекущейОперации - Строка
//  * Пароль - Строка - Пароль к контейнеру Рутокен.
//
Асинх Процедура ПродолжитьОбработкуОперацииРутокен(Результат, Контекст) Экспорт
	
	Если ТипЗнч(Результат) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыКомпоненты = Контекст.ПараметрыКомпоненты;
	
	Операция = ПараметрыКомпоненты.ТекущаяОперация;

	ИдентификаторОперации = "";
	ОтветКомпоненты = "";
	Форма = ПараметрыКомпоненты.Форма;
	Элементы = Форма.Элементы;
	
	ОписаниеДанных = Контекст.ОписаниеДанных;
	
	Если Операция = "Подписание" Тогда
		
		Элементы.ДекорацияТекстовоеСостояниеОперации.Заголовок = "";
		//@skip-check property-return-type
		Элементы.СтраницыПодписание.ТекущаяСтраница = Элементы.СтраницаОбработкаОперацииРутокен;
	
		ЗаголовокОперации = НСтр("ru ='ПОДПИСЫВАЕТСЯ:'");
		
		НаборДанных = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ОписаниеДанных, "НаборДанных");
		
		НомерСтрокиДанных = 1;
		
		КоличествоДанныхВНаборе = НаборДанных.Количество();

		Для Каждого Данные Из НаборДанных Цикл
			
			Если Данные.Свойство("СвойстваПодписи") Тогда
				НомерСтрокиДанных = НомерСтрокиДанных + 1;
				Продолжить;
			КонецЕсли;
			
			ДанныеДляПодписания = Данные.Данные;
			
			Если ТипЗнч(ДанныеДляПодписания) = Тип("Строка") Тогда
				ДанныеДляПодписания = ПолучитьИзВременногоХранилища(ДанныеДляПодписания);
			КонецЕсли;
			
			//@skip-check dynamic-access-method-not-found
			//@skip-check statement-type-change
			ОтветКомпоненты = ПараметрыКомпоненты.ОбъектКомпоненты.Подписать(Контекст.Пароль,
				ПараметрыКомпоненты.ОтпечатокHexВыбранногоСертификата,
				ДанныеДляПодписания);
			
			ИдентификаторОперации = ИдентификаторТекущейОперации(ОтветКомпоненты, ПараметрыКомпоненты);
			
			Данные.Вставить("ИдентификаторОперацииПодписания", ИдентификаторОперации);
			
			//@skip-check property-return-type
			ПредставлениеДанных = Данные.Представление;
			Если ТипЗнч(ПредставлениеДанных) = Тип("Структура") Тогда
				ПредставлениеДанных = ПредставлениеДанных.Представление;
			КонецЕсли;
				
			Если КоличествоДанныхВНаборе > 1 Тогда
			
				ПредставлениеДанных = СтрШаблон("(%1/%2) %3",
					НомерСтрокиДанных,
					КоличествоДанныхВНаборе,
					ПредставлениеДанных);
				
			КонецЕсли;
			
			Элементы.ДекорацияТекстовоеСостояниеОперации.Заголовок = СтрШаблон("%1%2%3",
				ЗаголовокОперации,
				Символы.ПС,
				ПредставлениеДанных);
			
			НомерСтрокиДанных = НомерСтрокиДанных + 1;
			
			Прервать;

		КонецЦикла;

	ИначеЕсли Операция = "Расшифровка" Тогда

		ДанныеДляРасшифровки = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ОписаниеДанных, "Данные");
		
		Если ТипЗнч(ДанныеДляРасшифровки) = Тип("Строка") Тогда
			ДанныеДляРасшифровки = ПолучитьИзВременногоХранилища(ДанныеДляРасшифровки);
		КонецЕсли;
		
		ОтветКомпоненты = ПараметрыКомпоненты.ОбъектКомпоненты.Расшифровать(Контекст.Пароль,
			ДанныеДляРасшифровки);
		
		ИдентификаторОперации = ИдентификаторТекущейОперации(ОтветКомпоненты, ПараметрыКомпоненты);
		
		ОписаниеДанных.Вставить("ИдентификаторОперацииРасшифровки", ИдентификаторОперации);

	КонецЕсли;
	
	Если ЗначениеЗаполнено(ИдентификаторОперации) Тогда
		ПараметрыКомпоненты.ИдентификаторТекущейОперации = ИдентификаторОперации;
	Иначе

		Ошибка = НовыйОшибкаРутокен();
		Ошибка.Форма = Форма;
		ТекстОшибки = НСтр("ru = 'Не найден идентификатор текущей операции. Повторите операцию' ");
		Ошибка.Описание = ТекстОшибки;
		
		ВыполнитьОбработкуОповещения(ПараметрыКомпоненты.ОбработкаОшибки, Ошибка);
	КонецЕсли;
	
КонецПроцедуры

//  Обрабатывает результат операции "Подписание"
//  Параметры:
//   ПодписанныеДанные - ДвоичныеДанные, Строка - Подписанные данные
//   ПараметрыКомпоненты - Структура - Структура из:
//    * ОбъектКомпоненты - ОбъектВнешнейКомпоненты, Неопределено - Объект компоненты
//    * СвойстваСертификатов - Структура, Неопределено - Свойства сертификатов
//    * СвойстваВыбранногоСертификата - Структура, Неопределено - Свойства выбранного сертификата
//    * ОписаниеОповещенияПослеОперации - ОписаниеОповещения, Неопределено - Оповещение
//    * ИдентификаторТекущейОперации - Строка
//    * ТекущаяОперация - Строка - Текущая операция
//    * Форма- ФормаКлиентскогоПриложения, Неопределено - Форма-Источник
//    * ОписаниеДанных - Структура, Неопределено - Структура с описанием данных
//    * ОбработкаОшибки - ОписаниеОповещения
//
Асинх Процедура ОбработатьРезультатПодписанияДанных(ПодписанныеДанные, ПараметрыКомпоненты) Экспорт

	Форма = ПараметрыКомпоненты.Форма;
	Ошибка = НовыйОшибкаРутокен();
	Ошибка.Форма = Форма;
	
	Если ПодписанныеДанные = Неопределено Тогда

		Ошибка.Описание = НСтр("ru = 'Не удалось подписать данные набора'");
		ВыполнитьОбработкуОповещения(ПараметрыКомпоненты.ОбработкаОшибки, Ошибка);
		Возврат;

	КонецЕсли;
	
	ОписаниеДанных = ПараметрыКомпоненты.ОписаниеДанных;

	НаборДанных = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ОписаниеДанных, "НаборДанных");

	Если НаборДанных = Неопределено Тогда
		
		Ошибка.Описание = НСтр("ru = 'Нет данных для подписания'");
		ВыполнитьОбработкуОповещения(ПараметрыКомпоненты.ОбработкаОшибки, Ошибка);
		Возврат;
	КонецЕсли;
	
	КоличествоДанныхВНаборе = НаборДанных.Количество();
	
	НомерСтрокиДанных = 1;
	
	Элементы = Форма.Элементы;
	
	ЕстьДанныеДляПодписания = Ложь;
	
	Для Каждого Данные Из НаборДанных Цикл
			
		Если Данные.Свойство("СвойстваПодписи") Тогда
			НомерСтрокиДанных = НомерСтрокиДанных + 1;
			Продолжить;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ПараметрыКомпоненты.ИдентификаторТекущейОперации) И
			Данные.ИдентификаторОперацииПодписания <> ПараметрыКомпоненты.ИдентификаторТекущейОперации Тогда
			НомерСтрокиДанных = НомерСтрокиДанных + 1;
			Продолжить;
		КонецЕсли;

		Если ТипЗнч(ПодписанныеДанные) = Тип("Строка") Тогда
			ПодписанныеДанные = Base64Значение(ПодписанныеДанные);
		КонецЕсли;
		
		ЗаполнитьСвойстваПодписиУДанныхНабора(Данные,
			ПараметрыКомпоненты.СвойстваВыбранногоСертификата,
			ПодписанныеДанные);
		
		СледующийНомерСтрокиДанных= НомерСтрокиДанных + 1;
		
		Если СледующийНомерСтрокиДанных <= КоличествоДанныхВНаборе Тогда

			СледующаяСтрокаДанных = НаборДанных[СледующийНомерСтрокиДанных -1];

			ПредставлениеСледующейСтрокиДанных = СледующаяСтрокаДанных.Представление;
			
			Если ТипЗнч(ПредставлениеСледующейСтрокиДанных) = Тип("Структура") Тогда
				ПредставлениеСледующейСтрокиДанных = ПредставлениеСледующейСтрокиДанных.Представление;
			КонецЕсли;
			
			Элементы.ДекорацияТекстовоеСостояниеОперации.Заголовок = СтрШаблон("(%1/%2) %3",
				СледующийНомерСтрокиДанных,
				КоличествоДанныхВНаборе,
				ПредставлениеСледующейСтрокиДанных);
			
			ЕстьДанныеДляПодписания = Истина;
			
			Прервать;
		
		КонецЕсли;
		
	КонецЦикла;
	
	Если ЕстьДанныеДляПодписания Тогда
		Элементы.Подписать.Доступность = Истина;
	Иначе
		Если ПараметрыКомпоненты.ОписаниеОповещенияПослеОперации <> Неопределено Тогда
			ВыполнитьОбработкуОповещения(ПараметрыКомпоненты.ОписаниеОповещенияПослеОперации, Новый Структура());
		КонецЕсли;

		Если Форма.Открыта() Тогда
			Форма.Закрыть()
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

//  Обрабатывает результат операции "Подписание"
//  Параметры:
//   РасшифрованныеДанные - ДвоичныеДанные, Строка - Результат расшифровки
//   ПараметрыКомпоненты - Структура - Структура из:
//    * ОбъектКомпоненты - ОбъектВнешнейКомпоненты, Неопределено - Объект компоненты
//    * СвойстваСертификатов - Структура, Неопределено - Свойства сертификатов
//    * СвойстваВыбранногоСертификата - Структура, Неопределено - Свойства выбранного сертификата
//    * ОписаниеОповещенияПослеОперации - ОписаниеОповещения, Неопределено - Оповещение
//    * ИдентификаторТекущейОперации - Строка
//    * ТекущаяОперация - Строка - Текущая операция
//    * Форма- ФормаКлиентскогоПриложения, Неопределено - Форма-Источник
//    * ОписаниеДанных - Структура, Неопределено - Структура с описанием данных
//    * ОбработкаОшибки - ОписаниеОповещения
//
Асинх Процедура ОбработатьРезультатРасшифровкиДанных(РасшифрованныеДанные, ПараметрыКомпоненты) Экспорт

	Форма = ПараметрыКомпоненты.Форма;
	Ошибка = НовыйОшибкаРутокен();
	Ошибка.Форма = Форма;
	
	Если РасшифрованныеДанные = Неопределено Тогда

		Ошибка.Описание = НСтр("ru = 'Не удалось подписать данные набора'");
		ВыполнитьОбработкуОповещения(ПараметрыКомпоненты.ОбработкаОшибки, Ошибка);
		Возврат;

	КонецЕсли;
	
	ОписаниеДанных = ПараметрыКомпоненты.ОписаниеДанных;
	
	Если ПараметрыКомпоненты.ИдентификаторТекущейОперации <> ОписаниеДанных.ИдентификаторОперацииРасшифровки Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(РасшифрованныеДанные) = Тип("Строка") Тогда
		РасшифрованныеДанные = Base64Значение(РасшифрованныеДанные);
	КонецЕсли;
	
	ОписаниеДанных.Вставить("РасшифрованныеДанные", РасшифрованныеДанные);
	
	Если ПараметрыКомпоненты.ОписаниеОповещенияПослеОперации <> Неопределено Тогда
		ВыполнитьОбработкуОповещения(ПараметрыКомпоненты.ОписаниеОповещенияПослеОперации, ОписаниеДанных);
	КонецЕсли;

	Если Форма.Открыта() Тогда
		Форма.Закрыть()
	КонецЕсли;

КонецПроцедуры

// Обрабатывает результат взаимодействия с компонентой
// Параметры:
// Результат - Структура - Структура ошибки:
// 	* КодОшибки - Строка - контролируемый код ошибки
//  * Описание - Строка - описание ошибки
//  * Форма - ФормаКлиентскогоПриложения - Форма
//	ДополнительныеПараметры - Структура, Неопределено - дополнительные параметры ошибки
//
Асинх Процедура ОбработатьОшибкуОперацииРутокен(Результат, ДополнительныеПараметры) Экспорт

	ТекстСообщения = "";
	
	КодОшибки = Результат.КодОшибки;
	Форма = Результат.Форма;
	ОписаниеОшибки = Результат.Описание;
	
	ЕстьКодОшибки = ЗначениеЗаполнено(КодОшибки);
	
	Если ЕстьКодОшибки Тогда
		Если КодОшибки = "99" Тогда
			ОписаниеОшибки = СтрШаблон(
				НСтр("ru = 'Закончилось время ожидания взаимодействия с устройством'"));
		КонецЕсли;

	КонецЕсли;
	
	Если Не ПустаяСтрока(ОписаниеОшибки) Тогда
		Если ЕстьКодОшибки Тогда
			ТекстСообщения = СтрШаблон("(%1)%2%3", КодОшибки, Символы.ПС, ОписаниеОшибки);
		Иначе
			ТекстСообщения = ОписаниеОшибки;
		КонецЕсли;
	КонецЕсли;
	
	Если Форма <> Неопределено Тогда
		ЭтоФормаПодписания =
			(Форма.ИмяФормы = "Обработка.ПодписаниеИШифрованиеДанныхВМобильномЭДО.Форма.ПодписаниеДанных");
		Если ЭтоФормаПодписания Тогда
			Форма.Элементы.Подписать.Доступность = Истина;
			Форма.Элементы.СтраницыПодписание.ТекущаяСтраница = Форма.Элементы.СтраницаПодписание;
			
		Иначе
			Форма.Элементы.ФормаРасшифровать.Доступность = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Если Не ПустаяСтрока(ТекстСообщения) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;

КонецПроцедуры

//  Заполняет свойства формы и свойства параметров компоненты
// Параметры:
//  ПараметрыКомпоненты - Структура - структура с ключами:
//    * ОбъектКомпоненты - ОбъектВнешнейКомпоненты, Неопределено - Объект компоненты
//    * СвойстваВыбранногоСертификата - Структура, Неопределено - Свойства выбранного сертификата 
//      из СвойствСертификатов (см. КриптографияБЭД.СвойстваСертификатов()
//    * ОтпечатокHexВыбранногоСертификата - Строка, Неопределено - Отпечаток сертификата в виде строки hex
//    * ОписаниеОповещенияПослеОперации - ОписаниеОповещения, Неопределено - Оповещение
//    * ИдентификаторТекущейОперации - Строка
//    * ТекущаяОперация - Строка - Текущая операция
//	  * Версия - Строка - Версия компоненты
//	  * Форма - ФормаКлиентскогоПриложения - Форма
//  СвойстваСертификатов - Соответствие - см. КриптографияБЭД.СвойстваСертификатов.
//
Процедура ЗаполнитьСвойстваПоСертификату(ПараметрыКомпоненты, СвойстваСертификатов) Экспорт
	
	Если СвойстваСертификатов = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Форма = ПараметрыКомпоненты.Форма;
 	СвойстваВыбранногоСертификата = СвойстваСертификатов.Получить(Форма.Сертификат);
	Если СвойстваВыбранногоСертификата = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ПараметрыКомпоненты.СвойстваВыбранногоСертификата = СвойстваВыбранногоСертификата;

	Форма.СертификатАдрес = ПоместитьВоВременноеХранилище(СвойстваВыбранногоСертификата.ДанныеСертификата,
		Форма.УникальныйИдентификатор);
		
	Форма.СертификатДействителенДо = СвойстваВыбранногоСертификата.ДействителенДо;
	Форма.СертификатОтозван = СвойстваВыбранногоСертификата.Отозван;
	Форма.СертификатОтпечаток = СвойстваВыбранногоСертификата.Отпечаток;

	ПараметрыКомпоненты.ОтпечатокHexВыбранногоСертификата = HexОтпечатокИзBase64Строка(
		СвойстваВыбранногоСертификата.Отпечаток);

КонецПроцедуры

#КонецОбласти

#Область Биометрия

// Выполняет подключение отключение биометрии для
//  Параметры:
//   Форма - ФормаКлиентскогоПриложения - Форма 
//   ИмяЗащищаемогоРеквизита - Строка - Имя реквизита
//   ИмяРеквизитаПодключитьБиометрию  - Строка - Имя флажка с настройкой подключения биометрии
//   Оповещение - ОписаниеОповещения - Оповещение после чтения пароля с помощью биометрии
//
Асинх Процедура ЗаполнитьПоДаннымБиометрии(Форма,
	ИмяЗащищаемогоРеквизита = "Пароль",
	ИмяРеквизитаПодключитьБиометрию = "ПодключитьБиометрию",
	Оповещение = Неопределено) Экспорт
	
	ПодключитьБиометрию = Форма[ИмяРеквизитаПодключитьБиометрию];
	
	Если Не ПодключитьБиометрию Тогда
		Возврат;
	КонецЕсли;
	
	Ключ = СтрШаблон("%1_%2", ИмяРеквизитаПодключитьБиометрию, ИмяЗащищаемогоРеквизита);

#Если МобильныйКлиент Тогда
	
	Если Не БезопасноеХранилище.ПоддерживаетсяЗащитаДоступа(
		СпособЗащитыДоступаБезопасногоХранилища.ТребуетсяДополнительнаяПроверкаПользователя) Тогда
		
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru ='Биометрическая защита не поддерживается'"));
		Форма[ИмяРеквизитаПодключитьБиометрию] = Ложь;
		Возврат;
	КонецЕсли;
	
	Если Не БезопасноеХранилище.СодержитКлюч(Ключ) Тогда
		Форма[ИмяРеквизитаПодключитьБиометрию] = Ложь;
		Возврат;
	КонецЕсли;

	ПарольВБезопасномХранилище = Ждать БезопасноеХранилище.ПолучитьДанныеАсинх(
		Ключ,
		НСтр("ru='Для заполнения пароля необходимо прочитать биометрические данные'"));
			
	Если ПарольВБезопасномХранилище <> Неопределено Тогда
		Форма[ИмяЗащищаемогоРеквизита] = ПарольВБезопасномХранилище;
		
		Если Оповещение <> Неопределено Тогда
			ВыполнитьОбработкуОповещения(Оповещение, ПарольВБезопасномХранилище);
		КонецЕсли;
	КонецЕсли;

#КонецЕсли

КонецПроцедуры

// Выполняет подключение отключение биометрии для
//  Параметры:
//   Форма - ФормаКлиентскогоПриложения - Форма 
//   ИмяЭлементаФормы - Строка - Имя элемента формы
//   ИмяЗащищаемогоРеквизита - Строка - Имя реквизита
//   ИмяРеквизитаПодключитьБиометрию  - Строка - Имя флажка с настройкой подключения биометрии
//
Асинх Процедура ПодключитьОтключитьБиометрию(Форма,
	СвойстваПароля,
	ИмяЗащищаемогоРеквизита ="Пароль",
	ИмяРеквизитаПодключитьБиометрию = "ПодключитьБиометрию") Экспорт

	Ключ = СтрШаблон("%1_%2", ИмяРеквизитаПодключитьБиометрию, ИмяЗащищаемогоРеквизита);

#Если МобильныйКлиент Тогда
	
	ПодключитьБиометрию = Форма[ИмяРеквизитаПодключитьБиометрию];
	
	Если ПодключитьБиометрию = Истина Тогда
		
		Если Не БезопасноеХранилище.ПоддерживаетсяЗащитаДоступа(
			СпособЗащитыДоступаБезопасногоХранилища.ТребуетсяДополнительнаяПроверкаПользователя) Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru ='Биометрическая защита не поддерживается'"));
			Форма[ИмяРеквизитаПодключитьБиометрию] = Ложь;
			Возврат;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(СвойстваПароля.Значение) Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru ='Пароль не заполнен'"));
			Форма[ИмяРеквизитаПодключитьБиометрию] = Ложь;
			Возврат;
		КонецЕсли;

		ДанныеПомещены = Ждать БезопасноеХранилище.ПоместитьДанныеАсинх(Ключ,
			СвойстваПароля.Значение,
			СпособЗащитыДоступаБезопасногоХранилища.ТребуетсяДополнительнаяПроверкаПользователя,
			СпособДополнительнойПроверкиПользователя.БиометрическаяИлиВводПароля);

		Если ДанныеПомещены = Истина Тогда
			ПоказатьОповещениеПользователя(НСтр("ru='Биометрия подключена'"));
		КонецЕсли;
		
	Иначе

		Если БезопасноеХранилище.СодержитКлюч(Ключ) Тогда
			ДанныеУдалены = Ждать БезопасноеХранилище.УдалитьДанныеАсинх(Ключ);
			Если ДанныеУдалены = Истина Тогда
				ПоказатьОповещениеПользователя(НСтр("ru='Биометрия отключена'"));
			КонецЕсли;
		КонецЕсли;

	КонецЕсли;
	
#КонецЕсли

КонецПроцедуры

// Конструктор для инициализации переменной "ПараметрыКомпоненты"
//  Возвращаемое значение:
//   Структура - Структура с ключами:
//    * ОбъектКомпоненты - ОбъектВнешнейКомпоненты, Неопределено - Объект компоненты
//    * СвойстваВыбранногоСертификата - Структура, Неопределено - Свойства выбранного сертификата 
//      из СвойствСертификатов (см. КриптографияБЭД.СвойстваСертификатов()
//    * ОтпечатокHexВыбранногоСертификата - Строка, Неопределено - Отпечаток сертификата в виде строки hex
//    * ОписаниеОповещенияПослеОперации - ОписаниеОповещения, Неопределено - Оповещение
//    * ИдентификаторТекущейОперации - Строка
//    * ТекущаяОперация - Строка - Текущая операция
//    * Версия - Строка - Версия компоненты
//    * Форма - ФормаКлиентскогоПриложения, Неопределено - Форма-владелец, в которой выполняется операция
//    * ОписаниеДанных - Структура.
//
Функция НовыйПараметрыКомпонентыРутокен() Экспорт
	
	ПараметрыКомпоненты = Новый Структура();
	ПараметрыКомпоненты.Вставить("ОбъектКомпоненты", Неопределено);
	ПараметрыКомпоненты.Вставить("СвойстваВыбранногоСертификата", "");
	ПараметрыКомпоненты.Вставить("ОписаниеОповещенияПослеОперации", Неопределено);
	ПараметрыКомпоненты.Вставить("ИдентификаторТекущейОперации", "");
	ПараметрыКомпоненты.Вставить("ТекущаяОперация", "");
	ПараметрыКомпоненты.Вставить("ОтпечатокHexВыбранногоСертификата", "");
	ПараметрыКомпоненты.Вставить("Версия", "");
	ОбработкаОшибки = Новый ОписаниеОповещения("ОбработатьОшибкуОперацииРутокен",
		МобильныйЭДОСлужебныйКлиент);
	ПараметрыКомпоненты.Вставить("ОбработкаОшибки", ОбработкаОшибки);
	ПараметрыКомпоненты.Вставить("Форма", Неопределено);
	ПараметрыКомпоненты.Вставить("ОписаниеДанных", Новый Структура);
	
	//@skip-check constructor-function-return-section
	Возврат ПараметрыКомпоненты;

КонецФункции

// Конструктор для инициализации результата обработки операции Рутокен
//  Возвращаемое значение:
//   Структура - Структура с ключами:
//    * Форма - ФормаКлиентскогоПриложения, Неопределено - Форма
//    * КодОшибки - Строка
//    * Описание - Строка
//
Функция НовыйОшибкаРутокен() Экспорт
	
	Ошибка = Новый Структура();
	Ошибка.Вставить("Форма", Неопределено);
	Ошибка.Вставить("Описание", "");
	Ошибка.Вставить("КодОшибки", "");

	//@skip-check constructor-function-return-section
	Возврат Ошибка;
	
КонецФункции

#КонецОбласти

// Возвращает представление данных в форме.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения
// Возвращаемое значение:
//  Строка - Представление данных
//
Функция ПолноеПредставлениеДанных(Форма) Экспорт
	
	Элементы = Форма.Элементы;
	ЭлементПредставлениеДанных = Элементы.ПредставлениеДанных; // ПолеФормы
	Если Элементы.ПредставлениеДанных.ПоложениеЗаголовка <> ПоложениеЗаголовкаЭлементаФормы.Нет
		И ЗначениеЗаполнено(ЭлементПредставлениеДанных.Заголовок) Тогда
	
		Возврат ЭлементПредставлениеДанных.Заголовок + ": " + Форма.ПредставлениеДанных;
	Иначе
		Возврат Форма.ПредставлениеДанных;
	КонецЕсли;
	
КонецФункции

// Открывает представление данных по гиперссылке в форме.
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения
//  Элемент - ЭлементыФормы
//  СтандартнаяОбработка - Булево
//  ТекущийСписокПредставлений - СписокЗначений
//
Процедура ПредставлениеДанныхНажатие(Форма, Элемент, СтандартнаяОбработка, ТекущийСписокПредставлений) Экспорт
	
	СтандартнаяОбработка = Ложь;
	
	Если ТекущийСписокПредставлений.Количество() > 1 Тогда
		СписокПредставленийДанных = Новый Массив;
		Для Каждого ЭлементСписка Из ТекущийСписокПредставлений Цикл
			СписокПредставленийДанных.Добавить(ЭлементСписка.Представление);
		КонецЦикла;
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("СписокПредставленийДанных", СписокПредставленийДанных);
		ПараметрыФормы.Вставить("ПредставлениеДанных", Форма.ПредставлениеДанных);
		НоваяФорма = ОткрытьФорму("Справочник.СертификатыКлючейЭлектроннойПодписиИШифрования.Форма.ПросмотрДанных",
			ПараметрыФормы, Элемент);
		Если НоваяФорма = Неопределено Тогда
			Возврат;
		КонецЕсли;
		НоваяФорма.УстановитьСписокПредставлений(ТекущийСписокПредставлений, Неопределено);
	Иначе
		Значение = ТекущийСписокПредставлений[0].Значение;
		Если ТипЗнч(Значение) = Тип("ОписаниеОповещения") Тогда
			ВыполнитьОбработкуОповещения(Значение);
		Иначе
			ПоказатьЗначение(, Значение);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Только для внутреннего использования.
Процедура ОткрытьНовуюФорму(ВидФормы, КлиентскиеПараметры, СерверныеПараметры, ОбработкаЗавершения) Экспорт
	
	ОписаниеДанных = КлиентскиеПараметры.ОписаниеДанных;
	
	СерверныеПараметры.Вставить("БезПодтверждения", Ложь);
	
	Если ОписаниеДанных.Свойство("БезПодтверждения")
		И ОписаниеДанных.БезПодтверждения
		И (СерверныеПараметры.Свойство("ОтборСертификатов")
				И ТипЗнч(СерверныеПараметры.ОтборСертификатов) = Тип("Массив")
				И СерверныеПараметры.ОтборСертификатов.Количество() = 1 
			Или СерверныеПараметры.Свойство("Подписант") И ЗначениеЗаполнено(СерверныеПараметры.Подписант)) Тогда
		СерверныеПараметры.Вставить("БезПодтверждения", Истина);
	КонецЕсли;
	
	Если СерверныеПараметры.Свойство("НаборСертификатов")
	   И ОписаниеДанных.Свойство("БезПодтверждения")
	   И ОписаниеДанных.БезПодтверждения Тогда
		
		СерверныеПараметры.Вставить("БезПодтверждения", Истина);
	КонецЕсли;
	
	НастроитьПредставлениеДанных(КлиентскиеПараметры, СерверныеПараметры);
	
	Контекст = Новый Структура;
	Контекст.Вставить("ВидФормы",            ВидФормы);
	Контекст.Вставить("КлиентскиеПараметры", КлиентскиеПараметры);
	Контекст.Вставить("СерверныеПараметры",  СерверныеПараметры);
	Контекст.Вставить("ОбработкаЗавершения", ОбработкаЗавершения);
	
	ОткрытьНовуюФормуЗавершение(Новый Массив, Контекст);

КонецПроцедуры

// Продолжение процедуры ОткрытьНовуюФорму.
Процедура ОткрытьНовуюФормуЗавершение(ОтпечаткиСертификатовНаКлиенте, Контекст)
	
	Контекст.СерверныеПараметры.Вставить("ОтпечаткиСертификатовНаКлиенте",
		ОтпечаткиСертификатовНаКлиенте);
	
	ФормаПередачаПараметров().ОткрытьНовуюФорму(
		Контекст.ВидФормы,
		Контекст.СерверныеПараметры,
		Контекст.КлиентскиеПараметры,
		Контекст.ОбработкаЗавершения);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Для процедуры ОткрытьНовуюФорму
Процедура НастроитьПредставлениеДанных(КлиентскиеПараметры, СерверныеПараметры)
	
	ОписаниеДанных = КлиентскиеПараметры.ОписаниеДанных;
	
	Если ОписаниеДанных.Свойство("СписокПредставлений") Тогда
		СписокПредставлений = ОписаниеДанных.СписокПредставлений;
	Иначе
		СписокПредставлений = Новый Массив;
		
		Если ОписаниеДанных.Свойство("Данные")
		 Или ОписаниеДанных.Свойство("Объект") Тогда
			
			ЗаполнитьСписокПредставлений(СписокПредставлений, ОписаниеДанных);
		Иначе
			Для каждого ЭлементДанных Из ОписаниеДанных.НаборДанных Цикл
				ЗаполнитьСписокПредставлений(СписокПредставлений, ЭлементДанных);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	ТекущийСписокПредставлений = Новый СписокЗначений;
	
	Для каждого ЭлементСписка Из СписокПредставлений Цикл
		Если ТипЗнч(ЭлементСписка) = Тип("Строка") Тогда
			Представление = ЭлементСписка;
			Значение = Неопределено;
		ИначеЕсли ТипЗнч(ЭлементСписка) = Тип("Структура") Тогда
			Представление = ЭлементСписка.Представление;
			Значение = ЭлементСписка.Значение;
		Иначе // Ссылка
			Представление = Строка(ЭлементСписка.Значение);
			Значение = ЭлементСписка.Значение;
		КонецЕсли;
		
		ТекущийСписокПредставлений.Добавить(Значение, Представление);
	КонецЦикла;
	
	Если ТекущийСписокПредставлений.Количество() > 1 Тогда
		СерверныеПараметры.Вставить("ПредставлениеДанныхОткрывается", Истина);
		СерверныеПараметры.Вставить("ПредставлениеДанных", СтрЗаменить(
			ОписаниеДанных.ПредставлениеНабора, "%1", ОписаниеДанных.НаборДанных.Количество()));
	Иначе
		СерверныеПараметры.Вставить("ПредставлениеДанныхОткрывается",
			ТипЗнч(ТекущийСписокПредставлений[0].Значение) = Тип("ОписаниеОповещения")
			Или ЗначениеЗаполнено(ТекущийСписокПредставлений[0].Значение));
		
		СерверныеПараметры.Вставить("ПредставлениеДанных",
			ТекущийСписокПредставлений[0].Представление);
	КонецЕсли;
	
	КлиентскиеПараметры.Вставить("ТекущийСписокПредставлений", ТекущийСписокПредставлений);
	
КонецПроцедуры

// Для процедуры НастроитьПредставлениеДанных.
Процедура ЗаполнитьСписокПредставлений(СписокПредставлений, ЭлементДанных)
	
	ЭлементСписка = Новый Структура("Значение, Представление", Неопределено, "");
	СписокПредставлений.Добавить(ЭлементСписка);
	
	Если ЭлементДанных.Свойство("Представление")
	   И ТипЗнч(ЭлементДанных.Представление) = Тип("Структура") Тогда
		
		ЗаполнитьЗначенияСвойств(ЭлементСписка, ЭлементДанных.Представление);
		Возврат;
	КонецЕсли;
	
	Если ЭлементДанных.Свойство("Представление")
		И ТипЗнч(ЭлементДанных.Представление) <> Тип("Строка") Тогда
	
		ЭлементСписка.Значение = ЭлементДанных.Представление;
		
	ИначеЕсли ЭлементДанных.Свойство("Объект")
		И ТипЗнч(ЭлементДанных.Объект) <> Тип("ОписаниеОповещения") Тогда
		
		ЭлементСписка.Значение = ЭлементДанных.Объект;
	КонецЕсли;
	
	Если ЭлементДанных.Свойство("Представление") Тогда
		ЭлементСписка.Представление = ЭлементДанных.Представление;
	КонецЕсли;
	
КонецПроцедуры

// Заполняет свойства подписи у подготовленного набора данных:
// Параметры:
//  ДанныеНабора - Структура:
//  * Данные            - ДвоичныеДанные - данные для подписания.
//                          - Строка - адрес временного хранилища, содержащего двоичные данные.
//  * Объект              - ЛюбаяСсылка - (необязательный) - ссылка на объект , к которому нужно добавить подпись.
//                          Если не указан, то подпись не требуется добавлять.
//  ПараметрыСертификата - Структура - Параметры выбранного сертификата:
//   *КомуВыдан - Строка,
//   *Отпечаток - Строка,
//   *ДанныеСертификата - ДвоичныеДанные,
//   *Ссылка - СправочникСсылка.СертификатыКлючейЭлектроннойПодписиИШифрования
//  ДвоичныеДанныеПодписи - ДвоичныеДанные - Полученные двоичные данные подписи
//
Процедура ЗаполнитьСвойстваПодписиУДанныхНабора(ДанныеНабора, ПараметрыСертификата, ДвоичныеДанныеПодписи)

	СвойстваПодписи = КриптографияБЭДКлиентСервер.НовыеСвойстваПодписи();
	СвойстваПодписи.Подпись = ДвоичныеДанныеПодписи;
	СвойстваПодписи.УстановившийПодпись = ПользователиКлиент.ТекущийПользователь();
	СвойстваПодписи.ДатаПодписи = ДатаПодписания(ДвоичныеДанныеПодписи);
	
	СвойстваПодписи.ПодписьВерна = Истина;
	СвойстваПодписи.ДатаПроверкиПодписи = СвойстваПодписи.ДатаПодписи;
	
	СвойстваПодписи.КомуВыданСертификат = ПараметрыСертификата.КомуВыдан;
	СвойстваПодписи.Отпечаток = ПараметрыСертификата.Отпечаток;
	СвойстваПодписи.Сертификат = ПараметрыСертификата.ДанныеСертификата;

	ДанныеНабора.Вставить("СвойстваПодписи", СвойстваПодписи);
	ДанныеНабора.Вставить("ВыбранныйСертификат", ПараметрыСертификата.Ссылка);

КонецПроцедуры
	
// Возвращает дату, извлеченную из двоичных данных подписи, или Неопределено.
//
// Параметры:
//  Подпись - ДвоичныеДанные - данные подписи из которых нужно извлечь дату.
//  ПривестиКЧасовомуПоясуСеанса - Булево - привести универсальное время к времени сеанса.
//
// Возвращаемое значение:
//  Дата - успешно извлеченная дата подписи.
//  Неопределено - не удалось извлечь дату из данных подписи.
//
Функция ДатаПодписания(Подпись, ПривестиКЧасовомуПоясуСеанса = Истина)
	
	ДатаПодписания = ЭлектроннаяПодписьСлужебныйКлиентСервер.ДатаПодписанияУниверсальная(Подпись);
	
	Если ПривестиКЧасовомуПоясуСеанса Тогда
		ДатаПодписания = ДатаПодписания + (ОбщегоНазначенияКлиент.ДатаСеанса()
			- ОбщегоНазначенияКлиент.ДатаУниверсальная());
	КонецЕсли;
	
	Возврат ДатаПодписания;
	
КонецФункции

// Для процедур УстановитьПарольСертификата, ОткрытьНовуюФорму, ВыборСертификатаДляПодписанияИлиРасшифровки,
// ПроверитьСертификатСправочника.
//
Функция ФормаПередачаПараметров()
	
	ИмяПараметра = "СтандартныеПодсистемы.ПараметрыЭлектроннойПодписиИШифрования";
	Если ПараметрыПриложения[ИмяПараметра] = Неопределено Тогда
		ПараметрыПриложения.Вставить(ИмяПараметра, Новый Соответствие);
	КонецЕсли;
	
	Форма = ОткрытьФорму("Обработка.ПодписаниеИШифрованиеДанныхВМобильномЭДО.Форма.ПередачаПараметров");
	ПараметрыПриложения["СтандартныеПодсистемы.ПараметрыЭлектроннойПодписиИШифрования"].Вставить("ФормаПередачаПараметров", Форма);
	
	Возврат Форма;
	
КонецФункции

// Преобразует отпечаток сертификата из Base64 в Hex.
//
// Параметры:
//  СертификатОтпечаток - Строка - отпечаток сертификата в Base64.
//
// Возвращаемое значение:
//  Строка - отпечаток сертификата в Hex.
//
Функция HexОтпечатокИзBase64Строка(СертификатОтпечаток)
	
	Если Не ТипЗнч(СертификатОтпечаток) = Тип("Строка") Тогда
		ВызватьИсключение НСтр("ru = 'Неверный тип данных отпечатка сертификата'");
	КонецЕсли;

	ДвоичныеДанныеОтпечатка = Base64Значение(СертификатОтпечаток);
	Буфер = ПолучитьБуферДвоичныхДанныхИзДвоичныхДанных(ДвоичныеДанныеОтпечатка);

	HexChars = "0123456789ABCDEF";
	Результат = "";

	Для Инд = 0 По Буфер.Размер - 1 Цикл
		Байт = Буфер.Получить(Инд);
		СтаршаяТетрада = Цел(Байт / 16);
		МладшаяТетрада = Байт % 16;

		Результат = Результат
			+ Сред(HexChars, СтаршаяТетрада + 1, 1)
			+ Сред(HexChars, МладшаяТетрада + 1, 1);
	КонецЦикла;

	Возврат Результат;

КонецФункции


// Возвращает идентификатор начатой операции
// Параметры:
//  ОтветКомпоненты - Строка - Ответ компоненты в формате JSON
//  ПараметрыКомпоненты - Структура:
//   * ОбъектКомпоненты - ОбъектВнешнейКомпоненты, Неопределено - Объект компоненты
//   * СвойстваВыбранногоСертификата - Структура, Неопределено - Свойства выбранного сертификата 
//      из СвойствСертификатов (см. КриптографияБЭД.СвойстваСертификатов()
//   * ОтпечатокHexВыбранногоСертификата - Строка, Неопределено - Отпечаток сертификата в виде строки hex
//   * ОписаниеОповещенияПослеОперации - ОписаниеОповещения, Неопределено - Оповещение
//   * ИдентификаторТекущейОперации - Строка
//   * ТекущаяОперация - Строка - Текущая операция
//	 * Версия - Строка - Версия компоненты
//   * ОбработкаОшибки - ОписаниеОповещения
// Возвращаемое значение:
//  Строка - идентификатор операции.
//
Функция ИдентификаторТекущейОперации(ОтветКомпоненты, ПараметрыКомпоненты)
	
ИдентификаторОперации = "";

#Если Не ВебКлиент Тогда

	ТекстСообщения = "";
	КодОшибки = "";

	Попытка
		//@skip-check bsl-legacy-check-type-environments
		ЧтениеОбъекта = Новый ЧтениеJSON;
		//@skip-check bsl-legacy-check-dynamic-feature-access
		ЧтениеОбъекта.УстановитьСтроку(ОтветКомпоненты);
		//@skip-check undefined-function
		ЧтениеДанных = ПрочитатьJSON(ЧтениеОбъекта);
		
		//@skip-check property-return-type
		Если ЧтениеДанных.isError Тогда
			//@skip-check property-return-type
			КодОшибки = ЧтениеДанных.ErrorCode;
			ТекстСообщения = ЧтениеДанных.Error;
		Иначе
			ИдентификаторОперации = ЧтениеДанных.Content;
		КонецЕсли;

	Исключение
		ТекстСообщения = СтрШаблон(НСтр("ru='%1 Данные:%2'"), ОписаниеОшибки(), ОтветКомпоненты);
		ИдентификаторОперации = "";
	КонецПопытки;

	Если ЗначениеЗаполнено(КодОшибки) Или ЗначениеЗаполнено(ТекстСообщения) Тогда
		
		ТекстОшибки = НСтр("ru = 'Не удалось получить идентификатор текущей операции'");
		Если ЗначениеЗаполнено(ТекстСообщения) Тогда
			ТекстОшибки = ТекстСообщения
		КонецЕсли;

		Ошибка = НовыйОшибкаРутокен();
		Ошибка.Форма = ПараметрыКомпоненты.Форма;
		Ошибка.КодОшибки = КодОшибки;
		Ошибка.Описание = ТекстОшибки;
		
		ВыполнитьОбработкуОповещения(ПараметрыКомпоненты.ОбработкаОшибки, Ошибка);
		Возврат "";
	КонецЕсли;

#КонецЕсли
	
	Возврат ИдентификаторОперации;

КонецФункции

#КонецОбласти