#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Найти список ДОПП для документа
// 
// Параметры:
//  Ссылка - ДокументСсылка
// 
// Возвращаемое значение:
//  Структура:
// 		* МассивДОПП - Массив из Структура
// 		* СуммаВсего - Число - общая фактурная стоимость ДОПП, введенных для данного документа
Функция НайтиДОПППоОснованию(Ссылка) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийДокумент", Ссылка);

	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДокументОПредстоящейПоставке.Ссылка КАК Ссылка,
	|	ДокументОПредстоящейПоставке.ДатаДОПП КАК ДатаДОПП,
	|	ДокументОПредстоящейПоставке.Дата КАК Дата,
	|	ДокументОПредстоящейПоставке.Номер КАК Номер,
	|	ДокументОПредстоящейПоставке.НомерДОПП КАК НомерДОПП,
	|	СУММА(ДокументОПредстоящейПоставкеТовары.ФактурнаяСтоимость) КАК ФактурнаяСтоимость
	|ИЗ
	|	Документ.ДокументОПредстоящейПоставке КАК ДокументОПредстоящейПоставке
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ДокументОПредстоящейПоставке.Товары КАК ДокументОПредстоящейПоставкеТовары
	|		ПО ДокументОПредстоящейПоставке.Ссылка = ДокументОПредстоящейПоставкеТовары.Ссылка
	|ГДЕ
	|	ДокументОПредстоящейПоставке.ДокументОснование = &ТекущийДокумент
	|	И НЕ ДокументОПредстоящейПоставке.ПометкаУдаления
	|
	|СГРУППИРОВАТЬ ПО
	|	ДокументОПредстоящейПоставке.Ссылка,
	|	ДокументОПредстоящейПоставке.ДатаДОПП,
	|	ДокументОПредстоящейПоставке.Дата,
	|	ДокументОПредстоящейПоставке.Номер,
	|	ДокументОПредстоящейПоставке.НомерДОПП";
	
	Выборка = Запрос.Выполнить().Выбрать();
	СуммаВсего = 0;
	
	МассивДОПП = Новый Массив();
	
	Пока Выборка.Следующий() Цикл
		
		СтруктураЗаписи = Новый Структура();
		СтруктураЗаписи.Вставить("Ссылка",    Выборка.Ссылка);
		СтруктураЗаписи.Вставить("Дата",      Выборка.Дата);
		СтруктураЗаписи.Вставить("ДатаДОПП",  Выборка.ДатаДОПП);
		СтруктураЗаписи.Вставить("НомерДОПП", СокрЛП(Выборка.НомерДОПП));
		СуммаВсего = СуммаВсего + Выборка.ФактурнаяСтоимость;
		МассивДОПП.Добавить(СтруктураЗаписи);
		
	КонецЦикла;
	
	ИтоговыеДанные = Новый Структура();
	ИтоговыеДанные.Вставить("МассивДОПП", МассивДОПП);
	ИтоговыеДанные.Вставить("СуммаВсего", СуммаВсего);
	
	Возврат ИтоговыеДанные;
	
КонецФункции

// Формирует описание реквизитов объекта, заполняемых по статистике их использования.
// 
// Параметры:
//  ОписаниеРеквизитов - Структура - описание реквизитов, для которых необходимо получить значения по статистике
//
//
Процедура ЗадатьОписаниеЗаполняемыхРеквизитовПоСтатистике(ОписаниеРеквизитов) Экспорт
	
	Параметры = ЗаполнениеОбъектовПоСтатистике.ПараметрыЗаполняемыхРеквизитов();
	Параметры.РазрезыСбораСтатистики.ИспользоватьВсегда = "Автор";
	Параметры.РазрезыСбораСтатистики.ИспользоватьТолькоЗаполненные = "Партнер";
	Параметры.ЗаполнятьПриУсловии.ПоляОбъектаЗаполнены = "Автор";
	ЗаполнениеОбъектовПоСтатистике.ДобавитьОписаниеЗаполняемыхРеквизитов(ОписаниеРеквизитов,
		"Организация", Параметры);
	
	Параметры = ЗаполнениеОбъектовПоСтатистике.ПараметрыЗаполняемыхРеквизитов();
	Параметры.РазрезыСбораСтатистики.ИспользоватьВсегда = "Автор";
	Параметры.ЗаполнятьПриУсловии.ПоляОбъектаЗаполнены = "Автор";
	ЗаполнениеОбъектовПоСтатистике.ДобавитьОписаниеЗаполняемыхРеквизитов(ОписаниеРеквизитов,
		"Подразделение", Параметры);
	
КонецПроцедуры

 // Получение Номеров РНПТ для ДОПП из Квитанции ФНС
// 
// Параметры:
//  ПараметрыПолученияДанных - Структура - См. СтруктураПередаваемыхДанных()
// 
// Возвращаемое значение:
//  Структура - ТаблицаЗначения:
//	*РегистрационныйНомер - Строка - полученный из ФНС номер РНПТ.
//	*НомерТовараРеглОтчет - Строка -номер строки в квитанции ФНС.
//	*РНПТ - СправочникСсылка.НомераГТД - Номер РНПТ, указанный в строке ДОПП.
//	*Номенклатура - СправочникСсылка.Номенклатура.
//	*СтранаПроисхождения - СправочникСсылка.СтраныМира.
//	*НомерСтроки - Строка - номер строки из ДОПП.
//	*ЕдиницаИзмерения - СправочникСсылка.УпаковкиЕдиницыИзмерения - ед. изм. из КодТНВЭД.

Функция ЗаполнитьНомерРНПТИзКвитанции(ПараметрыПолученияДанных) Экспорт
	
	Результат = Неопределено;
	
	
	Возврат Результат;
	
КонецФункции

// Возвращает структуру параметров для заполнения номеров РНПТ документа по данным квитанции о присвоении РНПТ.
//
// Возвращаемое значение:
//  Структура - параметры заполнения номеров РНПТ:
//   * Уведомление - Неопределено - уведомление, из которого заполняются номера РНПТ.
//   * Объект - ДокументОбъект.ДокументОПредстоящейПоставке, Неопределено - объект документа, для которого заполняются номера РНПТ.
//   * Организация - СправочникСсылка.Организации - организация документа.
//   * ПереданОбъект - Булево - Истина, если в Объект передан объект документа.
//   * ТаблицаТовары - ТаблицаЗначений, Неопределено - таблица товаров документа с колонками
//       НомерСтроки, Номенклатура, НоменклатураПартнера, Характеристика, Содержание, КодТНВЭД, НомерРНПТ, СтранаПроисхождения.
//   * ХарактеристикаУчаствуетВНаименованииДляБРО - Булево - характеристика участвует в наименовании товара для БРО.
Функция СтруктураПередаваемыхДанных() Экспорт
	
	ПередаваемыеДанные = Новый Структура;
	ПередаваемыеДанные.Вставить("Уведомление", Неопределено);
	ПередаваемыеДанные.Вставить("Объект", Неопределено);
	ПередаваемыеДанные.Вставить("Организация", Справочники.Организации.ПустаяСсылка());
	ПередаваемыеДанные.Вставить("ПереданОбъект", Ложь);
	ПередаваемыеДанные.Вставить("ТаблицаТовары", Неопределено);
	ПередаваемыеДанные.Вставить("ХарактеристикаУчаствуетВНаименованииДляБРО", Ложь);
	
	Возврат ПередаваемыеДанные;
	
КонецФункции

#Область Проведение

// Описывает учетные механизмы используемые в документе для регистрации в механизме проведения.
//
// Параметры:
//  МеханизмыДокумента - Массив Из Строка- список имен учетных механизмов, для которых будет выполнена
//              регистрация в механизме проведения.
//
Процедура ЗарегистрироватьУчетныеМеханизмы(МеханизмыДокумента) Экспорт
	
	МеханизмыДокумента.Добавить("РеестрДокументов");
	МеханизмыДокумента.Добавить("УчетПрочихАктивовПассивов");
	МеханизмыДокумента.Добавить("УчетИмпорта");
	
	ЗаявлениеОВвозеЛокализация.ЗарегистрироватьУчетныеМеханизмы(МеханизмыДокумента);
	
КонецПроцедуры

// Возвращает таблицы для движений, необходимые для проведения документа по регистрам учетных механизмов.
//
// Параметры:
//  Документ - ДокументСсылка, ДокументОбъект - ссылка на документ или объект, по которому необходимо получить данные
//  Регистры - Структура - список имен регистров, для которых необходимо получить таблицы
//  ДопПараметры - Структура - дополнительные параметры для получения данных, определяющие контекст проведения.
//
// Возвращаемое значение:
//  см. ПроведениеДокументов.ИнициализироватьДанныеДокументаДляПроведения
//
Функция ДанныеДокументаДляПроведения(Документ, Регистры, ДопПараметры = Неопределено) Экспорт
	
	Если ДопПараметры = Неопределено Тогда
		ДопПараметры = ПроведениеДокументов.ДопПараметрыИнициализироватьДанныеДокументаДляПроведения();
	КонецЕсли;
	
	Если ТипЗнч(Документ) = Тип("ДокументОбъект.ДокументОПредстоящейПоставке") Тогда
		ДокументСсылка = Документ.Ссылка;
	Иначе
		ДокументСсылка = Документ;
	КонецЕсли;
	
	Запрос			= Новый Запрос;
	ТекстыЗапроса	= Новый СписокЗначений;
	
	Если Не ДопПараметры.ПолучитьТекстыЗапроса Тогда
		////////////////////////////////////////////////////////////////////////////
		// Создадим запрос инициализации движений
		
		ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка);
		ТекстЗапросаТаблицаПрочиеАктивыПассивы(ТекстыЗапроса, Регистры);
		ТекстЗапросаТаблицаДвиженияПоПрочимАктивамПассивам(ТекстыЗапроса, Регистры);
		ТекстЗапросаТаблицаТоварыКОформлениюДокументовИмпорта(Запрос, ТекстыЗапроса, Регистры);
		ТекстЗапросаТаблицаРеестрДокументов(Запрос, ТекстыЗапроса, Регистры);
		////////////////////////////////////////////////////////////////////////////
		// Сформируем текст запроса
		
		ЗаявлениеОВвозеЛокализация.ДополнитьТекстыЗапросовПроведенияДОПП(Запрос, ТекстыЗапроса, Регистры);
		
	КонецЕсли;
	
	////////////////////////////////////////////////////////////////////////////
	// Получим таблицы для движений
	
	Возврат ПроведениеДокументов.ИнициализироватьДанныеДокументаДляПроведения(Запрос, ТекстыЗапроса, ДопПараметры);
	
КонецФункции

#КонецОбласти

#Область Заполнение

// Заполняет таблицу товаров по данным отбора или массиву заказов
//
// Параметры:
//	ДанныеОтбора             - Структура - поля, по которым будут отобраны остатки заказов для заполнения документа
//	Товары                   - ДанныеФормыКоллекция - таблица товаров, в которую будут помещены остатки заказов
//	СкладПоступления         - СправочникСсылка.Склады - склад
//	МассивЗаказов            - Массив из ДокументСсылка.ЗаказПоставщику - заказы, по которым будут отобраны остатки.
//	ПроверятьПорядокРасчетов - Булево - По умолчанию Истина, это значит, что заполнение не будет произведено
//	                                    и будет выдано сообщение, если найдены заказы с различными порядками расчетов.
//
Процедура ЗаполнитьПоОстаткамЗаказов(ДанныеОтбора, Товары, СкладПоступления, МассивЗаказов = Неопределено, ПроверятьПорядокРасчетов = Истина) Экспорт
	
	// Данные по остаткам товаров заказа.
	ВыборкаТовары = ПолучитьРезультатЗапросаПоОстаткамЗаказов(ДанныеОтбора).Выбрать();
	
	Пока ВыборкаТовары.Следующий() Цикл
		СтрокаТаб = Товары.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТаб, ВыборкаТовары);
		СтрокаТаб.ЗаказПоставщику = ДанныеОтбора.ЗаказПоставщику;
		СтрокаТаб.Количество = ?(ВыборкаТовары.Количество < 0, 0, ВыборкаТовары.Количество);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

// Определяет список команд создания на основании.
//
// Параметры:
//  КомандыСозданияНаОсновании - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.КомандыСозданияНаОсновании
//  Параметры - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.Параметры
//
Процедура ДобавитьКомандыСозданияНаОсновании(КомандыСозданияНаОсновании, Параметры) Экспорт
	
	Документы.ПриобретениеТоваровУслуг.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	Документы.СписаниеБезналичныхДенежныхСредств.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	
КонецПроцедуры

// Добавляет команду создания документа "Документ о предстоящей поставке".
//
// Параметры:
//  КомандыСозданияНаОсновании - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.КомандыСозданияНаОсновании
//
// Возвращаемое значение:
//	СтрокаТаблицыЗначений - добавленная команда
Функция ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании) Экспорт
	Если ПравоДоступа("Добавление", Метаданные.Документы.ДокументОПредстоящейПоставке) Тогда
		КомандаСоздатьНаОсновании = КомандыСозданияНаОсновании.Добавить();
		КомандаСоздатьНаОсновании.Менеджер = Метаданные.Документы.ДокументОПредстоящейПоставке.ПолноеИмя();
		КомандаСоздатьНаОсновании.Представление = ОбщегоНазначенияУТ.ПредставлениеОбъекта(Метаданные.Документы.ЗаявлениеОВвозеТоваров);
		КомандаСоздатьНаОсновании.РежимЗаписи = "Проводить";
		КомандаСоздатьНаОсновании.ФункциональныеОпции = "ИспользоватьВвозТоваровИзТаможенногоСоюза";
	
		Возврат КомандаСоздатьНаОсновании;
	КонецЕсли;
	
	Возврат Неопределено;
КонецФункции

// Определяет список команд отчетов.
//
// Параметры:
//   КомандыОтчетов - См. ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов.КомандыОтчетов
//   Параметры - См. ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов.Параметры
//
//@skip-check module-empty-method
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры) Экспорт
	
КонецПроцедуры

// Заполняет список команд печати.
//
// Параметры:
//   КомандыПечати - см. УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
КонецПроцедуры

// Сформировать печатные формы объектов.
//
// Параметры:
//  МассивОбъектов  - Массив Из ДокументСсылка.ЗаявлениеОВвозеТоваров   - ссылки на объекты, которые нужно распечатать.
//  ПараметрыПечати - Структура - дополнительные настройки печати.
//  КоллекцияПечатныхФорм - ТаблицаЗначений - сформированные табличные документы (выходной параметр)
//  ОбъектыПечати         - СписокЗначений Из ДокументСсылка.ЗаявлениеОВвозеТоваров - значение - ссылка на объект;
//                                            представление - имя области в которой был выведен объект (выходной параметр).
//  ПараметрыВывода       - Структура       - дополнительные параметры сформированных табличных документов (выходной параметр).
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
КонецПроцедуры

// Возвращает данные для заполнения документа на основании Документ о предстоящей поставке .
//
// Параметры:
//   Ссылка - ДокументСсылка.ДокументОПредстоящейПоставке - Документ-основание
//
// Возвращаемое значение:
//   Структура:
//     * Шапка - Структура:
//         ** Организация - СправочникСсылка.Организации
//         ** Подразделение - СправочникСсылка.СтруктураПредприятия
//         ** Контрагент - СправочникСсылка.Контрагенты
//         ** Партнер - СправочникСсылка.Партнеры
//         ** Договор - СправочникСсылка.ДоговорыКонтрагентов
//         ** Валюта - СправочникСсылка.Валюты
//         ** НаправлениеДеятельности - СправочникСсылка.НаправленияДеятельности
//      * Товары - ТаблицаЗначений:
//         ** Номенклатура - СправочникСсылка.Номенклатура
//         ** Характеристика - СправочникСсылка.ХарактеристикиНоменклатуры
//         ** Упаковка - СправочникСсылка.УпаковкиЕдиницыИзмерения
//         ** Количество - Число
//         ** КоличествоУпаковок - Число
//         ** Сумма - Число
//         ** Цена - Число
//         ** НоменклатураПартнера - СправочникСсылка.НоменклатураКонтрагентов
Функция ДанныеЗаполненияНаОсновании(Ссылка) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	ТекстыЗапроса = Новый СписокЗначений;
	
	ТекстыЗапроса.Добавить(
		"ВЫБРАТЬ
		|	ДокументОПредстоящейПоставке.Организация             КАК Организация,
		|	ДокументОПредстоящейПоставке.Подразделение           КАК Подразделение,
		|	ДокументОПредстоящейПоставке.Контрагент              КАК Контрагент,
		|	ДокументОПредстоящейПоставке.Партнер                 КАК Партнер,
		|	ДокументОПредстоящейПоставке.Договор                 КАК Договор,
		|	ДокументОПредстоящейПоставке.Валюта                  КАК Валюта,
		|	ДокументОПредстоящейПоставке.НаправлениеДеятельности КАК НаправлениеДеятельности,
		|	ДоговорыКонтрагентов.ТипДоговора                     КАК ТипДоговора,
		|	ДокументОПредстоящейПоставке.ЗаказПоставщику         КАК ЗаказПоставщику,
		|	ВЫБОР
		|		КОГДА ЗаказПоставщикуДок.Склад ЕСТЬ NULL
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
		|		КОГДА ЗаказПоставщикуДок.Склад.ЭтоГруппа
		|				И ЗаказПоставщикуДок.Склад.ВыборГруппы = ЗНАЧЕНИЕ(Перечисление.ВыборГруппыСкладов.РазрешитьВЗаказах)
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
		|		ИНАЧЕ ЗаказПоставщикуДок.Склад
		|	КОНЕЦ КАК Склад,
		|	ВЫБОР
		|		КОГДА ЗаказПоставщикуДок.Склад ЕСТЬ NULL
		|			ТОГДА ЛОЖЬ
		|		КОГДА ЗаказПоставщикуДок.Склад ЕСТЬ NULL
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
		|		КОГДА ЗаказПоставщикуДок.Склад.ЭтоГруппа
		|				И ЗаказПоставщикуДок.Склад.ВыборГруппы = ЗНАЧЕНИЕ(Перечисление.ВыборГруппыСкладов.РазрешитьВЗаказах)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ЗапрещеноВыбиратьГруппуСкладов,
		|	ЕСТЬNULL(ЗаказПоставщикуДок.Соглашение, ЗНАЧЕНИЕ(Справочник.СоглашенияСПоставщиками.ПустаяСсылка)) КАК Соглашение
		|ИЗ
		|	Документ.ДокументОПредстоящейПоставке КАК ДокументОПредстоящейПоставке
		|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|		ПО ДокументОПредстоящейПоставке.Договор = ДоговорыКонтрагентов.Ссылка
		|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказПоставщику КАК ЗаказПоставщикуДок
		|		ПО ДокументОПредстоящейПоставке.ЗаказПоставщику = ЗаказПоставщикуДок.Ссылка
		|ГДЕ
		|	ДокументОПредстоящейПоставке.Ссылка = &Ссылка",
		"Шапка");
	
	ТекстыЗапроса.Добавить(
		"ВЫБРАТЬ
		|	ТаблицаТовары.Номенклатура         КАК Номенклатура,
		|	ТаблицаТовары.НоменклатураПартнера КАК НоменклатураПартнера,
		|	ТаблицаТовары.Характеристика       КАК Характеристика,
		|	ТаблицаТовары.Упаковка             КАК Упаковка,
		|	ТаблицаТовары.Количество           КАК Количество,
		|	ТаблицаТовары.КоличествоПОРНПТ     КАК КоличествоПоРНПТ,
		|	ТаблицаТовары.НомерРНПТ            КАК НомерГТД,
		|	ТаблицаТовары.КоличествоУпаковок   КАК КоличествоУпаковок,
		|	ТаблицаТовары.ФактурнаяСтоимость   КАК Сумма,
		|	ТаблицаТовары.Цена                 КАК Цена,
		|	ТаблицаТовары.КодСтроки            КАК КодСтроки,
		|	ЕСТЬNULL(ДокументОПредстоящейПоставке.ЗаказПоставщику, ЗНАЧЕНИЕ(Документ.ЗаказПоставщику.ПустаяСсылка)) КАК ЗаказПоставщику,
		|	ЕСТЬNULL(ЗаказПоставщикуТовары.Склад, ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)) КАК Склад,
		|	ЕСТЬNULL(ЗаказПоставщикуТовары.Назначение, ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)) КАК Назначения
		|ИЗ
		|	Документ.ДокументОПредстоящейПоставке.Товары КАК ТаблицаТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ДокументОПредстоящейПоставке КАК ДокументОПредстоящейПоставке
		|		ПО ТаблицаТовары.Ссылка = ДокументОПредстоящейПоставке.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказПоставщику.Товары КАК ЗаказПоставщикуТовары
		|		ПО ТаблицаТовары.НомерСтроки = ЗаказПоставщикуТовары.НомерСтроки
		|			И ДокументОПредстоящейПоставке.ЗаказПоставщику = ЗаказПоставщикуТовары.Ссылка
		|ГДЕ
		|	ТаблицаТовары.Ссылка = &Ссылка",
		"Товары");

	РезультатПакета = ОбщегоНазначенияУТ.ПолучитьРезультатыЗапроса(Запрос, ТекстыЗапроса);
	
	РезультатЗапроса = РезультатПакета.Шапка; // РезультатЗапроса
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	Шапка = Новый Структура;
	Для Каждого Колонка Из Выборка.Владелец().Колонки Цикл
		Шапка.Вставить(Колонка.Имя, Выборка[Колонка.Имя]);
	КонецЦикла;
	
	Товары = РезультатПакета.Товары.Выгрузить(); // ТаблицаЗначений
	
	ВозвращаемоеЗначение = Новый Структура;
	ВозвращаемоеЗначение.Вставить("Шапка", Шапка);
	ВозвращаемоеЗначение.Вставить("Товары", Товары);
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

// Текст запроса заполнения табличной части товары.
// 
// Возвращаемое значение:
//  Строка - Текст запроса заполнения табличной части товары
Функция ТекстЗапросаЗаполненияТабличнойЧастиТовары() Экспорт
	
	ТекстЧастиЗапроса =
	"ВЫБРАТЬ
	|	ДокументОснованиеДОППТовары.НомерСтроки КАК НомерСтроки,
	|	ДокументОснованиеДОППТовары.Номенклатура КАК Номенклатура,
	|	ДокументОснованиеДОППТовары.Содержание КАК Содержание,
	|	ДокументОснованиеДОППТовары.НоменклатураПартнера КАК НоменклатураПартнера,
	|	ДокументОснованиеДОППТовары.Характеристика КАК Характеристика,
	|	ДокументОснованиеДОППТовары.Упаковка КАК Упаковка,
	|	ДокументОснованиеДОППТовары.КоличествоУпаковок КАК КоличествоУпаковок,
	|	ДокументОснованиеДОППТовары.Количество КАК Количество,
	|	0 КАК КоличествоПоРНПТ,
	|	ДокументОснованиеДОППТовары.ФактурнаяСтоимость КАК ФактурнаяСтоимость,
	|	ДокументОснованиеДОППТовары.Цена КАК Цена,
	|	ДокументОснованиеДОППТовары.ОсобыйПризнакДОПП КАК ОсобыйПризнакДОПП,
	|	ДокументОснованиеДОППТовары.КодТНВЭД КАК КодТНВЭД,
	|	ДокументОснованиеДОППТовары.СтранаПроисхождения КАК СтранаПроисхождения,
	|	ДокументОснованиеДОППТовары.КодСтроки КАК КодСтроки,
	|	ЗНАЧЕНИЕ(Справочник.НомераГТД.ПустаяСсылка) КАК НомерГТД,
	|	ЕСТЬNULL(ДокументОснованиеДОППТовары.Номенклатура.ПрослеживаемыйТовар, ЛОЖЬ) КАК ВедетсяУчетПоРНПТ,
	|	ВЫБОР
	|		КОГДА КлючиВидовПродукцииИС.Ссылка ЕСТЬ NULL
	|			ИЛИ КлючиВидовПродукцииИС.ВидПродукцииГИСМТ = ЗНАЧЕНИЕ(Справочник.КлючиВидовПродукцииИС.ПустаяСсылка)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ
	|			ИСТИНА
	|	КОНЕЦ КАК МаркируемаяПродукция,
	|	ЕСТЬNULL(ПодакцизныеТовары.КоэффициентПересчетаЕдиницИзмерения, 0)
	|		 * ДокументОснованиеДОППТовары.Количество КАК НалоговаяБазаАкцизы,
	|	ЕСТЬNULL(ПодакцизныеТовары.Ставка, 0) КАК ТвердаяСтавкаАкциза,
	|	0 КАК АдвалорнаяСтавкаАкциза, // Адвалорная Ставка не поддерживается
	|	ЕСТЬNULL(ПодакцизныеТовары.СтавкаРегл, 0) * ЕСТЬNULL(ПодакцизныеТовары.КоэффициентПересчетаЕдиницИзмерения, 0)
	|		 * ДокументОснованиеДОППТовары.Количество КАК СуммаАкциза,
	|	ЕСТЬNULL(ПодакцизныеТовары.КоэффициентПересчетаЕдиницИзмерения, 0) КАК КоэффициентПересчета,
	|	ЕСТЬNULL(ПодакцизныеТовары.ПодакцизныйТовар, ЛОЖЬ) КАК ПодакцизныйТовар,
	|	ВЫБОР
	|		КОГДА СтавкиНДСНоменклатуры.Номенклатура ЕСТЬ NULL
	|			ТОГДА &ОсновнаяСтавкаНДС
	|		КОГДА СтавкиНДСНоменклатуры.СтавкаНДС.ПеречислениеСтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС10)
	|			ТОГДА СтавкиНДСНоменклатуры.СтавкаНДС
	|		ИНАЧЕ
	|			&ОсновнаяСтавкаНДС
	|	КОНЕЦ КАК СтавкаНДС,
	|	0 КАК НалоговаяБазаНДС,
	|	0 КАК СуммаНДС,
	|	0 КАК ОбеспечительныйПлатеж,
	|	ВЫРАЗИТЬ("""" КАК Строка(20)) КАК КБК,
	|	ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Код, """") КАК ЕдиницаИзмеренияАкциза,
	|	ЕСТЬNULL(ПодакцизныеТовары.КодАкциза, """") КАК КодАкциза,
	|	ЕСТЬNULL(ПодакцизныеТовары.КатегорияПодакцизногоТовара, ЗНАЧЕНИЕ(Справочник.КатегорииПодакцизныхТоваров.ПустаяСсылка)) КАК КатегорияПодакцизныхТоваров
	|ИЗ
	|	ВтТоварыОснования КАК ДокументОснованиеДОППТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПодакцизныеТовары КАК ПодакцизныеТовары
	|			ПО ДокументОснованиеДОППТовары.Номенклатура = ПодакцизныеТовары.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтавкиНДСНоменклатуры.СрезПоследних(, Страна = &СтранаРегистрации) КАК СтавкиНДСНоменклатуры
	|			ПО ДокументОснованиеДОППТовары.Номенклатура = СтавкиНДСНоменклатуры.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОписаниеНоменклатурыИС КАК ОписаниеНоменклатурыИС
	|			ПО ДокументОснованиеДОППТовары.Номенклатура = ОписаниеНоменклатурыИС.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиВидовПродукцииИС КАК КлючиВидовПродукцииИС
	|			ПО ОписаниеНоменклатурыИС.КлючВидовПродукции = КлючиВидовПродукцииИС.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УпаковкиЕдиницыИзмерения КАК УпаковкиЕдиницыИзмерения
	|			ПО ПодакцизныеТовары.ЕдиницаИзмеренияАкциза = УпаковкиЕдиницыИзмерения.Ссылка
	|";
	
	Возврат ТекстЧастиЗапроса;
	
КонецФункции

// Обновить структуру реквизитов выгрузки.
// 
// Параметры:
//  СтруктураРеквизитовВыгрузки - Структура реквизитов выгрузки
Процедура ОбновитьСтруктуруРеквизитовВыгрузки(СтруктураРеквизитовВыгрузки) Экспорт
	
	Если ТипЗнч(СтруктураРеквизитовВыгрузки) = Тип("Структура") Тогда
		
		Если НЕ СтруктураРеквизитовВыгрузки.Свойство("ИмпортерСовпадаетСОтправителем") Тогда
			СтруктураРеквизитовВыгрузки.Вставить("ИмпортерСовпадаетСОтправителем", Истина);
		КонецЕсли;
		
		Если НЕ СтруктураРеквизитовВыгрузки.Свойство("ИмпортерЯвляетсяЮЛ") Тогда
			СтруктураРеквизитовВыгрузки.Вставить("ИмпортерЯвляетсяЮЛ", Истина);
		КонецЕсли;
		
		Если НЕ СтруктураРеквизитовВыгрузки.Свойство("КтоИмпортирует") Тогда
			СтруктураРеквизитовВыгрузки.Вставить("КтоИмпортирует", 1);
		КонецЕсли;
		
		Если НЕ СтруктураРеквизитовВыгрузки.Свойство("НаимИмпорт") Тогда
			СтруктураРеквизитовВыгрузки.Вставить("НаимИмпорт",  "");
		КонецЕсли;
		
		Если НЕ СтруктураРеквизитовВыгрузки.Свойство("ИННЮЛИмпорт") Тогда
			СтруктураРеквизитовВыгрузки.Вставить("ИННЮЛИмпорт", "");
		КонецЕсли;
		
		Если НЕ СтруктураРеквизитовВыгрузки.Свойство("КППИмпорт") Тогда
			СтруктураРеквизитовВыгрузки.Вставить("КППИмпорт",   "");
		КонецЕсли;
		
		Если НЕ СтруктураРеквизитовВыгрузки.Свойство("ИННФЛИмпорт") Тогда
			СтруктураРеквизитовВыгрузки.Вставить("ИННФЛИмпорт",      "");
		КонецЕсли;
		
		Если НЕ СтруктураРеквизитовВыгрузки.Свойство("ФамилияФЛИмпорт") Тогда
			СтруктураРеквизитовВыгрузки.Вставить("ФамилияФЛИмпорт",  "");
		КонецЕсли;
		
		Если НЕ СтруктураРеквизитовВыгрузки.Свойство("ИмяФЛИмпорт") Тогда
			СтруктураРеквизитовВыгрузки.Вставить("ИмяФЛИмпорт",      "");
		КонецЕсли;
		
		Если НЕ СтруктураРеквизитовВыгрузки.Свойство("ОтчествоФЛИмпорт") Тогда
			СтруктураРеквизитовВыгрузки.Вставить("ОтчествоФЛИмпорт", "");
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры


#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// Параметры:
//   Ограничение - см. УправлениеДоступомПереопределяемый.ПриЗаполненииОграниченияДоступа.Ограничение.
//
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)
	|	И ЗначениеРазрешено(Партнер)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// СтандартныеПодсистемы.Печать

// Переопределяет настройки печати для объекта.
//
// Параметры:
//  Настройки - см. УправлениеПечатью.НастройкиПечатиОбъекта.
//
Процедура ПриОпределенииНастроекПечати(Настройки) Экспорт
	
	Настройки.ПриДобавленииКомандПечати = Истина;
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.Печать

#КонецОбласти

// СтандартныеПодсистемы.ВерсионированиеОбъектов
// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
// Настройки - Структура - настройки подсистемы.
//@skip-check module-empty-method
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
	
КонецПроцедуры
// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолноеИмяОбъекта()
	Возврат "Документ.ДокументОПредстоящейПоставке";
КонецФункции

#Область Заполнение

// Формирует результат запроса по непоставленной части заказов
//
// Параметры:
//	ДанныеОтбора     - Структура - поля, по которым будут отобраны остатки заказов
//	МассивЗаказов    - Массив - заказы, по которым будут отобраны остатки.
//
// Возвращаемое значение:
//	РезультатЗапроса - результат запроса по непоставленной части заказов.
//
Функция ПолучитьРезультатЗапросаПоОстаткамЗаказов(ДанныеОтбора)
		
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ЗаказПоставщику", ДанныеОтбора.ЗаказПоставщику);
	Запрос.УстановитьПараметр("ТоварыНакладной", ДанныеОтбора.ТоварыНакладной);
	Запрос.УстановитьПараметр("Организация",     ДанныеОтбора.Организация);
	Запрос.УстановитьПараметр("Ссылка",          ДанныеОтбора.Ссылка);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДокументОПредстоящейПоставкеТовары.Номенклатура КАК Номенклатура,
	|	ДокументОПредстоящейПоставкеТовары.Характеристика КАК Характеристика,
	|	ДокументОПредстоящейПоставкеТовары.КодСтроки КАК КодСтроки,
	|	СУММА(ДокументОПредстоящейПоставкеТовары.Количество) КАК Количество
	|ПОМЕСТИТЬ ВтТоварыНакладных
	|ИЗ
	|	Документ.ДокументОПредстоящейПоставке.Товары КАК ДокументОПредстоящейПоставкеТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ДокументОПредстоящейПоставке КАК ДокументОПредстоящейПоставке
	|		ПО ДокументОПредстоящейПоставкеТовары.Ссылка = ДокументОПредстоящейПоставке.Ссылка
	|		И НЕ ИСТИНА В (ВЫБРАТЬ ПЕРВЫЕ 1 ИСТИНА ИЗ РегистрСведений.ДокументыОПредстоящейПоставке КАК ДокументыОПредстоящейПоставке
	|					ГДЕ ДокументыОПредстоящейПоставке.НомерДОПП = ДокументОПредстоящейПоставке.НомерДОПП
	|						И ДокументыОПредстоящейПоставке.Организация = &Организация
	|						И ДокументыОПредстоящейПоставке.Состояние = ЗНАЧЕНИЕ(Перечисление.СостояниеДОПП.ПоставкаОтменена))
	|ГДЕ
	|	ДокументОПредстоящейПоставке.Организация = &Организация
	|	И ДокументОПредстоящейПоставке.ЗаказПоставщику = &ЗаказПоставщику
	|	И ДокументОПредстоящейПоставке.Ссылка <> &Ссылка
	|	И ДокументОПредстоящейПоставке.Проведен
	|	И ДокументОПредстоящейПоставкеТовары.КодСтроки <> 0
	|СГРУППИРОВАТЬ ПО
	|	ДокументОПредстоящейПоставкеТовары.Номенклатура,
	|	ДокументОПредстоящейПоставкеТовары.Характеристика,
	|	ДокументОПредстоящейПоставкеТовары.КодСтроки
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура,
	|	Характеристика,
	|	КодСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаказПоставщикуТовары.Ссылка КАК Ссылка,
	|	ЗаказПоставщикуТовары.НомерСтроки КАК НомерСтроки,
	|	ЗаказПоставщикуТовары.НоменклатураПартнера КАК НоменклатураПартнера,
	|	ЗаказПоставщикуТовары.Номенклатура КАК Номенклатура,
	|	ЗаказПоставщикуТовары.Характеристика КАК Характеристика,
	|	ЗаказПоставщикуТовары.Упаковка КАК Упаковка,
	|	(ЗаказПоставщикуТовары.Количество - ЕСТЬNULL(ВтТоварыНакладных.Количество, 0)) / ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки, 1) КАК КоличествоУпаковок,
	|	(ЗаказПоставщикуТовары.Количество - ЕСТЬNULL(ВтТоварыНакладных.Количество, 0)) / ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки, 1) КАК КоличествоУпаковокВЗаказе,
	|	ЗаказПоставщикуТовары.Количество - ЕСТЬNULL(ВтТоварыНакладных.Количество, 0) КАК Количество,
	|	ЗаказПоставщикуТовары.Количество - ЕСТЬNULL(ВтТоварыНакладных.Количество, 0) КАК КоличествоВЗаказе,
	|	ВЫБОР
	|		КОГДА ЗаказПоставщикуТовары.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	|			ТОГДА 1
	|		ИНАЧЕ ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки, 1)
	|	КОНЕЦ КАК Коэффициент,
	|	ЗаказПоставщикуТовары.Цена КАК Цена,
	|	ЗаказПоставщикуТовары.Сумма КАК Сумма,
	|	ЗаказПоставщикуТовары.КодСтроки КАК КодСтроки,
	|	ЗаказПоставщикуТовары.ПричинаОтмены КАК ПричинаОтмены,
	|	ЗаказПоставщикуТовары.Склад КАК Склад,
	|	ЗаказПоставщикуТовары.Назначение КАК Назначение,
	|	ЗаказПоставщикуТовары.Подразделение КАК Подразделение,
	|	ЗаказПоставщикуТовары.СписатьНаРасходы КАК СписатьНаРасходы,
	|	ЗаказПоставщикуТовары.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	ЗаказПоставщикуТовары.ДатаОтгрузки КАК ДатаОтгрузки,
	|	ЗаказПоставщикуТовары.ПроконтролироватьКачество КАК ПроконтролироватьКачество,
	|	ЗаказПоставщикуТовары.ДатаПодтвержденияКачества КАК ДатаПодтвержденияКачества
	|ИЗ
	|	Документ.ЗаказПоставщику.Товары КАК ЗаказПоставщикуТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтТоварыНакладных КАК ВтТоварыНакладных
	|		ПО ЗаказПоставщикуТовары.Номенклатура = ВтТоварыНакладных.Номенклатура
	|			И ЗаказПоставщикуТовары.Характеристика = ВтТоварыНакладных.Характеристика
	|			И ЗаказПоставщикуТовары.КодСтроки = ВтТоварыНакладных.КодСтроки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|		ПО ЗаказПоставщикуТовары.Номенклатура = СпрНоменклатура.Ссылка
	|ГДЕ
	|	ЗаказПоставщикуТовары.Ссылка = &ЗаказПоставщику
	|	И НЕ ЗаказПоставщикуТовары.Отменено
	|	И СпрНоменклатура.ТипНоменклатуры В (
	|		ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар), 
	|		ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара))";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТекстЗапросаКоэффициентУпаковки",
		Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаКоэффициентаУпаковки(
			"ЗаказПоставщикуТовары.Упаковка",
			"ЗаказПоставщикуТовары.Номенклатура"));

	Возврат Запрос.Выполнить();
	
КонецФункции

#КонецОбласти

#Область Проведение

// Возвращает контейнер соотвествия для дополнительных данных движений
//
// Параметры:
//  ИмяРегистра - Строка - имя регистра в конфигурации.
//
// Возвращаемое значение:
//  Соответствие Из КлючИЗначение - Истина, если требуется формировать указанную таблицу
//@skip-check function-return-types
Функция ДополнительныеИсточникиДанныхДляДвижений(ИмяРегистра) Экспорт

	ИсточникиДанных = Новый Соответствие;
	
	Возврат ИсточникиДанных;

КонецФункции

Процедура ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка)
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДокументОПредстоящейПоставке.Ссылка КАК Ссылка,
	|	ДокументОПредстоящейПоставке.Дата КАК Дата,
	|	ДокументОПредстоящейПоставке.Организация КАК Организация,
	|	ДокументОПредстоящейПоставке.Контрагент КАК Контрагент,
	|	ДокументОПредстоящейПоставке.Партнер КАК Партнер,
	|	ДокументОПредстоящейПоставке.ЗаказПоставщику КАК ЗаказПоставщику,
	|	ДокументОПредстоящейПоставке.Валюта КАК Валюта,
	|	ДокументОПредстоящейПоставке.СуммаОбеспечительногоПлатежа КАК СуммаДокумента,
	|	ДокументОПредстоящейПоставке.СуммаОбеспечительногоПлатежа КАК СуммаОбеспечительногоПлатежа,
	|	ДокументОПредстоящейПоставке.Номер КАК Номер,
	|	ДокументОПредстоящейПоставке.Договор КАК Договор,
	|	ДокументОПредстоящейПоставке.Подразделение КАК Подразделение,
	|	ДокументОПредстоящейПоставке.Комментарий КАК Комментарий,
	|	ДокументОПредстоящейПоставке.ПометкаУдаления КАК ПометкаУдаления,
	|	ДокументОПредстоящейПоставке.Проведен КАК Проведен,
	|	ДокументОПредстоящейПоставке.Организация.ВалютаРегламентированногоУчета КАК ВалютаРегламентированногоУчета,
	|	ДокументОПредстоящейПоставке.Организация.СтранаРегистрации КАК СтранаРегистрации,
	|	ДокументОПредстоящейПоставке.Автор КАК Автор,
	|	ДокументОПредстоящейПоставке.НомерДОПП КАК НомерДОПП,
	|	ДокументОПредстоящейПоставке.ДатаДОПП КАК ДатаДОПП,
	|	ДокументОПредстоящейПоставке.Партнер КАК Поставщик,
	|	ДокументОПредстоящейПоставке.НаправлениеДеятельности КАК НаправлениеДеятельности
	|ИЗ
	|	Документ.ДокументОПредстоящейПоставке КАК ДокументОПредстоящейПоставке
	|ГДЕ
	|	ДокументОПредстоящейПоставке.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(ЕСТЬNULL(ДокументОПредстоящейПоставкеТовары.СуммаНДС, 0)) КАК СуммаНДС,
	|	СУММА(ЕСТЬNULL(ДокументОПредстоящейПоставкеТовары.ОбеспечительныйПлатеж, 0)) КАК ОбеспечительныйПлатеж
	|ИЗ
	|	Документ.ДокументОПредстоящейПоставке.Товары КАК ДокументОПредстоящейПоставкеТовары
	|ГДЕ
	|	ДокументОПредстоящейПоставкеТовары.Ссылка = &Ссылка
	|
	|ИМЕЮЩИЕ НЕ СУММА(ЕСТЬNULL(ДокументОПредстоящейПоставкеТовары.СуммаНДС, 0)) ЕСТЬ NULL
	|	ИЛИ НЕ СУММА(ЕСТЬNULL(ДокументОПредстоящейПоставкеТовары.ОбеспечительныйПлатеж, 0)) ЕСТЬ NULL
	|";
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	Реквизиты = РезультатыЗапроса[0].Выбрать();
	Реквизиты.Следующий();
	
	Для Каждого Колонка Из РезультатыЗапроса[0].Колонки Цикл
		Запрос.УстановитьПараметр(Колонка.Имя, Реквизиты[Колонка.Имя]);
	КонецЦикла;
	
	Результат = РезультатыЗапроса[1].Выбрать();
	Если Результат.Следующий() Тогда
		СуммаОкругленияНДС = Результат.СуммаНДС - Окр(Результат.СуммаНДС);
		Запрос.УстановитьПараметр("СуммаОкругленияНДС", СуммаОкругленияНДС);
		
		Запрос.УстановитьПараметр("СуммаОкругленияАкциза", Результат.ОбеспечительныйПлатеж - Реквизиты.СуммаДокумента
															- СуммаОкругленияНДС);
	Иначе
		Запрос.УстановитьПараметр("СуммаОкругленияНДС",    0);
		Запрос.УстановитьПараметр("СуммаОкругленияАкциза", 0);
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Период",                    Реквизиты.Дата);
	Запрос.УстановитьПараметр("ИдентификаторМетаданных",   ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ПолноеИмяОбъекта()));
	Запрос.УстановитьПараметр("ИдентификаторПриобретение", ОбщегоНазначения.ИдентификаторОбъектаМетаданных("Документ.ПриобретениеТоваровУслуг"));
	Запрос.УстановитьПараметр("ХозяйственнаяОперация",     Перечисления.ХозяйственныеОперации.ЗакупкаВСтранахЕАЭС);
	
	Если ЗначениеЗаполнено(Реквизиты.Договор) Тогда
		ШаблонСтроки = НСтр("ru = 'По договору ""%1""'"); // @НСтр
		ИнформацияПоДоговору = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонСтроки, Реквизиты.Договор);
	КонецЕсли;
	Запрос.УстановитьПараметр("ИнформацияПоДоговору", ИнформацияПоДоговору);
	
	Запрос.УстановитьПараметр("ИспользоватьПодакцизныеТовары",
		УчетПодакцизныхТоваров.ИспользуетсяИмпортПодакцизныхТоваров(Реквизиты.Организация, Реквизиты.Дата));
	Если НЕ ПолучитьФункциональнуюОпцию("ИспользоватьМногострановойУчет") Тогда
		Запрос.УстановитьПараметр("СтранаРегистрации", ЗначениеНастроекКлиентСерверПовтИсп.ОсновнаяСтрана());
	КонецЕсли;
	
	ВалютаРеглУчета = ЗначениеНастроекПовтИсп.ВалютаРегламентированногоУчетаОрганизации(Реквизиты.Организация);
	КоэффициентыПересчета = РаботаСКурсамиВалютУТ.ПолучитьКоэффициентыПересчетаВалюты(
		ВалютаРеглУчета, ВалютаРеглУчета, Реквизиты.Дата, Реквизиты.Организация);
	Запрос.УстановитьПараметр("КоэффициентПересчетаВВалютуУпр", КоэффициентыПересчета.КоэффициентПересчетаВВалютуУпр);
	
КонецПроцедуры

Функция ТекстЗапросаТаблицаПрочиеАктивыПассивы(ТекстыЗапроса, Регистры)
	
	ИмяРегистра = "ПрочиеАктивыПассивы";
	Если НЕ ПроведениеДокументов.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли;
	
	Если НЕ ПроведениеДокументов.ЕстьТаблицаЗапроса("ВТРасшифровкаНалогов", ТекстыЗапроса) Тогда
		ДобавитьТекстЗапросаВТРасшифровкаНалогов(ТекстыЗапроса);
	КонецЕсли;
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	&Период                                             КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)              КАК ВидДвижения,
	|	&Организация                                        КАК Организация,
	|	НЕОПРЕДЕЛЕНО                                        КАК Подразделение,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)     КАК НаправлениеДеятельности,
	|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиАктивовПассивов.Налоги) КАК Статья,
	|	ЗНАЧЕНИЕ(Справочник.ВидыНалоговВзносов.НДС_ВвозимыеТовары)    КАК Аналитика,
	|	СУММА(Налоги.СуммаНДСУУ)                               КАК Сумма
	|ИЗ
	|	ВТРасшифровкаНалогов КАК Налоги
	|
	|ГДЕ
	|	&СуммаДокумента <> 0
	|	И Налоги.СуммаНДС <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&Период                                             КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)              КАК ВидДвижения,
	|	&Организация                                        КАК Организация,
	|	НЕОПРЕДЕЛЕНО                                        КАК Подразделение,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)     КАК НаправлениеДеятельности,
	|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиАктивовПассивов.Налоги) КАК Статья,
	|	ЗНАЧЕНИЕ(Справочник.ВидыНалоговВзносов.Акцизы)      КАК Аналитика,
	|	СУММА(Налоги.СуммаАкцизаУУ)                         КАК Сумма
	|ИЗ
	|	ВТРасшифровкаНалогов КАК Налоги
	|ГДЕ
	|	&СуммаДокумента <> 0
	|	И Налоги.СуммаАкциза <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&Период                                             КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)              КАК ВидДвижения,
	|	&Организация                                        КАК Организация,
	|	НЕОПРЕДЕЛЕНО                                        КАК Подразделение,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)         КАК НаправлениеДеятельности,
	|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиАктивовПассивов.Налоги)     КАК Статья,
	|	ЗНАЧЕНИЕ(Справочник.ВидыНалоговВзносов.ОбеспечительныйПлатежСПОТ) КАК Аналитика,
	|	СУММА(Налоги.СуммаНДСУУ + Налоги.СуммаАкциза)       КАК Сумма
	|ИЗ
	|	ВТРасшифровкаНалогов КАК Налоги
	|
	|ГДЕ
	|	&СуммаДокумента <> 0
	|	И Налоги.СуммаАкциза + Налоги.СуммаНДС <> 0";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаТаблицаДвиженияПоПрочимАктивамПассивам(ТекстыЗапроса, Регистры)
	
	ИмяРегистра = "ДвиженияПоПрочимАктивамПассивам";
	Если НЕ ПроведениеДокументов.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли;
	
	Если НЕ ПроведениеДокументов.ЕстьТаблицаЗапроса("ВТРасшифровкаНалогов", ТекстыЗапроса) Тогда
		ДобавитьТекстЗапросаВТРасшифровкаНалогов(ТекстыЗапроса);
	КонецЕсли;
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	&Период                                             КАК Период,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийПрочихАктивовПассивов.Дебет) КАК ДебетКредит,
	|	&Организация                                        КАК Организация,
	|	НЕОПРЕДЕЛЕНО                                        КАК Подразделение,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)     КАК НаправлениеДеятельности,
	|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиАктивовПассивов.Налоги) КАК Статья,
	|	ЗНАЧЕНИЕ(Справочник.ВидыНалоговВзносов.НДС_ВвозимыеТовары)    КАК Аналитика,
	|	Налоги.СуммаНДС                                     КАК СуммаРегл,
	|	Налоги.СуммаНДСУУ                                   КАК СуммаБезНДС,
	|	Налоги.СуммаНДСУУ                                   КАК СуммаСНДС,
	|	Налоги.СуммаНДСУУ                                   КАК СуммаУпр,
	|	Налоги.ИдентификаторСтроки                          КАК ИдентификаторФинЗаписи,
	|	ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.ЗакупкаВСтранахЕАЭС) КАК НастройкаХозяйственнойОперации
	|ИЗ
	|	ВТРасшифровкаНалогов КАК Налоги
	|ГДЕ
	|	Налоги.СуммаНДС <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&Период                                             КАК Период,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийПрочихАктивовПассивов.Дебет) КАК ДебетКредит,
	|	&Организация                                        КАК Организация,
	|	НЕОПРЕДЕЛЕНО                                        КАК Подразделение,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)     КАК НаправлениеДеятельности,
	|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиАктивовПассивов.Налоги) КАК Статья,
	|	ЗНАЧЕНИЕ(Справочник.ВидыНалоговВзносов.Акцизы)      КАК Аналитика,
	|	Налоги.СуммаАкциза                                  КАК СуммаРегл,
	|	Налоги.СуммаАкцизаУУ                                КАК СуммаБезНДС,
	|	Налоги.СуммаАкцизаУУ                                КАК СуммаСНДС,
	|	Налоги.СуммаАкцизаУУ                                КАК СуммаУпр,
	|	Налоги.ИдентификаторСтроки                          КАК ИдентификаторФинЗаписи,
	|	ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.ЗакупкаВСтранахЕАЭС) КАК НастройкаХозяйственнойОперации
	|ИЗ
	|	ВТРасшифровкаНалогов КАК Налоги
	|ГДЕ
	|	Налоги.СуммаАкциза <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&Период                                             КАК Период,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийПрочихАктивовПассивов.Кредит) КАК ДебетКредит,
	|	&Организация                                        КАК Организация,
	|	НЕОПРЕДЕЛЕНО                                        КАК Подразделение,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)         КАК НаправлениеДеятельности,
	|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиАктивовПассивов.Налоги)     КАК Статья,
	|	ЗНАЧЕНИЕ(Справочник.ВидыНалоговВзносов.ОбеспечительныйПлатежСПОТ) КАК Аналитика,
	|	Налоги.СуммаАкциза + Налоги.СуммаНДС                КАК СуммаРегл,
	|	Налоги.СуммаАкцизаУУ + Налоги.СуммаНДСУУ            КАК СуммаБезНДС,
	|	Налоги.СуммаАкцизаУУ + Налоги.СуммаНДСУУ            КАК СуммаСНДС,
	|	Налоги.СуммаАкцизаУУ + Налоги.СуммаНДСУУ            КАК СуммаУпр,
	|	Налоги.ИдентификаторСтроки                          КАК ИдентификаторФинЗаписи,
	|	ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.ЗакупкаВСтранахЕАЭС) КАК НастройкаХозяйственнойОперации
	|ИЗ
	|	ВТРасшифровкаНалогов КАК Налоги
	|ГДЕ
	|	Налоги.СуммаАкциза + Налоги.СуммаНДС <> 0";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	Возврат ТекстЗапроса;
	
КонецФункции

Процедура ДобавитьТекстЗапросаВТРасшифровкаНалогов(ТекстыЗапроса)
	
	ИмяТаблицы = "ВТРасшифровкаНалогов";
	Если ПроведениеДокументов.ЕстьТаблицаЗапроса(ИмяТаблицы, ТекстыЗапроса) Тогда
		Возврат;
	КонецЕсли;
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Строки.СуммаНДС КАК СуммаНДС,
	|	Строки.КБК КАК КБК,
	|	ВЫБОР
	|		КОГДА Строки.МаркируемаяПродукция
	|		ТОГДА 0
	|		ИНАЧЕ Строки.СуммаАкциза
	|	КОНЕЦ КАК СуммаАкциза,
	|	Строки.НомерСтроки КАК НомерСтроки,
	|	Строки.ИдентификаторСтроки КАК ИдентификаторСтроки
	|ПОМЕСТИТЬ ВТРасшифровкаНалоговПредварительная
	|ИЗ
	|	Документ.ДокументОПредстоящейПоставке.Товары КАК Строки
	|
	|ГДЕ
	|	Строки.Ссылка = &Ссылка
	|	И &СуммаДокумента <> 0
	|;
	|////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(Строки.СуммаНДС) КАК СуммаНДС,
	|	МАКСИМУМ(Строки.СуммаАкциза) КАК СуммаАкциза
	|ПОМЕСТИТЬ ВТСтроки
	|ИЗ
	|	ВТРасшифровкаНалоговПредварительная КАК Строки
	|;
	|////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИСТИНА КАК ЭтоНДС,
	|	МАКСИМУМ(РасшифровкаНалогов.НомерСтроки) КАК НомерСтроки,
	|	&СуммаОкругленияНДС КАК ОкруглениеНалога
	|ПОМЕСТИТЬ ВТНомераСтрок
	|ИЗ
	|	ВТРасшифровкаНалоговПредварительная КАК РасшифровкаНалогов
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСтроки КАК Строки
	|		ПО РасшифровкаНалогов.СуммаНДС = Строки.СуммаНДС
	|	
	|ОБЪЕДИНИТЬ ВСЕ
	|	
	|ВЫБРАТЬ
	|	ЛОЖЬ КАК ЭтоНДС,
	|	МАКСИМУМ(РасшифровкаНалогов.НомерСтроки) КАК НомерСтроки,
	|	&СуммаОкругленияАкциза КАК ОкруглениеНалога
	|ИЗ
	|	ВТРасшифровкаНалоговПредварительная КАК РасшифровкаНалогов
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСтроки КАК Строки
	|		ПО РасшифровкаНалогов.СуммаАкциза = Строки.СуммаАкциза
	|;
	|////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РасшифровкаНалогов.СуммаНДС - ЕстьNull(СтрокиНДС.ОкруглениеНалога, 0) КАК СуммаНДС,
	|	ВЫРАЗИТЬ((РасшифровкаНалогов.СуммаНДС - ЕстьNull(СтрокиНДС.ОкруглениеНалога, 0))
	|				* &КоэффициентПересчетаВВалютуУпр КАК ЧИСЛО(31,2)) КАК СуммаНДСУУ,
	|	РасшифровкаНалогов.СуммаАкциза - ЕстьNull(СтрокиАкциз.ОкруглениеНалога, 0) КАК СуммаАкциза,
	|	ВЫРАЗИТЬ((РасшифровкаНалогов.СуммаАкциза  - ЕстьNull(СтрокиАкциз.ОкруглениеНалога, 0))
	|				* &КоэффициентПересчетаВВалютуУпр КАК ЧИСЛО(31,2)) КАК СуммаАкцизаУУ,
	|	РасшифровкаНалогов.ИдентификаторСтроки КАК ИдентификаторСтроки
	|ПОМЕСТИТЬ ВТРасшифровкаНалогов
	|ИЗ
	|	ВТРасшифровкаНалоговПредварительная КАК РасшифровкаНалогов
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТНомераСтрок КАК СтрокиНДС
	|		ПО РасшифровкаНалогов.НомерСтроки = СтрокиНДС.НомерСтроки
	|			И СтрокиНДС.ЭтоНДС
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТНомераСтрок КАК СтрокиАкциз
	|		ПО РасшифровкаНалогов.НомерСтроки = СтрокиАкциз.НомерСтроки
	|			И НЕ СтрокиАкциз.ЭтоНДС
	|";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяТаблицы);
	
КонецПроцедуры

Процедура ИнициализироватьКлючиАналитикиУчетаНоменклатуры(Запрос) Экспорт
	
	ЗапросАналитик = Новый Запрос("
	|ВЫБРАТЬ
	|	ПрослеживаемыеТовары.Номенклатура                   КАК Номенклатура,
	|	ПрослеживаемыеТовары.Характеристика                 КАК Характеристика,
	|	ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)        КАК Назначение,
	|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК Серия,
	|	ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)            КАК Склад,
	|	&Договор                                            КАК МестоХранения
	|ИЗ
	|	Документ.ДокументОПредстоящейПоставке.Товары КАК ПрослеживаемыеТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.НомераГТД КАК НомераГТД
	|		ПО ПрослеживаемыеТовары.НомерРНПТ = НомераГТД.Ссылка
	|			И (НомераГТД.ТипНомераГТД = ЗНАЧЕНИЕ(Перечисление.ТипыНомеровГТД.НомерРНПТ)
	|			ИЛИ НомераГТД.ТипНомераГТД = ЗНАЧЕНИЕ(Перечисление.ТипыНомеровГТД.НомерРНПТКомплекта))
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаНоменклатуры КАК Аналитика
	|		ПО (ПрослеживаемыеТовары.Номенклатура      = Аналитика.Номенклатура
	|			И ПрослеживаемыеТовары.Характеристика = Аналитика.Характеристика
	|			И Аналитика.МестоХранения     = &Договор
	|			И Аналитика.Серия             = ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)
	|			И Аналитика.Назначение        = ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
	|		ЛЕВОЕ Соединение Справочник.Номенклатура КАК СпрНоменклатура
	|			ПО ПрослеживаемыеТовары.Номенклатура = СпрНоменклатура.Ссылка
	|				И СпрНоменклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар)
	|ГДЕ
	|	ПрослеживаемыеТовары.Ссылка = &Ссылка
	|	И Аналитика.КлючАналитики ЕСТЬ NULL
	|	И НЕ ПрослеживаемыеТовары.Номенклатура ЕСТЬ NULL
	|
	|СГРУППИРОВАТЬ ПО
	|	ПрослеживаемыеТовары.Номенклатура,
	|	ПрослеживаемыеТовары.Характеристика
	|");
	
	ЗапросАналитик.УстановитьПараметр("Ссылка", Запрос.Параметры.Ссылка);
	ЗапросАналитик.УстановитьПараметр("Договор", Запрос.Параметры.Договор);
	Выборка = ЗапросАналитик.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		РегистрыСведений.АналитикаУчетаНоменклатуры.СоздатьКлючАналитики(Выборка);
	КонецЦикла;
	
КонецПроцедуры

Функция ТекстЗапросаТаблицаТоварыКОформлениюДокументовИмпорта(Запрос, ТекстыЗапроса, Регистры)
	
	ИмяРегистра = "ТоварыКОформлениюДокументовИмпорта";
	
	Если НЕ ПроведениеДокументов.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли;
	
	ИнициализироватьКлючиАналитикиУчетаНоменклатуры(Запрос);
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	&Период КАК Период,
	|	&Организация КАК Организация,
	|	&Партнер КАК Поставщик,
	|	Аналитика.КлючАналитики КАК АналитикаУчетаНоменклатуры,
	|	ВЫБОР
	|		КОГДА &ЗаказПоставщику = ЗНАЧЕНИЕ(Документ.ЗаказПоставщику.ПустаяСсылка)
	|		ТОГДА НЕОПРЕДЕЛЕНО
	|	ИНАЧЕ &ЗаказПоставщику
	|	КОНЕЦ КАК ДокументПоступления,
	|	&ИдентификаторПриобретение КАК ТипДокументаИмпорта,
	|	ПрослеживаемыеТовары.НомерРНПТ КАК НомерРНПТ,
	|	ПрослеживаемыеТовары.КоличествоПоРНПТ КАК КоличествоПоРНПТ,
	|	ПрослеживаемыеТовары.Количество КАК Количество,
	|	0 КАК Сумма,
	|	ИСТИНА КАК Первичное,
	|	ПрослеживаемыеТовары.ИдентификаторСтроки КАК ИдентификаторСтроки
	|ИЗ
	|	Документ.ДокументОПредстоящейПоставке.Товары КАК ПрослеживаемыеТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.НомераГТД КАК НомераГТД
	|		ПО ПрослеживаемыеТовары.НомерРНПТ = НомераГТД.Ссылка
	|			И (НомераГТД.ТипНомераГТД = ЗНАЧЕНИЕ(Перечисление.ТипыНомеровГТД.НомерРНПТ)
	|			ИЛИ НомераГТД.ТипНомераГТД = ЗНАЧЕНИЕ(Перечисление.ТипыНомеровГТД.НомерРНПТКомплекта))
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаНоменклатуры КАК Аналитика
	|		ПО (ПрослеживаемыеТовары.Номенклатура      = Аналитика.Номенклатура
	|			И ПрослеживаемыеТовары.Характеристика = Аналитика.Характеристика
	|			И Аналитика.МестоХранения     = &Договор
	|			И Аналитика.Серия             = ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)
	|			И Аналитика.Назначение        = ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
	|ГДЕ
	|	ПрослеживаемыеТовары.Ссылка = &Ссылка
	|	И ПрослеживаемыеТовары.КоличествоПоРНПТ > 0
	|";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаТаблицаРеестрДокументов(Запрос, ТекстыЗапроса, Регистры)
	
	ИмяРегистра = "РеестрДокументов";
	
	Если НЕ ПроведениеДокументов.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли;
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	&Ссылка                  КАК Ссылка,
	|	&Период                  КАК ДатаДокументаИБ,
	|	&Номер                   КАК НомерДокументаИБ,
	|	&ИдентификаторМетаданных КАК ТипСсылки,
	|	&Организация             КАК Организация,
	|	&ХозяйственнаяОперация   КАК ХозяйственнаяОперация,
	|	НЕОПРЕДЕЛЕНО             КАК Партнер,
	|	&Контрагент              КАК Контрагент,
	|	&Договор                 КАК Договор,
	|	&НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	НЕОПРЕДЕЛЕНО             КАК МестоХранения,
	|	&Подразделение           КАК Подразделение,
	|	&Автор                   КАК Ответственный,
	|	&Комментарий             КАК Комментарий,
	|	&Валюта                  КАК Валюта,
	|	&СуммаОбеспечительногоПлатежа КАК Сумма,
	
	
	|	&Проведен                КАК Проведен,
	|	&ПометкаУдаления         КАК ПометкаУдаления,
	|	ЛОЖЬ                     КАК ДополнительнаяЗапись,
	|	&ИнформацияПоДоговору    КАК Дополнительно,
	|	&ДатаДОПП                КАК ДатаПервичногоДокумента,
	|	&НомерДОПП               КАК НомерПервичногоДокумента,
	|	&Период                  КАК ДатаОтраженияВУчете,
	|	НЕОПРЕДЕЛЕНО             КАК Приоритет
	|";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса;
	
КонецФункции

// Возвращает результат адаптации текста запроса движений по регистру.
// 
// Параметры:
//  ИмяРегистра - Строка - имя регистра в конфигурации.
// 
// Возвращаемое значение:
//  см. ОбновлениеИнформационнойБазыУТ.РезультатАдаптацииЗапроса
//
Функция АдаптированныйТекстЗапросаДвиженийПоРегистру(ИмяРегистра) Экспорт
	
	Запрос = Новый Запрос;
	ТекстыЗапроса = Новый СписокЗначений;
	
	ПолноеИмяДокумента           = "Документ.ДокументОПредстоящейПоставке";
	СинонимТаблицыДокумента      = "";
	ВЗапросеЕстьИсточник         = Истина;
	ТекстыЗапросаВременныхТаблиц = Новый Соответствие();
	
	ПереопределениеРасчетаПараметров = Новый Структура;
	ПереопределениеРасчетаПараметров.Вставить("НомерНаПечать",        """""");
	ПереопределениеРасчетаПараметров.Вставить("ИнформацияПоДоговору", """""");
	
	ЗначенияПараметров = Новый Структура;
	ЗначенияПараметров.Вставить("ИдентификаторМетаданных",
		ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ПолноеИмяДокумента));
	ЗначенияПараметров.Вставить("ХозяйственнаяОперация", Перечисления.ХозяйственныеОперации.ЗакупкаВСтранахЕАЭС);
	
	Если ИмяРегистра = "РеестрДокументов" Тогда
		
		ТекстЗапроса = ТекстЗапросаТаблицаРеестрДокументов(Запрос, ТекстыЗапроса, ИмяРегистра);
		СинонимТаблицыДокумента = "";
		ВЗапросеЕстьИсточник = Ложь;
		
	Иначе
		ТекстИсключения = НСтр("ru = 'В документе %ПолноеИмяДокумента% не реализована адаптация текста запроса формирования движений по регистру %ИмяРегистра%.'");
		ТекстИсключения = СтрЗаменить(ТекстИсключения, "%ПолноеИмяДокумента%", 	ПолноеИмяДокумента);
		ТекстИсключения = СтрЗаменить(ТекстИсключения, "%ИмяРегистра%", 		ИмяРегистра);
		
		ВызватьИсключение ТекстИсключения;
	КонецЕсли;
	
	Если ИмяРегистра = "РеестрДокументов" Тогда
		
		ТекстЗапроса = ОбновлениеИнформационнойБазыУТ.АдаптироватьЗапросПроведенияПоНезависимомуРегистру(
			ТекстЗапроса,
			ПолноеИмяДокумента,
			СинонимТаблицыДокумента,
			ВЗапросеЕстьИсточник,
			ПереопределениеРасчетаПараметров,
			ТекстыЗапросаВременныхТаблиц);
		
	Иначе
		
		ТекстЗапроса = ОбновлениеИнформационнойБазыУТ.АдаптироватьЗапросМеханизмаПроведения(
			ТекстЗапроса,
			ПолноеИмяДокумента,
			СинонимТаблицыДокумента,
			ПереопределениеРасчетаПараметров,
			ТекстыЗапросаВременныхТаблиц);
		
	КонецЕсли;
	
	Результат = ОбновлениеИнформационнойБазыУТ.РезультатАдаптацииЗапроса();
	Результат.ЗначенияПараметров = ЗначенияПараметров;
	Результат.ТекстЗапроса = ТекстЗапроса;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область ОбновлениеИнформационнойБазы

// см. ОбновлениеИнформационнойБазыБСП.ПриДобавленииОбработчиковОбновления
//
Процедура ПриДобавленииОбработчиковОбновления(Обработчики) Экспорт

	Обработчик = Обработчики.Добавить();
	Обработчик.Процедура = "Документы.ДокументОПредстоящейПоставке.ОбработатьДанныеДляПереходаНаНовуюВерсию";
	Обработчик.Версия = "2.5.27.98";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("de97bc49-9d7a-47a9-a0ec-a9afbf8c584a");
	Обработчик.Многопоточный = Истина;
	Обработчик.ПроцедураЗаполненияДанныхОбновления = "Документы.ДокументОПредстоящейПоставке.ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию";
	Обработчик.ПроцедураПроверки = "ОбновлениеИнформационнойБазы.ДанныеОбновленыНаНовуюВерсиюПрограммы";
	Обработчик.Порядок = Перечисления.ПорядокОбработчиковОбновления.Некритичный;
	Обработчик.Комментарий = НСтр("ru = 'Создание документов о предстоящей поставке'");
	
	Читаемые = Новый Массив;
	

	Читаемые.Добавить(Метаданные.Документы.ДокументОПредстоящейПоставке.ПолноеИмя());
	Обработчик.ЧитаемыеОбъекты = СтрСоединить(Читаемые, ",");
	
	Изменяемые = Новый Массив;
	Изменяемые.Добавить(Метаданные.Документы.ДокументОПредстоящейПоставке.ПолноеИмя());
	
	
	Обработчик.ИзменяемыеОбъекты = СтрСоединить(Изменяемые, ",");
	
КонецПроцедуры

// Параметры:
// 	Параметры - см. ОбновлениеИнформационнойБазы.ОсновныеПараметрыОтметкиКОбработке
//
Процедура ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	ПараметрыВыборки = Параметры.ПараметрыВыборки;
	МассивИмен = Новый Массив;
	МассивИмен.Добавить(Документы.ДокументОПредстоящейПоставке.ПустаяСсылка().Метаданные().ПолноеИмя());
	ПараметрыВыборки.ПолныеИменаОбъектов = СтрСоединить(МассивИмен,",");
	ПараметрыВыборки.СпособВыборки = ОбновлениеИнформационнойБазы.СпособВыборкиСсылки();
	ПараметрыВыборки.ПоляУпорядочиванияПриРаботеПользователей.Добавить("Дата УБЫВ");
	ПараметрыВыборки.ПоляУпорядочиванияПриОбработкеДанных.Добавить("Дата УБЫВ");
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДокументОПредстоящейПоставке.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ДокументОПредстоящейПоставке КАК ДокументОПредстоящейПоставке
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ДокументОПредстоящейПоставке.Товары КАК ДокументОПредстоящейПоставкеТовары
	|		ПО ДокументОПредстоящейПоставке.Ссылка = ДокументОПредстоящейПоставкеТовары.Ссылка
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|		ПО ДокументОПредстоящейПоставкеТовары.Номенклатура = СпрНоменклатура.Ссылка
	|			И СпрНоменклатура.ПрослеживаемыйТовар
	|ГДЕ
	|	НЕ ДокументОПредстоящейПоставке.ПометкаУдаления
	|	И ДокументОПредстоящейПоставкеТовары.КоличествоПоРНПТ = 0
	|	
	|ОБЪЕДИНИТЬ ВСЕ
	|	
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДокументОПредстоящейПоставке.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ДокументОПредстоящейПоставке КАК ДокументОПредстоящейПоставке
	|	
	|ГДЕ
	|	ДокументОПредстоящейПоставке.ДокументОснование Ссылка Документ.ЗаказПоставщику
	|	И НЕ ДокументОПредстоящейПоставке.ПометкаУдаления
	|	И ДокументОПредстоящейПоставке.ЗаказПоставщику = ЗНАЧЕНИЕ(Документ.ЗаказПоставщику.ПустаяСсылка)
	|";
	
	ТипыОснований = Новый СписокЗначений();
	
	
	
	ОбновлениеИнформационнойБазы.ОтметитьКОбработке(Параметры, Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));
	
КонецПроцедуры

// Обработчик обновления
// 
// Параметры:
// 	Параметры - См. ОбновлениеИнформационнойБазы.ДополнительныеПараметрыВыборкиДанныхДляМногопоточнойОбработки 
//
Процедура ОбработатьДанныеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	Параметры.ОбработкаЗавершена = Ложь;
	
	ОбновляемыеДанные = ОбновлениеИнформационнойБазы.ДанныеДляОбновленияВМногопоточномОбработчике(Параметры);
	
	МассивИменДокументов = Новый Массив;
	МассивИменДокументов.Добавить(Документы.ДокументОПредстоящейПоставке.ПустаяСсылка().Метаданные().ПолноеИмя());
	
	
	Если ОбновляемыеДанные.Количество() = 0 Тогда
		
		Параметры.ОбработкаЗавершена =
			ОбновлениеИнформационнойБазы.ОбработкаДанныхЗавершена(Параметры.Очередь, МассивИменДокументов);
		Возврат;
		
	КонецЕсли;
	
	ОбъектовОбработано = 0;
	ПроблемныхОбъектов = 0;
	ИсключенияПриОбновлении = Новый Массив;
	
	СписокОписаний = Новый Массив;
	СписокОписаний.Добавить(НСтр("ru = 'Обновление документов ""Документ о предстоящей поставке (ДОПП)""'"));
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ОбновляемыеДанные", ОбновляемыеДанные);
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц; 
	
	Запрос.Текст ="
	|ВЫБРАТЬ
	|	ОбновляемыеДанные.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ОбновляемыеДанные
	|ИЗ
	|	&ОбновляемыеДанные КАК ОбновляемыеДанные
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОбновляемыеДанные.Ссылка КАК Ссылка,
	|	ВЫБОР
	|		КОГДА ДокументОПредстоящейПоставке.ДокументОснование Ссылка Документ.ЗаказПоставщику
	|		ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЗаполнятьЗаказ,
	|	ДокументОПредстоящейПоставке.ДокументОснование КАК ДокументОснование,
	|	ЕСТЬNULL(СпрНоменклатура.ПрослеживаемыйТовар, ЛОЖЬ) КАК ПрослеживаемыйТовар,
	|	ДокументОПредстоящейПоставкеТовары.НомерСтроки КАК НомерСтроки
	|ИЗ
	|	ОбновляемыеДанные КАК ОбновляемыеДанные
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ДокументОПредстоящейПоставке КАК ДокументОПредстоящейПоставке
	|		ПО ДокументОПредстоящейПоставке.Ссылка = ОбновляемыеДанные.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ДокументОПредстоящейПоставке.Товары КАК ДокументОПредстоящейПоставкеТовары
	|		ПО ДокументОПредстоящейПоставке.Ссылка = ДокументОПредстоящейПоставкеТовары.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|		ПО ДокументОПредстоящейПоставкеТовары.Номенклатура = СпрНоменклатура.Ссылка
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка";
	
	РезльтатыЗапроса = Запрос.ВыполнитьПакет();
	
	
	// Исправление существующих ДОПП
	ПолноеИмяОбъекта = Документы.ДокументОПредстоящейПоставке.ПустаяСсылка().Метаданные().ПолноеИмя();
	НомерЗапроса = 1;
	
	
	ВыборкаДокументов = РезльтатыЗапроса[НомерЗапроса].Выбрать();
	Пока ВыборкаДокументов.СледующийПоЗначениюПоля("Ссылка") Цикл
				
		ПричинаИсключения = 0;
		Рекомендация = "";
		
		НачатьТранзакцию();
		
		Попытка
			
			ПричинаИсключения = 1; // Блокировка
		
			Блокировка = Новый БлокировкаДанных;
			ЭлементБлокировки = Блокировка.Добавить(ПолноеИмяОбъекта);
			ЭлементБлокировки.УстановитьЗначение("Ссылка", ВыборкаДокументов.Ссылка);
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			Блокировка.Заблокировать();
			
			ПричинаИсключения = 2; // ПлохиеДанные
			Рекомендация = НСтр("ru = 'Дозаполните ДОПП вручную'");
			
			ДОПП = ВыборкаДокументов.Ссылка.ПолучитьОбъект();
			
			Если ДОПП = Неопределено Тогда
				ОбновлениеИнформационнойБазы.ОтметитьВыполнениеОбработки(ВыборкаДокументов.Ссылка);
			Иначе
				ДОПП.ОбменДанными.Загрузка = Истина;
				
				Если ТипЗнч(ДОПП.ДокументОснование) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
					ДОПП.ЗаказПоставщику = ДОПП.ДокументОснование;
				КонецЕсли;
				
				Пока ВыборкаДокументов.Следующий() Цикл
					Если ВыборкаДокументов.ПрослеживаемыйТовар Тогда
						ДОПП.Товары[ВыборкаДокументов.НомерСтроки - 1].КоличествоПоРНПТ = ДОПП.Товары[ВыборкаДокументов.НомерСтроки - 1].Количество;
					КонецЕсли;
				КонецЦикла;
				
				ДОПП.Комментарий = НСтр("ru = 'Создан обработчиком обновления'");
				ДОПП.УстановитьНовыйНомер();
				ДОПП.Записать(РежимЗаписиДокумента.Запись);
				
			КонецЕсли;
			
			ПричинаИсключения = 3; // Запись
				
			Если ДОПП.Модифицированность() Тогда
				ОбновлениеИнформационнойБазы.ЗаписатьДанные(ДОПП);
			Иначе
				ОбновлениеИнформационнойБазы.ОтметитьВыполнениеОбработки(ВыборкаДокументов.Ссылка);
			КонецЕсли;
				
			ОбъектовОбработано = ОбъектовОбработано + 1;
			
			ЗафиксироватьТранзакцию();
			
		Исключение
			
			ОтменитьТранзакцию();
			
			ПроблемныхОбъектов = ПроблемныхОбъектов + 1;
			ОбновлениеИнформационнойБазыУТ.СообщитьОНеудачнойОбработке(ИнформацияОбОшибке(), ВыборкаДокументов.СчетФактура);
			
			Если ПричинаИсключения = 2 Тогда
				
				ОписаниеПроблемы = ОбновлениеИнформационнойБазыУТ.ПроблемаСДанными(
					ВыборкаДокументов.Ссылка, Рекомендация, ИнформацияОбОшибке());
				ИсключенияПриОбновлении.Добавить(ОписаниеПроблемы);
				
			ИначеЕсли ПричинаИсключения = 3 Тогда
				
				ОбновлениеИнформационнойБазыУТ.ЗаписатьПлохиеДанные(
					ИсключенияПриОбновлении, ОбъектовОбработано, Параметры);
				ВызватьИсключение СтрСоединить(СписокОписаний, Символы.ПС);
				
			КонецЕсли;
			
		КонецПопытки;
		
	КонецЦикла;
	
	Параметры.ОбработкаЗавершена =
		ОбновлениеИнформационнойБазы.ОбработкаДанныхЗавершена(Параметры.Очередь);
	
	ОбновлениеИнформационнойБазыУТ.ЗаписатьПлохиеДанные(ИсключенияПриОбновлении, ОбъектовОбработано, Параметры);
	
КонецПроцедуры


#КонецОбласти

#КонецОбласти

#КонецЕсли