&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.ЗначениеКопирования.Пустая() = Ложь 
		И Параметры.ЗначениеКопирования.ЭтоВходящий = Истина Тогда
	    Отказ = Истина; 
	    СтандартнаяОбработка = Ложь;
	КонецЕсли;
	
	Если НЕ Параметры.Свойство("ФормаБезОбработки") Тогда
		
		// СтандартныеПодсистемы.ПодключаемыеКоманды
		ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
		// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
		
		ОбменСГИСЭПД.ПриСозданииНаСервереПодчиненнойФормы(ЭтотОбъект, Отказ, СтандартнаяОбработка);

		Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
			
			ОбменСГИСЭПД.ЗаполнитьТаблицуВерсийТитулов(Объект.Ссылка, Объект.Организация, ВерсииТитулов);
			ОбменСГИСЭПД.ЗаполнитьТаблицуЗначенийРеквизитов(Объект.Ссылка, Объект.Организация, СтруктураРеквизитов);
			
		Иначе 
			
			ОбменСГИСЭПД.ЗаполнитьТаблицуЗначенийРеквизитовПоПараметрамФормы(Параметры, СтруктураРеквизитов);
			
			Если ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда 
				Объект.ИдентификаторЗаказчика = Неопределено;
				Объект.ИдентификаторЭкспедитора = Неопределено;
			КонецЕсли;
			
		КонецЕсли;
		
		ОрганизацияОписаниеТипов = Метаданные.ОпределяемыеТипы.Организация.Тип;
		КонтрагентОписаниеТипов = Метаданные.ОпределяемыеТипы.КонтрагентБЭД.Тип;

		ОбменСГИСЭПДКлиентСервер.УстановитьДоступностьЭлементовЭПЭ(ЭтотОбъект);
		
		Если Объект.ЭтоВходящий = Ложь Тогда
			
			Если ЗначениеЗаполнено(Объект.СсылкаТитулЗаказчикаСоставитель) Тогда
				ВариантПоДоверенностиЗаЗаказчика = 1;
				Элементы.СсылкаТитулЗаказчикаЗаказчик.ОграничениеТипа = КонтрагентОписаниеТипов;
				Элементы.СсылкаТитулЗаказчикаСоставитель.ОграничениеТипа = ОрганизацияОписаниеТипов;
				Если ЗначениеЗаполнено(Объект.СсылкаТитулЗаказчикаСоставитель) = Ложь Тогда
					Объект.СсылкаТитулГрузоотправителяСоставитель = ИнтеграцияЭДО.ОрганизацияПоУмолчанию();
				КонецЕсли;
			Иначе
				Элементы.СсылкаТитулЗаказчикаЗаказчик.ОграничениеТипа = ОрганизацияОписаниеТипов;
				Объект.СсылкаТитулЗаказчикаЗаказчик = 
					ОбменСГИСЭПДКлиентСервер.ПолучитьЗначениеРеквизитаИзСтруктурыФормы(ЭтотОбъект, 
					"СсылкаТитулЗаказчикаЗаказчик");	
				Если ЗначениеЗаполнено(Объект.СсылкаТитулЗаказчикаЗаказчик) = Ложь Тогда
					Объект.СсылкаТитулЗаказчикаЗаказчик = ИнтеграцияЭДО.ОрганизацияПоУмолчанию();
					ОбменСГИСЭПДКлиентСервер.ЗаполнитьРеквизитыПоСсылке(Элементы.СсылкаТитулЗаказчикаЗаказчик, ЭтотОбъект);
				КонецЕсли;
			КонецЕсли;
			
			Элементы.СсылкаТитулЗаказчикаЭкспедитор.ОграничениеТипа = КонтрагентОписаниеТипов;			
						
			МассивЭлементов = Новый Массив;
			МассивЭлементов.Добавить(Элементы.СсылкаТитулЗаказчикаЗаказчик);
			Если ЗначениеЗаполнено(Объект.СсылкаТитулЗаказчикаСоставитель) Тогда
				МассивЭлементов.Добавить(Элементы.СсылкаТитулЗаказчикаСоставитель);
			КонецЕсли;
			МассивЭлементов.Добавить(Элементы.СсылкаТитулЗаказчикаЭкспедитор);
			ОбменСГИСЭПДКлиентСервер.ПоказатьОшибкиПоКонтрагентам(ЭтотОбъект, МассивЭлементов);
			
			Элементы.ГруппаРеквизитаТитулЗаказчикаНомер.Видимость = Ложь;
			Элементы.ЗаголовокНомер.Заголовок = "Номер";
			
			ОпределенДоговорЭПД = ОбменСГИСЭПД.ОпределенДоговорЭПД();
			
			Элементы.ГруппаРеквизитаЗаполнитьПоСсылкеТитулЗаказчикаРеквизитыДоговора.Видимость = ОпределенДоговорЭПД;
			Элементы.ГруппаРеквизитаЗаполнитьТитулЗаказчикаРеквизитыДоговора.Видимость = Не ОпределенДоговорЭПД;
			
		Иначе
			Элементы.ГруппаРеквизитаНомер.Видимость = Ложь;
			
			Элементы.ГруппаРеквизитаЗаполнитьПоСсылкеТитулЗаказчикаРеквизитыДоговора.Видимость = Ложь;
			Элементы.ГруппаРеквизитаЗаполнитьТитулЗаказчикаРеквизитыДоговора.Видимость = Истина;
			
		КонецЕсли;

		ЦветВыделенияУчастника = ЦветаСтиля.ЦветВыделенияУчастникаЭПД;
		Если Объект.РольУчастника = 1 Тогда
			Элементы.ГруппаРеквизитаСсылкаТитулЗаказчикаЭкспедитор.ЦветФона = ЦветВыделенияУчастника;
		ИначеЕсли Объект.РольУчастника = 3 Тогда
			Элементы.ГруппаРеквизитаСсылкаТитулЗаказчикаЗаказчик.ЦветФона = ЦветВыделенияУчастника;
		КонецЕсли;
		
		ИзмененСоставУчастников = ЗначениеЗаполнено(Объект.ИдентификаторЗаказчика) = Ложь
									Или ЗначениеЗаполнено(Объект.ИдентификаторЭкспедитора) = Ложь;
	

		ЗаполнитьЗначенияПоУмолчаниюДляТекущегоТитула();
		УстановитьТекущийШагПомощника();
		
		Элементы.ГруппаДокументыНеОтправляютсяВГис.Видимость = Не ОбменСГИСЭПД.СтатусПриемаЭкспедиторскихДокументовВГисЭПД(); 
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
КонецПроцедуры

&НаКлиенте
Функция ИдентификаторОтправителя()

	Результат = Неопределено;
	
	ТипОрганизация = ОбменСГИСЭПДВызовСервера.ПолучитьТипОрганизация();
	Если ТипЗнч(Объект.СсылкаТитулЗаказчикаЗаказчик) = ТипОрганизация Тогда
		Результат = Объект.ИдентификаторЗаказчика;
	ИначеЕсли ВариантПоДоверенностиЗаЗаказчика = Истина 
	И ТипЗнч(Объект.СсылкаТитулЗаказчикаСоставитель) = ТипОрганизация Тогда
		Результат = Объект.ИдентификаторЗаказчика;
	Иначе
		Результат = Объект.ИдентификаторЭкспедитора;	
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции 

&НаКлиенте
Процедура ВыгрузитьВФайл(Команда) 
		
	Результат = ОбменСГИСЭПДВызовСервера.ДвоичныеДанныеДокументаЭПД(Объект.Ссылка, УникальныйИдентификатор);
	
	Если Результат.ДвоичныеДанные <> Неопределено Тогда
		ПараметрыДиалога = Новый ПараметрыДиалогаПолученияФайлов;
		ПараметрыДиалога.Заголовок = НСтр("ru = 'Выберите путь для сохранения файла'");
		
		НачатьПолучениеФайлаССервера(Результат.ДвоичныеДанные, Результат.ИмяФайла, ПараметрыДиалога);
	Иначе
		ПоказатьПредупреждение(, НСтр("ru='Нет доступного титула'"), , );	
	КонецЕсли;

КонецПроцедуры


&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если ЗначениеЗаполнено(Объект.ТекущийТитул) = Ложь Тогда
		Возврат;
	КонецЕсли;
	
	Если ПараметрыЗаписи.Свойство("НеТребуетсяИдентификацияФайла") = Ложь Тогда
		
		Если ИзмененСоставУчастников = Истина
		Или ЗначениеЗаполнено(Объект.ИдентификаторЗаказчика) = Ложь
		Или ЗначениеЗаполнено(Объект.ИдентификаторЭкспедитора) = Ложь
		Тогда
			ЗаполнитьУчастников();
		КонецЕсли;
		
		ИнформацияПоПрефиксамТитула = ОбменСГИСЭПДКлиентСервер.ПрефиксТитулаПоЭлементуРегламентаЭДО(Объект.ТекущийТитул);
		ОбменСГИСЭПДКлиент.ЗаполнитьИдентификациюФайлаОбмена(ЭтотОбъект, ИнформацияПоПрефиксамТитула, ИдентификаторОтправителя());	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ЗначениеЗаполнено(ТекущийОбъект.ТекущийТитул) = Ложь Тогда
		Возврат;
	КонецЕсли;
	
	ИнформацияПоПрефиксамТитула = ОбменСГИСЭПДКлиентСервер.ПрефиксТитулаПоЭлементуРегламентаЭДО(Объект.ТекущийТитул);
	
	Если ИнформацияПоПрефиксамТитула.ВПрограмме = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	КонтейнерОтображаемойВерсии = Неопределено;
	
	ОбменСГИСЭПД.ЗаполнитьДополнительныеРеквизитыФормы(ЭтотОбъект, ИнформацияПоПрефиксамТитула.ВПрограмме, КонтейнерОтображаемойВерсии);
	
	НомерВерсии = ОбменСГИСЭПДКлиентСервер.ПолучитьЗначениеРеквизитаИзСтруктурыФормы(ЭтотОбъект, 
		ИнформацияПоПрефиксамТитула.ВПрограмме + "НомерИсправления", 0, КонтейнерОтображаемойВерсии);
	
	Если ПараметрыЗаписи.Свойство("ТребуетсяОбновитьДанныеОПодписантахВСтруктуреФормы") Тогда
		ОбменСГИСЭПД.ОбновитьДанныеОПодписантахВСтруктуреФормы(ЭтотОбъект, НомерВерсии);
	КонецЕсли;
	
	Если ПараметрыЗаписи.Свойство("НеДобавлятьВерсию") = Ложь Тогда
		// Запишем версию при необходимости
		ТекущийОбъект.ДополнительныеСвойства.Вставить("НомерВерсии", НомерВерсии);
		
		ИдентификаторФайлаВерсии = Объект[ИнформацияПоПрефиксамТитула.ВПрограмме + "ИдентификаторФайла"];
		
		ДатаВерсии = Объект[ИнформацияПоПрефиксамТитула.ВПрограмме + "ДатаФормированияФайла"]
						+ 60 * 60 * Час(Объект[ИнформацияПоПрефиксамТитула.ВПрограмме + "ВремяФормированияФайла"]) 
						+ 60 * Минута(Объект[ИнформацияПоПрефиксамТитула.ВПрограмме + "ВремяФормированияФайла"]) 
						+ Секунда(Объект[ИнформацияПоПрефиксамТитула.ВПрограмме + "ВремяФормированияФайла"]);
		
		ЭтоНоваяВерсия = Истина;
		Для Каждого СтрокаВерсии Из ВерсииТитулов Цикл
			Если СтрокаВерсии.Титул = ТекущийОбъект.ТекущийТитул 
			И СтрокаВерсии.НомерВерсии = НомерВерсии Тогда
				СтрокаВерсии.ИдентификаторФайла = ИдентификаторФайлаВерсии;	
				ЭтоНоваяВерсия = Ложь;
			КонецЕсли;	
		КонецЦикла;
	
		Если ЭтоНоваяВерсия = Истина Тогда
			НовСтрокаВерсии = ВерсииТитулов.Добавить();
			НовСтрокаВерсии.ДатаВерсии = ДатаВерсии;
			Если НовСтрокаВерсии.ДатаВерсии = Дата(1,1,1) Тогда
				НовСтрокаВерсии.ДатаВерсии = ТекущаяДатаСеанса();
			КонецЕсли;
			НовСтрокаВерсии.ИдентификаторФайла = ИдентификаторФайлаВерсии;
			НовСтрокаВерсии.НомерВерсии = НомерВерсии;
			НовСтрокаВерсии.Титул = ТекущийОбъект.ТекущийТитул;		
		КонецЕсли;
			
		ВерсияТитула = Новый Структура;
		ВерсияТитула.Вставить("НомерВерсии", НомерВерсии);
		ВерсияТитула.Вставить("ИдентификаторФайла", ИдентификаторФайлаВерсии);
		ВерсияТитула.Вставить("Титул", ТекущийОбъект.ТекущийТитул);
		ВерсияТитула.Вставить("ДатаВерсии", ДатаВерсии);
		ТекущийОбъект.ДополнительныеСвойства.Вставить("ВерсияТитула", ВерсияТитула);
	КонецЕсли;
	
	МассивВерсийТитула = Неопределено;
	СтруктураРеквизитов.Свойство(ИнформацияПоПрефиксамТитула.ВПрограмме, МассивВерсийТитула);
	Если МассивВерсийТитула <> Неопределено Тогда
		ТекущийОбъект.ДополнительныеСвойства.Вставить("СтруктураРеквизитов", МассивВерсийТитула[Мин(НомерВерсии, МассивВерсийТитула.ВГраница())]);
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	Оповестить("Запись_ДокументыЭПД", Объект.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура ТитулЗаказчикаДатаПриИзменении(Элемент)
	ПриИзмененииДанныхНаФорме(Элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ТитулЗаказчикаНомерПриИзменении(Элемент)
	ПриИзмененииДанныхНаФорме(Элемент.Имя);
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ОбменСГИСЭПДКлиент.ПриОткрытииПодчиненнойФормы(ЭтотОбъект); 
	
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды  

&НаКлиенте
Процедура ФормаСоздатьТитулОтзыва(Команда)
	
	Объект.ТекущийТитул = ПредопределенноеЗначение("Перечисление.ТипыЭлементовРегламентаЭДО.ЭПЭ_Титул3");
	УстановитьВидимостьСтраницыТитулЗаказчикаОтзыв();
	ОбменСГИСЭПДКлиентСервер.УстановитьДоступностьЭлементовЭПЭ(ЭтотОбъект);
	ЗаполнитьЗначенияПоУмолчаниюДляТекущегоТитула();
	
КонецПроцедуры


&НаКлиенте
Процедура ОткрытьЭлектронныйДокумент(Команда)
	
	ИнтерфейсДокументовЭДОКлиент.ОткрытьЭлектронныйДокументОбъектаУчета(Объект.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура НадписьСтатусаОшибкаОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	Если НавигационнаяСсылкаФорматированнойСтроки = "ОписаниеОшибки" Тогда
		СтандартнаяОбработка = Ложь;
		ОбменСГИСЭПДКлиент.ОткрытьОписаниеОшибки(Объект.Ссылка, ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НадписьСтатусаОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	Если НавигационнаяСсылкаФорматированнойСтроки = "ТекущиеДелаПоЭДО" Тогда
		СтандартнаяОбработка = Ложь;
		ИнтерфейсДокументовЭДОКлиент.ОткрытьЭлектронныйДокументОбъектаУчета(Объект.Ссылка);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьЧерезЭДО(Команда)
	
	ЭтотОбъект.Доступность = Ложь;
		
	Если ИзмененСоставУчастников = Истина
		Или ЗначениеЗаполнено(Объект.ИдентификаторЗаказчика) = Ложь
		Или ЗначениеЗаполнено(Объект.ИдентификаторЭкспедитора) = Ложь
		Тогда
		ЗаполнитьУчастников(Истина);
	Иначе
		ОтправитьЧерезЭДОПослеЗаписи();
	  КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьЧерезЭДОПовторно(Команда)
	
	ЭтотОбъект.Доступность = Ложь;
	
	// Сейчас при повторной отправке происходит ошибка на стороне оператора,
	// у них это считается дубликатом (одинаковый титул в рамках одного документооборота)
	// Это не верно, т.к. повторная отправка возможна (после УОУ или ошибки от ГИС)
	ОтправитьЧерезЭДОПослеЗаписи(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура Проверить(Команда)
	
	Если ЗначениеЗаполнено(Объект.ТекущийТитул) = Ложь Тогда
		Возврат;	
	КонецЕсли;
	
	Если ИзмененСоставУчастников = Истина
		Или ЗначениеЗаполнено(Объект.ИдентификаторЗаказчика) = Ложь
		Или ЗначениеЗаполнено(Объект.ИдентификаторЭкспедитора) = Ложь
		Тогда
		ЗаполнитьУчастников();
	КонецЕсли;
	
	ИнформацияПоПрефиксамТитула = ОбменСГИСЭПДКлиентСервер.ПрефиксТитулаПоЭлементуРегламентаЭДО(Объект.ТекущийТитул);
	ОбменСГИСЭПДКлиент.ЗаполнитьИдентификациюФайлаОбмена(ЭтотОбъект, ИнформацияПоПрефиксамТитула, ИдентификаторОтправителя());
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОшибкиЗаполненияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ТекущиеДанные = ЭтотОбъект["ОшибкиЗаполнения"].НайтиПоИдентификатору(ВыбраннаяСтрока);
	ЭтотОбъект.ПереходыПоОшибкам = ТекущиеДанные.Описание.Переходы;
	ОбменСГИСЭПДКлиент.ПоказатьОшибкуЗаполнения(ЭтотОбъект, ТекущиеДанные, ИдентификаторОтправителя());

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_НадписьОшибкиЗакрытьНажатие(Элемент)
	
	Элементы.ГруппаОшибки.Видимость = Ложь;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЗначенияПоУмолчаниюДляТекущегоТитула()
	
	КонтейнерОтображаемойВерсии = Неопределено;
	
	Если (ЗначениеЗаполнено(Объект.Ссылка) = Ложь 
		Или Объект.ТекущийТитул = ПредопределенноеЗначение("Перечисление.ТипыЭлементовРегламентаЭДО.ЭПЭ_Титул1")) Тогда
				
		Если ЗначениеЗаполнено(Объект.ВидДокумента) = Ложь Тогда
			Объект.ВидДокумента = ЭлектронныеДокументыЭДО.ВидДокументаПоТипу(ПредопределенноеЗначение("Перечисление.ТипыДокументовЭДО.ЭПЭ"));
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Объект.ТитулЗаказчикаДата) = Ложь Тогда
			Объект.ТитулЗаказчикаДата = ТекущаяДатаСеанса();	
		КонецЕсли;
		
		ОбменСГИСЭПДКлиентСервер.УстановитьЗначениеРеквизитаВСтруктуреФормы(ЭтотОбъект, 
				"ТитулЗаказчикаДокГруз", 
				Ложь, Ложь,
				КонтейнерОтображаемойВерсии, Истина);	
		
	ИначеЕсли ЗначениеЗаполнено(Объект.Ссылка)
		И Объект.ТекущийТитул = ПредопределенноеЗначение("Перечисление.ТипыЭлементовРегламентаЭДО.ЭПЭ_Титул2") Тогда
		
		СкопироватьИныхПолучателейИзТитулаЗаказчика(); 
		
		Данные = ОбменСГИСЭПД.ПолучитьДанныеОЗаписиВРеестреУведомленийТЭДПоПоследнемуДокументу(Объект.Организация, Объект.ВидДокумента);   
		
		ОбменСГИСЭПДКлиентСервер.УстановитьЗначениеРеквизитаВСтруктуреФормы(ЭтотОбъект, 
				"ТитулЭкспедитораНомРеестр", 
				Данные.Номер, Ложь,
				КонтейнерОтображаемойВерсии);
				
		ОбменСГИСЭПДКлиентСервер.УстановитьЗначениеРеквизитаВСтруктуреФормы(ЭтотОбъект, 
				"ТитулЭкспедитораДатаРеестр", 
				Данные.Дата, Ложь,
				КонтейнерОтображаемойВерсии, Истина);
	
	ИначеЕсли ЗначениеЗаполнено(Объект.Ссылка)
		И Объект.ТекущийТитул = ПредопределенноеЗначение("Перечисление.ТипыЭлементовРегламентаЭДО.ЭПЭ_Титул3") Тогда
		
		СкопироватьИныхПолучателейИзТитулаЗаказчика();
		
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ДокументыОснования(Команда)
	
	ОбменСГИСЭПДКлиент.ОткрытьФормуДокументовОснований(ЭтотОбъект);
					
КонецПроцедуры

&НаСервере
Процедура СкопироватьИныхПолучателейИзТитулаЗаказчика()
	
	Если ЗначениеЗаполнено(Объект.ТекущийТитул) Тогда
		
		ИнформацияПоПрефиксамТитула = ОбменСГИСЭПДКлиентСервер.ПрефиксТитулаПоЭлементуРегламентаЭДО(Объект.ТекущийТитул);
		
		ИтераторСтрокиОткуда = 1;
		КлючОткуда = "ТитулЗаказчикаИдентификаторыИныхПолучателейФайла__" + ИтераторСтрокиОткуда + "__" + "ИдентификаторИногоПолучателя";
		
		ЗначениеОткуда = Неопределено;
		КонтейнерОтображаемойВерсии = ОбменСГИСЭПДКлиентСервер.КонтейнерОтображаемойВерсииРеквизита(ЭтотОбъект, КлючОткуда);
		СтруктураВерсииТитула = КонтейнерОтображаемойВерсии.СтруктураРеквизитовЗаполнение[КонтейнерОтображаемойВерсии.ПрефиксТитула][КонтейнерОтображаемойВерсии.НомерВерсии];
		КонтейнерОтображаемойВерсииКуда = Неопределено;
		
		ИтераторСтрокиКуда = 0;
		
		Пока СтруктураВерсииТитула.Свойство(КлючОткуда, ЗначениеОткуда) Цикл
			
			Если ЗначениеОткуда <> Объект.ИдентификаторЗаказчика
				И ЗначениеОткуда <> Объект.ИдентификаторЭкспедитора Тогда
				
				ИтераторСтрокиКуда = ИтераторСтрокиКуда + 1;
				КлючКуда = ИнформацияПоПрефиксамТитула.ВПрограмме 
								+ "ИдентификаторыИныхПолучателейФайла__" + ИтераторСтрокиКуда + "__" + "ИдентификаторИногоПолучателя";
							
				ОбменСГИСЭПДКлиентСервер.УстановитьЗначениеРеквизитаВСтруктуреФормы(ЭтотОбъект, КлючКуда, ЗначениеОткуда, , КонтейнерОтображаемойВерсииКуда, Истина);	
				
			КонецЕсли;
			
			ИтераторСтрокиОткуда = ИтераторСтрокиОткуда + 1;
			КлючОткуда = "ТитулЗаказчикаИдентификаторыИныхПолучателейФайла__" + ИтераторСтрокиОткуда + "__" + "ИдентификаторИногоПолучателя";  
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьУчастников(ЭтоНастройкаПередОтправкой = Ложь)
	
	КлючНастроекОтправки = НастройкиЭДОКлиентСервер.НовыйКлючНастроекОтправки();
	КлючНастроекОтправки.ВидДокумента = Объект.ВидДокумента;
	КлючНастроекОтправки.ВсегдаСоздаватьАвтоматическоеПриглашение = Истина;
	
	Если ЗначениеЗаполнено(Объект.СсылкаТитулЗаказчикаСоставитель) Тогда
		СоставительПервогоТитула = Объект.СсылкаТитулЗаказчикаСоставитель;
	Иначе
		СоставительПервогоТитула = Объект.СсылкаТитулЗаказчикаЗаказчик;	
	КонецЕсли;
	
	СоставительВторогоТитула = Объект.СсылкаТитулЗаказчикаЭкспедитор;
	
	Если Объект.ЭтоВходящий = Истина Тогда
		КлючНастроекОтправки.Отправитель = СоставительВторогоТитула;
		КлючНастроекОтправки.Получатель = СоставительПервогоТитула;
	Иначе
		КлючНастроекОтправки.Отправитель = СоставительПервогоТитула;
		КлючНастроекОтправки.Получатель = СоставительВторогоТитула; 
	КонецЕсли;
	
	НастройкиОтправки = НастройкиОтправкиЭДОСлужебныйВызовСервера.НастройкиОтправки(КлючНастроекОтправки);
	
	ПараметрыНастройкиОбменаСКонтрагентом = НастройкиЭДОКлиент.НовыеПараметрыНастройкиОбменаСКонтрагентом();
	ПараметрыНастройкиОбменаСКонтрагентом.НастройкаОдногоДокумента = Истина;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("КлючНастроекОтправки", КлючНастроекОтправки);
	ДополнительныеПараметры.Вставить("ПараметрыНастройкиОбменаСКонтрагентом", ПараметрыНастройкиОбменаСКонтрагентом);
	ДополнительныеПараметры.Вставить("ПараметрыЗаписи", Новый Структура);
	ДополнительныеПараметры.Вставить("ЭтоНастройкаПередОтправкой", ЭтоНастройкаПередОтправкой);
	
	ОповещениеОкончаниеНастройки = Новый ОписаниеОповещения("ЗаполнитьУчастников_ПослеНастроек", ЭтотОбъект, ДополнительныеПараметры);
	Если НастройкиОтправки = Неопределено И ЭтоНастройкаПередОтправкой = Истина Тогда	
		НастройкиЭДОКлиент.НастроитьОбменСКонтрагентом(КлючНастроекОтправки, ОповещениеОкончаниеНастройки, ПараметрыНастройкиОбменаСКонтрагентом);
	Иначе
		ВыполнитьОбработкуОповещения(ОповещениеОкончаниеНастройки, НастройкиОтправки); 
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьУчастников_ПослеНастроек(Настройка, ДополнительныеПараметры) Экспорт
	
	Если Настройка = Неопределено Тогда
		ЭтотОбъект.Доступность = Истина;
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.СсылкаТитулЗаказчикаСоставитель) Тогда
		СоставительПервогоТитула = Объект.СсылкаТитулЗаказчикаСоставитель;
	Иначе
		СоставительПервогоТитула = Объект.СсылкаТитулЗаказчикаЗаказчик;	
	КонецЕсли;
	
	СоставительВторогоТитула = Объект.СсылкаТитулЗаказчикаЭкспедитор;
	
	Если Настройка.Отправитель = СоставительПервогоТитула Тогда
		Объект.ИдентификаторЗаказчика = Настройка.ИдентификаторОтправителя;
	КонецЕсли;
	
	Если Настройка.Отправитель = СоставительВторогоТитула Тогда
		Объект.ИдентификаторЭкспедитора = Настройка.ИдентификаторОтправителя;
	КонецЕсли;
	
	Если Настройка.Получатель = СоставительПервогоТитула Тогда
		Объект.ИдентификаторЗаказчика = Настройка.ИдентификаторПолучателя;
	КонецЕсли;
	
	Если Настройка.Получатель = СоставительВторогоТитула Тогда
		Объект.ИдентификаторЭкспедитора = Настройка.ИдентификаторПолучателя;
	КонецЕсли;	
																		
	ИзмененСоставУчастников = Ложь;
	
	ЭтоНастройкаПередОтправкой = Неопределено;
	ДополнительныеПараметры.Свойство("ЭтоНастройкаПередОтправкой", ЭтоНастройкаПередОтправкой);
	Если ЭтоНастройкаПередОтправкой = Истина
		И ЗначениеЗаполнено(Объект.ИдентификаторЗаказчика)
		И ЗначениеЗаполнено(Объект.ИдентификаторЭкспедитора) Тогда
			ОтправитьЧерезЭДОПослеЗаписи();
	Иначе
		ЭтотОбъект.Доступность = Истина;
		ПараметрыЗаписи = Новый Структура;
		ПараметрыЗаписи.Вставить("НеТребуетсяИдентификацияФайла");
		Записать(ПараметрыЗаписи);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция УстановитьНомерДокумента()
	
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	ДокументОбъект.УстановитьНовыйНомер();
	
	Возврат ДокументОбъект.Номер;
	
КонецФункции

&НаКлиенте
Процедура ОтправитьЧерезЭДОПослеЗаписи(Повторно = Ложь)
		
	Если ЗначениеЗаполнено(Объект.Ссылка) = Ложь Тогда
		Объект.Номер = УстановитьНомерДокумента();
	КонецЕсли;	
	
	ОбменСГИСЭПДКлиент.ОтправитьЭПД(ЭтотОбъект, Ложь, Повторно);		
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыполненияДействийПоЭДО(Результат, ДополнительныеПараметры) Экспорт
	
	ДействиеОтправить = ПредопределенноеЗначение("Перечисление.ДействияПоЭДО.Отправить");
	КоличествоОтправлено = Результат.ОбработаноПоДействиям.Получить(ДействиеОтправить);
	
	Если КоличествоОтправлено <> Неопределено И КоличествоОтправлено > 0 Тогда
		Если ДополнительныеПараметры.ЭтоИсправление Тогда
			ОбменСГИСЭПДВызовСервера.ОтметитьИсправлениеДокумента(Объект.Ссылка);	
		КонецЕсли;
		ПараметрыЗаписи = Новый Структура;
		ПараметрыЗаписи.Вставить("НеТребуетсяИдентификацияФайла");
		ПараметрыЗаписи.Вставить("ТребуетсяОбновитьДанныеОПодписантахВСтруктуреФормы");
		Записать(ПараметрыЗаписи);
		
		ОтображаемыеВерсииТитулов = Неопределено;
		
		ТекстОповещения = НСтр("ru = 'Титул """ + Объект.ТекущийТитул + """ отправлен'");		
		ЗаголовокОповещения = НСтр("ru = 'Электронные документы'");	
		ДействиеПриНажатии = Неопределено;
		КартинкаОповещения = БиблиотекаКартинок.ЭмблемаСервиса1СЭДО48;
		
		ПодключитьОбработчикОжидания("ОбновлениеДоступностиЭлементов", 2, Истина);	
		
		#Если Не МобильноеПриложениеКлиент Тогда
		ПоказатьОповещениеПользователя(ЗаголовокОповещения, ДействиеПриНажатии, ТекстОповещения, КартинкаОповещения,
			СтатусОповещенияПользователя.Важное);
		#КонецЕсли
	Иначе
		ЭтотОбъект.Доступность = Истина;
	КонецЕсли;
	
	Если ДополнительныеПараметры.НаборДействий.Получить(ПредопределенноеЗначение("Перечисление.ДействияПоЭДО.ОтправитьВАрхив")) = Истина Тогда
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыполненияДействийПоЭДО_ОбработкаОшибки(ИнформацияОбОшибке, СтандартнаяОбработка, ДополнительныеПараметры) Экспорт
	
	ОбменСГИСЭПДКлиент.ОчиститьИдФайлТекущегоТитула(ЭтотОбъект, Истина);
	
	ПодключитьОбработчикОжидания("ОбновлениеДоступностиЭлементов", 2, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновлениеДоступностиЭлементов()

	ЭтотОбъект.Доступность = Истина;
	
	ВводимТитулОтзывПоручения = Ложь;
	
	ОбменСГИСЭПДКлиентСервер.УстановитьДоступностьЭлементовЭПЭ(ЭтотОбъект);
	УстановитьТекущийШагПомощника();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииДанныхНаФорме(ИмяЭлемента)
	
	НомерВерсии = 0;
	Для Каждого СтрВерсия Из ВерсииТитулов Цикл
		Если СтрВерсия.Титул = Объект.ТекущийТитул И СтрВерсия.НомерВерсии > НомерВерсии Тогда
			НомерВерсии = СтрВерсия.НомерВерсии;
		КонецЕсли;	
	КонецЦикла;

	СтруктураРеквизитовФормы = Новый Структура(ЭтотОбъект.ОписаниеРеквизитовФормы.ПараметрыФормы);
	СтруктураРеквизитовОбъекта = Новый Структура(ЭтотОбъект.ОписаниеРеквизитовФормы.РеквизитыОбъекта);
	
	Если СтруктураРеквизитовФормы.Свойство(ИмяЭлемента) Тогда
		ЗначениеРеквизита = ЭтотОбъект[ИмяЭлемента];
	ИначеЕсли СтруктураРеквизитовОбъекта.Свойство(ИмяЭлемента) Тогда
		ЗначениеРеквизита = Объект[ИмяЭлемента];
	КонецЕсли;
	
	ОбменСГИСЭПДКлиентСервер.УстановитьЗначениеРеквизитаВСтруктуреФормы(ЭтотОбъект, ИмяЭлемента, ЗначениеРеквизита, , , Истина);
	
КонецПроцедуры

&НаКлиенте
Функция ОписаниеРеквизитовФормы() Экспорт
	
	Возврат ОписаниеРеквизитовФормыСервер();
	
КонецФункции

&НаСервере
Функция ОписаниеРеквизитовФормыСервер()
	
	Возврат ОбменСГИСЭПД.ОписаниеРеквизитовФормы(ЭтаФорма);
		
КонецФункции

&НаКлиенте
Процедура ОтменаВводаДопТитула(Команда)
	
	Объект.ТекущийТитул = Неопределено; 
	ВводимТитулОтзывПоручения = Ложь; 
	ОбменСГИСЭПДКлиентСервер.УстановитьДоступностьЭлементовЭПЭ(ЭтотОбъект);
	
	УстановитьТекущийШагПомощника();

КонецПроцедуры

&НаКлиенте
Процедура ТитулЗаказчикаОтзывДатаОтзПриИзменении(Элемент)
	ПриИзмененииДанныхНаФорме(Элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ТитулЗаказчикаОтзывДатаПрИспПриИзменении(Элемент)
	ПриИзмененииДанныхНаФорме(Элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ТитулЗаказчикаОтзывВремяПрИспПриИзменении(Элемент)
	ПриИзмененииДанныхНаФорме(Элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ТитулЗаказчикаОтзывПричОтзПриИзменении(Элемент)
	ПриИзмененииДанныхНаФорме(Элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ТитулЗаказчикаОтзывУказГрузПриИзменении(Элемент)
	ПриИзмененииДанныхНаФорме(Элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ТитулЗаказчикаОтзывСумФактРасхПриИзменении(Элемент)
	ПриИзмененииДанныхНаФорме(Элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ТитулЭкспедитораНомРеестрПриИзменении(Элемент)
	ПриИзмененииДанныхНаФорме(Элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ТитулЭкспедитораДатаРеестрПриИзменении(Элемент)
	ПриИзмененииДанныхНаФорме(Элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТитулЭкспедитораДопИнфЭксп(Команда)
	ОбменСГИСЭПДКлиент.ВывестиФормуВводаДанных(ЭтотОбъект, Команда.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТитулЭкспедитораИныеДанЭксп(Команда)
	ОбменСГИСЭПДКлиент.ВывестиФормуВводаДанных(ЭтотОбъект, Команда.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТитулЗаказчикаИныеДанныеИОговоркиКлиента(Команда)
	ОбменСГИСЭПДКлиент.ВывестиФормуВводаДанных(ЭтотОбъект, Команда.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТитулЗаказчикаОтзывИныеДанКлнт(Команда)
	ОбменСГИСЭПДКлиент.ВывестиФормуВводаДанных(ЭтотОбъект, Команда.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТитулЗаказчикаОтзывСвВозврГруз(Команда)
	ОбменСГИСЭПДКлиент.ВывестиФормуВводаДанных(ЭтотОбъект, Команда.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТитулЗаказчикаСоставительДоверенность(Команда)
	
	ОбменСГИСЭПДКлиент.ВывестиФормуВводаДанных(ЭтотОбъект, Команда.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТитулЗаказчикаДоговор(Команда)	
	ОбменСГИСЭПДКлиент.ВывестиФормуВводаДанных(ЭтотОбъект, Команда.Имя);	
КонецПроцедуры  

&НаКлиенте
Процедура ЗаполнитьТитулЗаказчикаЗаявкиНаТранспортировку(Команда)
	ОбменСГИСЭПДКлиент.ВывестиФормуВводаДанных(ЭтотОбъект, Команда.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТитулЗаказчикаСопроводительныеДокументы(Команда)
	
	ОбменСГИСЭПДКлиент.ВывестиФормуВводаДанных(ЭтотОбъект, Команда.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТитулЗаказчикаГрузы(Команда)
	
	ОбменСГИСЭПДКлиент.ВывестиФормуВводаДанных(ЭтотОбъект, Команда.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура СсылкаТитулЗаказчикаЗаказчикПриИзменении(Элемент)

	ПриИзмененииДанныхНаФорме(Элемент.Имя);
	
	ПараметрыЗаполнения = Новый Структура ("АдресВСвободнойФорме", Истина);
	ОбменСГИСЭПДКлиентСервер.ЗаполнитьРеквизитыПоСсылке(Элемент, ЭтотОбъект,,, ПараметрыЗаполнения);
	
КонецПроцедуры

&НаКлиенте
Процедура СсылкаТитулЗаказчикаЭкспедиторПриИзменении(Элемент)

	ПриИзмененииДанныхНаФорме(Элемент.Имя); 
	
	ПараметрыЗаполнения = Новый Структура ("АдресВСвободнойФорме", Истина);
	ОбменСГИСЭПДКлиентСервер.ЗаполнитьРеквизитыПоСсылке(Элемент, ЭтотОбъект,,, ПараметрыЗаполнения);
	
КонецПроцедуры


&НаКлиенте
Процедура ВариантПоДоверенностиЗаЗаказчикаПриИзменении(Элемент)
	
	ОбменСГИСЭПДКлиентСервер.ИзменитьОформлениеФормы(ЭтотОбъект, Элемент.Имя);
	
	ВариантПоДоверенностиЗаЗаказчикаПриИзмененииСервер();

КонецПроцедуры

&НаСервере
Процедура ВариантПоДоверенностиЗаЗаказчикаПриИзмененииСервер()
	
	ОрганизацияОписаниеТипов = Метаданные.ОпределяемыеТипы.Организация.Тип;
	КонтрагентОписаниеТипов = Метаданные.ОпределяемыеТипы.КонтрагентБЭД.Тип;
	
	Если Объект.ЭтоВходящий = Ложь Тогда	
		Если ВариантПоДоверенностиЗаЗаказчика = 1 Тогда
			Элементы.СсылкаТитулЗаказчикаЗаказчик.ОграничениеТипа = КонтрагентОписаниеТипов;
			Элементы.СсылкаТитулЗаказчикаСоставитель.ОграничениеТипа = ОрганизацияОписаниеТипов;
		Иначе
			Элементы.СсылкаТитулЗаказчикаЗаказчик.ОграничениеТипа = ОрганизацияОписаниеТипов;
			Элементы.СсылкаТитулЗаказчикаСоставитель.ОграничениеТипа = Новый ОписаниеТипов("Неопределено");	
			Объект.СсылкаТитулЗаказчикаСоставитель = Неопределено;
			
			ОбменСГИСЭПДКлиентСервер.УстановитьЗначениеРеквизитаВСтруктуреФормы(ЭтотОбъект, 
				"ТитулЗаказчикаЗаказчикПредставительЗаказчика", , , , Истина);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура СсылкаТитулЗаказчикаСоставительПриИзменении(Элемент)
	
	ПриИзмененииДанныхНаФорме(Элемент.Имя);
	
	ИзмененСоставУчастников = Истина;
	
	НаименованиеСоставителя = Строка(Объект.СсылкаТитулЗаказчикаСоставитель);
	
	Если ЗначениеЗаполнено(НаименованиеСоставителя) Тогда
		ОбменСГИСЭПДКлиентСервер.УстановитьЗначениеРеквизитаВСтруктуреФормы(ЭтотОбъект, 
			"ТитулЗаказчикаЗаказчикПредставительЗаказчика", НаименованиеСоставителя, , , Истина);
	Иначе
		ОбменСГИСЭПДКлиентСервер.УстановитьЗначениеРеквизитаВСтруктуреФормы(ЭтотОбъект, 
			"ТитулЗаказчикаЗаказчикПредставительЗаказчика", , , , Истина);	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СсылкаТитулЗаказчикаДоговорПриИзменении(Элемент)
	ПриИзмененииДанныхНаФорме(Элемент.Имя);
	ОбменСГИСЭПДКлиентСервер.ЗаполнитьРеквизитыПоСсылке(Элемент, ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура СсылкаТитулЗаказчикаДоговорНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	Организация = ?(ВариантПоДоверенностиЗаЗаказчика, Объект.СсылкаТитулЗаказчикаСоставитель, Объект.СсылкаТитулЗаказчикаЗаказчик);
	Контрагент = Объект.СсылкаТитулЗаказчикаЭкспедитор;
	
	ОбменСГИСЭПДКлиентПереопределяемый.ЗаполнениеДоговораНачалоВыбора( Организация, Контрагент, Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ИныеПолучатели(Команда)
	
	ТолькоПросмотрИныхПолучателей = Элементы.Страницы.ТекущаяСтраница.ТолькоПросмотр
										Или Элементы.Страницы.ТекущаяСтраница <> Элементы.СтраницаТитулЗаказчика;
		
	Если Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаТитулЗаказчика Тогда
		ИмяТаблицы = "ТитулЗаказчикаИдентификаторыИныхПолучателейФайла";	
	ИначеЕсли Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаТитулЭкспедитора Тогда
		ИмяТаблицы = "ТитулЭкспедитораИдентификаторыИныхПолучателейФайла";
	КонецЕсли;
	
	Организация = Неопределено;
	ТипОрганизация = ОбменСГИСЭПДВызовСервера.ПолучитьТипОрганизация();
	Если ТипЗнч(Объект.СсылкаТитулЗаказчикаЭкспедитор) = ТипОрганизация Тогда
		Организация = Объект.СсылкаТитулЗаказчикаЭкспедитор;
	ИначеЕсли ТипЗнч(Объект.СсылкаТитулЗаказчикаСоставитель) = ТипОрганизация Тогда
		Организация = Объект.СсылкаТитулЗаказчикаСоставитель;
	ИначеЕсли ТипЗнч(Объект.СсылкаТитулЗаказчикаЗаказчик) = ТипОрганизация Тогда
		Организация = Объект.СсылкаТитулЗаказчикаЗаказчик;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Организация) = Ложь Тогда
		ПоказатьПредупреждение(, "Сначала нужно выбрать организацию, для которой настроена учетная запись 1С-ЭДО");	
		Возврат;	
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Организация", Организация);
	
	МассивПолучателей = Новый Массив;
	ИтераторСтроки = 1;
	КлючСтруктуры = ИмяТаблицы + "__" + ИтераторСтроки + "__ИдентификаторИногоПолучателя";
	ЗначениеРеквизита = Неопределено;
	КонтейнерОтображаемойВерсии = ОбменСГИСЭПДКлиентСервер.КонтейнерОтображаемойВерсииРеквизита(ЭтотОбъект, ИмяТаблицы);
	СтруктураВерсииТитула = КонтейнерОтображаемойВерсии.СтруктураРеквизитовЗаполнение[КонтейнерОтображаемойВерсии.ПрефиксТитула][КонтейнерОтображаемойВерсии.НомерВерсии];
	Пока СтруктураВерсииТитула.Свойство(КлючСтруктуры, ЗначениеРеквизита) Цикл
		Если ЗначениеРеквизита <> Объект.ИдентификаторЗаказчика
			И ЗначениеРеквизита <> Объект.ИдентификаторЭкспедитора Тогда
			МассивПолучателей.Добавить(ЗначениеРеквизита);
		КонецЕсли;
		ИтераторСтроки = ИтераторСтроки + 1;
		КлючСтруктуры = ИмяТаблицы + "__" + ИтераторСтроки + "__ИдентификаторИногоПолучателя";
	КонецЦикла;
	
	ПараметрыФормы.Вставить("ВидДокумента", Объект.ВидДокумента);
	ПараметрыФормы.Вставить("ИмяТаблицы", ИмяТаблицы);
	ПараметрыФормы.Вставить("МассивПолучателей", МассивПолучателей);
	ПараметрыФормы.Вставить("ТолькоПросмотр", ТолькоПросмотрИныхПолучателей);
	
	ОписаниеИныеПолучатели_Закрытие = Новый ОписаниеОповещения("ИныеПолучатели_Закрытие", ЭтотОбъект, ПараметрыФормы);
	
	ОткрытьФорму("Документ.ЭлектронноеПоручениеЭкспедитору.Форма.ИныеПолучатели", ПараметрыФормы, ЭтотОбъект, 
					УникальныйИдентификатор, , , ОписаниеИныеПолучатели_Закрытие, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
					
КонецПроцедуры

&НаКлиенте
Процедура ИныеПолучатели_Закрытие(Результат, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(Результат) = Тип("Массив") Тогда
		ОбменСГИСЭПДКлиентСервер.УдалитьСтрокиТаблицыИзСтруктурыФормы(ЭтотОбъект, ДополнительныеПараметры.ИмяТаблицы);
		ИтераторСтроки = 1;
		Для Каждого ИДПолучателя Из Результат Цикл
			Если ИДПолучателя <> Объект.ИдентификаторЗаказчика
			И ИДПолучателя <> Объект.ИдентификаторЭкспедитора Тогда
				КлючКуда = ДополнительныеПараметры.ИмяТаблицы + "__" + ИтераторСтроки + "__ИдентификаторИногоПолучателя";
				ОбменСГИСЭПДКлиентСервер.УстановитьЗначениеРеквизитаВСтруктуреФормы(ЭтотОбъект, КлючКуда, ИДПолучателя, , , Истина);
				ИтераторСтроки = ИтераторСтроки + 1;
			КонецЕсли;
		КонецЦикла;	
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

#Область Навигация

&НаКлиенте

Процедура НавигацияКартинкаОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;

	ОбработатьИзменениеШага(НавигационнаяСсылкаФорматированнойСтроки, НавигационнаяСсылкаФорматированнойСтроки);
	
КонецПроцедуры

&НаКлиенте
Процедура Шаг1ОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОбработатьИзменениеШага("Шаг1", НавигационнаяСсылкаФорматированнойСтроки);

КонецПроцедуры

&НаКлиенте
Процедура Шаг2ОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОбработатьИзменениеШага("Шаг2", НавигационнаяСсылкаФорматированнойСтроки);

КонецПроцедуры  

&НаКлиенте
Процедура Шаг3ОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОбработатьИзменениеШага("Шаг3", НавигационнаяСсылкаФорматированнойСтроки);

КонецПроцедуры

#КонецОбласти


#Область НавигацияПоСтраницам

&НаКлиенте
Процедура ИнкрементироватьОтображаемуюВерсиюТитула(ТитулСтрока, Инкремент)
	
	Если Инкремент = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если ОтображаемыеВерсииТитулов = Неопределено Тогда
		ОтображаемыеВерсииТитулов = Новый Структура;
	Иначе
		ТекущееЗначениеВерсии = Неопределено;
		ОтображаемыеВерсииТитулов.Свойство(ТитулСтрока, ТекущееЗначениеВерсии);
		Если ТекущееЗначениеВерсии <> Неопределено Тогда
			ОтображаемыеВерсииТитулов.Вставить(ТитулСтрока, ТекущееЗначениеВерсии + Инкремент);
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьСтраницы(ОтображаемаяСтраница)
	
	ОтображаемаяСтраницаЦелевая = ПодменитьСтраницуДляТестированияФормы(ОтображаемаяСтраница);

	// Чтобы не отрастали лишние скролл-бары по высоте из-за разного числа элементов
	// на разных страницах, оставляем видимость только у одной - отображаемой страницы.
	
	Для каждого Стр Из Элементы.Страницы.ПодчиненныеЭлементы Цикл
		Стр.Видимость = (Стр = ОтображаемаяСтраницаЦелевая);
	КонецЦикла;

	Элементы.Страницы.ТекущаяСтраница  = ОтображаемаяСтраницаЦелевая;
	
	
	ОбменСГИСЭПД.ПодготовитьФормуДляОтметкиОбязательныхПолей(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Функция ПодменитьСтраницуДляТестированияФормы(ОтображаемаяСтраница)
	
	Возврат ОтображаемаяСтраница;
	
КонецФункции

&НаСервере
Процедура УстановитьТекущийШагПомощника(ПредыдущийТекущийТитул = Неопределено)
	
	Если Параметры.Свойство("ТитулСтраницы") Тогда
		ТитулСтраницы = Параметры.ТитулСтраницы;
	Иначе
		ТитулСтраницы = ?(ЗначениеЗаполнено(Объект.ТекущийТитул), Объект.ТекущийТитул, ПредыдущийТекущийТитул);
	КонецЕсли;
	
	НачатьСПервойСтраницы = ТолькоПросмотр ИЛИ НЕ ЗначениеЗаполнено(Объект.Ссылка);

	Если НачатьСПервойСтраницы Тогда		
		УстановитьВидимостьСтраницыНачало("Шаг1");		
	Иначе		
		Если ТитулСтраницы = ПредопределенноеЗначение("Перечисление.ТипыЭлементовРегламентаЭДО.ЭПЭ_Титул2") Тогда			
			УстановитьВидимостьСтраницыТитулПеревозчика("Шаг2");
		ИначеЕсли ТитулСтраницы = ПредопределенноеЗначение("Перечисление.ТипыЭлементовРегламентаЭДО.ЭПЭ_Титул3") Тогда			
			УстановитьВидимостьСтраницыТитулЗаказчикаОтзыв();
		Иначе			
			УстановитьВидимостьСтраницыНачало("Шаг1");			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СохранитьТекущийШагПомощника()
	
	Если ТолькоПросмотр ИЛИ НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьСтраницыНачало(ИмяШага)

	УстановитьВидимостьСтраницы(Элементы.СтраницаТитулЗаказчика);
	
	СтруктураНавигации = НавигацияПомощника();
	ИмяШагаПараметр = СтруктураНавигации[ИмяШага].СтруктураПараметровФормы.НавигацияПараметрФормы;
	
	РазместитьНавигацию(ИмяШагаПараметр);
	
	СохранитьТекущийШагПомощника();

КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьСтраницыТитулПеревозчика(ИмяШага)

	УстановитьВидимостьСтраницы(Элементы.СтраницаТитулЭкспедитора);
	
	СтруктураНавигации = НавигацияПомощника();
	ИмяШагаПараметр = СтруктураНавигации[ИмяШага].СтруктураПараметровФормы.НавигацияПараметрФормы;
	
	РазместитьНавигацию(ИмяШагаПараметр);
	
	СохранитьТекущийШагПомощника();

КонецПроцедуры  

&НаСервере
Процедура  УстановитьВидимостьСтраницыТитулЗаказчикаОтзыв() 
	
	ВводимТитулОтзывПоручения = Объект.ТекущийТитул = Перечисления.ТипыЭлементовРегламентаЭДО.ЭПЭ_Титул3;

	УстановитьВидимостьСтраницы(Элементы.СтраницаТитулЗаказчикаОтзыв);
	
	РазместитьНавигацию("ТитулЗаказчикаОтзыв");
	
	СохранитьТекущийШагПомощника();
	
КонецПроцедуры 	


&НаСервере
Функция ИмяПомощника()

	Возврат "ЭлектронноеПоручениеЭкспедитору";

КонецФункции

&НаСервере
Функция СтатусТитулаОтзыва(Форма) 
	
	Если ЗначениеЗаполнено(Форма.Объект.Ссылка) Тогда
		
		ТитулЗаказчикаОтзывИдентификаторФайла = 
			ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Форма.Объект.Ссылка, "ТитулЗаказчикаОтзывИдентификаторФайла");
		
		Если ЗначениеЗаполнено(ТитулЗаказчикаОтзывИдентификаторФайла)
			Или Форма.ВводимТитулОтзывПоручения Тогда
			Возврат 1;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат 0; 
	
КонецФункции

&НаСервере
Функция НавигацияПомощника()

	СтруктураНавигации = Новый Структура;
	
	СтруктураНавигации.Вставить(НавигацияПомощниковСВозвратомЭПД.ИмяШага(1), СтруктураШагаНачало(1));
	СтруктураНавигации.Вставить(НавигацияПомощниковСВозвратомЭПД.ИмяШага(2), СтруктураШагаПодтверждение(2)); 
	
	Если СтатусТитулаОтзыва(ЭтотОбъект) > 0 Тогда
		СтруктураНавигации.Вставить(НавигацияПомощниковСВозвратомЭПД.ИмяШага(3), СтруктураШагаОтмены(3));
	КонецЕсли;
	
	Для Каждого КиЗ Из СтруктураНавигации Цикл
		ШагВыполнен = Ложь;
		Для Каждого СтрВерсия Из ВерсииТитулов Цикл
			Если СтрВерсия.Титул = КиЗ.Значение.ТипЭлементаРегламента И СтрВерсия.ИдентификаторФайла <> "" Тогда
				ШагВыполнен = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		КиЗ.Значение.Выполнен = ШагВыполнен; 	
		КиЗ.Значение.Доступен = КиЗ.Значение.Доступен Или КиЗ.Значение.Выполнен;
	КонецЦикла;
	
	Возврат СтруктураНавигации;
	
КонецФункции

&НаСервере
Функция СтруктураШагаНачало(НомерШага)
	
	Титул = ПредопределенноеЗначение("Перечисление.ТипыЭлементовРегламентаЭДО.ЭПЭ_Титул1");
	Отбор = Новый Структура("Титул", Титул);
	СтрокиВерсий = ВерсииТитулов.Выгрузить(Отбор, "НомерВерсии");
	
	СтруктураШага                = НавигацияПомощниковСВозвратомЭПД.НовыйСтруктураШага();
	СтруктураШага.ИмяПомощника   = ИмяПомощника();
	СтруктураШага.НомерШага      = НомерШага;
	СтруктураШага.ТекстНавигации = НСтр("ru='Оформление'");
	СтруктураШага.СтруктураПараметровФормы.НавигацияПараметрФормы = "ТитулЗаказчика";
	СтруктураШага.ТипЭлементаРегламента = Титул;
	СтруктураШага.Выполнен = ЗначениеЗаполнено(Объект.ТитулЗаказчикаИдентификаторФайла); 
	СтруктураШага.Доступен = Истина;
	СтруктураШага.КоличествоВерсий = Макс(СтрокиВерсий.Количество(), 1);
	СтруктураШага.НомерВерсии = ОтображаемаяВерсияТитула(СтрокиВерсий, "ТитулЗаказчика");
	Возврат СтруктураШага;
	
КонецФункции

&НаСервере
Функция СтруктураШагаПодтверждение(НомерШага)
	
	Титул = ПредопределенноеЗначение("Перечисление.ТипыЭлементовРегламентаЭДО.ЭПЭ_Титул2");
	Отбор = Новый Структура("Титул", Титул);
	СтрокиВерсий = ВерсииТитулов.Выгрузить(Отбор, "НомерВерсии");
	
	СтруктураШага                = НавигацияПомощниковСВозвратомЭПД.НовыйСтруктураШага();
	СтруктураШага.ИмяПомощника   = ИмяПомощника();
	СтруктураШага.НомерШага      = НомерШага;
	СтруктураШага.ТекстНавигации = НСтр("ru='Подтверждение'");
	СтруктураШага.СтруктураПараметровФормы.НавигацияПараметрФормы = "ТитулЭкспедитора";
	СтруктураШага.ТипЭлементаРегламента = Титул;
	СтруктураШага.Выполнен = ЗначениеЗаполнено(Объект.ТитулЭкспедитораИдентификаторФайла);
	СтруктураШага.Доступен = СтруктураШага.Выполнен Или Объект.ТекущийТитул = Титул;
	СтруктураШага.КоличествоВерсий = Макс(СтрокиВерсий.Количество(), 1);
	СтруктураШага.НомерВерсии = ОтображаемаяВерсияТитула(СтрокиВерсий, "ТитулЭкспедитора");
	Возврат СтруктураШага;
	
КонецФункции  

&НаСервере
Функция СтруктураШагаОтмены(НомерШага)
	
	Титул = ПредопределенноеЗначение("Перечисление.ТипыЭлементовРегламентаЭДО.ЭПЭ_Титул3");
	Отбор = Новый Структура("Титул", Титул);
	СтрокиВерсий = ВерсииТитулов.Выгрузить(Отбор, "НомерВерсии");
	
	СтруктураШага                = НавигацияПомощниковСВозвратомЭПД.НовыйСтруктураШага();
	СтруктураШага.ИмяПомощника   = ИмяПомощника();
	СтруктураШага.НомерШага      = НомерШага;
	СтруктураШага.ТекстНавигации = НСтр("ru='Отзыв'");
	СтруктураШага.СтруктураПараметровФормы.НавигацияПараметрФормы = "ТитулЗаказчикаОтзыв";
	СтруктураШага.ТипЭлементаРегламента = Титул;
	СтруктураШага.Выполнен = ЗначениеЗаполнено(Объект.ТитулЗаказчикаОтзывИдентификаторФайла);
	СтруктураШага.Доступен = СтруктураШага.Выполнен Или Объект.ТекущийТитул = Титул;
	СтруктураШага.КоличествоВерсий = Макс(СтрокиВерсий.Количество(), 1);
	СтруктураШага.НомерВерсии = ОтображаемаяВерсияТитула(СтрокиВерсий, "ТитулЗаказчикаОтзыв");
	Возврат СтруктураШага;
	
КонецФункции


&НаСервере
Функция ОтображаемаяВерсияТитула(СтрокиВерсий, ТитулСтрока)
	
	МаксВерсия = 0;
	Для Каждого СтрокаТЗ Из СтрокиВерсий Цикл
		Если СтрокаТЗ.НомерВерсии > МаксВерсия Тогда
			МаксВерсия = СтрокаТЗ.НомерВерсии;
		КонецЕсли;
	КонецЦикла;
	
	Если ОтображаемыеВерсииТитулов = Неопределено Тогда
		ОтображаемыеВерсииТитулов = Новый Структура;
		ОтображаемыеВерсииТитулов.Вставить(ТитулСтрока, МаксВерсия);
		Возврат МаксВерсия;
	КонецЕсли;
	
	ТекущееЗначениеВерсии = Неопределено;
	ОтображаемыеВерсииТитулов.Свойство(ТитулСтрока, ТекущееЗначениеВерсии);
	
	Если ТекущееЗначениеВерсии = Неопределено Тогда
		ОтображаемыеВерсииТитулов.Вставить(ТитулСтрока, МаксВерсия);
		Возврат МаксВерсия;
	Иначе
		Возврат ТекущееЗначениеВерсии;		
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьРеквизитыОтображаемойВерсии(ВыбранныйТитулСтрока, ОтмечатьТекущий)
	
	ВыбранныйТитул = ОбменСГИСЭПДКлиентСервер.ТитулПоПрефиксу("Документ.ЭлектронноеПоручениеЭкспедитору", ВыбранныйТитулСтрока); 
	
	Если ЗначениеЗаполнено(ВыбранныйТитул) Тогда
		Отбор = Новый Структура("Титул", ВыбранныйТитул);
		СтрокиВерсий = ВерсииТитулов.Выгрузить(Отбор, "НомерВерсии");
		СтрокиВерсий.Сортировать("НомерВерсии");	
		НомерВерсии = ОтображаемаяВерсияТитула(СтрокиВерсий, ВыбранныйТитулСтрока);
		
		РеквизитыТекущейВерсииТитула = ОбменСГИСЭПД.ПолучитьВерсиюТитулаДокумента(СтруктураРеквизитов, ВыбранныйТитул, НомерВерсии);
		ОбменСГИСЭПД.ЗаполнитьРеквизитыПоВерсии(ЭтотОбъект, ВыбранныйТитул, НомерВерсии, РеквизитыТекущейВерсииТитула);
		Если ОтмечатьТекущий = Истина Тогда
			СтруктураСТекущимиДанными = ОбменСГИСЭПДКлиентСервер.ПолучитьСтруктуруПоТитулуИВерсии(ЭтотОбъект);
			СтруктураДанныхОбъекта = ОбменСГИСЭПДКлиентСервер.ПолучитьСериализуемыйОбъектСДаннымиДокумента(ЭтотОбъект);
			СтруктураСДаннымиФормыДляОформленияКнопок = ОбменСГИСЭПДКлиентСервер.СтруктураСДаннымиФормыДляОформленияКнопок(ЭтотОбъект);
			
			Результат = ИзменитьОформлениеКнопокНаСервере(СтруктураСТекущимиДанными,
				Неопределено,
				Неопределено,
				СтруктураДанныхОбъекта,
				СтруктураСДаннымиФормыДляОформленияКнопок);
				
			Если Результат.Успешно Тогда
				ЭтотОбъект.АдресДереваСоответствийИтаблицыКнопок = Результат.НовыйАдресВХранилище;	
				МассивОформления = Результат.МассивОформления;
				ОбменСГИСЭПДКлиентСервер.ОформлениеКнопокНаФорме(ЭтотОбъект, СтруктураСТекущимиДанными, МассивОформления);	
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры 

&НаСервере
Процедура РазместитьНавигацию(ВыбранныйТитулСтрока)

	НавигацияПараметрФормы = ВыбранныйТитулСтрока;
	
	ЗаполнитьРеквизитыОтображаемойВерсии(ВыбранныйТитулСтрока, Истина);

	СтруктураНавигацииПомощника = НавигацияПомощника();
	НавигацияПомощниковСВозвратомЭПД.РазместитьНавигацию(ЭтотОбъект, СтруктураНавигацииПомощника, Параметры);

КонецПроцедуры

&НаКлиенте
Процедура ОбработатьИзменениеШага(ИмяШага, НавигационнаяСсылка)
	
	ИнкрементВерсии = 0;
	Если НавигационнаяСсылка = "Влево" Тогда
		ИнкрементВерсии = -1;
	ИначеЕсли НавигационнаяСсылка = "Вправо" Тогда
		ИнкрементВерсии = 1;
	КонецЕсли;
	
	Если ИмяШага = "Шаг1" Тогда
		ИнкрементироватьОтображаемуюВерсиюТитула("ТитулЗаказчика", ИнкрементВерсии);
		УстановитьВидимостьСтраницыНачало(ИмяШага);
	ИначеЕсли ИмяШага = "Шаг2" Тогда
		ИнкрементироватьОтображаемуюВерсиюТитула("ТитулЭкспедитора", ИнкрементВерсии);
		УстановитьВидимостьСтраницыТитулПеревозчика(ИмяШага);
	ИначеЕсли ИмяШага = "Шаг3" Тогда
		ИнкрементироватьОтображаемуюВерсиюТитула("ТитулЗаказчикаОтзыв", ИнкрементВерсии);
		УстановитьВидимостьСтраницыТитулЗаказчикаОтзыв();
	КонецЕсли;
	
	ОбменСГИСЭПДКлиентСервер.ИзменитьОформлениеФормы(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти


#Область ОбъектыОбязательныеДляЗаполнения

&НаКлиенте
Процедура ИзменитьОформлениеКнопок(Параметр) Экспорт

	Если Не ЭтотОбъект.НачальноеОформлениеВыполнено Тогда
		ЭтотОбъект.ТребуетсяДополнительноеОформлениеКнопок = Истина;
		Если ЭтотОбъект.СтруктураДополнительногоОформленияКнопок <> Неопределено Тогда
			ЭтотОбъект.СтруктураДополнительногоОформленияКнопок = 
				Новый ФиксированнаяСтруктура("ИмяКнопки, ИдентификаторСтроки");
		Иначе
			ЭтотОбъект.СтруктураДополнительногоОформленияКнопок = Параметр;
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	СтруктураСТекущимиДаннымиРеквизитов = ОбменСГИСЭПДКлиентСервер.ПолучитьСтруктуруПоТитулуИВерсии(ЭтотОбъект);
	СтруктураДанныхОбъекта = Неопределено;
	СтруктураСДаннымиФормыДляОформленияКнопок = 
		ОбменСГИСЭПДКлиентСервер.СтруктураСДаннымиФормыДляОформленияКнопок(ЭтотОбъект);
	
	Результат = ИзменитьОформлениеКнопокНаСервере(СтруктураСТекущимиДаннымиРеквизитов,
		Параметр.ИмяКнопки,
		Параметр.ИдентификаторСтроки,
		СтруктураДанныхОбъекта,
		СтруктураСДаннымиФормыДляОформленияКнопок);
		
	Если Результат.Успешно Тогда
		ЭтотОбъект.АдресДереваСоответствийИтаблицыКнопок = Результат.НовыйАдресВХранилище;	
		МассивОформления = Результат.МассивОформления;
		ОбменСГИСЭПДКлиентСервер.ОформлениеКнопокНаФорме(ЭтотОбъект,
			СтруктураСТекущимиДаннымиРеквизитов, МассивОформления);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ИзменитьОформлениеКнопокНаСервере(Знач СтруктураСТекущимиДаннымиРеквизитов,
	ИмяКнопки = Неопределено,
	ИдентификаторСтроки = Неопределено,
	Знач СтруктураДанныхОбъекта,
	Знач СтруктураСДаннымиФормыДляОформленияКнопок)
	
	НовыйАдресВХранилище = ОбменСГИСЭПД.ЗапуститьИзменениеОформленияКнопок(СтруктураСДаннымиФормыДляОформленияКнопок,
		СтруктураСТекущимиДаннымиРеквизитов, ИмяКнопки, ИдентификаторСтроки, СтруктураДанныхОбъекта);

	Результат = ОбменСГИСЭПД.ОбработатьРезультатИзмененияОформленияКнопок(НовыйАдресВХранилище);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ОтметитьОбязательныеНеЗаполненныеЭлементыФормы(Параметр)
	
	СтруктураСТекущимиДаннымиРеквизитов = ОбменСГИСЭПДКлиентСервер.ПолучитьСтруктуруПоТитулуИВерсии(ЭтотОбъект);
	ОтметитьОбязательныеНеЗаполненныеЭлементыФормыНаСервере(СтруктураСТекущимиДаннымиРеквизитов);
	
КонецПроцедуры

&НаСервере
Процедура ОтметитьОбязательныеНеЗаполненныеЭлементыФормыНаСервере(Знач СтруктураСТекущимиДанными)
	
	ОбменСГИСЭПД.ОтметитьОбязательныеНеЗаполненныеЭлементыФормы(ЭтотОбъект, СтруктураСТекущимиДанными);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ОтметитьОбязательныеНеЗаполненныеЭлементыФормы" Тогда
		Если УникальныйИдентификатор <> Параметр Тогда
			Возврат;
		КонецЕсли;
		ОтметитьОбязательныеНеЗаполненныеЭлементыФормы(Параметр);
	ИначеЕсли ИмяСобытия = "ИзменитьОформлениеКнопокФормы" Тогда
		Если УникальныйИдентификатор <> Параметр.УникальныйИдентификаторОбновляемойФормы Тогда
			Возврат;
		КонецЕсли;
		ИзменитьОформлениеКнопок(Параметр);	
	ИначеЕсли СтрНачинаетсяС(ИмяСобытия, "Запись_") И Источник <> Неопределено Тогда
		Если Источник = Объект.СсылкаТитулЗаказчикаЗаказчик Тогда  
			СсылкаТитулЗаказчикаЗаказчикПриИзменении(Элементы.СсылкаТитулЗаказчикаЗаказчик);
		ИначеЕсли Источник = Объект.СсылкаТитулЗаказчикаСоставитель Тогда  
			СсылкаТитулЗаказчикаСоставительПриИзменении(Элементы.СсылкаТитулЗаказчикаСоставитель);
		ИначеЕсли Источник = Объект.СсылкаТитулЗаказчикаЭкспедитор Тогда 
			СсылкаТитулЗаказчикаЭкспедиторПриИзменении(Элементы.СсылкаТитулЗаказчикаЭкспедитор);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
