////////////////////////////////////////////////////////////////////////////////
// ОбменСБанкамиДепозитыКлиент: механизм обмена электронными документами с банками.
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Обрабатывает команды депозитного калькулятора.
//
// Параметры:
//   Форма - ФормаКлиентскогоПриложения - форма объекта-владельца, в которой размещен депозитный калькулятор;
//   ПараметрыПредложений - Структура - см. НовыйПараметрыПредложенийБанка;
//   Команда - ДекорацияФормы, КнопкаФормы, Неопределено - источник действия;
//   ИмяКоманды - Строка, Неопределено - имя команды, может быть Неопределено если задан параметр Команда.
//
Процедура ВыполнитьКоманду(Форма, ПараметрыПредложений, Команда = Неопределено, Знач ИмяКоманды = Неопределено) Экспорт 
	
	Если Не Команда = Неопределено И Не ЗначениеЗаполнено(ИмяКоманды) Тогда
		ИмяКоманды = Команда.Имя;
	КонецЕсли;
	
	ДополнительныеПараметрыДепозитов =
		ОбменСБанкамиДепозитыСлужебныйКлиентСервер.ДополнительныеПараметрыДепозитов(Форма);
	Если ДополнительныеПараметрыДепозитов = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ИмяКоманды = ОбменСБанкамиДепозитыКлиентСервер.ИмяКоманды("ПоказатьРасчетДепозитов") Тогда
		
		ИмяГруппыРазмещения = ДополнительныеПараметрыДепозитов.ИмяГруппыРазмещения;
		ЭлементКалькулятор = Форма.Элементы[ИмяГруппыРазмещения];
		ЭтоОткрытиеДепозитногоКалькулятора = Не ЭлементКалькулятор.Видимость;
		
		ЭлементКалькулятор.Видимость = Не ЭлементКалькулятор.Видимость;
		
		Если ДополнительныеПараметрыДепозитов.ИспользоватьКомандуДепозиты Тогда
			Форма.Элементы[ИмяКоманды].Пометка = ЭлементКалькулятор.Видимость;
		КонецЕсли;
		
		Если Не ЭтоОткрытиеДепозитногоКалькулятора Тогда
			Возврат;
		КонецЕсли;
		
		Если ДополнительныеПараметрыДепозитов.ВыполняетсяАктуализация Тогда
			Возврат;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ДополнительныеПараметрыДепозитов.ДатаОбновленияПредложений) Тогда
			ПроверитьАктуальностьИОбновитьДанныеДепозитныхПродуктов(Форма, ПараметрыПредложений);
		Иначе
			ПоказатьРасчетДепозитов(Форма, ПараметрыПредложений);
		КонецЕсли;
		
	ИначеЕсли ИмяКоманды = ОбменСБанкамиДепозитыКлиентСервер.ИмяКоманды("ОтправитьЗаявку") Тогда
		
		Если Не ЗначениеЗаполнено(ПараметрыПредложений) Тогда
			ОбновитьПредложенияПриИзмененииОрганизации(Форма, ПараметрыПредложений);
			Возврат;
		КонецЕсли;
		
		ПараметрыОткрытияФормы = Новый Структура();
		ИмяПараметра = ОбменСБанкамиДепозитыСлужебныйКлиентСервер.ИмяПараметра("Сумма");
		ПараметрыОткрытияФормы.Вставить("Сумма", Форма[ИмяПараметра]);
		
		ИмяПараметра = ОбменСБанкамиДепозитыСлужебныйКлиентСервер.ИмяПараметра("Срок");
		ПараметрыОткрытияФормы.Вставить("Срок", Форма[ИмяПараметра]);
		
		ПараметрыОткрытияФормы.Вставить("КлючПродукта", ДополнительныеПараметрыДепозитов.ВыбранноеПредложение);
		ПараметрыОткрытияФормы.Вставить("Организация", ПараметрыПредложений.Организация);

		ОткрытьФорму("Документ.ЗаявкаНаДепозитОбменСБанками.Форма.ФормаДокумента", ПараметрыОткрытияФормы);
		
	ИначеЕсли ИмяКоманды = ОбменСБанкамиДепозитыСлужебныйКлиентСервер.ИмяЭлементаФормы("СрокиИУсловия") Тогда
		
		Если Не ЗначениеЗаполнено(ПараметрыПредложений) Тогда
			ОбновитьПредложенияПриИзмененииОрганизации(Форма, ПараметрыПредложений);
			Возврат;
		КонецЕсли;
		
		ВыбранноеПредложение = ДополнительныеПараметрыДепозитов.ВыбранноеПредложение;
		
		ДанныеТекущегоПродукта = Неопределено;
		Для Каждого ТекПродукт Из ПараметрыПредложений.МассивПредложений Цикл
			ДанныеПродукта = ТекПродукт.ДополнительныеДанные;
			Если ДанныеПродукта.КлючПродукта = ВыбранноеПредложение Тогда
				ДанныеТекущегоПродукта = ТекПродукт.ДополнительныеДанные;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если ДанныеТекущегоПродукта = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		ПараметрыОткрытия = НовыеПараметрыОткрытияФормыСрокиИУсловия();
		
		ПараметрыПродукта = НовыеПараметрыПродукта();
		ПараметрыПродукта.КлючПродукта = ДанныеТекущегоПродукта.КлючПродукта;
		ПараметрыПродукта.Наименование = ДанныеТекущегоПродукта.Наименование;
		ПараметрыПродукта.НаименованиеБанка = ДанныеТекущегоПродукта.НаименованиеБанка;
		ПараметрыПродукта.ПодробноеОписание = ДанныеТекущегоПродукта.ОписаниеПродукта;
		ПараметрыПродукта.ОдинБанк = ПараметрыПредложений.ОдинБанк;
		ПараметрыПродукта.РасчетПриОформлении = ДанныеТекущегоПродукта.РасчетПриОформлении;
		
		ПараметрыОткрытия.ПараметрыПродукта = ПараметрыПродукта;
		
		ПараметрыПользователя = НовыеПараметрыПользователя();
		ИмяПараметра = ОбменСБанкамиДепозитыСлужебныйКлиентСервер.ИмяПараметра("Сумма"); 
		ПараметрыПользователя.Сумма = Форма[ИмяПараметра];
		ИмяПараметра = ОбменСБанкамиДепозитыСлужебныйКлиентСервер.ИмяПараметра("Срок");
		ПараметрыПользователя.Срок = Форма[ИмяПараметра];
		
		ПараметрыПользователя.ДатаРасчета = ДополнительныеПараметрыДепозитов.ДатаОбновленияПредложений;
		
		ПараметрыОткрытия.ПараметрыПользователя = ПараметрыПользователя;
		ПараметрыОткрытия.АдресХранилищаПредложенийБанков =
			ДополнительныеПараметрыДепозитов.АдресХранилищаПредложенийБанков;
		
		ОткрытьФорму("Документ.ЗаявкаНаДепозитОбменСБанками.Форма.СрокиИУсловия",
			ПараметрыОткрытия, Форма, , , , ,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
			
	ИначеЕсли ИмяКоманды = ОбменСБанкамиДепозитыКлиентСервер.ИмяКоманды("ПовторитьЗапросПредложений") Тогда
		
		Если ДополнительныеПараметрыДепозитов.ВыполняетсяАктуализация Тогда
			Возврат;
		КонецЕсли;
		
		ПроверитьАктуальностьИОбновитьДанныеДепозитныхПродуктов(Форма, ПараметрыПредложений, Истина);
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура обработчик события "ОбработкаВыбора" списка выбора предложений депозитных продуктов.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма объекта-владельца, в которой размещен депозитный калькулятор;
//  ПараметрыПредложений - Структура - см. НовыйПараметрыПредложенийБанка;
//  Элемент - ПолеФормы - элемент источник события;
//  ВыбранноеЗначение - Строка - имя предложения банка;
//  ДополнительныеДанные - см. ОбменСБанкамиДепозитыСлужебный.СформироватьДанныеСпискаВыбораПредложений;
//  СтандартнаяОбработка - Булево - признак выполнения стандартной (системной) обработки события.
//
Процедура ОбработкаВыбора(Форма, ПараметрыПредложений, Элемент, ВыбранноеЗначение, ДополнительныеДанные,
		СтандартнаяОбработка) Экспорт
	
	СтандартнаяОбработка = Ложь;
	СлужебныйЭлементСпискаПредложений =
		ОбменСБанкамиДепозитыСлужебныйКлиентСервер.ЗначениеСлужебногоЭлементаСпискаПредложений();
	
	Если Не ЗначениеЗаполнено(ПараметрыПредложений)
		Или Не ЗначениеЗаполнено(ДополнительныеДанные) Тогда
		
		ОбновитьПредложенияПриИзмененииОрганизации(Форма, ПараметрыПредложений);
		Возврат;
		
	КонецЕсли;
	
	Если ВыбранноеЗначение = СлужебныйЭлементСпискаПредложений Тогда
		Возврат;
	КонецЕсли;
	
	ДополнительныеПараметры =
		ОбменСБанкамиДепозитыСлужебныйКлиентСервер.ДополнительныеПараметрыДепозитов(Форма);
	
	Если ДополнительныеПараметры.ВыбранноеПредложение = ДополнительныеДанные.КлючПродукта Тогда
		Возврат;
	КонецЕсли;
	
	ДополнительныеПараметры.ВыбранноеПредложение = ДополнительныеДанные.КлючПродукта;
	
	ИмяЭлементаСрок = ОбменСБанкамиДепозитыСлужебныйКлиентСервер.ИмяЭлементаФормы("Срок");
	ИмяЭлементаСумма = ОбменСБанкамиДепозитыСлужебныйКлиентСервер.ИмяЭлементаФормы("Сумма");
	
	Если ДополнительныеДанные.Сумма = Форма[ИмяЭлементаСрок]
		И ДополнительныеДанные.Срок = Форма[ИмяЭлементаСумма]
		Или Не ПараметрыПредложений.ПользовательУказалПараметры
		Или Не ДополнительныеДанные.ЭтоПредложениеДепозита Тогда
		УстановитьПредложениеБанка(Форма, ВыбранноеЗначение, ДополнительныеДанные,
			ПараметрыПредложений);
		
	Иначе
			
		Форма.ОбменСБанкамиДепозитыОбновитьУсловияПродукта();
		
	КонецЕсли;
	
КонецПроцедуры

// Обрабатывает изменение элементов формы депозитов.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма объекта-владельца, в которой размещен депозитный калькулятор;
//  Элемент - ПолеФормы - Измененный элемент формы;
//  ПараметрыПредложений - см. НовыйПараметрыПредложенийБанка.
//
Процедура ДепозитыПриИзменении(Форма, Элемент, ПараметрыПредложений) Экспорт
	
	Если Не ЗначениеЗаполнено(ПараметрыПредложений) Тогда
		ОбновитьПредложенияПриИзмененииОрганизации(Форма, ПараметрыПредложений);
		Возврат;
	КонецЕсли;
	
	ЭлементыФормы = Форма.Элементы;
	ДополнительныеПараметры =
		ОбменСБанкамиДепозитыСлужебныйКлиентСервер.ДополнительныеПараметрыДепозитов(Форма);
	ИмяЭлементаОрганизация = ДополнительныеПараметры.ИмяЭлементаРеквизитаОрганизация;
	ИмяЭлементаСрок = ОбменСБанкамиДепозитыСлужебныйКлиентСервер.ИмяЭлементаФормы("Срок");
	ИмяЭлементаДатаЗакрытия = ОбменСБанкамиДепозитыСлужебныйКлиентСервер.ИмяЭлементаФормы("ДатаЗакрытия");
	ИмяЭлементаСумма = ОбменСБанкамиДепозитыСлужебныйКлиентСервер.ИмяЭлементаФормы("Сумма");
	ИмяГруппыРазмещения = ДополнительныеПараметры.ИмяГруппыРазмещения;
	ЭлементКалькулятор = ЭлементыФормы[ИмяГруппыРазмещения];
	ДлинаСуток = 24 * 60 * 60;
	
	// Для расчета сроков предложений используем ДатуОбновленияПредложений, т.к. ДатаОбновленияПредложений - это
	// НачалоДня(ТекущаяДатаСеанса()), полученная при проверке актуальности предложений,
	// и ее использование предпочтительней, чем использование ТекущаяДата(), и позволяет избежать возможных ошибок
	// при получении текущей даты во время расчета условий депозитных продуктов.
	//
	Если ИмяЭлементаСрок = Элемент.Имя Тогда
		Форма[ИмяЭлементаДатаЗакрытия] =
			ДополнительныеПараметры.ДатаОбновленияПредложений + Форма[ИмяЭлементаСрок] * ДлинаСуток;
	ИначеЕсли ИмяЭлементаДатаЗакрытия = Элемент.Имя Тогда
		Если Форма[ИмяЭлементаДатаЗакрытия] <= ДополнительныеПараметры.ДатаОбновленияПредложений Тогда
			Форма[ИмяЭлементаСрок] = 1;
			Форма[ИмяЭлементаДатаЗакрытия] = ДополнительныеПараметры.ДатаОбновленияПредложений + ДлинаСуток;
		Иначе
			Форма[ИмяЭлементаСрок] = Окр(
				(Форма[ИмяЭлементаДатаЗакрытия] - ДополнительныеПараметры.ДатаОбновленияПредложений) / (ДлинаСуток), 0);
		КонецЕсли;
	КонецЕсли;
	
	Если ИмяЭлементаСумма = Элемент.Имя
		Или ИмяЭлементаСрок = Элемент.Имя
		Или ИмяЭлементаДатаЗакрытия = Элемент.Имя Тогда
		ПараметрыПредложений.ПользовательУказалПараметры = Истина;
		ПроверитьОбновитьРасчетПоУсловиямТекущегоПродукта(Форма, ПараметрыПредложений);
	ИначеЕсли ИмяЭлементаОрганизация = Элемент.Имя И ЭлементКалькулятор.Видимость Тогда
		ОбновитьПредложенияПриИзмененииОрганизации(Форма, ПараметрыПредложений);
	КонецЕсли;
	
КонецПроцедуры

// Заполняет данные выбора предложений банков.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма объекта-владельца, в которой размещен депозитный калькулятор;
//  ПараметрыПредложений - Структура - см. НовыйПараметрыПредложенийБанка;
//  Элемент - ПолеФормы - элемент источник события;
//  Текст - Строка - строка текста, введенная в поле ввода;
//  ДанныеВыбора - СписокЗначений из ЭлементСпискаЗначений - Список для заполнения предложениями;
//  СтандартнаяОбработка - Булево - признак выполнения стандартной (системной) обработки события.
//
Процедура ЗаполнитьДанныеВыбора(Форма, ПараметрыПредложений, Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка) Экспорт
	
	СтандартнаяОбработка = Ложь;
	
	Если Не ЗначениеЗаполнено(ПараметрыПредложений) Тогда
		ОбновитьПредложенияПриИзмененииОрганизации(Форма, ПараметрыПредложений);
		СтандартнаяОбработка = Истина;
		Возврат;
	КонецЕсли;
	
	Если ПараметрыПредложений.ПользовательУказалПараметры Тогда
		
		ДополнительныеПараметры =
			ОбменСБанкамиДепозитыСлужебныйКлиентСервер.ДополнительныеПараметрыДепозитов(Форма);
		ТекущаяОрганизация = ОбщегоНазначенияКлиентСервер.ПолучитьРеквизитФормыПоПути(Форма, 
			ДополнительныеПараметры.ПутьКРеквизитуОрганизация);
		ОбновитьДанныеПредложенияБанков(Форма, ПараметрыПредложений, ТекущаяОрганизация);
		
	КонецЕсли;
	
	ДанныеВыбора = Новый СписокЗначений;
	
	Если ПараметрыПредложений.Свойство("МассивПредложений") Тогда
		
		Для Каждого ТекущиеПредложение из ПараметрыПредложений.МассивПредложений Цикл
			ТекущееПредставление = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
				ТекущиеПредложение, "Представление", "");
			ДанныеВыбора.Добавить(ТекущиеПредложение, ТекущееПредставление);
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

// Обновляет предложения банков при изменении организации.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма объекта-владельца, в которой размещен депозитный калькулятор;
//  ПараметрыПредложений - см. НовыйПараметрыПредложенийБанка.
//
Процедура ОбновитьПредложенияПриИзмененииОрганизации(Форма, ПараметрыПредложений) Экспорт
	
	ДополнительныеПараметрыДепозитов =
		ОбменСБанкамиДепозитыСлужебныйКлиентСервер.ДополнительныеПараметрыДепозитов(Форма);
	Если Не ЗначениеЗаполнено(ДополнительныеПараметрыДепозитов)
		Или ДополнительныеПараметрыДепозитов.ВыполняетсяАктуализация Тогда
		Возврат;
	КонецЕсли;
	
	ЭлементыФормы = Форма.Элементы;
	ЭлементРазмещения = ЭлементыФормы[ДополнительныеПараметрыДепозитов.ИмяГруппыРазмещения];
	
	Если Не ЭлементРазмещения.Видимость Тогда
		Возврат;
	КонецЕсли;
	
	ЭлементыФормы = Форма.Элементы;
	ИмяЭлемента = ОбменСБанкамиДепозитыСлужебныйКлиентСервер.ИмяЭлементаФормы("СтраницаИнформации");
	ЭлементСтраницаИнформации = ЭлементыФормы[ИмяЭлемента];
	ЭлементСтраницаИнформации.Видимость = Ложь;
	
	Если Не ОбменСБанкамиДепозитыСлужебныйКлиентСервер.ОтложеннаяИнициализацияВыполнена(
			ДополнительныеПараметрыДепозитов) Тогда
		Форма.ОбменСБанкамиДепозитыВыполнитьИнициализацию();
	Иначе
		
		ТекущаяОрганизация = ОбщегоНазначенияКлиентСервер.ПолучитьРеквизитФормыПоПути(Форма, 
			ДополнительныеПараметрыДепозитов.ПутьКРеквизитуОрганизация);
		ВыбранноеПредложение = ДополнительныеПараметрыДепозитов.ВыбранноеПредложение;
		
		УсловияВыбранногоПредложения = Неопределено;
		
		Если ПараметрыПредложений = Неопределено Тогда
			ПараметрыПредложений = НовыйПараметрыПредложенийБанка();
		КонецЕсли;
		УсловияВыбранногоПредложения = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
			ПараметрыПредложений, "УсловияТекущегоПродукта", Неопределено);
		КлючПродуктаУсловий = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
			УсловияВыбранногоПредложения, "КлючПродукта", ВыбранноеПредложение);
		
		Если Не ЭтоАдресВременногоХранилища(ДополнительныеПараметрыДепозитов.АдресХранилищаПредложенийБанков)
			Или Не ЗначениеЗаполнено(ВыбранноеПредложение)
			Или Не ТекущаяОрганизация = ПараметрыПредложений.Организация
			Или УсловияВыбранногоПредложения = Неопределено
			Или Не ВыбранноеПредложение = КлючПродуктаУсловий Тогда
			
			ОбновитьДанныеПредложенияБанков(Форма, ПараметрыПредложений, ТекущаяОрганизация);
			
		Иначе
			
			ДанныеВыбранногоПредложения = Неопределено;
			ДанныеВыбранногоУсловия = Неопределено;
			
			Для Каждого ТекПредложение Из ПараметрыПредложений.МассивПредложений Цикл
				ДанныеВыбранногоУсловия = ТекПредложение.ДополнительныеДанные;
				Если ДанныеВыбранногоУсловия.КлючПродукта = ВыбранноеПредложение Тогда
					ДанныеВыбранногоПредложения = ТекПредложение.Значение;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
			Если Не ДанныеВыбранногоПредложения = Неопределено 
				И Не ДанныеВыбранногоУсловия = Неопределено Тогда
				
				УстановитьПредложениеБанка(Форма, ДанныеВыбранногоПредложения, 
					ДанныеВыбранногоУсловия, ПараметрыПредложений);
					
			КонецЕсли;
				
			НастроитьВидимостьСтраницыРасчетДепозитов(Форма, Истина);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Обновляет данные депозитного калькулятора в соответствии с выбранными условиями.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма объекта-владельца, в которой размещен депозитный калькулятор;
//  ВыбранноеЗначение - Структура - Выбранные пользователем условия депозита
//  ИсточникВыбора - ФормаКлиентскогоПриложения - Форма-источник выбора условий
//  ПараметрыПредложений - см. НовыйПараметрыПредложенийБанка.
//
Процедура ОбработатьВыборУсловия(Форма, ВыбранноеЗначение, ИсточникВыбора, ПараметрыПредложений) Экспорт
	
	ДополнительныеПараметрыДепозитов = 
		ОбменСБанкамиДепозитыСлужебныйКлиентСервер.ДополнительныеПараметрыДепозитов(Форма);
	Если Не ЗначениеЗаполнено(ДополнительныеПараметрыДепозитов) Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ВыбранноеЗначение) 
		Или ИсточникВыбора = Неопределено
		Или Не ИсточникВыбора.ИмяФормы = "Документ.ЗаявкаНаДепозитОбменСБанками.Форма.СрокиИУсловия"
		Или ПараметрыПредложений = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;
		
	МассивПредложений = ПараметрыПредложений.МассивПредложений;
	ТекущийПродукт = Неопределено;
	ДополнительныеДанные = Неопределено;
	Для Каждого ТекущийПродукт Из МассивПредложений Цикл
		ДополнительныеДанные = ТекущийПродукт.ДополнительныеДанные;
		Если ДополнительныеДанные.КлючПродукта = ВыбранноеЗначение.КлючПродукта Тогда
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	ДанныеТекущегоПродукта = ПараметрыПредложений.УсловияТекущегоПродукта;
	
	ТекущееУсловие = Неопределено;
	Для Каждого ТекущееУсловие Из ДанныеТекущегоПродукта.Условия Цикл
			
		Если ТекущееУсловие.ИдентификаторУсловия = ВыбранноеЗначение.ИдентификаторУсловия Тогда
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Если ДополнительныеДанные = Неопределено
		Или ТекущееУсловие = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыПредложений.ПользовательУказалПараметры = Истина;
	
	ЗаполнитьЗначенияСвойств(ДополнительныеДанные, ТекущееУсловие, 
		"СрокМаксимум, СрокМинимум, СуммаМаксимум, СуммаМинимум, Ставка, ИдентификаторУсловия");
	ДополнительныеДанные.Срок = ВыбранноеЗначение.Срок;
	ДополнительныеДанные.Сумма = ВыбранноеЗначение.Сумма;
	ДополнительныеДанные.Доход = ВыбранноеЗначение.Доход; 
	ДополнительныеДанные.НеВыполненыУсловия = Ложь;
	
	ИмяПараметра = ОбменСБанкамиДепозитыСлужебныйКлиентСервер.ИмяПараметра("Сумма");
	Форма[ИмяПараметра] = ВыбранноеЗначение.Сумма;
	
	ИмяПараметра = ОбменСБанкамиДепозитыСлужебныйКлиентСервер.ИмяПараметра("Срок");
	Форма[ИмяПараметра] = ВыбранноеЗначение.Срок;
	
	ДлинаСуток = 24 * 60 * 60;
	ИмяПараметра = ОбменСБанкамиДепозитыСлужебныйКлиентСервер.ИмяПараметра("ДатаЗакрытия");
	Форма[ИмяПараметра] = 
		ДополнительныеПараметрыДепозитов.ДатаОбновленияПредложений + ВыбранноеЗначение.Срок * ДлинаСуток;
	
	Если ПараметрыПредложений.ОдинБанк Тогда
		НаименованиеПродукта = СтрШаблон("%1%% %2", ДополнительныеДанные.Ставка, ДополнительныеДанные.Наименование);
	Иначе
		НаименованиеПродукта = СтрШаблон("%1: %2%% %3", ДополнительныеДанные.НаименованиеБанка, 
			ДополнительныеДанные.Ставка, ДополнительныеДанные.Наименование);
	КонецЕсли;
	
	ТекущийПродукт.Значение = НаименованиеПродукта;
	ВыбранноеПредложение = ТекущийПродукт.Значение;
	
	УстановитьПредложениеБанка(Форма, ВыбранноеПредложение, ДополнительныеДанные, ПараметрыПредложений);
	
КонецПроцедуры

// Настраивает видимость элементов формы и проверяет актуальность данных
// о депозитных продуктах при открытии формы.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма объекта-владельца, в которой размещен депозитный калькулятор.
//
Процедура ПриОткрытии(Форма) Экспорт
	
	ДополнительныеПараметрыДепозитов =
		ОбменСБанкамиДепозитыСлужебныйКлиентСервер.ДополнительныеПараметрыДепозитов(Форма);
		
	Если ДополнительныеПараметрыДепозитов = Неопределено 
		Или Не ОрганизацияЗаполнена(Форма)
		Или Не ДополнительныеПараметрыДепозитов.ПоказыватьПанельРасчетаДепозитов Тогда
		Возврат;
	КонецЕсли; 
	
	Если ДополнительныеПараметрыДепозитов.ИспользоватьКомандуДепозиты Тогда
		ИмяКоманды = ОбменСБанкамиДепозитыКлиентСервер.ИмяКоманды("ПоказатьРасчетДепозитов");
		Форма.Элементы[ИмяКоманды].Пометка = Истина;
	КонецЕсли;
	
	ИмяГруппыРазмещения = ДополнительныеПараметрыДепозитов.ИмяГруппыРазмещения;
	ЭлементКалькулятор = Форма.Элементы[ИмяГруппыРазмещения];
	ЭлементКалькулятор.Видимость = Истина;
	Форма.ПодключитьОбработчикОжидания(
		"Подключаемый_ОбменСБанкамиДепозитыПроверитьАктуальностьПредложений", 0.1, Истина);
	
КонецПроцедуры

// Проверяет видимость панели расчета депозитов и обновляет данные в хранилище общих настроек.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма объекта-владельца, в которой размещен депозитный калькулятор.
//
Процедура ПередЗакрытием(Форма) Экспорт
	
	ДополнительныеПараметрыДепозитов = 
		ОбменСБанкамиДепозитыСлужебныйКлиентСервер.ДополнительныеПараметрыДепозитов(Форма);
		
	Если ДополнительныеПараметрыДепозитов = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ИмяГруппыРазмещения = ДополнительныеПараметрыДепозитов.ИмяГруппыРазмещения;
	ЭлементКалькулятор = Форма.Элементы[ИмяГруппыРазмещения];
	
	ВидимостьПанелиРасчета = ЭлементКалькулятор.Видимость;
	ОбменСБанкамиДепозитыВызовСервера.ОбработатьСостояниеПанелиРасчетаДепозитов(ВидимостьПанелиРасчета);
	
КонецПроцедуры

// Настраивает отображение и заполняет доп параметры депозитов на форме.
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма объекта-владельца, в которой размещен депозитный калькулятор;
//  ПараметрыПредложений - см. НовыйПараметрыПредложенийБанка;
//  РезультатИнициализации - см. ОбменСБанкамиДепозиты.ПроверитьПродуктыБанковИЗавершитьИнициализацию.
//
Процедура УстановитьПредложенияБанковПослеИнициализации(Форма, ПараметрыПредложений, РезультатИнициализации) Экспорт
	
	ДополнительныеПараметры = ОбменСБанкамиДепозитыСлужебныйКлиентСервер.ДополнительныеПараметрыДепозитов(Форма);
	ТекущаяОрганизация = ОбщегоНазначенияКлиентСервер.ПолучитьРеквизитФормыПоПути(Форма, 
			ДополнительныеПараметры.ПутьКРеквизитуОрганизация);
	
	Если Не РезультатИнициализации.ЕстьПредложенияБанков Тогда
		
		ЕстьОшибка = Ложь;
		ПовторитьЗапрос = Ложь;
		Если ЗначениеЗаполнено(РезультатИнициализации.ОшибкаПолученияПредложений) Тогда
			ТекстСообщения = РезультатИнициализации.ОшибкаПолученияПредложений;
			ЕстьОшибка = Истина;
			ПовторитьЗапрос = Истина;
		ИначеЕсли Не РезультатИнициализации.ЕстьСчетаВБанкахСПоддержкойДепозитов Тогда
			ТекстСообщения = 
				ТекстСообщенияНетСчетовВБанкахСПоддержкойДепозитов();
		Иначе
			ТекстСообщения = 
				ОбменСБанкамиДепозитыКлиентСервер.ТекстСообщенияНетПредложенийБанковДляОрганизации();
		КонецЕсли;
		
		НастроитьОтображениеСтраницыИнформации(Форма, ТекстСообщения, ПовторитьЗапрос, Ложь, ЕстьОшибка);
		
		Возврат;
		
	КонецЕсли;
	
	ЭлементыФормы = Форма.Элементы;
	ИмяЭлементСтраницаИнформации = ОбменСБанкамиДепозитыСлужебныйКлиентСервер.ИмяЭлементаФормы("СтраницаИнформации");
	ЭлементСтраницаИнформации = ЭлементыФормы[ИмяЭлементСтраницаИнформации];
	ЭлементСтраницаИнформации.Видимость = Ложь;
	
	ИмяЭлементСтраницаРасчетДепозита =
		ОбменСБанкамиДепозитыСлужебныйКлиентСервер.ИмяЭлементаФормы("СтраницаРасчетДепозита");
	ЭлементСтраницаРасчетДепозита = ЭлементыФормы[ИмяЭлементСтраницаРасчетДепозита];
	ЭлементСтраницаРасчетДепозита.Видимость = Истина;
	
	ПараметрыРасчета = НовыеПараметрыРасчетаПредложений();
	ПараметрыРасчета.ДатаРасчета = ДополнительныеПараметры.ДатаОбновленияПредложений;
	АдресХранилищаПредложенийБанков = ДополнительныеПараметры.АдресХранилищаПредложенийБанков;
	
	ДанныеПредложенийБанков = ОбменСБанкамиДепозитыВызовСервера.ДанныеПредложенийБанков(АдресХранилищаПредложенийБанков,
		ПараметрыРасчета);
	
	ПараметрыПредложений = НовыйПараметрыПредложенийБанка();
	ПараметрыПредложений.Организация = ТекущаяОрганизация;
	
	УстановитьПараметрыИПредложенияПослеПолучения(Форма, ПараметрыПредложений, ДанныеПредложенийБанков);
	
КонецПроцедуры

// Сохраняет решение пользователя закрыть панель расчета депозита в хранилище
// общих настроек.
//
Процедура ОбработатьЗакрытиеПанелиРасчетаДепозитов() Экспорт
	
	ОбменСБанкамиДепозитыВызовСервера.ОбработатьЗакрытиеПанелиРасчетаДепозитов();
	
КонецПроцедуры

// Возвращает текст сообщения об отсутствии у организации счетов в банках с поддержкой сервиса 1С:Депозит.
//
// Возвращаемое значение:
//  Строка - текст сообщения, содержащий информацию и ссылку на список банков с поддержкой сервиса.
//
Функция ТекстСообщенияНетСчетовВБанкахСПоддержкойДепозитов() Экспорт
	
	СсылкаСписокБанков = ОбменСБанкамиДепозитыКлиентСервер.АдресСсылкиСервисаДепозиты();
	Текст = НСтр("ru='У организации нет счетов в банках с поддержкой сервиса <a href = ""%1"">1С:Депозит</a>.
		|
		|Информацию о возможности подключения вы можете запросить в вашем банке.'");
	Возврат СтроковыеФункцииКлиент.ФорматированнаяСтрока(Текст, СсылкаСписокБанков);
	
КонецФункции

// Процедура обработчик события "ОбработкаНавигационнойСсылки" элементов депозитного калькулятора.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма объекта-владельца, в которой размещен депозитный калькулятор;
//  ПараметрыПредложений - см. НовыйПараметрыПредложенийБанка;
//  НавигационнаяСсылкаФорматированнойСтроки - Строка - навигационная ссылка форматированной строки;
//  СтандартнаяОбработка - Булево - признак выполнения стандартной (системной) обработки события.
//
Процедура ОбработкаНавигационнойСсылки(Форма, ПараметрыПредложений, НавигационнаяСсылкаФорматированнойСтроки, 
		СтандартнаяОбработка) Экспорт
	
	Если НавигационнаяСсылкаФорматированнойСтроки = "НастройкаОбмена" Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ДополнительныеПараметрыДепозитов = 
			ОбменСБанкамиДепозитыСлужебныйКлиентСервер.ДополнительныеПараметрыДепозитов(Форма);
		Если ДополнительныеПараметрыДепозитов = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		Если ПараметрыПредложений = Неопределено Тогда
			ОбновитьПредложенияПриИзмененииОрганизации(Форма, ПараметрыПредложений);
			Возврат;
		КонецЕсли;
		
		ВыбранноеПредложение = ДополнительныеПараметрыДепозитов.ВыбранноеПредложение;
		
		ДанныеТекущегоПродукта = Неопределено;
		Для Каждого ТекПродукт Из ПараметрыПредложений.МассивПредложений Цикл
			ДанныеПродукта = ТекПродукт.ДополнительныеДанные;
			Если ДанныеПродукта.КлючПродукта = ВыбранноеПредложение Тогда
				ДанныеТекущегоПродукта = ТекПродукт.ДополнительныеДанные;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если ДанныеТекущегоПродукта = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		ТекущийБанк = ДанныеТекущегоПродукта.Банк;
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Организация", ПараметрыПредложений.Организация);
		ПараметрыФормы.Вставить("Банк", ТекущийБанк);
	
		ОткрытьФорму("Справочник.НастройкиОбменСБанками.Форма.ПомощникСозданияНастройкиОбмена", ПараметрыФормы);
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура обработчик события "ОбработкаОповещения" формы размещения депозитного калькулятора.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма объекта-владельца, в которой размещен депозитный калькулятор;
//  ИмяСобытия - Строка - имя события;
//  Параметр - Произвольный - параметр события, переданный при вызове "Оповестить";
//  Источник - Произвольный - источник события.
//
Процедура ОбработкаОповещения(Форма, ИмяСобытия, Параметр, Источник) Экспорт
	
	Если ИмяСобытия <> "ИзмененаНастройкаОбменСБанками"
		Или ТипЗнч(Параметр) <> Тип("СправочникСсылка.НастройкиОбменСБанками")
		Или Не ЗначениеЗаполнено(Параметр) Тогда
		Возврат;
	КонецЕсли;

	ДополнительныеПараметрыДепозитов = 
		ОбменСБанкамиДепозитыСлужебныйКлиентСервер.ДополнительныеПараметрыДепозитов(Форма);
	
	Если ДополнительныеПараметрыДепозитов = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ДополнительныеПараметрыДепозитов.ВыполняетсяАктуализация Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтоАдресВременногоХранилища(ДополнительныеПараметрыДепозитов.АдресХранилищаПредложенийБанков) Тогда
		УдалитьИзВременногоХранилища(ДополнительныеПараметрыДепозитов.АдресХранилищаПредложенийБанков);
		ДополнительныеПараметрыДепозитов.АдресХранилищаПредложенийБанков = Неопределено;
	КонецЕсли;
	
	ИмяГруппыРазмещения = ДополнительныеПараметрыДепозитов.ИмяГруппыРазмещения;
	ЭлементКалькулятор = Форма.Элементы[ИмяГруппыРазмещения];
	ДополнительныеПараметрыДепозитов.ВыбранноеПредложение = "";
	
	Если ЭлементКалькулятор.Видимость Тогда
		ТекстСообщения = ОбменСБанкамиДепозитыКлиентСервер.ТекстСообщенияОбновлениеПредложений();
		НастроитьОтображениеСтраницыИнформации(Форма, ТекстСообщения, Ложь, Истина);
		Форма.ПодключитьОбработчикОжидания(
		"Подключаемый_ОбменСБанкамиДепозитыПроверитьАктуальностьПредложений", 0.1, Истина);
	Иначе
		ДополнительныеПараметрыДепозитов.ДатаОбновленияПредложений = Дата(1, 1, 1);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ПослеОбновленияДанныхДепозитныхПродуктов(Результат, ДополнительныеПараметры) Экспорт
	
	Форма = ДополнительныеПараметры.Форма;
	ТекстСообщения = "";
	
	Если Не ТипЗнч(Результат) = Тип("Структура") Тогда // задание было отменено
		ТекстСообщения =  НСтр("ru = 'Не удалось отправить запрос в банк.'");
	ИначеЕсли Результат.Статус = "Ошибка" Тогда
		ТекстСообщения = Результат.КраткоеПредставлениеОшибки;
	КонецЕсли;
	
	ДополнительныеПараметрыДепозитов =
			ОбменСБанкамиДепозитыСлужебныйКлиентСервер.ДополнительныеПараметрыДепозитов(Форма);
	ДополнительныеПараметрыДепозитов.ВыполняетсяАктуализация = Ложь;
	Если Не ПустаяСтрока(ТекстСообщения) Тогда
		ДополнительныеПараметрыДепозитов.ДатаОбновленияПредложений = Дата(1, 1, 1);
		НастроитьОтображениеСтраницыИнформации(ДополнительныеПараметры.Форма, ТекстСообщения, Истина, Ложь, Истина);
	Иначе
		ПоказатьРасчетДепозитов(ДополнительныеПараметры.Форма, ДополнительныеПараметры.ПараметрыПредложений);
	КонецЕсли;
	
КонецПроцедуры

// Выполняет поиск подходящих условий по сроку и сумме депозита, обновляет расчет дохода и данные на форме.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма объекта-владельца, в которой размещен депозитный калькулятор;
//  ПараметрыПредложений - см. НовыйПараметрыПредложенийБанка.
//
// Возвращаемое значение:
//  Булево - Истина, если найдено подходящие условие.
//
Функция ПроверитьОбновитьРасчетПоУсловиямТекущегоПродукта(Форма, ПараметрыПредложений) Экспорт
	
	Если Не ЗначениеЗаполнено(ПараметрыПредложений) Тогда
		ОбновитьПредложенияПриИзмененииОрганизации(Форма, ПараметрыПредложений);
	КонецЕсли;
	
	ДополнительныеПараметры = 
		ОбменСБанкамиДепозитыСлужебныйКлиентСервер.ДополнительныеПараметрыДепозитов(Форма);
	ДатаРасчета = ДополнительныеПараметры.ДатаОбновленияПредложений;
	ИмяПараметра = ОбменСБанкамиДепозитыСлужебныйКлиентСервер.ИмяПараметра("Сумма");
	СуммаДепозита = Форма[ИмяПараметра];
	ИмяПараметра = ОбменСБанкамиДепозитыСлужебныйКлиентСервер.ИмяПараметра("Срок");
	СрокДепозита = Форма[ИмяПараметра];
	СписокДоходности = Новый СписокЗначений();
	ЕстьПодходящиеУсловие = Ложь;
	УсловияТекущегоПродукта = ПараметрыПредложений.УсловияТекущегоПродукта;
	МассивПредложений = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
		ПараметрыПредложений, "МассивПредложений", Новый Массив());
	КлючПродуктаУсловий = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
		УсловияТекущегоПродукта, "КлючПродукта", ДополнительныеПараметры.ВыбранноеПредложение);
	СписокУсловий = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
		УсловияТекущегоПродукта, "Условия", Неопределено);
	
	Если Не СписокУсловий = Неопределено И СписокУсловий.Количество() > 0
		И Не ДополнительныеПараметры.ВыбранноеПредложение = КлючПродуктаУсловий Тогда
		
		СписокУсловий = ОбменСБанкамиДепозитыВызовСервера.ПолучитьУсловияПродукта(
			ДополнительныеПараметры.АдресХранилищаПредложенийБанков, ДополнительныеПараметры.ВыбранноеПредложение);
		УсловияТекущегоПродукта.КлючПродукта = ДополнительныеПараметры.ВыбранноеПредложение;
		УсловияТекущегоПродукта.Условия = СписокУсловий;
		
	КонецЕсли;
	
	МаксСтавка = 0;
	
	Если Не СписокУсловий = Неопределено Тогда
		
		Для Индекс = 0 По СписокУсловий.Количество() - 1 Цикл
			
			ТекущиеУсловие = СписокУсловий[Индекс];
			
			Если ОбменСБанкамиДепозитыСлужебныйКлиентСервер.ВыполняютсяУсловияПродукта(
					ТекущиеУсловие, СуммаДепозита, СрокДепозита) Тогда
				
				ЕстьПодходящиеУсловие = Истина;
				Доход = ОбменСБанкамиДепозитыСлужебныйКлиентСервер.РассчитатьДоход(ДатаРасчета, 
					СуммаДепозита, ТекущиеУсловие.Ставка, СрокДепозита);
				СписокДоходности.Добавить(Доход, Индекс);
				
			КонецЕсли;
			
			МаксСтавка = Макс(МаксСтавка, ТекущиеУсловие.Ставка);
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если СписокДоходности.Количество() > 1 Тогда
		СписокДоходности.СортироватьПоЗначению(НаправлениеСортировки.Убыв);
	КонецЕсли;
	
	КлючПродукта = ДополнительныеПараметры.ВыбранноеПредложение;
	ДополнительныеДанные = Неопределено;
	ЭтоПредложениеПоДепозиту = Ложь;
	
	Для Каждого ТекушийПродукт Из МассивПредложений Цикл
		
		ДополнительныеДанные = ТекушийПродукт.ДополнительныеДанные;
		
		Если ДополнительныеДанные.КлючПродукта = КлючПродукта Тогда
			
			ЭтоПредложениеПоДепозиту = ДополнительныеДанные.ЭтоПредложениеДепозита;
			
			Если Не ЭтоПредложениеПоДепозиту Тогда
				Прервать;
			КонецЕсли;
			
			Если ЕстьПодходящиеУсловие Тогда
				
				УсловиеПродукта = СписокУсловий[Число(СписокДоходности[0].Представление)];
				ДополнительныеДанные.ИдентификаторУсловия = УсловиеПродукта.ИдентификаторУсловия;
				ДополнительныеДанные.Сумма = СуммаДепозита;
				ДополнительныеДанные.Срок = СрокДепозита;
				ДополнительныеДанные.Ставка = УсловиеПродукта.Ставка;
				ДополнительныеДанные.Доход = СписокДоходности[0].Значение;
				ДополнительныеДанные.НеВыполненыУсловия = Ложь;
				ДополнительныеДанные.СрокМинимум = УсловиеПродукта.СрокМинимум;
				ДополнительныеДанные.СрокМаксимум = УсловиеПродукта.СрокМаксимум;
				ДополнительныеДанные.СуммаМинимум = УсловиеПродукта.СуммаМинимум;
				ДополнительныеДанные.СуммаМаксимум = УсловиеПродукта.СуммаМаксимум;
			Иначе
				ДополнительныеДанные.НеВыполненыУсловия = Истина;
			КонецЕсли;
			
			Если ПараметрыПредложений.ОдинБанк Тогда
				НаименованиеПродукта = СтрШаблон("%1%% %2", ДополнительныеДанные.Ставка,
					ДополнительныеДанные.Наименование);
			Иначе
				НаименованиеПродукта = СтрШаблон("%1: %2%% %3", ДополнительныеДанные.НаименованиеБанка, 
					ДополнительныеДанные.Ставка, ДополнительныеДанные.Наименование);
			КонецЕсли;
			
			ТекушийПродукт.Значение = НаименованиеПродукта;
			Прервать;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если ЭтоПредложениеПоДепозиту Тогда
	
		УстановитьПредложениеБанка(Форма, ТекушийПродукт.Значение, ДополнительныеДанные, ПараметрыПредложений);
	
	КонецЕсли;
	
	Возврат ЕстьПодходящиеУсловие;
	
КонецФункции

// Подготавливает запуск задания проверки актуальности предложений, и обновляет их данные на форме.
// Устанавливает страницу информации на панели расчета депозита в состояние ожидания завершения операции.
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма объекта-владельца, в которой размещен депозитный калькулятор.
//  ПараметрыПредложений - см. НовыйПараметрыПредложенийБанка.
//  ОбновитьВсеБанки - Булево - если Истина, данные для запроса предложений будут получены для всех доступных банков,
//    вне зависимости от актуальности уже полученных предложений.
//
Процедура ПроверитьАктуальностьИОбновитьДанныеДепозитныхПродуктов(Форма, ПараметрыПредложений = Неопределено,
		ОбновитьВсеБанки = Ложь) Экспорт
	
	ДополнительныеПараметрыДепозитов = 
		ОбменСБанкамиДепозитыСлужебныйКлиентСервер.ДополнительныеПараметрыДепозитов(Форма);
	ТекстСообщения = ОбменСБанкамиДепозитыКлиентСервер.ТекстСообщенияОбновлениеПредложений();
	НастроитьОтображениеСтраницыИнформации(Форма, ТекстСообщения, Ложь, Истина);
	ДополнительныеПараметрыОповещения = Новый Структура;
	ДополнительныеПараметрыОповещения.Вставить("Форма", Форма);
	ДополнительныеПараметрыОповещения.Вставить("ПараметрыПредложений", ПараметрыПредложений);
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ПослеОбновленияДанныхДепозитныхПродуктов", 
		ЭтотОбъект, ДополнительныеПараметрыОповещения);
	
	РезультатЗапускаЗадания =
		ОбменСБанкамиДепозитыВызовСервера.ЗапускЗаданияОбновленияДанныхДепозитныхПродуктов(ОбновитьВсеБанки);
	Если ЗначениеЗаполнено(РезультатЗапускаЗадания.ДлительнаяОперация) Тогда
		ДополнительныеПараметрыДепозитов.ДатаОбновленияПредложений = РезультатЗапускаЗадания.ДатаОбновленияПредложений;
		ДополнительныеПараметрыДепозитов.ВыполняетсяАктуализация = Истина;
		ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(Неопределено);
		ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
		ДлительныеОперацииКлиент.ОжидатьЗавершение(РезультатЗапускаЗадания.ДлительнаяОперация,
			ОповещениеОЗавершении, ПараметрыОжидания);
	КонецЕсли
	
КонецПроцедуры

// Функция - конструктор параметров открытия формы Документы.ЗаявкаНаДепозит.Формы.СрокиИУсловия.
//
// Возвращаемое значение:
//  Структура:
//   * ПараметрыПродукта - см. НовыеПараметрыПродукта.
//   * ПараметрыПользователя - см. НовыеПараметрыПользователя.
//   * АдресХранилищаПредложенийБанков - Строка - адрес временного хранилища с данными предложений банков.
//   * РежимВыбора - Булево - значение по умолчанию Истина.
//   * МножественныйВыбор - Булево - значение по умолчанию Ложь.
//   * ЗакрыватьПриВыборе - Булево - значение по умолчанию Истина.
//
Функция НовыеПараметрыОткрытияФормыСрокиИУсловия() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("ПараметрыПродукта", Новый Структура);
	Результат.Вставить("ПараметрыПользователя", Новый Структура);
	Результат.Вставить("АдресХранилищаПредложенийБанков", "");
	Результат.Вставить("РежимВыбора", Истина);
	Результат.Вставить("МножественныйВыбор", Ложь);
	Результат.Вставить("ЗакрыватьПриВыборе", Истина);
	
	Возврат Результат;
	
КонецФункции

// Функция - конструктор свойств параметра "ПараметрыПродукта" для 
//  параметров открытия формы Документы.ЗаявкаНаДепозит.Формы.СрокиИУсловия.
//
// Возвращаемое значение:
//  Структура:
//   * КлючПродукта - Строка - уникальный идентификатор депозитного продукта.
//   * Наименование - Строка - наименование депозитного продукта.
//   * НаименованиеБанка - Строка - наименование банка.
//   * ПодробноеОписание - Строка - описание депозитного продукта.
//   * РасчетПриОформлении - Булево - если Истина, расчет доходности выполняется в банке.
//   * ОдинБанк - Булево - если Истина, все депозитные продукты от одного банка.
//
Функция НовыеПараметрыПродукта() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("КлючПродукта", "");
	Результат.Вставить("Наименование", "");
	Результат.Вставить("НаименованиеБанка", "");
	Результат.Вставить("ПодробноеОписание", "");
	Результат.Вставить("РасчетПриОформлении", Ложь);
	Результат.Вставить("ОдинБанк", Ложь);
	
	Возврат Результат;
	
КонецФункции

// Функция - конструктор свойств параметра "ПараметрыПользователя" для 
// параметров открытия формы Документы.ЗаявкаНаДепозит.Формы.СрокиИУсловия.
// см. НовыеПараметрыОткрытияФормыСрокиИУсловия.
//
// Возвращаемое значение:
//  Структура:
//   * Срок - Число - срок депозита в днях.
//   * Сумма - Число - сумма депозита.
//   * ДатаРасчета - Дата - дата расчета.
//
Функция НовыеПараметрыПользователя() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Срок", 0);
	Результат.Вставить("Сумма", 0);
	Результат.Вставить("ДатаРасчета", Дата(1, 1, 1));
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПоказатьРасчетДепозитов(Форма, ПараметрыПредложений)
	
	ДополнительныеПараметры =
		ОбменСБанкамиДепозитыСлужебныйКлиентСервер.ДополнительныеПараметрыДепозитов(Форма);
	
	Если Не ОрганизацияЗаполнена(Форма) Тогда
		ТекстСообщения = ОбменСБанкамиДепозитыКлиентСервер.ТекстСообщенияНеЗаполненаОрганизация();
		НастроитьОтображениеСтраницыИнформации(Форма, ТекстСообщения, Ложь);
	ИначеЕсли Не ОбменСБанкамиДепозитыСлужебныйКлиентСервер.ОтложеннаяИнициализацияВыполнена(
			ДополнительныеПараметры) Тогда
		Форма.ОбменСБанкамиДепозитыВыполнитьИнициализацию();
	Иначе
		ОбновитьПредложенияПриИзмененииОрганизации(Форма, ПараметрыПредложений);
	КонецЕсли;
	
КонецПроцедуры

// Обновляет отображение данных предложений банков по депозитам.
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма объекта-владельца, в которой размещен депозитный калькулятор;
//  ПараметрыПредложений - Структура - см. НовыйПараметрыПредложенийБанка;
//  ДанныеПредложенийБанков - см. ОбменСБанкамиДепозитыСлужебный.СформироватьПредложенияБанков.
//
Процедура УстановитьПараметрыИПредложенияПослеПолучения(Форма, ПараметрыПредложений,
		ДанныеПредложенийБанков)
	
	ДополнительныеПараметрыДепозиты =
		ОбменСБанкамиДепозитыСлужебныйКлиентСервер.ДополнительныеПараметрыДепозитов(Форма);
	
	Для Каждого ТекущееПредложение Из ДанныеПредложенийБанков.МассивПредложений Цикл
		
		СлужебныйЭлементСпискаПредложений = 
			ОбменСБанкамиДепозитыСлужебныйКлиентСервер.ЗначениеСлужебногоЭлементаСпискаПредложений();
			
		Если ТекущееПредложение.Значение <> СлужебныйЭлементСпискаПредложений Тогда
			ВыбранноеПредложение = ТекущееПредложение;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Если ВыбранноеПредложение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеВыбранногоУсловия = ВыбранноеПредложение.ДополнительныеДанные;
	ДанныеВыбранногоПредложения = ВыбранноеПредложение.Значение;
	КлючПродукта = ДанныеВыбранногоУсловия.КлючПродукта;
	ИмяПараметраСумма = ОбменСБанкамиДепозитыСлужебныйКлиентСервер.ИмяПараметра("Сумма");
	ИмяПараметраСрок = ОбменСБанкамиДепозитыСлужебныйКлиентСервер.ИмяПараметра("Срок");
	ИмяПараметраДатаЗакрытия = ОбменСБанкамиДепозитыСлужебныйКлиентСервер.ИмяПараметра("ДатаЗакрытия");
	ДлинаСуток = 24 * 60 * 60;
	
	// Для расчета сроков предложений используем ДатуОбновленияПредложений, т.к. ДатаОбновленияПредложений - это
	// НачалоДня(ТекущаяДатаСеанса()), полученная при проверке актуальности предложений,
	// и ее использование предпочтительней, чем использование ТекущаяДата(), и позволяет избежать возможных ошибок
	// при получении текущей даты во время расчета условий депозитных продуктов.
	//
	Если Форма[ИмяПараметраСумма] = 0 Тогда
		Форма[ИмяПараметраСумма] = ДанныеВыбранногоУсловия.Сумма;
	КонецЕсли;
	
	Если Форма[ИмяПараметраСрок] = 0 Тогда
		ДанныеВыбранногоУсловияСрок = 1;
		Если ДанныеВыбранногоУсловия.Срок <> 0 Тогда
			ДанныеВыбранногоУсловияСрок = ДанныеВыбранногоУсловия.Срок;
		КонецЕсли;
		Форма[ИмяПараметраСрок] = ДанныеВыбранногоУсловияСрок;
		Форма[ИмяПараметраДатаЗакрытия] =
			ДополнительныеПараметрыДепозиты.ДатаОбновленияПредложений + ДанныеВыбранногоУсловияСрок * ДлинаСуток;
	КонецЕсли;
	
	ЭлементыФормы = Форма.Элементы;
	ИмяЭлемента = ОбменСБанкамиДепозитыСлужебныйКлиентСервер.ИмяЭлементаФормы("Предложение");
	ЭлементПредложение = ЭлементыФормы[ИмяЭлемента];
	ТекстЗаголовка = НСтр("ru = 'Предложения'");
	
	Если ДанныеПредложенийБанков.ОдинБанк Тогда
		ТекстЗаголовка = СтрШаблон(НСтр("ru = 'Предложения банка %1'"), ДанныеВыбранногоУсловия.НаименованиеБанка);
	КонецЕсли;

	ЭлементПредложение.Заголовок = ТекстЗаголовка;

	ПараметрыПредложений.МассивПредложений = ДанныеПредложенийБанков.МассивПредложений;
	ПараметрыПредложений.УсловияТекущегоПродукта = ДанныеПредложенийБанков.УсловияТекущегоПродукта;
	ПараметрыПредложений.ОдинБанк = ДанныеПредложенийБанков.ОдинБанк;
	
	ДополнительныеПараметрыДепозиты.ВыбранноеПредложение = КлючПродукта;
	ИмяПараметраДополнительныеПараметры =
		ОбменСБанкамиДепозитыСлужебныйКлиентСервер.ИмяПараметра("ДополнительныеПараметры");
	Форма[ИмяПараметраДополнительныеПараметры] = ДополнительныеПараметрыДепозиты;
	УстановитьПредложениеБанка(Форма, ДанныеВыбранногоПредложения,
		ДанныеВыбранногоУсловия, ПараметрыПредложений);
	
	НастроитьВидимостьСтраницыРасчетДепозитов(Форма, Истина);
	
КонецПроцедуры

// Устанавливает данные выбранного предложения банка на форме.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма объекта-владельца, в которой размещен депозитный калькулятор;
//  ВыбранноеПредложение - Строка - выбранное пользователем предложение в списке выбора предложений;
//  ВыбранноеУсловие - см. ОбменСБанкамиДепозитыСлужебный.НовыеПараметрыУсловияДепозитногоПродукта;
//  ПараметрыПредложений - см. НовыйПараметрыПредложенийБанка.
//
Процедура УстановитьПредложениеБанка(Форма, ВыбранноеПредложение, ВыбранноеУсловие, ПараметрыПредложений)
	
	ЭлементыФормы = Форма.Элементы;
	КлючПараметраСумма = "Сумма";
	ИмяПараметраСумма = ОбменСБанкамиДепозитыСлужебныйКлиентСервер.ИмяПараметра(КлючПараметраСумма);
	ИмяПараметраСрок = ОбменСБанкамиДепозитыСлужебныйКлиентСервер.ИмяПараметра("Срок");
	ИмяПараметраДатаЗакрытия = ОбменСБанкамиДепозитыСлужебныйКлиентСервер.ИмяПараметра("ДатаЗакрытия");
	ДополнительныеПараметры =
		ОбменСБанкамиДепозитыСлужебныйКлиентСервер.ДополнительныеПараметрыДепозитов(Форма);
	ДлинаСуток = 24 * 60 * 60;
	ПользовательВыбралПараметры = ПараметрыПредложений.ПользовательУказалПараметры;
	МассивПредложений = ПараметрыПредложений.МассивПредложений;
	ОдноПредложение = Ложь;
	
	// Для расчета сроков предложений используем ДатуОбновленияПредложений, т.к. ДатаОбновленияПредложений - это
	// НачалоДня(ТекущаяДатаСеанса()), полученная при проверке актуальности предложений,
	// и ее использование предпочтительней, чем использование ТекущаяДата(), и позволяет избежать возможных ошибок
	// при получении текущей даты во время расчета условий депозитных продуктов.
	//
	Если МассивПредложений.Количество() = 1 Тогда
		ОдноПредложение = Истина;
	КонецЕсли;
	
	Если Не ПользовательВыбралПараметры И ВыбранноеУсловие.РасчетПриОформлении Тогда
		
		ВыбрранноеУсловиеСрок = 1;
		Если ВыбранноеУсловие.Срок <> 0 Тогда
			ВыбрранноеУсловиеСрок = ВыбранноеУсловие.Срок;
		КонецЕсли;
		
		Форма[ИмяПараметраСрок] = ВыбрранноеУсловиеСрок;
		Форма[ИмяПараметраСумма] = ВыбранноеУсловие.Сумма;
		Форма[ИмяПараметраДатаЗакрытия] =
			ДополнительныеПараметры.ДатаОбновленияПредложений + ВыбрранноеУсловиеСрок * ДлинаСуток;
		
	КонецЕсли;
	
	ЗначениеПараметраСумма = Форма[ИмяПараметраСумма];
	
	ИмяЭлемента = ОбменСБанкамиДепозитыСлужебныйКлиентСервер.ИмяЭлементаФормы("Ставка");
	ЭлементПараметраСтавка = ЭлементыФормы[ИмяЭлемента];
	
	ИмяЭлемента = ОбменСБанкамиДепозитыКлиентСервер.ИмяКоманды("ОтправитьЗаявку");
	ЭлементФормыКнопкаЗаявки = ЭлементыФормы[ИмяЭлемента];
	
	ИмяЭлемента = ОбменСБанкамиДепозитыСлужебныйКлиентСервер.ИмяЭлементаФормы("Доход");
	ЭлементПараметраДоход = ЭлементыФормы[ИмяЭлемента];
	
	ИмяЭлемента = ОбменСБанкамиДепозитыСлужебныйКлиентСервер.ИмяЭлементаФормы("РасчетПриОформлении");
	ЭлементРасчетПриОформлении = ЭлементыФормы[ИмяЭлемента];
	
	ИмяЭлемента = ОбменСБанкамиДепозитыСлужебныйКлиентСервер.ИмяЭлементаФормы("Итог");
	ЭлементПараметраИтог = ЭлементыФормы[ИмяЭлемента];
	
	ИмяЭлемента = ОбменСБанкамиДепозитыСлужебныйКлиентСервер.ИмяЭлементаФормы("ГруппаПараметровДоходности");
	ЭлементГруппаПараметровДоходности = ЭлементыФормы[ИмяЭлемента];
	
	ИмяЭлемента = ОбменСБанкамиДепозитыСлужебныйКлиентСервер.ИмяЭлементаФормы("ВсплывающаяГруппа");
	ЭлементДоходность = ЭлементыФормы[ИмяЭлемента];
	
	ИмяЭлемента = ОбменСБанкамиДепозитыСлужебныйКлиентСервер.ИмяЭлементаФормы("ГоризонтальнаяГруппаОписание");
	ЭлементГруппаОписание = ЭлементыФормы[ИмяЭлемента];
	
	ИмяЭлемента = ОбменСБанкамиДепозитыСлужебныйКлиентСервер.ИмяЭлементаФормы("ГоризонтальнаяГруппаПодвал");
	ЭлементГруппаПодвал = ЭлементыФормы[ИмяЭлемента];
	
	ИмяЭлемента = ОбменСБанкамиДепозитыСлужебныйКлиентСервер.ИмяЭлементаФормы("ОписаниеДепозита");
	ЭлементОписание = ЭлементыФормы[ИмяЭлемента];
	
	ИмяЭлемента = ОбменСБанкамиДепозитыСлужебныйКлиентСервер.ИмяЭлементаФормы("ОписаниеБанка");
	ЭлементОписаниеБанка = ЭлементыФормы[ИмяЭлемента];
	
	ФорматЧислаСтрока = "ЧЦ=15; ЧДЦ=2;";
	
	ЭлементГруппаПараметровДоходности.Видимость = Истина;
	ЭлементРасчетПриОформлении.Видимость = Ложь;
	ЭлементДоходность.Видимость = Истина;
	ЭлементГруппаОписание.Видимость = Истина;
	ЭлементГруппаПодвал.Видимость = Истина;
	ЭлементОписаниеБанка.Видимость = Ложь;
	
	Если ВыбранноеУсловие.РасчетПриОформлении Тогда
		
		ЭлементГруппаПараметровДоходности.Видимость = Ложь;
		ЭлементРасчетПриОформлении.Видимость = Истина;
		
	КонецЕсли;
	
	Если Не ВыбранноеУсловие.ЭтоПредложениеДепозита Тогда
		
		ЭлементОписаниеБанка.Видимость = Истина;
		ЭлементОписаниеБанка.Заголовок = ВыбранноеУсловие.ОписаниеПродукта;
		ЭлементДоходность.Видимость = Ложь;
		ЭлементГруппаПодвал.Видимость = Ложь;
		
		ЭлементПараметраСтавка.Заголовок = "";
		ЭлементПараметраДоход.Заголовок = Формат(0, ФорматЧислаСтрока);
		ЭлементПараметраИтог.Заголовок = Формат(0, ФорматЧислаСтрока);
		
	ИначеЕсли Не ВыбранноеУсловие.НеВыполненыУсловия Тогда
		
		ЭлементПараметраИтог.Заголовок = Формат(ВыбранноеУсловие.Доход + ЗначениеПараметраСумма, ФорматЧислаСтрока);
		ЭлементДоходность.Заголовок = ОбменСБанкамиДепозитыКлиентСервер.СформироватьСтрокуИнформацииПоУсловию(
			ВыбранноеУсловие);
		ЭлементОписание.Заголовок = СтроковыеФункцииКлиент.ФорматированнаяСтрока(ВыбранноеУсловие.ОписаниеПродукта);
		ЭлементПараметраДоход.Заголовок = Формат(ВыбранноеУсловие.Доход, ФорматЧислаСтрока);
		ШаблонЗаголовка = НСтр("ru = '%1 %% год.'");
		ЭлементПараметраСтавка.Заголовок = СтрШаблон(ШаблонЗаголовка, ВыбранноеУсловие.Ставка);
		ЭлементФормыКнопкаЗаявки.Доступность = Истина;
		
	Иначе
		
		ЭлементПараметраСтавка.Заголовок = "";
		ЭлементПараметраДоход.Заголовок = Формат(0, ФорматЧислаСтрока);
		ЭлементПараметраИтог.Заголовок = Формат(0, ФорматЧислаСтрока);
		ЭлементДоходность.Заголовок = НСтр("ru = 'Не выполнены условия продукта'");
		Если ОдноПредложение Тогда
			ЭлементОписание.Заголовок = 
				НСтр("ru = 'Укажите другие параметры депозита или подберите подходящие условия'");
		Иначе
			ЭлементОписание.Заголовок = 
				НСтр("ru = 'Выберите другой продукт из списка предложений или подберите подходящие условия'");
		КонецЕсли;
		ЭлементФормыКнопкаЗаявки.Доступность = Ложь;
		
	КонецЕсли;
	
	ИмяПараметра = ОбменСБанкамиДепозитыСлужебныйКлиентСервер.ИмяПараметра("Предложение");
	Форма[ИмяПараметра] = ВыбранноеПредложение;
	
КонецПроцедуры

// Выводит сообщение и настраивает отображение страницы информации.
//
// Параметры:
//   Форма - ФормаКлиентскогоПриложения - Форма, в которой необходимо настроить отображение страницы информации.
//   ТекстСообщения - Строка - Текст сообщения, которое необходимо вывести.
//   ПовторитьЗапрос - Булево - Флаг, указывающий, следует ли отображать команду повторного запроса.
//   ПоказатьОжидание - Булево - Флаг, указывающий, следует ли отображать признак ожидания.
//   ПоказатьОшибку - Булево - Флаг, указывающий, следует ли отображать признак ошибки.
//
Процедура НастроитьОтображениеСтраницыИнформации(Форма, ТекстСообщения, ПовторитьЗапрос,
	ПоказатьОжидание = Ложь, ПоказатьОшибку = Ложь)
	
	Элементы = Форма.Элементы;
	ДополнительныеПараметры = 
		ОбменСБанкамиДепозитыСлужебныйКлиентСервер.ДополнительныеПараметрыДепозитов(Форма);
	ИмяЭлементаСтраницаИнформации = ОбменСБанкамиДепозитыСлужебныйКлиентСервер.ИмяЭлементаФормы(
		"СтраницаИнформации");
	ИмяЭлементаСтраницаРасчетДепозита = ОбменСБанкамиДепозитыСлужебныйКлиентСервер.ИмяЭлементаФормы(
		"СтраницаРасчетДепозита");
	ЭлементСтраницаИнформации = Элементы[ИмяЭлементаСтраницаИнформации];
	
	ЭлементСтраницаИнформации.Видимость = Истина;
	
	Если ОбменСБанкамиДепозитыСлужебныйКлиентСервер.ОтложеннаяИнициализацияВыполнена(ДополнительныеПараметры) Тогда
		ЭлементСтраницаРасчетДепозита = Элементы[ИмяЭлементаСтраницаРасчетДепозита];
		ЭлементСтраницаРасчетДепозита.Видимость = Ложь;
	КонецЕсли;
	
	ИмяЭлементаОжидание = ОбменСБанкамиДепозитыСлужебныйКлиентСервер.ИмяЭлементаФормы("ОжиданиеКартинка");
	ЭлементОжиданиеКартинка = Элементы[ИмяЭлементаОжидание];
	ЭлементОжиданиеКартинка.Видимость = ПоказатьОжидание;
	
	ИмяЭлементаОшибка = ОбменСБанкамиДепозитыСлужебныйКлиентСервер.ИмяЭлементаФормы("ОшибкаКартинка");
	ЭлементОшибкаКартинка = Элементы[ИмяЭлементаОшибка];
	ЭлементОшибкаКартинка.Видимость = ПоказатьОшибку;
	
	ИмяЭлементаТекстСообщения = ОбменСБанкамиДепозитыСлужебныйКлиентСервер.ИмяЭлементаФормы("ТекстСообщения");
	ЭлементОжиданиеТекст = Элементы[ИмяЭлементаТекстСообщения];
	Если ТипЗнч(ТекстСообщения) = Тип("Строка") Тогда
		ЭлементОжиданиеТекст.Заголовок = СтроковыеФункцииКлиент.ФорматированнаяСтрока(ТекстСообщения);
	Иначе
		ЭлементОжиданиеТекст.Заголовок = ТекстСообщения;
	КонецЕсли;
	
	ИмяЭлементаКомандаПовторитьЗапрос = ОбменСБанкамиДепозитыКлиентСервер.ИмяКоманды("ПовторитьЗапросПредложений");
	ЭлементКомандаПовторитьЗапрос = Элементы[ИмяЭлементаКомандаПовторитьЗапрос];
	
	ЭлементКомандаПовторитьЗапрос.Видимость = ПовторитьЗапрос;
	
КонецПроцедуры

Процедура НастроитьВидимостьСтраницыРасчетДепозитов(Форма, ВидимостьСтраницы)
	
	Элементы = Форма.Элементы;
	ИмяЭлементаСтраницаИнформации = ОбменСБанкамиДепозитыСлужебныйКлиентСервер.ИмяЭлементаФормы(
		"СтраницаИнформации");
	ИмяЭлементаСтраницаРасчетДепозита = ОбменСБанкамиДепозитыСлужебныйКлиентСервер.ИмяЭлементаФормы(
		"СтраницаРасчетДепозита");
	
	ЭлементСтраницаИнформации = Элементы[ИмяЭлементаСтраницаИнформации];
	ЭлементСтраницаИнформации.Видимость = Не ВидимостьСтраницы;

	ЭлементСтраницаРасчетДепозита = Элементы[ИмяЭлементаСтраницаРасчетДепозита];
	ЭлементСтраницаРасчетДепозита.Видимость = ВидимостьСтраницы;
	
КонецПроцедуры

Функция ОрганизацияЗаполнена(Форма)
	
	ДополнительныеПараметры = 
		ОбменСБанкамиДепозитыСлужебныйКлиентСервер.ДополнительныеПараметрыДепозитов(Форма);
	ТекущаяОрганизация = ОбщегоНазначенияКлиентСервер.ПолучитьРеквизитФормыПоПути(Форма, 
		ДополнительныеПараметры.ПутьКРеквизитуОрганизация);
	
	Возврат ЗначениеЗаполнено(ТекущаяОрганизация);
	
КонецФункции

// Возвращает новую структуру параметров для расчета предложений банков.
//
// Возвращаемое значение:
//  Структура:
//   * ДатаРасчета - Дата - текущая дата расчета доходности предложения.
//   * Сумма - Число - сумма депозита.
//   * Срок - Число - срок депозита в днях.
//
Функция НовыеПараметрыРасчетаПредложений()
	
	Результат = Новый Структура;
	Результат.Вставить("ДатаРасчета", Дата(1, 1, 1));
	Результат.Вставить("Сумма", 0);
	Результат.Вставить("Срок", 0);
	
	Возврат Результат;
	
КонецФункции

// Создает и возвращает структуру параметров предложений банков по депозитам.
//
// Возвращаемое значение:
//  Структура:
//   * Организация - Неопределено, ОпределяемыйТип.Организация - ссылка на организацию;
//   * МассивПредложений - Массив из см. ОбменСБанкамиДепозитыСлужебный.СформироватьДанныеСпискаВыбораПредложений;
//   * УсловияТекущегоПродукта - см. ОбменСБанкамиДепозитыСлужебный.СформироватьПредложенияБанков;
//   * ПользовательУказалПараметры - Булево - признак указания параметров пользователем;
//   * ОдинБанк - Булево - признак указывающий что все доступные предложения от одного банка.
//
Функция НовыйПараметрыПредложенийБанка()
	
	Результат = Новый Структура;
	Результат.Вставить("Организация", Неопределено);
	Результат.Вставить("МассивПредложений", Новый Массив);
	Результат.Вставить("УсловияТекущегоПродукта", Новый Структура);
	Результат.Вставить("ПользовательУказалПараметры", Ложь);
	Результат.Вставить("ОдинБанк", Ложь);
	
	Возврат Результат;
	
КонецФункции

// Выполняет обновление данных депозитных продуктов после изменения организации.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма объекта-владельца, в которой размещен депозитный калькулятор;
//  ПараметрыПредложений - см. НовыйПараметрыПредложенийБанка;
//  Организация - ОпределяемыйТип.Организация - ссылка на организацию.
//
Процедура ОбновитьДанныеПредложенияБанков(Форма, ПараметрыПредложений, Организация = Неопределено)
	
	ДополнительныеПараметры = ОбменСБанкамиДепозитыСлужебныйКлиентСервер.ДополнительныеПараметрыДепозитов(Форма);
	ИмяПараметраСумма = ОбменСБанкамиДепозитыСлужебныйКлиентСервер.ИмяПараметра("Сумма");
	ИмяПараметраСрок = ОбменСБанкамиДепозитыСлужебныйКлиентСервер.ИмяПараметра("Срок");
	
	СуммаДепозита = 0;
	СрокДепозита = 0 ;
	
	Если ПараметрыПредложений.ПользовательУказалПараметры Тогда
		СуммаДепозита = Форма[ИмяПараметраСумма];
		СрокДепозита = Форма[ИмяПараметраСрок];
	КонецЕсли;
	
	ПараметрыРасчета = НовыеПараметрыРасчетаПредложений();
	ПараметрыРасчета.ДатаРасчета = ДополнительныеПараметры.ДатаОбновленияПредложений;
	ПараметрыРасчета.Сумма = СуммаДепозита;
	ПараметрыРасчета.Срок = СрокДепозита;
	
	ПредложенияБанков = Неопределено;
	
	Если ЗначениеЗаполнено(Организация) Тогда
		
		ИдентификаторФормы = Форма.УникальныйИдентификатор;
		ДанныеПредложенийБанков = 
			ОбменСБанкамиДепозитыВызовСервера.ПроверитьПродуктыИСформироватьДанныеПредложенийБанков(Организация, 
				ИдентификаторФормы, ПараметрыРасчета, ДополнительныеПараметры.АдресХранилищаПредложенийБанков);
		
		Если Не ЗначениеЗаполнено(ДанныеПредложенийБанков.ПредложенияБанков) Тогда
			ЕстьОшибка = Ложь;
			ПовторитьЗапросПредложений = Ложь;
			Если ЗначениеЗаполнено(ДанныеПредложенийБанков.ОшибкаПолученияПредложений) Тогда
				ТекстСообщения = ДанныеПредложенийБанков.ОшибкаПолученияПредложений;
				ЕстьОшибка = Истина;
				ПовторитьЗапросПредложений = Истина;
			ИначеЕсли Не ДанныеПредложенийБанков.ЕстьСчетаВБанкахСПоддержкойДепозитов Тогда
				ТекстСообщения = 
					ТекстСообщенияНетСчетовВБанкахСПоддержкойДепозитов();
			Иначе
				ТекстСообщения = 
					ОбменСБанкамиДепозитыКлиентСервер.ТекстСообщенияНетПредложенийБанковДляОрганизации();
			КонецЕсли;
			
			НастроитьОтображениеСтраницыИнформации(Форма, ТекстСообщения, ПовторитьЗапросПредложений, Ложь, ЕстьОшибка);
			Возврат;
			
		КонецЕсли;
		
		ДополнительныеПараметры.АдресХранилищаПредложенийБанков = 
			ДанныеПредложенийБанков.АдресХранилища;
		ПредложенияБанков = ДанныеПредложенийБанков.ПредложенияБанков;
		ПараметрыПредложений.Организация = Организация;
		
	Иначе
		
		ТекстСообщения = 
				ОбменСБанкамиДепозитыКлиентСервер.ТекстСообщенияНеЗаполненаОрганизация();
		НастроитьОтображениеСтраницыИнформации(Форма, ТекстСообщения, Ложь);
		
		Возврат;
		
	КонецЕсли;
	
	УстановитьПараметрыИПредложенияПослеПолучения(Форма, ПараметрыПредложений, ПредложенияБанков);
	
КонецПроцедуры

#КонецОбласти