
#Область ОписаниеПеременных

&НаКлиенте
Перем ЭтоНоваяСтрока;

&НаКлиенте
Перем КэшированныеЗначения; //используется механизмом обработки изменения реквизитов ТЧ

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбщегоНазначенияУТ.ОбработкаЗаполнения(Объект, Новый Структура, СтандартнаяОбработка);
		
	Если Параметры.Ключ.Пустая() Тогда
		Если ЗначениеЗаполнено(Параметры.Организация) Тогда
			Объект.Организация = Параметры.Организация;
		КонецЕсли;
		ПриЧтенииСозданииНаСервере();
	КонецЕсли;
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	Если НЕ Объект.Ссылка.Пустая() Тогда
		СтруктураРеквизитовВыгрузки = Объект.Ссылка.ПолучитьОбъект().СтруктураРеквизитовВыгрузки.Получить();
	Иначе
		Объект.Автор = Пользователи.ТекущийПользователь();
	КонецЕсли;
		
	Если СтруктураРеквизитовВыгрузки = Неопределено Тогда
		СтруктураРеквизитовВыгрузки = Параметры.ЗначениеКопирования.СтруктураРеквизитовВыгрузки.Получить();
		Если СтруктураРеквизитовВыгрузки = Неопределено Тогда
			СтруктураРеквизитовВыгрузки = ОбновитьДанныеРеквизитовВыгрузки();
		КонецЕсли;
	КонецЕсли;
	
	Документы.ДокументОПредстоящейПоставке.ОбновитьСтруктуруРеквизитовВыгрузки(СтруктураРеквизитовВыгрузки);
	
	
	ЗаполнитьТекстПроДОПП();
	УстановитьСписокВыбораСтавкиНДС();
	
	Если ЗначениеЗаполнено(Объект.Организация) И Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		УстановитьОсобыйПризнакЗаявителя();
	КонецЕсли;
	
	Элементы.ТекстСостояние.Видимость = ЗначениеЗаполнено(Объект.Ссылка) И ЗначениеЗаполнено(Объект.НомерДОПП)
													И Объект.Проведен;
	
	СобытияФорм.ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	
	УстановитьВидимость();
	
	ЗаказПоставщику = Объект.ЗаказПоставщику;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
	ПриЧтенииСозданииНаСервере();
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ОбщегоНазначенияУТКлиент.ВыполнитьДействияПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	
	Оповестить("Запись_ДокументОПредстоящейПоставке", ПараметрыЗаписи, Объект.Ссылка);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	ЗаполнитьДобавленныеКолонкиТаблиц();
	СтруктураНаименованийТабличныхЧастей = Новый Структура("Товары");
	ЗаполнитьСлужебныеРеквизитыПоНоменклатуре(СтруктураНаименованийТабличныхЧастей);
	
	ОбновитьИтоги(ЭтотОбъект);
	УстановитьЗаголовокФормы(ЭтотОбъект);
	
	Если Не Объект.ПометкаУдаления И ЗначениеЗаполнено(Объект.Организация) Тогда
		ЗарегистрироватьАктуализироватьДОПП();
		ЗаполнитьТекстПроДОПП();
		ТекстСостояние = ОбновитьТекстСостояние(Объект.Организация, Объект.НомерДОПП, Объект.СуммаОбеспечительногоПлатежа);
	КонецЕсли;
	
	Элементы.ТекстСостояние.Видимость = ЗначениеЗаполнено(Объект.НомерДОПП) И Объект.Проведен;
	
	СтруктураРеквизитовФормы.Вставить("мСохраненныйДок", СсылкаНаДОПП);
	СтруктураРеквизитовФормы.Вставить("Организация",     Объект.Организация);
	
	УстановитьВидимость();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ИсточникВыбора.ИмяФормы = "Документ.ДокументОПредстоящейПоставке.Форма.ФормаРедактированияАкцизов" Тогда
		ОбработкаВыбораАкцизы(ВыбранноеЗначение);
	ИначеЕсли ИсточникВыбора.ИмяФормы = "Обработка.ЖурналДокументовЗакупки.Форма.ФормаПодбораТоваровИзЗаказа" Тогда
		ПолучитьТоварыИзХранилища(ВыбранноеЗначение.АдресТоваровВХранилище);
	КонецЕсли;
	
	Если Окно <> Неопределено Тогда
		Окно.Активизировать();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.СтруктураРеквизитовВыгрузки = Новый ХранилищеЗначения(СтруктураРеквизитовВыгрузки);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	ПринудительноЗакрытьФорму = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Запись_РегистрДокументыОПредстоящейПоставке" Тогда
		
		Если Не ЗначениеЗаполнено(Параметр)
			Или ЗначениеЗаполнено(Параметр) И Параметр = Объект.НомерДОПП Тогда
			
			ТекстСостояние = ОбновитьТекстСостояние(Объект.Организация, Объект.НомерДОПП, Объект.СуммаОбеспечительногоПлатежа);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	ДатаПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПартнерПриИзменении(Элемент)
	
	Если Не ЗначениеЗаполнено(Объект.Партнер) Тогда
		Возврат;
	КонецЕсли;
	
	ПартнерПриИзмененииСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.Контрагент) Тогда
		КонтрагентПриИзмененииНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОсобыйПризнакДОПППриИзменении(Элемент)
	
	Если Объект.Товары.Количество() > 0 Тогда
		Оповещение = Новый ОписаниеОповещения(
			"ВопросПередИзменениемПризнакаДОППЗавершение", ЭтотОбъект, Новый Структура);
		ТекстВопроса = НСтр("ru = 'Особый признак ДОПП будет установлен для всех строк. Продолжить?'");
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет,, КодВозвратаДиалога.Да);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	УстановитьВидимость();
	
	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		ОрганизацияПриИзмененииНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОсобыйПризнакЗаявителяПриИзменении(Элемент)
	
	Если Объект.ОсобыйПризнакЗаявителя <> "2" Тогда
		Объект.ИнойОсобыйПризнакЗаявителя = "";
	КонецЕсли;
	
	ОсобыйПризнакЗаявителяПриИзмененииНаСервере();
	
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ДоговорКонтрагентаПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.Договор) Тогда
		ДоговорКонтрагентаПриИзмененииНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаказПоставщикуПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.ЗаказПоставщику)
		И Объект.ЗаказПоставщику <> ЗаказПоставщику
		И Объект.Товары.Количество() > 0 Тогда
		ТекстВопроса = НСтр("ru = 'При изменении Заказа табличная часть Товары будет перезаполнена. Продолжить?'");
		Оповещение =
			Новый ОписаниеОповещения("ВопросПередИзменениемЗаказа", ЭтотОбъект, Объект.ЗаказПоставщику);
		Кнопки = Новый СписокЗначений;
		Кнопки.Добавить(КодВозвратаДиалога.Да, НСтр("ru = 'Продолжить'"));
		Кнопки.Добавить(КодВозвратаДиалога.Отмена);
		ПоказатьВопрос(Оповещение, ТекстВопроса, Кнопки);
	ИначеЕсли Объект.Товары.Количество() = 0 Тогда
		ЗаполнитьТабличнуюЧастьТоварыПоЗаказу();
	КонецЕсли;
	
	ОбновитьИтоги(ЭтотОбъект);
	
КонецПроцедуры
	
&НаКлиенте
Процедура ЗаказПоставщикуОчистка(Элемент, СтандартнаяОбработка)
	
	ЗаказПоставщику = Объект.ЗаказПоставщику;
	
КонецПроцедуры

&НаКлиенте
Процедура РегистрационныйЗнакПрицепаПриИзменении(Элемент)
	
	Если Не ЗначениеЗаполнено(Объект.РегистрационныйЗнакПрицепа) Тогда
		Объект.РегистрационныйЗнакПрицепаДополнительный = "";
	КонецЕсли;
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияСсылкаНаДОППНажатие(Элемент)
	
	ОчиститьСообщения();
	
	
КонецПроцедуры

&НаКлиенте
Процедура НомерДОПППриИзменении(Элемент)
	ТекстСостояние = ОбновитьТекстСостояние(Объект.Организация, Объект.НомерДОПП, Объект.СуммаОбеспечительногоПлатежа);
КонецПроцедуры

&НаКлиенте
Процедура СкорректироватьДОПП(Элемент)
	
	
	Возврат ;
	
КонецПроцедуры

&НаКлиенте
Процедура СостояниеДОПП(Элемент, НавигационнаяСсылка, СтандартнаяОбработка)
	
	ОчиститьСообщения();
	СтандартнаяОбработка = Ложь;
	
	КлючиСтруктуры = "Организация, Проведен, НомерДОПП, СуммаДокумента";
	ПараметрыФормы = Новый Структура(КлючиСтруктуры);
	ЗаполнитьЗначенияСвойств(ПараметрыФормы, Объект);
	ПараметрыФормы.СуммаДокумента = Объект.СуммаОбеспечительногоПлатежа;
	РеквизитыДОПП = ПолучитьРеквизитыДОПП(ПараметрыФормы);
	
	Если РеквизитыДОПП.Проведен И РеквизитыДОПП.КоличествоЗаписей =1 Тогда
		
		ПараметрыФормы = Новый Структура();
		ПараметрыФормы.Вставить("Ключ"          ,   РеквизитыДОПП.КлючЗаписи);
		ПараметрыФормы.Вставить("СуммаДокумента",   РеквизитыДОПП.СуммаДокумента);
		ПараметрыФормы.Вставить("УрезанныйВариант", Истина);
		ОткрытьФорму("РегистрСведений.ДокументыОПредстоящейПоставке.ФормаЗаписи",
			ПараметрыФормы,
			ЭтотОбъект,,,,
			,
			РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	Иначе
	
		ПараметрыФормы = Новый Структура();
		ПараметрыФормы.Вставить("Организация",    РеквизитыДОПП.Организация);
		ПараметрыФормы.Вставить("СуммаДокумента", РеквизитыДОПП.СуммаДокумента);
		ПараметрыФормы.Вставить("НомерДОПП",      РеквизитыДОПП.НомерДОПП);
		СтруктураОтбора = Новый Структура();
		СтруктураОтбора.Вставить("НомерДОПП",   РеквизитыДОПП.НомерДОПП);
		СтруктураОтбора.Вставить("Организация", РеквизитыДОПП.Организация);
		ПараметрыФормы.Вставить("Отбор", СтруктураОтбора);
		ПараметрыФормы.Вставить("НеВыводитьЗаголовок", Истина);
		
		ОткрытьФорму("РегистрСведений.ДокументыОПредстоящейПоставке.Форма.РабочееМесто",
					ПараметрыФормы,
					ЭтотОбъект,
					,
					,
					);
					
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары

&НаКлиенте
Процедура ТоварыНоменклатураПартнераНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ЭлементФормы" , Элемент);
	ДополнительныеПараметры.Вставить("ТекущаяСтрока", ТекущаяСтрока);
	
	ОповещениеОЗакрытие = Новый ОписаниеОповещения("ОбработатьРезультатВыбораНоменклатурыПартнера", ЭтотОбъект, ДополнительныеПараметры);

	НоменклатураПартнеровКлиент.ОткрытьФормуВыбораНоменклатурыПартнера(ЭтотОбъект, Объект.Партнер, ТекущаяСтрока, Элемент.Заголовок, ОповещениеОЗакрытие);

КонецПроцедуры

&НаКлиенте
Процедура ТоварыНоменклатураПартнераПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	
	Если ТекущаяСтрока <> Неопределено Тогда
		
		НоменклатураПартнеровКлиент.УстановитьПараметрыВыбораУпаковки(Элемент.ПараметрыВыбора, ТекущаяСтрока);
		
		СтруктураДействий = Новый Структура;
		СтруктураДействий.Вставить("ЗаполнитьНоменклатуруПоНоменклатуреПартнера");
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("ТекущаяСтрока", ТекущаяСтрока);
		ДополнительныеПараметры.Вставить("НоменклатураДоИзмененияНоменклатурыПартнера", ТекущаяСтрока.Номенклатура);
		ДополнительныеПараметры.Вставить("Ном", СтруктураДействий);
		
		ПакетнаяОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);
		ДополнительныеПараметры.Вставить("ОчиститьСтруктуруДействий", Истина);
		ТоварыНоменклатураПартнераПриИзмененииВопросПользователюЗавершение(Истина, ДополнительныеПараметры);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыНоменклатураПартнераПриИзмененииВопросПользователюЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Не Результат Тогда
		Возврат;
	КонецЕсли;
	
	ТекущаяСтрока = ДополнительныеПараметры.ТекущаяСтрока;
	Если ТекущаяСтрока.Номенклатура <> ДополнительныеПараметры.НоменклатураДоИзмененияНоменклатурыПартнера Тогда
		ПриИзмененииНоменклатуры(ТекущаяСтрока);
	КонецЕсли;
	
	ОбновитьИтоги(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	Если Не ЗначениеЗаполнено(ТекущиеДанные.Номенклатура) Тогда
		Возврат;
	КонецЕсли;
	
	ПриИзмененииНоменклатуры(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыУпаковкаПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ЗаполнитьНоменклатуруПартнераПоНоменклатуре", Объект.Партнер);
	СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиниц");
		УчетПрослеживаемыхТоваровКлиентСерверЛокализация.ДополнитьОписаниеНастроекПересчетаРеквизитовТабличнойЧасти(
		Объект,
		СтруктураДействий);
	
	Если ТекущаяСтрока.Количество > 0 Тогда
		СтруктураДействий.Вставить("ПересчитатьЦенуЗаУпаковку", ТекущаяСтрока.Количество);
	Иначе
		СтруктураЗаполняененияЦены = ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруЗаполненияЦеныЗакупкиВСтрокеТЧ(Объект);
		СтруктураЗаполняененияЦены.ЦенаВключаетНДС = Ложь;
		СтруктураДействий.Вставить("ЗаполнитьЦенуЗакупки", СтруктураЗаполняененияЦены);
	КонецЕсли;
	
	ПакетнаяОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);
	
	ОбновитьИтоги(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	ДействияПриИзмененииКоличества(ТекущиеДанные);
	
	ОбновитьИтоги(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСтавкаНДСПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	// При изменении ставки НДС перерасчитываем сумму НДС
	
	ДанныеОбъекта = Новый Структура("ОсобыйПризнакЗаявителя", Объект.ОсобыйПризнакЗаявителя);
	РассчитатьНалогиПоСтроке(ДанныеОбъекта, ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыНалоговаяБазаНДСПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	// При изменении налоговой базы перерасчитываем сумму НДС
	
	ДанныеОбъекта = Новый Структура("ОсобыйПризнакЗаявителя", Объект.ОсобыйПризнакЗаявителя);
	РассчитатьНалогиПоСтроке(ДанныеОбъекта, ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	ТекущиеДанные.ФактурнаяСтоимость = ТекущиеДанные.Цена * ТекущиеДанные.КоличествоУпаковок;
	
	ТоварыФактурнаяСтоимостьПриИзменении(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыФактурнаяСтоимостьПриИзменении(Элемент)

	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	ДанныеСтрокиТаблицы = Новый Структура(
		"ФактурнаяСтоимость,НалоговаяБазаНДС,СтавкаНДС,
		|СуммаНДС,СуммаАкциза,ОбеспечительныйПлатеж,МаркируемаяПродукция,
		|ТвердаяСтавкаАкциза, АдвалорнаяСтавкаАкциза,ОсобыйПризнакДОПП");
		
	ДанныеОбъекта = Новый Структура(
		"ВалютаРегламентированногоУчета,Дата,Валюта,ОсобыйПризнакЗаявителя",
		ВалютаРегламентированногоУчета, Объект.Дата, Объект.Валюта, Объект.ОсобыйПризнакЗаявителя);
		
	ЗаполнитьЗначенияСвойств(ДанныеСтрокиТаблицы, ТекущиеДанные);
	
	РасчитатьСуммыВТабличнойЧастиНаСервере(ДанныеСтрокиТаблицы, ДанныеОбъекта);
	
	ЗаполнитьЗначенияСвойств(ТекущиеДанные, ДанныеСтрокиТаблицы);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыАналитикаАкцизаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ВыбраннаяСтрока = Элементы.Товары.ТекущаяСтрока;
	ОткрытьФормуРедактированияАкцизов(ВыбраннаяСтрока);

КонецПроцедуры

&НаКлиенте
Процедура ТоварыОсобыйПризнакДОПППриИзменении(Элемент)
	
	СтрокаТаблицы = Элементы.Товары.ТекущиеДанные;
	АктуализироватьНалогиПоСтрокеТовары(СтрокаТаблицы);
	ОбновитьИтоги(ЭтотОбъект);
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриИзменении(Элемент)
	
	ОбновитьИтоги(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПередУдалением(Элемент, Отказ)
	
	Если Элементы.Товары.ТекущиеДанные <> Неопределено Тогда
		
		РаботаСТабличнымиЧастямиКлиент.КэшироватьТекущуюСтроку(Элементы.Товары, ЭтотОбъект);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПослеУдаления(Элемент)
	
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя = "ТоварыАналитикаАкциза" Тогда
		ОткрытьФормуРедактированияАкцизов(ВыбраннаяСтрока);
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриАктивизацииЯчейки(Элемент)
	
	Если Элементы.Товары.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Если ЭтоНоваяСтрока Тогда
		ТекущаяКолонкаТаблицы = Элементы.Товары.ТекущийЭлемент;
		Если ТекущаяКолонкаТаблицы.Имя = "ТоварыАналитикаАкциза" Тогда
			ВыбраннаяСтрока = Элементы.Товары.ТекущаяСтрока;
			ОткрытьФормуРедактированияАкцизов(ВыбраннаяСтрока);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)

	ЭтоНоваяСтрока = НоваяСтрока;
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	Если ТекущаяСтрока <> Неопределено
		И ЗначениеЗаполнено(Объект.ЗаказПоставщику) И НоваяСтрока Тогда
		ТекущаяСтрока.РасхождениеЗаказ = 1;
		ТекущаяСтрока.КодСтроки = 0;
	КонецЕсли;
	
	РаботаСТабличнымиЧастямиКлиент.КэшироватьТекущуюСтроку(Элементы.Товары, ЭтотОбъект);
	
	Если НЕ НоваяСтрока ИЛИ Копирование Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьЗаголовкиСтрок(ТекущаяСтрока);
	
	СтрокаТаблицы = Элементы.Товары.ТекущиеДанные;
	СтрокаТаблицы.АналитикаАкциза = НСтр("ru = 'Без акциза'");
	СтрокаТаблицы.ОсобыйПризнакДОПП = Объект.ОсобыйПризнакДОПП;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	Если ОтменаРедактирования И НоваяСтрока Тогда
		// Закроем форму редактирования строки, т.к. пользователь отменяет ввод
		Оповестить("ФормаРедактированияАкцизов_Закрыть", Неопределено, ЭтотОбъект);
	КонецЕсли;
	
	ЭтоНоваяСтрока = Ложь;
	
	ОбновитьИтоги(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СоздатьПриобретениеТоваровУслугНаОсновании(Команда)
	
	СписокСкладов = Новый СписокЗначений;
	Если Не УсловияВыбораВариантаВыполнены(Объект.ЗаказПоставщику, СписокСкладов) Тогда
		ОткрытьПриобретениеНаОсновании(Неопределено);
		Возврат;
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("СоздатьПриобретениеТоваровУслугНаОснованииЗавершение", ЭтотОбъект);
	СписокСкладов.ПоказатьВыборЭлемента(Оповещение, НСтр("ru = 'Выберите Склад'"));
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьСписаниеБДСНаОсновании(Команда)
	
	ПараметрыОткрытия = Новый Структура();
	ПараметрыОткрытия.Вставить("Основание", Объект.Ссылка);
	
	ОткрытьФорму("Документ.СписаниеБезналичныхДенежныхСредств.Форма.ФормаДокумента", ПараметрыОткрытия, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура СведенияОПодписантах(Команда)
	
	ОткрытьФормуСведенияОПодписантах();
	
КонецПроцедуры

&НаКлиенте
Процедура ПровестиДокумент(Команда)
	
	ОбщегоНазначенияУТКлиент.Провести(ЭтотОбъект, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПометкуУдаленияДокумента(Команда)
	
	ОбщегоНазначенияУТКлиент.УстановитьПометкуУдаленияДокумента(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПровестиИЗакрыть(Команда)
	
	ОбщегоНазначенияУТКлиент.ПровестиИЗакрыть(ЭтотОбъект, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьДокумент(Команда)
	
	ОбщегоНазначенияУТКлиент.Записать(ЭтотОбъект, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьНаДиск(Команда)
	Оповещение = Новый ОписаниеОповещения("ЗаписатьНаДискЗавершение", ЭтотОбъект);
	ПроверитьСЗапросомДальнейшегоДействия(Оповещение);
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьВКонтролирующийОрган(Команда)
	Оповещение = Новый ОписаниеОповещения("ОтправитьВКонтролирующийОрганЗавершение", ЭтотОбъект);
	ПроверитьСЗапросомДальнейшегоДействия(Оповещение);
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьВыгрузку(Команда)
	
	ОчиститьСообщения();
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьВИнтернете(Команда)
	
	ОчиститьСообщения();
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПечатьДОПП(Команда)
	
	ОчиститьСообщения();
	
	
КонецПроцедуры

&НаКлиенте
Процедура РазбитьСтрокуФакт(Команда)
	
	ТаблицаФормы  = Элементы.Товары;
	ДанныеТаблицы = Объект.Товары;
	
	ДополнительныеПараметры = УчетПрослеживаемыхТоваровКлиентСерверЛокализация.ДополнитьОписаниеПараметровРазбиенияСтрокиТабличнойЧасти(ТаблицаФормы.ТекущиеДанные);
	
	Оповещение = Новый ОписаниеОповещения("РазбитьСтрокуФактЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	РаботаСТабличнымиЧастямиКлиент.РазбитьСтроку(ДанныеТаблицы, ТаблицаФормы, Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьНомерРНПТИзКвитанции(Команда)
	
	ОчиститьСообщения();
	
	Если Объект.Товары.Количество() > 0 Тогда
		ТекстВопроса = НСтр("ru = 'Пустые РПНТ по прослеживаемыми товарами будут заполнены из квитанции. Продолжить?'");
		Оповещение =
			Новый ОписаниеОповещения("ВопросПередЗаполнениемНомеровРНПТ", ЭтотОбъект);
		Кнопки = Новый СписокЗначений;
		Кнопки.Добавить(КодВозвратаДиалога.Да, НСтр("ru = 'Продолжить'"));
		Кнопки.Добавить(КодВозвратаДиалога.Отмена);
		ПоказатьВопрос(Оповещение, ТекстВопроса, Кнопки);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьНомерРНПТ(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ОповещениеВводСтроки", ЭтотОбъект);
	ПоказатьВводСтроки(Оповещение, , НСтр("ru = 'Введите РНПТ'"), 29, Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодобратьТоварыПоЗаказамОрдерам(Команда)
	
	ПодборТоваровИзЗаказа();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтвязатьОтЗаказа(Команда)
	ВыделенныеСтроки = Элементы.Товары.ВыделенныеСтроки;
	Если ВыделенныеСтроки.Количество()>0 Тогда
		Для каждого ТекСтрока Из ВыделенныеСтроки Цикл
			СтрокаТаблицы = Объект.Товары.НайтиПоИдентификатору(ТекСтрока);
			СтрокаТаблицы.КодСтроки = 0;
			СтрокаТаблицы.РасхождениеЗаказ = 1;
		КонецЦикла;
		ОповеститьОбОкончанииОтвязкиСтрок(ВыделенныеСтроки.Количество());
	Иначе
		ТекстПредупреждения = НСтр("ru='Выберите строки, которые необходимо отвязать от заказа.'");
		ПоказатьПредупреждение(Неопределено, ТекстПредупреждения);
	КонецЕсли; 
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура СоздатьПриобретениеТоваровУслугНаОснованииЗавершение(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныйЭлемент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОткрытьПриобретениеНаОсновании(ВыбранныйЭлемент.Значение);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПриобретениеНаОсновании(Склад)
	
	Основание = Новый Структура();
	Основание.Вставить("ДокументОснование", Объект.Ссылка);
	Основание.Вставить("Склад", Склад);
	
	ПараметрыОткрытия = Новый Структура();
	ПараметрыОткрытия.Вставить("Основание", Основание);
	
	ОткрытьФорму("Документ.ПриобретениеТоваровУслуг.Форма.ФормаДокумента", ПараметрыОткрытия, ЭтотОбъект);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция УсловияВыбораВариантаВыполнены(ЗаказПоставщику, СписокСкладов)
	
	Если Не ЗначениеЗаполнено(ЗаказПоставщику) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Склад = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЗаказПоставщику, "Склад");
	Если Не ЗначениеЗаполнено(Склад) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ВыборГруппы = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Склад, "ВыборГруппы");
	
	РазрешитьВЗаказах = ВыборГруппы = Перечисления.ВыборГруппыСкладов.РазрешитьВЗаказах;
	
	Если РазрешитьВЗаказах Тогда
		СписокСкладов = СкладыЗаказаПоставщику(ЗаказПоставщику);
	КонецЕсли;
	
	Возврат РазрешитьВЗаказах;
	
КонецФункции

&НаСервереБезКонтекста
Функция СкладыЗаказаПоставщику(ЗаказПоставщику)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Товары.Склад КАК Склад
		|ИЗ
		|	Документ.ЗаказПоставщику.Товары КАК Товары
		|ГДЕ
		|	Товары.Ссылка = &Ссылка
		|	И Товары.Склад <> ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
		|УПОРЯДОЧИТЬ ПО
		|	Склад";
	Запрос.УстановитьПараметр("Ссылка", ЗаказПоставщику);
	
	СписокСкладов = Новый СписокЗначений;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СписокСкладов.Добавить(Выборка.Склад);
	КонецЦикла;
	
	Возврат СписокСкладов;
	
КонецФункции

#Область УправлениеФормой

&НаСервере
Процедура ПриЧтенииСозданииНаСервере()
	
	СтруктураРеквизитовФормы = Новый Структура;
	СтруктураРеквизитовФормы.Вставить("мСохраненныйДок", СсылкаНаДОПП);
	СтруктураРеквизитовФормы.Вставить("Организация",     Объект.Организация);
	УстановитьФункциональныеОпцииФормы();
	
	ЗаполнитьДобавленныеКолонкиТаблиц();
	ЗаполнитьКоллекциюСписковВыбора();
	
	НаименованиеВалютыДокумента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Валюта, "Наименование");
	ВалютаРегламентированногоУчета = ОбщегоНазначенияБПВызовСервераПовтИсп.ПолучитьВалютуРегламентированногоУчета();
	
	СтруктураНаименованийТабличныхЧастей = Новый Структура("Товары");
	ЗаполнитьСлужебныеРеквизитыПоНоменклатуре(СтруктураНаименованийТабличныхЧастей);
	
	ОбновитьИтоги(ЭтотОбъект);
	
	УстановитьЗаголовокФормы(ЭтотОбъект);
	
	УправлениеФормой(ЭтотОбъект);
	
	РаботаСТабличнымиЧастями.ИнициализироватьКэшСтрок(Элементы.Товары);
		
	УстановитьУсловноеОформление();
	
	ТекстСостояние = ОбновитьТекстСостояние(Объект.Организация, Объект.НомерДОПП, Объект.СуммаОбеспечительногоПлатежа);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)
	
	Элементы = Форма.Элементы;
	Объект   = Форма.Объект;
	Элементы.ДоговорКонтрагента.Доступность = ЗначениеЗаполнено(Объект.Организация) И ЗначениеЗаполнено(Объект.Контрагент);
	
	Элементы.ТоварыСтоимостьВал.Заголовок = СтрШаблон(
		НСтр("ru = 'Фактурная стоимость (%1)'"),
		Форма.НаименованиеВалютыДокумента); 
		
	Элементы.РегистрационныйЗнакПрицепаДополнительный.Доступность = ЗначениеЗаполнено(Объект.РегистрационныйЗнакПрицепа);
	Элементы.ИнойОсобыйПризнакЗаявителя.Видимость = Объект.ОсобыйПризнакЗаявителя = "2";
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УстановитьЗаголовокФормы(Форма)
	
	Объект = Форма.Объект;
	ТекстЗаголовка = НСтр("ru = 'Документ о предстоящей поставке товаров'");
		
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ТекстЗаголовка = ТекстЗаголовка + СтрШаблон(НСтр("ru = ' %1 от %2'"), Объект.Номер, Объект.Дата);
	Иначе
		ТекстЗаголовка = ТекстЗаголовка + НСтр("ru = ' (создание)'");
	КонецЕсли;
	
	Форма.Заголовок = ТекстЗаголовка;

КонецПроцедуры

&НаСервере
Процедура УстановитьФункциональныеОпцииФормы()
	
	ПлательщикНДС = УчетнаяПолитика.ПлательщикНДС(Объект.Организация, Объект.Дата);
	
	ОбщегоНазначенияБПКлиентСервер.УстановитьПараметрыФункциональныхОпцийФормыДокумента(ЭтотОбъект);
	ВедетсяУчетПрослеживаемыхТоваров =УчетПрослеживаемыхТоваровЛокализация.ИспользоватьУчетПрослеживаемыхИмпортныхТоваров(
														Объект.Дата);
	ИмпортПодакцизныхТоваров = УчетПодакцизныхТоваров.ИспользуетсяИмпортПодакцизныхТоваров(
					Объект.Организация, Объект.Дата);
	ИспользоватьЗаказыПоставщикам = ПолучитьФункциональнуюОпцию("ИспользоватьЗаказыПоставщикам");
		
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	
	НоменклатураСервер.УстановитьУсловноеОформлениеХарактеристикНоменклатуры(ЭтаФорма);
	НоменклатураСервер.УстановитьУсловноеОформлениеЕдиницИзмерения(ЭтаФорма);
	
	// Признак прослеживаемости
	ПараметрыУсловногоОформления = УчетПрослеживаемыхТоваровЛокализация.ПараметрыУстановкиУсловногоОформленияНомераГТД();
	ПараметрыУсловногоОформления.ИмяПоляВводаНомераГТД = "ТоварыНомерРНПТ";
	ПараметрыУсловногоОформления.ПутьКПолюНомерГТД = "Объект.Товары.НомерРНПТ";
	
	УчетПрослеживаемыхТоваровЛокализация.УстановитьУсловноеОформлениеКоличестваПоРНПТ(ЭтотОбъект);
	
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеФормы    = Элементы["ТоварыНомерРНПТ"]; // ПолеФормы
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(ПолеФормы.Имя);
	
	ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.ВедетсяУчетПоРНПТ");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;
	
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ТекстЗапрещеннойЯчейкиЦвет);
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '<РНПТ не используются>'"));
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);

	// ТоварыСтавкаНДС
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ТоварыСтавкаНДС");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"Объект.Товары.ТоварыОсобыйПризнакДОПП", ВидСравненияКомпоновкиДанных.НеРавно, 0);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Ложь);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьИтоги(Форма)
	
	Объект = Форма.Объект;
	Форма.ОбеспечительныйПлатеж = Окр(Объект.Товары.Итог("ОбеспечительныйПлатеж"));
	
КонецПроцедуры

&НаКлиенте
Процедура АктуализироватьНалогиПоСтрокеТовары(СтрокаТаблицы)
	
	Если СтрокаТаблицы.ОсобыйПризнакДОПП = "0" Тогда
		ПриИзмененииНоменклатуры(СтрокаТаблицы);
		ДанныеОбъекта = Новый Структура(
			"ВалютаРегламентированногоУчета,Валюта,Дата,ОсобыйПризнакЗаявителя",
			ВалютаРегламентированногоУчета, Объект.Валюта, Объект.Дата, Объект.ОсобыйПризнакЗаявителя); 
		ДанныеСтрокиТаблицы = Новый Структура(
			"ФактурнаяСтоимость,НалоговаяБазаНДС,СтавкаНДС,СуммаНДС,ОбеспечительныйПлатеж,КатегорияПодакцизныхТоваров,КБК,МаркируемаяПродукция,
			|НалоговаяБазаАкцизы,ЕдиницаИзмеренияАкциза,ТвердаяСтавкаАкциза,АдвалорнаяСтавкаАкциза,СуммаАкциза,АналитикаАкциза,ОсобыйПризнакДОПП");
		ЗаполнитьЗначенияСвойств(ДанныеСтрокиТаблицы, СтрокаТаблицы);
		РасчитатьСуммыВТабличнойЧастиНаСервере(ДанныеСтрокиТаблицы, ДанныеОбъекта);
		ЗаполнитьАналитикуАкцизов(ДанныеСтрокиТаблицы);
		ЗаполнитьЗначенияСвойств(СтрокаТаблицы, ДанныеСтрокиТаблицы);

	Иначе
		СтрокаТаблицы.СтавкаНДС                   = ПредопределенноеЗначение("Справочник.СтавкиНДС.ПустаяСсылка");
		СтрокаТаблицы.СуммаНДС                    = 0;
		СтрокаТаблицы.НалоговаяБазаНДС            = 0;
		СтрокаТаблицы.НалоговаяБазаАкцизы         = 0;
		СтрокаТаблицы.ТвердаяСтавкаАкциза         = 0;
		СтрокаТаблицы.АдвалорнаяСтавкаАкциза      = 0;
		СтрокаТаблицы.СуммаАкциза                 = 0;
		СтрокаТаблицы.ПодакцизныйТовар            = Ложь;
		СтрокаТаблицы.АналитикаАкциза             = НСтр("ru = 'Без акциза'");
		СтрокаТаблицы.ОбеспечительныйПлатеж       = 0;
		СтрокаТаблицы.КатегорияПодакцизныхТоваров = ПредопределенноеЗначение("Справочник.КатегорииПодакцизныхТоваров.ПустаяСсылка");
		СтрокаТаблицы.КБК                         = "";
		СтрокаТаблицы.МаркируемаяПродукция        = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура РассчитатьНалогиПоСтроке(ДанныеОбъекта, СтрокаТабличнойЧасти)
	
	Если СтрокаТабличнойЧасти.НалоговаяБазаНДС <> 0 Тогда
		СтрокаТабличнойЧасти.СуммаНДС = УчетНДСУПКлиентСервер.РассчитатьСуммуНДС(
			СтрокаТабличнойЧасти.НалоговаяБазаНДС,
			УчетНДСУПКлиентСервер.ЗначениеСтавкиНДС(СтрокаТабличнойЧасти.СтавкаНДС),
			Ложь);
	КонецЕсли;
	
	Если ДанныеОбъекта.ОсобыйПризнакЗаявителя = "0" Тогда
		Если СтрокаТабличнойЧасти.МаркируемаяПродукция Тогда
			СтрокаТабличнойЧасти.ОбеспечительныйПлатеж = СтрокаТабличнойЧасти.СуммаНДС;
		Иначе
			СтрокаТабличнойЧасти.ОбеспечительныйПлатеж = СтрокаТабличнойЧасти.СуммаНДС + СтрокаТабличнойЧасти.СуммаАкциза;
		КонецЕсли;
	Иначе
		СтрокаТабличнойЧасти.ОбеспечительныйПлатеж = 0;
	КонецЕсли;

КонецПроцедуры 

&НаКлиенте
Процедура ПриИзмененииНоменклатуры(СтрокаТабличнойЧасти)
	
	ОчиститьСообщения();
	
	ТекущаяСтрока = СтрокаТабличнойЧасти;
	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПроверитьХарактеристикуПоВладельцу", ТекущаяСтрока.Характеристика);
	СтруктураДействий.Вставить("ЗаполнитьПризнакТипНоменклатуры", Новый Структура("Номенклатура", "ТипНоменклатуры"));
	СтруктураДействий.Вставить("ЗаполнитьПризнакАртикул", Новый Структура("Номенклатура", "Артикул")); 
	СтруктураДействий.Вставить("ЗаполнитьПризнакВедетсяУчетПоГТД", Новый Структура("Номенклатура", "ВедетсяУчетПоГТД"));
	СтруктураДействий.Вставить("ЗаполнитьТНВЭД", Новый Структура("Номенклатура", "КодТНВЭД"));
	СтруктураДействий.Вставить("ЗаполнитьМаркируемаяПродукция", Новый Структура("Номенклатура", "Номенклатура"));
	ПараметрыЗаполнения = ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПараметрыЗаполненияСтраныПроисхождения();
	ПараметрыЗаполнения.НомерГТД = "НомерРНПТ";
	СтруктураДействий.Вставить("ЗаполнитьСтрануПроисхожденияНоменклатуры", ПараметрыЗаполнения);
	
	Если ИмпортПодакцизныхТоваров Тогда
		ПараметрыЗаполнения =
			ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПараметрыЗаполненияПризнакаПодакцизныйТовар(Объект);
		СтруктураДействий.Вставить("ЗаполнитьРеквизитыРасчетаАкциза", ПараметрыЗаполнения);
	КонецЕсли;
	СтруктураДействий.Вставить("ПроверитьЗаполнитьУпаковкуПоВладельцу", ТекущаяСтрока.Упаковка);
	СтруктураДействий.Вставить("ЗаполнитьНоменклатуруПартнераПоНоменклатуре", Объект.Партнер);
	СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиниц");
		
	ПараметрыЗаполненияСтавкиНДС = ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПараметрыЗаполненияСтавкиНДС(Объект, Истина);
	СтруктураДействий.Вставить("ЗаполнитьСтавкуНДС", ПараметрыЗаполненияСтавкиНДС);
	УчетПрослеживаемыхТоваровКлиентСерверЛокализация.ДополнитьОписаниеНастроекЗаполненияСлужебныхРеквизитовТабличнойЧасти(СтруктураДействий);
	УчетПрослеживаемыхТоваровКлиентСерверЛокализация.ДополнитьОписаниеНастроекПересчетаРеквизитовТабличнойЧасти(
		Объект,
		СтруктураДействий);
	ПакетнаяОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);
		
	Если ТекущаяСтрока.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.МногооборотнаяТара") Тогда
		ТекущаяСтрока.ОсобыйПризнакДОПП = "1";
		ТекущаяСтрока.СтавкаНДС = ПредопределенноеЗначение("Справочник.СтавкиНДС.ПустаяСсылка");
		Возврат;
	КонецЕсли;
	
	Если ИмпортПодакцизныхТоваров Тогда
		
		РассчитатьСуммуАкцизаВТабЧасти(ТекущаяСтрока);
		ДанныеСтрокиТаблицы = Новый Структура(
			"НалоговаяБазаАкцизы,ЕдиницаИзмеренияАкциза,ТвердаяСтавкаАкциза,АдвалорнаяСтавкаАкциза,СуммаАкциза,АналитикаАкциза");
		ЗаполнитьЗначенияСвойств(ДанныеСтрокиТаблицы, ТекущаяСтрока);
		ЗаполнитьАналитикуАкцизов(ДанныеСтрокиТаблицы);
		ТекущаяСтрока.АналитикаАкциза = ДанныеСтрокиТаблицы.АналитикаАкциза;
	
	КонецЕсли;
	
	ДанныеСтрокиТаблицы = Новый Структура(
		"ФактурнаяСтоимость,НалоговаяБазаНДС,СтавкаНДС,
		|СуммаНДС,СуммаАкциза,ОбеспечительныйПлатеж,МаркируемаяПродукция,
		|ТвердаяСтавкаАкциза,АдвалорнаяСтавкаАкциза,ОсобыйПризнакДОПП");
		
	ДанныеОбъекта = Новый Структура(
		"ВалютаРегламентированногоУчета,Дата,Валюта,ОсобыйПризнакЗаявителя",
		ВалютаРегламентированногоУчета, Объект.Дата, Объект.Валюта, Объект.ОсобыйПризнакЗаявителя);
		
	ЗаполнитьЗначенияСвойств(ДанныеСтрокиТаблицы, ТекущаяСтрока);
	
	НоменклатураПриИзмененииСервер(ДанныеСтрокиТаблицы, ДанныеОбъекта);
	
	ЗаполнитьЗначенияСвойств(ТекущаяСтрока, ДанныеСтрокиТаблицы);
	
	ОбновитьИтоги(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПартнерПриИзмененииСервер()
	
	ПартнерыИКонтрагенты.ЗаполнитьКонтрагентаПартнераПоУмолчанию(Объект.Партнер, Объект.Контрагент);
	КонтрагентПриИзмененииНаСервере();
	
	НоменклатураПартнеровСервер.ЗаполнитьНоменклатуруПартнераПоНоменклатуреПриИзмененииПартнера(Объект.Товары, Объект.Партнер);
	ОтветственныеЛицаСервер.ПриИзмененииСвязанныхРеквизитовДокумента(Объект);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункцииБСП

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура Подключаемый_ЗакрытьФорму()
	
	Если Открыта() Тогда
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтрефейс

&НаСервере
Процедура ЗаполнитьКоллекциюСписковВыбора()
	
	ЗаполнитьСписокВыбораОсобогоПризнакаЗаявителя(Элементы.ОсобыйПризнакЗаявителя.СписокВыбора);
	ЗаполнитьСписокВыбораОсобогоПризнакаДОПП(Элементы.ОсобыйПризнакДОПП.СписокВыбора);
	ЗаполнитьСписокВыбораОсобогоПризнакаДОПП(Элементы.ТоварыОсобыйПризнакДОПП.СписокВыбора);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокВыбораОсобогоПризнакаДОПП(СписокВыбора)

	СписокВыбора.Очистить();
	СписокВыбора.Добавить("0",  "0 – Отсутствует");
	СписокВыбора.Добавить("1",  "1 – Товары, не подлежащие налогообложению");
	СписокВыбора.Добавить("4",  "4 – Передача в рамках одного юридического лица");
	СписокВыбора.Добавить("5",  "5 – Переработка давальческого сырья");
	СписокВыбора.Добавить("6",  "6 – Возврат товара");
	СписокВыбора.Добавить("7",  "7 – Аренда оборудования");
	СписокВыбора.Добавить("8",  "8 – Выставочный экземпляр");
	СписокВыбора.Добавить("9",  "9 – Лизинг");
	СписокВыбора.Добавить("10", "10 – Договор между двумя российскими организациями");
	СписокВыбора.Добавить("11", "11 – Договор с физическим лицом (не ИП)");

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокВыбораОсобогоПризнакаЗаявителя(СписокВыбора)

	СписокВыбора.Очистить();
	СписокВыбора.Добавить("0",  "0 – Отсутствует");
	СписокВыбора.Добавить("1",  "1 – Освобождение от внесения обеспечительного платежа");
	СписокВыбора.Добавить("2",  "2 – Иной признак");

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДобавленныеКолонкиТаблиц()

	Для Каждого СтрокаТаблицы Из Объект.Товары Цикл
		ЗаполнитьДобавленныеКолонкиСтрокиТаблицыТовары(СтрокаТаблицы);
		Если СтрокаТаблицы.КодСтроки = 0 Тогда
			СтрокаТаблицы.РасхождениеЗаказ = 1;
		Иначе
			СтрокаТаблицы.РасхождениеЗаказ = 0;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаполнитьДобавленныеКолонкиСтрокиТаблицыТовары(СтрокаТаблицы)
	
	ЗаполнитьЗаголовкиСтрок(СтрокаТаблицы);
	ЗаполнитьАналитикуАкцизов(СтрокаТаблицы);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьЗаголовкиСтрок(СтрокаТаблицы)
	
	СтрокаТаблицы.НадписьНомерДокумента = НСтр("ru = 'Номер:'");
	СтрокаТаблицы.НадписьДатаДокумента  = НСтр("ru = 'Дата:'");
	СтрокаТаблицы.НадписьПоДокументу    = НСтр("ru = 'По документу:'");
	СтрокаТаблицы.НадписьПоТНВЭД        = НСтр("ru = 'По ТН ВЭД:'");
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаполнитьАналитикуАкцизов(СтрокаТабличнойЧасти)
	
	Если ЗначениеЗаполнено(СтрокаТабличнойЧасти.НалоговаяБазаАкцизы) Тогда
		
		
		Если ЗначениеЗаполнено(СтрокаТабличнойЧасти.АдвалорнаяСтавкаАкциза) Тогда
			
			ТекстСообщения = НСтр("ru = '%1 руб. (%2 руб. * %3%%)'");
			
			СтрокаТабличнойЧасти.АналитикаАкциза = СтрШаблон(ТекстСообщения,
			СтрокаТабличнойЧасти.СуммаАкциза,
			СтрокаТабличнойЧасти.НалоговаяБазаАкцизы,
			СтрокаТабличнойЧасти.АдвалорнаяСтавкаАкциза);
			
		Иначе
			
			Если СтрокаТабличнойЧасти.ЕдиницаИзмеренияАкциза = "112" Тогда
				ЕдиницаНалоговойБазы = НСтр("ru = 'литров'");
				ЕдиницаСтавки = НСтр("ru = 'за литр'");
			ИначеЕсли СтрокаТабличнойЧасти.ЕдиницаИзмеренияАкциза = "168" Тогда
				ЕдиницаНалоговойБазы = НСтр("ru = 'тонн'");
				ЕдиницаСтавки = НСтр("ru = 'за тонну'");
			ИначеЕсли СтрокаТабличнойЧасти.ЕдиницаИзмеренияАкциза = "251" Тогда
				ЕдиницаНалоговойБазы = НСтр("ru = 'лошадиных сил'");
				ЕдиницаСтавки = НСтр("ru = 'за лошадиную силу'");
			ИначеЕсли СтрокаТабличнойЧасти.ЕдиницаИзмеренияАкциза = "831" Тогда
				ЕдиницаНалоговойБазы = НСтр("ru = 'литров 100% спирта'");
				ЕдиницаСтавки = НСтр("ru = 'за литр 100% спирта'");
			Иначе
				ЭлементЕдиницыИзмеренияАкциза = Справочники.УпаковкиЕдиницыИзмерения.НайтиПоКоду(СтрокаТабличнойЧасти.ЕдиницаИзмеренияАкциза);
				Если ЭлементЕдиницыИзмеренияАкциза <> Неопределено Тогда
					ЕдиницаНалоговойБазы = ЭлементЕдиницыИзмеренияАкциза;
					ЕдиницаСтавки = НСтр("ru = 'за '" + ЭлементЕдиницыИзмеренияАкциза);
				КонецЕсли
			КонецЕсли;
			
			ТекстСообщения = НСтр("ru = '%1 руб. (%2 %3 * %4 %5)'");
			
			СтрокаТабличнойЧасти.АналитикаАкциза = СтрШаблон(ТекстСообщения,
			СтрокаТабличнойЧасти.СуммаАкциза,
			СтрокаТабличнойЧасти.НалоговаяБазаАкцизы,
			ЕдиницаНалоговойБазы,
			СтрокаТабличнойЧасти.ТвердаяСтавкаАкциза,
			ЕдиницаСтавки);
			
		КонецЕсли;
		
	Иначе
		
		СтрокаТабличнойЧасти.АналитикаАкциза = НСтр("ru = 'Без акциза'");
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура НоменклатураПриИзмененииСервер(СтрокаТабличнойЧасти, ДанныеОбъекта, СтруктураКурса = Неопределено)
	
	СтавкаНДС10 = УчетНДСРФВызовСервера.СтавкаНДСПоЗначениюПеречисления(
				Перечисления.СтавкиНДС.НДС10, Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС);
	ОсновнаяСтавкаНДС = УчетНДСУП.СтавкаНДСПоУмолчанию(Неопределено, Объект.Дата);
	
	Если СтрокаТабличнойЧасти.СтавкаНДС <> СтавкаНДС10
		И СтрокаТабличнойЧасти.СтавкаНДС <> ОсновнаяСтавкаНДС Тогда
		СтрокаТабличнойЧасти.СтавкаНДС = ОсновнаяСтавкаНДС;
	КонецЕсли;
	
	РасчитатьСуммыВТабличнойЧастиНаСервере(СтрокаТабличнойЧасти, ДанныеОбъекта, СтруктураКурса);
	
КонецПроцедуры

&НаСервере
Процедура РасчитатьСуммыВТабличнойЧастиНаСервере(СтрокаТабличнойЧасти, ДанныеОбъекта, СтруктураКурса = Неопределено)
	
	РасчитатьСуммыВТабличнойЧастиДОПП(СтрокаТабличнойЧасти, ДанныеОбъекта);
	ОбновитьИтоги(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура РасчитатьСуммыВТабличнойЧастиДОПП(СтрокаТабличнойЧасти, ДанныеОбъекта, СтруктураКурса = Неопределено) Экспорт
	
	// Рассчитаем по фактурной стоимости налоговую базу в рублях на дату, предшествующую дате ввоза товаров
	Если ЗначениеЗаполнено(СтрокаТабличнойЧасти.АдвалорнаяСтавкаАкциза)
		И Не ЗначениеЗаполнено(СтрокаТабличнойЧасти.ТвердаяСтавкаАкциза) Тогда
		ВидАкциза = 2;
	Иначе
		ВидАкциза = 1;
	КонецЕсли;
	
	Если СтрокаТабличнойЧасти.ОсобыйПризнакДОПП = "0" Тогда 
		Если ДанныеОбъекта.Валюта <> ДанныеОбъекта.ВалютаРегламентированногоУчета Тогда
			Если СтруктураКурса = Неопределено Тогда
				ДатаДляРасчетаКурса = ДанныеОбъекта.Дата - 86400;
				СтруктураКурса = РаботаСКурсамиВалютУТ.ПолучитьКурсВалюты(ДанныеОбъекта.Валюта, ДатаДляРасчетаКурса);
				Если СтруктураКурса.КурсЗнаменатель = 0 Тогда
					СтруктураКурса.КурсЗнаменатель = 1;
				КонецЕсли;
			КонецЕсли;
			ФактурнаяСтоимость = Окр((СтрокаТабличнойЧасти.ФактурнаяСтоимость * (СтруктураКурса.КурсЧислитель/СтруктураКурса.КурсЗнаменатель)), 2);
			Если ВидАкциза = 2 Тогда
				СтрокаТабличнойЧасти.СуммаАкциза = ФактурнаяСтоимость * СтрокаТабличнойЧасти.АдвалорнаяСтавкаАкциза / 100;
			КонецЕсли;
			СтрокаТабличнойЧасти.НалоговаяБазаНДС = ФактурнаяСтоимость + СтрокаТабличнойЧасти.СуммаАкциза;
		Иначе
			Если ВидАкциза = 2 Тогда
				СтрокаТабличнойЧасти.СуммаАкциза = СтрокаТабличнойЧасти.ФактурнаяСтоимость * СтрокаТабличнойЧасти.АдвалорнаяСтавкаАкциза / 100;
			КонецЕсли;
			СтрокаТабличнойЧасти.НалоговаяБазаНДС = СтрокаТабличнойЧасти.ФактурнаяСтоимость + СтрокаТабличнойЧасти.СуммаАкциза;
		КонецЕсли;
	Иначе
		СтрокаТабличнойЧасти.НалоговаяБазаНДС = 0;
		СтрокаТабличнойЧасти.СтавкаНДС = Справочники.СтавкиНДС.ПустаяСсылка();
		СтрокаТабличнойЧасти.СуммаАкциза = 0;
	КонецЕсли;
	
	// Рассчитаем по налоговой базе и ставке сумму НДС
	СтрокаТабличнойЧасти.СуммаНДС = УчетНДСКлиентСервер.РассчитатьСуммуНДС(
		СтрокаТабличнойЧасти.НалоговаяБазаНДС,
		Ложь,
		УчетНДСУПКлиентСервер.ЗначениеСтавкиНДС(СтрокаТабличнойЧасти.СтавкаНДС));
		
	Если ДанныеОбъекта.ОсобыйПризнакЗаявителя = "0" И СтрокаТабличнойЧасти.ОсобыйПризнакДОПП = "0" Тогда
		Если СтрокаТабличнойЧасти.МаркируемаяПродукция = Истина Тогда
			СтрокаТабличнойЧасти.ОбеспечительныйПлатеж = СтрокаТабличнойЧасти.СуммаНДС;
		Иначе
			СтрокаТабличнойЧасти.ОбеспечительныйПлатеж = СтрокаТабличнойЧасти.СуммаНДС + СтрокаТабличнойЧасти.СуммаАкциза;
		КонецЕсли;
	Иначе
		СтрокаТабличнойЧасти.ОбеспечительныйПлатеж = 0;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораАкцизы(ВыбранноеЗначение)
	
	СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
	
	ДанныеСтрокиТаблицы = Новый Структура(
		"ФактурнаяСтоимость,НалоговаяБазаНДС,СтавкаНДС,СуммаНДС,ОбеспечительныйПлатеж,КатегорияПодакцизныхТоваров,КБК,МаркируемаяПродукция,
		|НалоговаяБазаАкцизы,ЕдиницаИзмеренияАкциза,ТвердаяСтавкаАкциза,АдвалорнаяСтавкаАкциза,СуммаАкциза,АналитикаАкциза, ОсобыйПризнакДОПП");
		
	ДанныеОбъекта = Новый Структура(
		"ВалютаРегламентированногоУчета,Валюта,Дата,ОсобыйПризнакЗаявителя",
		ВалютаРегламентированногоУчета, Объект.Валюта, Объект.Дата, Объект.ОсобыйПризнакЗаявителя);
		
	ЗаполнитьЗначенияСвойств(ДанныеСтрокиТаблицы, СтрокаТабличнойЧасти);
	ЗаполнитьЗначенияСвойств(ДанныеСтрокиТаблицы, ВыбранноеЗначение);
	
	РасчитатьСуммыВТабличнойЧастиНаСервере(ДанныеСтрокиТаблицы, ДанныеОбъекта);
	ЗаполнитьАналитикуАкцизов(ДанныеСтрокиТаблицы);
	
	ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти, ДанныеСтрокиТаблицы);
	ОбновитьИтоги(ЭтотОбъект);
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ДоговорКонтрагентаПриИзмененииНаСервере()

	ВалютаДоговора = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Договор, "ВалютаВзаиморасчетов");
	
	Если Объект.Валюта <> ВалютаДоговора Тогда
		
		Объект.Валюта = ВалютаДоговора;
		НаименованиеВалютыДокумента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Валюта, "Наименование");
		
		ДанныеОбъекта = Новый Структура(
			"ВалютаРегламентированногоУчета,Валюта,Дата,ОсобыйПризнакЗаявителя",
			ВалютаРегламентированногоУчета, Объект.Валюта, Объект.Дата, Объект.ОсобыйПризнакЗаявителя);
		
		Для каждого СтрокаТабличнойЧасти Из Объект.Товары Цикл
			
			РасчитатьСуммыВТабличнойЧастиНаСервере(СтрокаТабличнойЧасти, ДанныеОбъекта);
			
		КонецЦикла;
		
		УправлениеФормой(ЭтотОбъект);
		ОбновитьИтоги(ЭтотОбъект);
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ОсобыйПризнакЗаявителяПриИзмененииНаСервере()
	
	ДанныеОбъекта = Новый Структура(
		"ВалютаРегламентированногоУчета,Валюта,Дата,ОсобыйПризнакЗаявителя",
		ВалютаРегламентированногоУчета, Объект.Валюта, Объект.Дата, Объект.ОсобыйПризнакЗаявителя);
	
	Для каждого СтрокаТабличнойЧасти Из Объект.Товары Цикл
		
		РасчитатьСуммыВТабличнойЧастиНаСервере(СтрокаТабличнойЧасти, ДанныеОбъекта);
		
	КонецЦикла;
	
	УправлениеФормой(ЭтотОбъект);
	ОбновитьИтоги(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ОрганизацияПриИзмененииНаСервере()
	
	УстановитьФункциональныеОпцииФормы();
	УстановитьОсобыйПризнакЗаявителя();
	
	Если ЗначениеЗаполнено(Объект.Контрагент) Тогда
		КонтрагентОбработатьИзменение();
	КонецЕсли;
	
	СтруктураРеквизитовВыгрузки = ОбновитьДанныеРеквизитовВыгрузки();
		
	Если Объект.Товары.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если ИмпортПодакцизныхТоваров Тогда
		КэшированныеЗначения = ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруКэшируемыеЗначения();
		СтруктураДействий = Новый Структура();
		ПараметрыЗаполнения =
			ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПараметрыЗаполненияПризнакаПодакцизныйТовар(Объект);
		СтруктураДействий.Вставить("ЗаполнитьРеквизитыРасчетаАкциза", ПараметрыЗаполнения);
		ПакетнаяОбработкаТабличнойЧастиСервер.ОбработатьТЧ(Объект.Товары, СтруктураДействий, КэшированныеЗначения);

		Если Объект.Валюта <> ВалютаРегламентированногоУчета Тогда
			
			ДанныеОбъекта = Новый Структура(
				"ВалютаРегламентированногоУчета,Валюта,Дата,ОсобыйПризнакЗаявителя",
				ВалютаРегламентированногоУчета, Объект.Валюта, Объект.Дата, Объект.ОсобыйПризнакЗаявителя);
				
			ДатаДляРасчетаКурса = ДанныеОбъекта.Дата - 86400;
			СтруктураКурса = РаботаСКурсамиВалютУТ.ПолучитьКурсВалюты(ДанныеОбъекта.Валюта, ДатаДляРасчетаКурса);
			Если СтруктураКурса.КурсЗнаменатель = 0 Тогда
				СтруктураКурса.КурсЗнаменатель = 1;
			КонецЕсли;
				
			Для каждого СтрокаТабличнойЧасти Из Объект.Товары Цикл
				РасчитатьСуммыВТабличнойЧастиНаСервере(СтрокаТабличнойЧасти, ДанныеОбъекта, СтруктураКурса);
			КонецЦикла;
			
		КонецЕсли;

		Для Каждого Строка Из Объект.Товары Цикл
			
			Строка.СуммаНДС = УчетНДСУПКлиентСервер.РассчитатьСуммуНДС(
				Строка.НалоговаяБазаНДС,
				УчетНДСУПКлиентСервер.ЗначениеСтавкиНДС(Строка.СтавкаНДС),
				Ложь);
			ЗаполнитьАналитикуАкцизов(Строка);

		КонецЦикла;
	
	КонецЕсли;

	ОтветственныеЛицаСервер.ПриИзмененииСвязанныхРеквизитовДокумента(Объект);
	
	СобытияФорм.ПриИзмененииЭлемента(ЭтотОбъект, "Товары");
	
	УправлениеФормой(ЭтотОбъект);
	ОбновитьИтоги(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ДатаПриИзмененииНаСервере()
	
	УстановитьФункциональныеОпцииФормы();
	
	Если Объект.Товары.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	КэшированныеЗначения = ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруКэшируемыеЗначения();
	СтруктураДействий = Новый Структура;
	СтруктураЗаполненияСтавкиНДС = 
		ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПараметрыЗаполненияСтавкиНДС(Объект);
	СтруктураЗаполненияСтавкиНДС.ИнициализацияВходящегоДокумента = Истина;
	
	СтруктураДействий.Вставить("СкорректироватьСтавкуНДС", СтруктураЗаполненияСтавкиНДС);
	Если ИмпортПодакцизныхТоваров Тогда
		ПараметрыЗаполнения =
			ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПараметрыЗаполненияПризнакаПодакцизныйТовар(Объект);
		СтруктураДействий.Вставить("ЗаполнитьРеквизитыРасчетаАкциза", ПараметрыЗаполнения);
	КонецЕсли;

	ПакетнаяОбработкаТабличнойЧастиСервер.ОбработатьТЧ(Объект.Товары, СтруктураДействий, КэшированныеЗначения);
	
	Если Объект.Валюта <> ВалютаРегламентированногоУчета Тогда
		
		ДанныеОбъекта = Новый Структура(
			"ВалютаРегламентированногоУчета,Валюта,Дата,ОсобыйПризнакЗаявителя",
			ВалютаРегламентированногоУчета, Объект.Валюта, Объект.Дата, Объект.ОсобыйПризнакЗаявителя);
			
		ДатаДляРасчетаКурса = ДанныеОбъекта.Дата - 86400;
		СтруктураКурса = РаботаСКурсамиВалютУТ.ПолучитьКурсВалюты(ДанныеОбъекта.Валюта, ДатаДляРасчетаКурса);
		Если СтруктураКурса.КурсЗнаменатель = 0 Тогда
			СтруктураКурса.КурсЗнаменатель = 1;
		КонецЕсли;
			
		Для каждого СтрокаТабличнойЧасти Из Объект.Товары Цикл
			РасчитатьСуммыВТабличнойЧастиНаСервере(СтрокаТабличнойЧасти, ДанныеОбъекта, СтруктураКурса);
		КонецЦикла;
		
	КонецЕсли;
	
	СтавкаНДС10 = УчетНДСРФВызовСервера.СтавкаНДСПоЗначениюПеречисления(
				Перечисления.СтавкиНДС.НДС10, Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС);
	ОсновнаяСтавкаНДС = УчетНДСУП.СтавкаНДСПоУмолчанию(Неопределено, Объект.Дата);
	
	Для Каждого Строка Из Объект.Товары Цикл
		
		Если Строка.СтавкаНДС <> СтавкаНДС10 Тогда
			Строка.СтавкаНДС = ОсновнаяСтавкаНДС;
		КонецЕсли;
		
		Строка.СуммаНДС = УчетНДСУПКлиентСервер.РассчитатьСуммуНДС(
			Строка.НалоговаяБазаНДС,
			УчетНДСУПКлиентСервер.ЗначениеСтавкиНДС(Строка.СтавкаНДС),
			Ложь);
		ЗаполнитьАналитикуАкцизов(Строка);

	КонецЦикла;
	
	ОтветственныеЛицаСервер.ПриИзмененииСвязанныхРеквизитовДокумента(Объект);
	
	СобытияФорм.ПриИзмененииЭлемента(ЭтотОбъект, "Товары");
	
	УстановитьСписокВыбораСтавкиНДС();
	УправлениеФормой(ЭтотОбъект);
	
	ОбновитьИтоги(ЭтотОбъект);
		
КонецПроцедуры

&НаСервере
Процедура КонтрагентПриИзмененииНаСервере()

	КонтрагентОбработатьИзменение();
	
	УправлениеФормой(ЭтотОбъект);

КонецПроцедуры

&НаСервере
Процедура КонтрагентОбработатьИзменение()

	Если ЗначениеЗаполнено(Объект.Договор) Тогда
		ДоговорКонтрагентаПриИзмененииНаСервере();
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура УстановитьОсобыйПризнакЗаявителя()
	
	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		
		РеквизитыОрганизации = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.Организация, "ОсобыйПризнакЗаявителяДОПП, ИнойОсобыйПризнакЗаявителяДОПП");
		Объект.ОсобыйПризнакЗаявителя = РеквизитыОрганизации.ОсобыйПризнакЗаявителяДОПП;
		Если Объект.ОсобыйПризнакЗаявителя = "2" Тогда
			Объект.ИнойОсобыйПризнакЗаявителя = РеквизитыОрганизации.ИнойОсобыйПризнакЗаявителяДОПП;
		КонецЕсли;
		Если Не ЗначениеЗаполнено(Объект.ОсобыйПризнакЗаявителя) Тогда
			Объект.ОсобыйПризнакЗаявителя = "0";
		КонецЕсли;
		ОсобыйПризнакЗаявителяПриИзмененииНаСервере();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуРедактированияАкцизов(ВыбранноеЗначение)

	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ТолькоПросмотр Тогда
		ЗаблокироватьДанныеФормыДляРедактирования();
	КонецЕсли;
	
	ДанныеСтроки = Объект.Товары.НайтиПоИдентификатору(ВыбранноеЗначение);
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("ТолькоПросмотр",             ТолькоПросмотр);
	ПараметрыФормы.Вставить("НалоговаяБазаАкцизы",        ДанныеСтроки.НалоговаяБазаАкцизы);
	ПараметрыФормы.Вставить("ТвердаяСтавкаАкциза",        ДанныеСтроки.ТвердаяСтавкаАкциза);
	ПараметрыФормы.Вставить("АдвалорнаяСтавкаАкциза",     ДанныеСтроки.АдвалорнаяСтавкаАкциза);
	ПараметрыФормы.Вставить("ЕдиницаИзмеренияАкциза",     ДанныеСтроки.ЕдиницаИзмеренияАкциза);
	ПараметрыФормы.Вставить("СуммаАкциза",                ДанныеСтроки.СуммаАкциза);
	ПараметрыФормы.Вставить("Номенклатура",               ДанныеСтроки.Номенклатура);
	ПараметрыФормы.Вставить("ФактурнаяСтоимость",         ДанныеСтроки.ФактурнаяСтоимость);
	ПараметрыФормы.Вставить("ЕдиницаИзмерения",           ДанныеСтроки.Упаковка);
	ПараметрыФормы.Вставить("КодТНВЭД",                   ДанныеСтроки.КодТНВЭД);
	ПараметрыФормы.Вставить("Количество",                 ДанныеСтроки.Количество);
	ПараметрыФормы.Вставить("ДатаПринятияНаУчет",         Объект.Дата);
	ПараметрыФормы.Вставить("Организация",                Объект.Организация);
	ПараметрыФормы.Вставить("ВалютаДокумента",            Объект.Валюта);
	ПараметрыФормы.Вставить("ВалютаРеглУчета",            ВалютаРегламентированногоУчета);
	ПараметрыФормы.Вставить("ЕстьУчетПодакцизныхТоваров", ДанныеСтроки.ПодакцизныйТовар);
	ПараметрыФормы.Вставить("КоэфициентПересчета",        ДанныеСтроки.КоэффициентПересчета);
	ПараметрыФормы.Вставить("КатегорияПодакцизныхТоваров",ДанныеСтроки.КатегорияПодакцизныхТоваров);
	ПараметрыФормы.Вставить("КБК",                        ДанныеСтроки.КБК);
	ПараметрыФормы.Вставить("МаркируемаяПродукция",       ДанныеСтроки.МаркируемаяПродукция);
	
	КодыБКМассив = Новый Массив();
	Для Каждого КБК Из КодыБК Цикл
		СтруктураСтроки = Новый Структура();
		СтруктураСтроки.Вставить("Код",      КБК.Код);
		СтруктураСтроки.Вставить("Название", КБК.Название);
		КодыБКМассив.Добавить(СтруктураСтроки);
	КонецЦикла;
	ПараметрыФормы.Вставить("КодыБК", КодыБКМассив);
	
	КБКПокатегориямПараметр = Новый Массив();
	Для Каждого КБК Из КБКПокатегориям Цикл
		СтруктураСтроки = Новый Структура();
		СтруктураСтроки.Вставить("Код",                   КБК.Код);
		СтруктураСтроки.Вставить("КодПодакцизногоТовара", КБК.КодПодакцизногоТовара);
		КБКПокатегориямПараметр.Добавить(СтруктураСтроки);
	КонецЦикла;
	ПараметрыФормы.Вставить("КБКПокатегориям", КБКПокатегориямПараметр);
	
	ОткрытьФорму("Документ.ДокументОПредстоящейПоставке.Форма.ФормаРедактированияАкцизов", ПараметрыФормы, ЭтотОбъект);

КонецПроцедуры

#КонецОбласти

#Область ВыгрузкаВЭлектронномВиде

&НаКлиенте
Процедура ОткрытьФормуСведенияОПодписантах()

	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("СтруктураРеквизитов", СтруктураРеквизитовВыгрузки);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПараметрыВыгрузкиЗавершение", ЭтотОбъект);
	
	ОткрытьФорму("Документ.ДокументОПредстоящейПоставке.Форма.ФормаСведенияОПодписантах", ПараметрыФормы, ЭтотОбъект,,,,
		ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыВыгрузкиЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		
		СтруктураРеквизитовВыгрузки = Результат;
		
		Модифицированность = Истина;
				
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ОбновитьДанныеРеквизитовВыгрузки()
	
	МассивДокументов = Новый Массив;
	МассивДокументов.Добавить(Объект.Ссылка);
				
	ЭтоПБОЮЛ = НЕ РегламентированнаяОтчетностьВызовСервера.ЭтоЮридическоеЛицо(Объект.Организация);
	
	СтрокаСведений = "ИННЮЛ, ИННФЛ, КППЮЛ, НаимЮЛПол, ФИО, КодНО, ФИОРук, ФИОБух, ФИОУпПред, ИННРук, ИННБух, ИННУпПред";
	СведенияОбОрганизации = РегламентированнаяОтчетностьВызовСервера.ПолучитьСведенияОбОрганизации(Объект.Организация, Объект.Дата, СтрокаСведений);
	
	ПараметрыВыгрузки = Новый Структура;
	
	Если НЕ ЗначениеЗаполнено(СведенияОбОрганизации) Тогда
		Возврат ПараметрыВыгрузки;
	КонецЕсли;
				
	ПараметрыВыгрузки.Вставить("ЭтоПБОЮЛ", ЭтоПБОЮЛ);
	ПараметрыВыгрузки.Вставить("НалогоплательщикИННЮЛ", СведенияОбОрганизации.ИННЮЛ);
	ПараметрыВыгрузки.Вставить("НалогоплательщикКПП", 	СведенияОбОрганизации.КППЮЛ);
	ПараметрыВыгрузки.Вставить("НалогоплательщикИННФЛ", СведенияОбОрганизации.ИННФЛ);
	ПараметрыВыгрузки.Вставить("НалогоплательщикНаимЮЛ",СведенияОбОрганизации.НаимЮЛПол);
	ПараметрыВыгрузки.Вставить("НалогоплательщикФИО", 	СведенияОбОрганизации.ФИО);
	
	ПараметрыВыгрузки.Вставить("КодИФНС", СведенияОбОрганизации.КодНО);
	
	ДанныеПредставителя = ПолучитьСведенияОПредставителе(СведенияОбОрганизации.КодНО);
	
	ПараметрыВыгрузки.Вставить("ПрОтпр", Число(ДанныеПредставителя.ТипПредставителя));
	
	ОтправительЯвляетсяЮЛ = Истина;
	
	Если ДанныеПредставителя.ТипПредставителя = "1" Тогда
		
		ФИОПодп1Титул = СведенияОбОрганизации.ФИОРук;
		ФИОПодп2Титул = СведенияОбОрганизации.ФИОБух;
		
	Иначе
		
		ФИОПодп1Титул = СведенияОбОрганизации.ФИОУпПред;
		
	КонецЕсли;
	
	НаимОтпр 		= "";
	ИННЮЛОтпр		= "";
	КППОтпр         = "";

	ИННФЛОтпр       = "";

	ФамилияФЛОтпр   = "";
	ИмяФЛОтпр       = "";
	ОтчествоФЛОтпр  = "";

	ПрПодп1         = 0;
	ИННФЛПодп1      = СведенияОбОрганизации.ИННРук;
	ДолжностьПодп1  = "";
	
	ФамилияПодп1    = "";
	ИмяПодп1        = "";
	ОтчествоПодп1   = "";

	НаимДовПодп1    = "";
	НомерДовПодп1   = "";
	ДатаДовПодп1    = "";
	
	ПрПодп2         = 0;
    ИННФЛПодп2      = СведенияОбОрганизации.ИННБух;;
	ДолжностьПодп2  = "";
	
	ФамилияПодп2    = "";
	ИмяПодп2        = "";
	ОтчествоПодп2   = "";
	
	НаимДовПодп2    = "";
	НомерДовПодп2   = "";
	ДатаДовПодп2    = "";

	ПрКурьер        = 0;
	ИННФЛКурьер		= ИННФЛПодп1;

	ФамилияКурьер   = "";
	ИмяКурьер       = "";
	ОтчествоКурьер  = "";
	
	НаимДовКурьер   = "";
	НомерДовКурьер  = "";
	ДатаДовКурьер   = "";

	Если ДанныеПредставителя.ТипПредставителя = "1" Тогда

		Если НЕ ЭтоПБОЮЛ Тогда
			
			ОтправительЯвляетсяЮЛ = Истина;
			
			НаимОтпр 		= СведенияОбОрганизации.НаимЮЛПол;
			ИННЮЛОтпр		= СведенияОбОрганизации.ИННЮЛ;
			КППОтпр         = СведенияОбОрганизации.КППЮЛ;
			
			ПрПодп1 = 2;
			
			ФИОПодп1        = РегламентированнаяОтчетность.РазложитьФИО(ФИОПодп1Титул);
			ФамилияПодп1    = ФИОПодп1.Фамилия;
			ИмяПодп1        = ФИОПодп1.Имя;
			ОтчествоПодп1   = ФИОПодп1.Отчество;
			
			ПрПодп2 = 2;
			
			ФИОПодп2        = РегламентированнаяОтчетность.РазложитьФИО(ФИОПодп2Титул);
			ФамилияПодп2    = ФИОПодп2.Фамилия;
			ИмяПодп2        = ФИОПодп2.Имя;
			ОтчествоПодп2   = ФИОПодп2.Отчество;
			
			ПрКурьер = 2;

			ФамилияКурьер   = ФИОПодп1.Фамилия;
			ИмяКурьер       = ФИОПодп1.Имя;
			ОтчествоКурьер  = ФИОПодп1.Отчество;
			
		Иначе
			
			ОтправительЯвляетсяЮЛ = Ложь;
			
			ИННФЛОтпр        = СведенияОбОрганизации.ИННФЛ;
			
			ФИОотправителя   = РегламентированнаяОтчетность.РазложитьФИО(ФИОПодп1Титул);
			ФамилияФЛОтпр    = ФИОотправителя.Фамилия;
			ИмяФЛОтпр        = ФИОотправителя.Имя;
			ОтчествоФЛОтпр   = ФИОотправителя.Отчество;

			ПрПодп1 = 1;
			ФИОПодп1        = РегламентированнаяОтчетность.РазложитьФИО(ФИОПодп1Титул);
			ФамилияПодп1    = ФИОПодп1.Фамилия;
			ИмяПодп1        = ФИОПодп1.Имя;
			ОтчествоПодп1   = ФИОПодп1.Отчество;
			
			ПрКурьер = 1;
			
			ФамилияКурьер   = ФИОотправителя.Фамилия;
			ИмяКурьер       = ФИОотправителя.Имя;
			ОтчествоКурьер  = ФИОотправителя.Отчество;
			
		КонецЕсли;
		
	Иначе
		
		Если ДанныеПредставителя.флПредставительЮрЛицо Тогда

			ОтправительЯвляетсяЮЛ = Истина;
			
			ПредставительСсылка = ДанныеПредставителя.ПредставительСсылка;
			НаимОтпр 		    = СокрЛП(ПредставительСсылка);
			ИННЮЛОтпр		    = ПредставительСсылка.ИНН;
			КППОтпр             = ПредставительСсылка.КПП;	
			
			ПрПодп1 = 3;
			ФИОПодп1        = РегламентированнаяОтчетность.РазложитьФИО(ФИОПодп1Титул);
			ФамилияПодп1    = ФИОПодп1.Фамилия;
			ИмяПодп1        = ФИОПодп1.Имя;
			ОтчествоПодп1   = ФИОПодп1.Отчество;

			ФИОПодп2        = РегламентированнаяОтчетность.РазложитьФИО(ФИОПодп2Титул);
			ФамилияПодп2    = ФИОПодп2.Фамилия;
			ИмяПодп2        = ФИОПодп2.Имя;
			ОтчествоПодп2   = ФИОПодп2.Отчество;

			ПрКурьер 		= 3;

			ФамилияКурьер   = ФИОПодп1.Фамилия;
			ИмяКурьер       = ФИОПодп1.Имя;
			ОтчествоКурьер  = ФИОПодп1.Отчество;
			
		Иначе
			
			ОтправительЯвляетсяЮЛ = Ложь;
			
			ИННФЛОтпр        = СведенияОбОрганизации.ИННУпПред;
			
			ФИОотправителя   = РегламентированнаяОтчетность.РазложитьФИО(ФИОПодп1Титул);
			ФамилияФЛОтпр    = ФИОотправителя.Фамилия;
			ИмяФЛОтпр        = ФИОотправителя.Имя;
			ОтчествоФЛОтпр   = ФИОотправителя.Отчество;
			
			ПрПодп1 		= 3;
			ФамилияПодп1    = ФИОотправителя.Фамилия;
			ИмяПодп1        = ФИОотправителя.Имя;
			ОтчествоПодп1   = ФИОотправителя.Отчество;
			
			ФИОПодп2        = РегламентированнаяОтчетность.РазложитьФИО(ФИОПодп2Титул);
			ФамилияПодп2    = ФИОПодп2.Фамилия;
			ИмяПодп2        = ФИОПодп2.Имя;
			ОтчествоПодп2   = ФИОПодп2.Отчество;
			
			ПрКурьер = 3;
			
			ФамилияКурьер   = ФИОотправителя.Фамилия;
			ИмяКурьер       = ФИОотправителя.Имя;
			ОтчествоКурьер  = ФИОотправителя.Отчество;
			
		КонецЕсли;
		
	КонецЕсли;
	
	ПараметрыВыгрузки.Вставить("ОтправительЯвляетсяЮЛ", ОтправительЯвляетсяЮЛ);
	
	ПараметрыВыгрузки.Вставить("НаимОтпр", 		НаимОтпр);
	ПараметрыВыгрузки.Вставить("ИННЮЛОтпр",		ИННЮЛОтпр);
	ПараметрыВыгрузки.Вставить("КППОтпр",       КППОтпр);

	ПараметрыВыгрузки.Вставить("ИННФЛОтпр",     ИННФЛОтпр);

	ПараметрыВыгрузки.Вставить("ФамилияФЛОтпр", ФамилияФЛОтпр);
	ПараметрыВыгрузки.Вставить("ИмяФЛОтпр",     ИмяФЛОтпр);
	ПараметрыВыгрузки.Вставить("ОтчествоФЛОтпр",ОтчествоФЛОтпр);
	
	Если ТипЗнч(СтруктураРеквизитовВыгрузки) = Тип("Структура") Тогда
		
		ПараметрыВыгрузки.Вставить("ИмпортерСовпадаетСОтправителем",
			СтруктураРеквизитовВыгрузки.ИмпортерСовпадаетСОтправителем);
		
		ПараметрыВыгрузки.Вставить("ИмпортерЯвляетсяЮЛ", СтруктураРеквизитовВыгрузки.ИмпортерЯвляетсяЮЛ);
		
		ПараметрыВыгрузки.Вставить("НаимИмпорт",  СтруктураРеквизитовВыгрузки.НаимИмпорт);
		ПараметрыВыгрузки.Вставить("ИННЮЛИмпорт", СтруктураРеквизитовВыгрузки.ИННЮЛИмпорт);
		ПараметрыВыгрузки.Вставить("КППИмпорт",   СтруктураРеквизитовВыгрузки.КППИмпорт);
		
		ПараметрыВыгрузки.Вставить("ИННФЛИмпорт",      СтруктураРеквизитовВыгрузки.ИННФЛИмпорт);
		ПараметрыВыгрузки.Вставить("ФамилияФЛИмпорт",  СтруктураРеквизитовВыгрузки.ФамилияФЛИмпорт);
		ПараметрыВыгрузки.Вставить("ИмяФЛИмпорт",      СтруктураРеквизитовВыгрузки.ИмяФЛИмпорт);
		ПараметрыВыгрузки.Вставить("ОтчествоФЛИмпорт", СтруктураРеквизитовВыгрузки.ОтчествоФЛИмпорт);
		
	Иначе
		
		ПараметрыВыгрузки.Вставить("ИмпортерСовпадаетСОтправителем", Истина);
		
		ПараметрыВыгрузки.Вставить("ИмпортерЯвляетсяЮЛ", Истина);
		
		ПараметрыВыгрузки.Вставить("НаимИмпорт",  "");
		ПараметрыВыгрузки.Вставить("ИННЮЛИмпорт", "");
		ПараметрыВыгрузки.Вставить("КППИмпорт",   "");
		
		ПараметрыВыгрузки.Вставить("ИННФЛИмпорт",      "");
		ПараметрыВыгрузки.Вставить("ФамилияФЛИмпорт",  "");
		ПараметрыВыгрузки.Вставить("ИмяФЛИмпорт",      "");
		ПараметрыВыгрузки.Вставить("ОтчествоФЛИмпорт", "");
		
	КонецЕсли;
	
	ПараметрыВыгрузки.Вставить("ПрПодп1",       ПрПодп1);
	ПараметрыВыгрузки.Вставить("ИННФЛПодп1",    ИННФЛПодп1);
	ПараметрыВыгрузки.Вставить("ДолжностьПодп1",ДолжностьПодп1);
	
	ПараметрыВыгрузки.Вставить("ФамилияПодп1",  ФамилияПодп1);
	ПараметрыВыгрузки.Вставить("ИмяПодп1",      ИмяПодп1);
	ПараметрыВыгрузки.Вставить("ОтчествоПодп1", ОтчествоПодп1);

	ПараметрыВыгрузки.Вставить("НаимДовПодп1",  НаимДовПодп1);
	ПараметрыВыгрузки.Вставить("НомерДовПодп1", НомерДовПодп1);
	ПараметрыВыгрузки.Вставить("ДатаДовПодп1",  ДатаДовПодп1);
	
	ПараметрыВыгрузки.Вставить("ПрПодп2",       ПрПодп2);
	ПараметрыВыгрузки.Вставить("ИННФЛПодп2",    ИННФЛПодп2);
	ПараметрыВыгрузки.Вставить("ДолжностьПодп2",ДолжностьПодп2);
	
	ПараметрыВыгрузки.Вставить("ФамилияПодп2",  ФамилияПодп2);
	ПараметрыВыгрузки.Вставить("ИмяПодп2",      ИмяПодп2);
	ПараметрыВыгрузки.Вставить("ОтчествоПодп2", ОтчествоПодп2);

	ПараметрыВыгрузки.Вставить("НаимДовПодп2",  НаимДовПодп2);
	ПараметрыВыгрузки.Вставить("НомерДовПодп2", НомерДовПодп2);
	ПараметрыВыгрузки.Вставить("ДатаДовПодп2",  ДатаДовПодп2);
	
	ПараметрыВыгрузки.Вставить("ОтправленПочтой", Ложь);
	ПараметрыВыгрузки.Вставить("ПрКурьер",      ПрКурьер);
	ПараметрыВыгрузки.Вставить("ИННФЛКурьер",   ИННФЛКурьер);
	                 
	ПараметрыВыгрузки.Вставить("ФамилияКурьер", ФамилияКурьер);
	ПараметрыВыгрузки.Вставить("ИмяКурьер",     ИмяКурьер);
	ПараметрыВыгрузки.Вставить("ОтчествоКурьер",ОтчествоКурьер);
	
	ПараметрыВыгрузки.Вставить("НаимДовКурьер",  НаимДовКурьер);
	ПараметрыВыгрузки.Вставить("НомерДовКурьер", НомерДовКурьер);
	ПараметрыВыгрузки.Вставить("ДатаДовКурьер",  ДатаДовКурьер);
		
	ПараметрыВыгрузки.Вставить("ФИОУпПред", СведенияОбОрганизации.ФИОУпПред);
	ПараметрыВыгрузки.Вставить("ИННУпПред", СведенияОбОрганизации.ИННУпПред);
	
	ПараметрыВыгрузки.Вставить("ФИОРук",    СведенияОбОрганизации.ФИОРук);
	
	Возврат ПараметрыВыгрузки;	
	
КонецФункции

&НаСервере
Функция ПолучитьСведенияОПредставителе(КодИФНС) Экспорт
	
	флПредставительЮрЛицо = Истина;
	НаименованиеОрганизацииПредставителя = "";
	ФИОПредставителя = "";
	ТипПредставителя = "1";
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	РегистрацииВНалоговомОргане.Код,
	|	РегистрацииВНалоговомОргане.КПП,
	|	РегистрацииВНалоговомОргане.Представитель,
	|	РегистрацииВНалоговомОргане.УполномоченноеЛицоПредставителя
	|ИЗ
	|	Справочник.РегистрацииВНалоговомОргане КАК РегистрацииВНалоговомОргане
	|ГДЕ
	|	РегистрацииВНалоговомОргане.Код = &Код
	|	И РегистрацииВНалоговомОргане.Владелец = &Владелец");
	
	Запрос.УстановитьПараметр("Код", КодИФНС);
	Запрос.УстановитьПараметр("Владелец", Объект.Организация);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() И ЗначениеЗаполнено(Выборка.Представитель) Тогда
		
		ТипПредставителя = "2";
		
		Если НЕ РегламентированнаяОтчетность.ПредставительЯвляетсяФизЛицом(Выборка.Представитель) Тогда
			
			флПредставительЮрЛицо = Истина;
			ФИОПредставителя = СокрЛП(Выборка.УполномоченноеЛицоПредставителя);
			ПредставительСсылка = Выборка.Представитель;
			
		Иначе
			
			флПредставительЮрЛицо = Ложь;
			ПредставительСсылка = Выборка.Представитель;
			ФИОПредставителя = СокрЛП(ПредставительСсылка);
			
		КонецЕсли;
	КонецЕсли;
	
	Возврат Новый Структура("ТипПредставителя, флПредставительЮрЛицо, ФИОПредставителя, ПредставительСсылка", 
							 ТипПредставителя, флПредставительЮрЛицо, ФИОПредставителя, ПредставительСсылка);
	
КонецФункции

#КонецОбласти

#Область Прочее

&НаСервере
Функция ЗаполнитьНомераРНПТИзКвитанцииСервер()
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор);
	
	ПередаваемыеДанные = Документы.ДокументОПредстоящейПоставке.СтруктураПередаваемыхДанных();
	ПередаваемыеДанные.Уведомление = СсылкаНаДОПП;
	ПередаваемыеДанные.Организация = Объект.Организация;
	ПередаваемыеДанные.ПереданОбъект = Ложь;
	ПередаваемыеДанные.ХарактеристикаУчаствуетВНаименованииДляБРО = Объект.ХарактеристикаУчаствуетВНаименованииДляБРО;
	ВыгружаемыеКолонки = "НомерСтроки, Номенклатура, НоменклатураПартнера, Характеристика, Содержание, КодТНВЭД, НомерРНПТ, СтранаПроисхождения";
	ПередаваемыеДанные.ТаблицаТовары = Объект.Товары.Выгрузить(, ВыгружаемыеКолонки);
	
	Возврат ДлительныеОперации.ВыполнитьФункцию(
		ПараметрыВыполнения,
		"Документы.ДокументОПредстоящейПоставке.ЗаполнитьНомерРНПТИзКвитанции",
		ПередаваемыеДанные);
	
КонецФункции

&НаКлиенте
Процедура ЗаполнениеРНПТизФНСЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Ошибка" Тогда
		СтандартныеПодсистемыКлиент.ВывестиИнформациюОбОшибке(Результат.ИнформацияОбОшибке);
		Возврат;
	КонецЕсли;
	
	ЗаполнитьРНПТИзФНСЗавершение(Результат.АдресРезультата);
	
КонецПроцедуры

&НаСервере
Функция ЗаполнитьРНПТИзФНСЗавершение(АдресРезультата)
	
	Результат = ПолучитьИзВременногоХранилища(АдресРезультата);
	УдалитьИзВременногоХранилища(АдресРезультата);
	
	Если Результат.Количество() > 0 Тогда
		УчетПрослеживаемыхТоваровЛокализация.ЗаполнитьНомера(Объект, Результат,"Товары", "НомерРНПТ", , Истина);
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ОповещениеВводСтроки(ВведенныйТекст, ДополнительныеПараметры) Экспорт
	
	ОчиститьСообщения();
	
	Если ВведенныйТекст = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ВыделенныеСтроки = Элементы.Товары.ВыделенныеСтроки;
	СтрокиБезСтраны = Новый Массив;
	Если ВыделенныеСтроки.Количество() > 0 Тогда
		СтрокиБезСтраны = ЗаполнитьНомераРНПТСервер(СокрЛП(ВведенныйТекст), ВыделенныеСтроки);
	КонецЕсли;
	
	Если СтрокиБезСтраны.Количество() > 0 Тогда
		
		ШаблонСообщения = НСтр("ru = 'В строке %1 не заполнена Страна происхождения'");
		Для Каждого НомерСтроки Из СтрокиБезСтраны Цикл
			ТекстСообщения = СтрШаблон(ШаблонСообщения, НомерСтроки);
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = ТекстСообщения;
			Сообщение.Сообщить();
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ЗаполнитьНомераРНПТСервер(ВведенныйТекст, ВыделенныеСтроки) Экспорт
	
	ВыгружаемыеСтроки = Новый Массив;
	СтрокиБезСтраны = Новый Массив;
	Для Каждого ИдентификаторСтроки Из ВыделенныеСтроки Цикл
		СтрокаТЧ = Объект.Товары.НайтиПоИдентификатору(ИдентификаторСтроки);
		Если СтрокаТЧ.ВедетсяУчетПоРНПТ Тогда
			Если Не ЗначениеЗаполнено(СтрокаТЧ.СтранаПроисхождения) Тогда
				СтрокиБезСтраны.Добавить(СтрокаТЧ.НомерСтроки);
			Иначе
				СтрокаТЧ.НомерРНПТ = ПредопределенноеЗначение("Справочник.НомераГТД.ПустаяСсылка");
				ВыгружаемыеСтроки.Добавить(СтрокаТЧ);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Если ВыгружаемыеСтроки.Количество() > 0 Тогда
		ВыгружаемыеКолонки = "НомерСтроки, Номенклатура, НомерРНПТ, СтранаПроисхождения, КодТНВЭД";
		УчетПрослеживаемыхТоваровЛокализация.ЗаполнитьНомера(Объект, Объект.Товары.Выгрузить(ВыгружаемыеСтроки, ВыгружаемыеКолонки),"Товары", "НомерРНПТ", ВведенныйТекст);
	КонецЕсли;
	
	Возврат СтрокиБезСтраны;
	
КонецФункции

&НаКлиенте
Процедура РазбитьСтрокуФактЗавершение(НоваяСтрока, ДополнительныеПараметры) Экспорт 
	
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	
	Если НоваяСтрока <> Неопределено Тогда

		ДействияПриИзмененииКоличества(ТекущаяСтрока);
		ДействияПриИзмененииКоличества(НоваяСтрока);
		
		ОбновитьИтоги(ЭтотОбъект);
		
	КонецЕсли;
	
	УчетПрослеживаемыхТоваровКлиентСерверЛокализация.РазбитьСтрокуЗавершение(НоваяСтрока, ДополнительныеПараметры);
	
		
КонецПроцедуры

&НаКлиенте
Процедура ДействияПриИзмененииКоличества(ТекущиеДанные)
	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиниц");
	УчетПрослеживаемыхТоваровКлиентСерверЛокализация.ДополнитьОписаниеНастроекПересчетаРеквизитовТабличнойЧасти(
		Объект,
		СтруктураДействий);
		
	ПакетнаяОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущиеДанные, СтруктураДействий, КэшированныеЗначения);
	
	ТекущиеДанные.ФактурнаяСтоимость = ТекущиеДанные.КоличествоУпаковок * ТекущиеДанные.Цена;
	
	Если ИмпортПодакцизныхТоваров Тогда
		
		РассчитатьСуммуАкцизаВТабЧасти(ТекущиеДанные);
		ДанныеСтрокиТаблицы = Новый Структура(
			"НалоговаяБазаАкцизы,ЕдиницаИзмеренияАкциза,ТвердаяСтавкаАкциза,АдвалорнаяСтавкаАкциза,СуммаАкциза,АналитикаАкциза");
		ЗаполнитьЗначенияСвойств(ДанныеСтрокиТаблицы, ТекущиеДанные);
		ЗаполнитьАналитикуАкцизов(ДанныеСтрокиТаблицы);
		ТекущиеДанные.АналитикаАкциза = ДанныеСтрокиТаблицы.АналитикаАкциза;
		ДанныеОбъекта = Новый Структура("ОсобыйПризнакЗаявителя", Объект.ОсобыйПризнакЗаявителя);
		РассчитатьНалогиПоСтроке(ДанныеОбъекта, ТекущиеДанные);
	
	КонецЕсли;
	
	ДанныеСтрокиТаблицы = Новый Структура(
		"ФактурнаяСтоимость,НалоговаяБазаНДС,СтавкаНДС,
		|СуммаНДС,СуммаАкциза,ОбеспечительныйПлатеж,МаркируемаяПродукция,
		|ТвердаяСтавкаАкциза, АдвалорнаяСтавкаАкциза,ОсобыйПризнакДОПП");
		
	ДанныеОбъекта = Новый Структура(
		"ВалютаРегламентированногоУчета,Дата,Валюта,ОсобыйПризнакЗаявителя",
		ВалютаРегламентированногоУчета, Объект.Дата, Объект.Валюта, Объект.ОсобыйПризнакЗаявителя);
		
	ЗаполнитьЗначенияСвойств(ДанныеСтрокиТаблицы, ТекущиеДанные);
	
	РасчитатьСуммыВТабличнойЧастиНаСервере(ДанныеСтрокиТаблицы, ДанныеОбъекта);
	
	ЗаполнитьЗначенияСвойств(ТекущиеДанные, ДанныеСтрокиТаблицы);
	
КонецПроцедуры


&НаКлиентеНаСервереБезКонтекста
Процедура РассчитатьСуммуАкцизаВТабЧасти(СтрокаТаблицы)
	
	СтрокаТаблицы.СуммаАкциза = СтрокаТаблицы.Количество * СтрокаТаблицы.КоэффициентПересчета * СтрокаТаблицы.ТвердаяСтавкаАкциза;
	Если СтрокаТаблицы.ЕдиницаИзмеренияАкциза = "214" Тогда
		СтрокаТаблицы.СуммаАкциза = СтрокаТаблицы.СуммаАкциза / 0.75;
	КонецЕсли;
	СтрокаТаблицы.НалоговаяБазаАкцизы = СтрокаТаблицы.Количество * СтрокаТаблицы.КоэффициентПересчета;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьРезультатВыбораНоменклатурыПартнера(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт
	
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДополнительныеПараметры.ТекущаяСтрока.НоменклатураПартнера = ВыбранноеЗначение;
	
	ТоварыНоменклатураПартнераПриИзменении(ДополнительныеПараметры.ЭлементФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьСЗапросомДальнейшегоДействия(ОповещениеЗавершения = Неопределено)
	
	ОчиститьСообщения();
	
	
КонецПроцедуры


&НаСервереБезКонтекста
Функция ОбновитьТекстСостояние(Организация, НомерДОПП, СуммаОП)
	
	Если Не ЗначениеЗаполнено(НомерДОПП) Тогда
				ТекстРаспоряжения = НСтр("ru = 'Принять к учету / отменить'");
	Иначе
		Запрос = Новый Запрос();
		Запрос.УстановитьПараметр("НомерДОПП", НомерДОПП);
		Запрос.УстановитьПараметр("Организация", Организация);
		Запрос.Текст = "ВЫБРАТЬ
		|	СУММА(ДокументыОПредстоящейПоставке.СуммаНалога) КАК СуммаНалога
		|ИЗ
		|	РегистрСведений.ДокументыОПредстоящейПоставке КАК ДокументыОПредстоящейПоставке
		|ГДЕ
		|	ДокументыОПредстоящейПоставке.НомерДОПП = &НомерДОПП
		|	И ДокументыОПредстоящейПоставке.Организация = &Организация
		|	И ДокументыОПредстоящейПоставке.Состояние <> ЗНАЧЕНИЕ(Перечисление.СостояниеДОПП.ПустаяСсылка)
		|
		|СГРУППИРОВАТЬ ПО
		|	ДокументыОПредстоящейПоставке.НомерДОПП";
		
		Результат = Запрос.Выполнить().Выбрать();
		
		СуммаПринято = 0;
		ЗаписьЕсть = Ложь;
		Если Результат.Следующий() Тогда
			СуммаПринято = Результат.СуммаНалога;
			ЗаписьЕсть = Истина;
		КонецЕсли;
		
		ОсталосьПринять = СуммаОП - СуммаПринято;
		
		Если СуммаПринято = 0 Или Не ЗаписьЕсть Тогда
			ТекстРаспоряжения = НСтр("ru = 'Принять к учету / отменить'");
		ИначеЕсли ОсталосьПринять <= 0 Тогда
			ТекстРаспоряжения = НСтр("ru = 'Принят к учету / отменен полностью'");
		Иначе
			ТекстРаспоряжения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
												НСтр("ru = 'Принято к учету / отменено %1; Осталось принять / отменить %2'"),
												СуммаПринято,
												ОсталосьПринять);
		КонецЕсли;
	КонецЕсли;
	
	НавигационнаяСсылкаСостояние = "СостояниеДОПП";
	ЦветТекста = ЦветаСтиля.ГиперссылкаЦвет;
	
	Возврат Новый ФорматированнаяСтрока(ТекстРаспоряжения, , ЦветТекста, , НавигационнаяСсылкаСостояние);
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьРеквизитыДОПП(Объект)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НомерДОПП", Объект.НомерДОПП);
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.Текст = "ВЫБРАТЬ
	|	ДокументыОПредстоящейПоставке.Организация КАК Организация,
	|	ДокументыОПредстоящейПоставке.ДатаСобытия КАК ДатаСобытия,
	|	ДокументыОПредстоящейПоставке.КБК КАК КБК,
	|	ДокументыОПредстоящейПоставке.НомерДОПП КАК НомерДОПП
	|ИЗ
	|	РегистрСведений.ДокументыОПредстоящейПоставке КАК ДокументыОПредстоящейПоставке
	|ГДЕ
	|	ДокументыОПредстоящейПоставке.НомерДОПП = &НомерДОПП
	|	И ДокументыОПредстоящейПоставке.Организация = &Организация";
	
	Результат = Запрос.Выполнить().Выгрузить();
	РеквизитыДОПП = Новый Структура();
	РеквизитыДОПП.Вставить("КоличествоЗаписей", Результат.Количество());
	РеквизитыДОПП.Вставить("Организация",       Объект.Организация);
	РеквизитыДОПП.Вставить("НомерДОПП",         Объект.НомерДОПП);
	РеквизитыДОПП.Вставить("Проведен",          Объект.Проведен);
	РеквизитыДОПП.Вставить("СуммаДокумента",    Объект.СуммаДокумента);
	Если Результат.Количество() = 1 Тогда
		ЗначениеКлюча = Новый Структура();
		ЗначениеКлюча.Вставить("Организация", Результат[0].Организация);
		ЗначениеКлюча.Вставить("ДатаСобытия", Результат[0].ДатаСобытия);
		ЗначениеКлюча.Вставить("КБК"        , Результат[0].КБК);
		ЗначениеКлюча.Вставить("НомерДОПП"  , Результат[0].НомерДОПП);
		КлючЗаписи = РегистрыСведений["ДокументыОПредстоящейПоставке"].СоздатьКлючЗаписи(ЗначениеКлюча);
		РеквизитыДОПП.Вставить("КлючЗаписи", КлючЗаписи);
	КонецЕсли;
	
	Возврат РеквизитыДОПП;
	
КонецФункции

&НаКлиенте
Процедура ПодборТоваровИзЗаказа()
	
	Попытка
		ЗаблокироватьДанныеФормыДляРедактирования();
		Модифицированность = Истина;
	Исключение
		ПоказатьПредупреждение(,КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		Возврат;
	КонецПопытки;
	
	МассивКодовСтрок = Новый Массив;
	АдресТоваров = "";
		
	ПередПодборомТоваровИзЗаказаСервер(МассивКодовСтрок, АдресТоваров);
	
	ПараметрыПодбора = Новый Структура();
	ПараметрыПодбора.Вставить("ЗаказПоставщику", Объект.ЗаказПоставщику);
	ПараметрыПодбора.Вставить("ВалютаДокумента", Объект.Валюта);
	ПараметрыПодбора.Вставить("Ссылка", Объект.Ссылка);
	ПараметрыПодбора.Вставить("Дата", Объект.Дата);
	ПараметрыПодбора.Вставить("МассивКодовСтрок", МассивКодовСтрок);
	ПараметрыПодбора.Вставить("Партнер", Объект.Партнер);
	ПараметрыПодбора.Вставить("Контрагент", Объект.Контрагент);
	ПараметрыПодбора.Вставить("Договор", Объект.Договор);
	ПараметрыПодбора.Вставить("Организация", Объект.Организация);
	ПараметрыПодбора.Вставить("НаправлениеДеятельности", Объект.НаправлениеДеятельности);
	ПараметрыПодбора.Вставить("АдресТоварыНакладнойВоВременномХранилище", АдресТоваров);
	ПараметрыПодбора.Вставить("Подразделение", Объект.Подразделение);
	ПараметрыПодбора.Вставить("ТолькоРаботыУслуги", Ложь);
	
	ОткрытьФорму(
		"Обработка.ЖурналДокументовЗакупки.Форма.ФормаПодбораТоваровИзЗаказа",
		ПараметрыПодбора,
		ЭтаФорма,,,, Неопределено, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры
	
&НаСервере
Процедура ПередПодборомТоваровИзЗаказаСервер(МассивКодовСтрок, АдресТоваров)
	
	Для Каждого СтрокаТЧ Из Объект.Товары Цикл
		
		Если СтрокаТЧ.КодСтроки <> 0  Тогда
			МассивКодовСтрок.Добавить(Новый Структура("КодСтроки,ЗаказПоставщику", СтрокаТЧ.КодСтроки, Объект.ЗаказПоставщику));
		КонецЕсли;
		
	КонецЦикла;
	
	АдресТоваров = ПоместитьВоВременноеХранилище(Объект.Товары.Выгрузить());
	
	ЗаказПоставщикуХО = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ЗаказПоставщику, "ХозяйственнаяОперация");
	
КонецПроцедуры

&НаКлиенте
Процедура ОповеститьОбОкончанииОтвязкиСтрок(КоличествоОтработанныхСтрок, СтрокиОтвязаны = Истина)

	Если СтрокиОтвязаны Тогда
		ТекстОповещения = НСтр("ru='В документе от заказов отвязано строк (%%Количество%%).'");
		ТекстОповещения = СтрЗаменить(ТекстОповещения, "%%Количество%%", КоличествоОтработанныхСтрок);
		ПоказатьОповещениеПользователя(
			НСтр("ru = 'Строки отвязаны'"),
			,
			ТекстОповещения,
			БиблиотекаКартинок.Информация32);
	Иначе
		ПоказатьОповещениеПользователя(
			НСтр("ru = 'Строки не отвязаны'"),
			,
			НСтр("ru='Ни одна строка не была отвязана.'"),
			БиблиотекаКартинок.Информация32);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьТоварыИзХранилища(АдресТоваровВХранилище)
	
	ТоварыИзХранилища = ПолучитьИзВременногоХранилища(АдресТоваровВХранилище); // ДокументТабличнаяЧасть.ДокументОПредстоящейПоставке.Товары
	
	СтруктураПоискаТоваровЗаказа = Новый Структура("КодСтроки");
	СтруктураПоискаТоваровНакладной = Новый Структура("НомерСтроки");
	
	ТоварыЗаказа = Новый Массив;
	ТоварыНакладной = Новый Массив;
	ДобавленныеСтроки = Новый Массив;
	
	Для Каждого СтрокаТоваров Из ТоварыИзХранилища Цикл
		
		Если СтрокаТоваров.КодСтроки<>0 Тогда
			СтруктураПоискаТоваровЗаказа.КодСтроки = СтрокаТоваров.КодСтроки;
			МассивСтрокТЧТовары = Объект.Товары.НайтиСтроки(СтруктураПоискаТоваровЗаказа);
		Иначе
			СтруктураПоискаТоваровНакладной.НомерСтроки = СтрокаТоваров.НомерСтроки;
			МассивСтрокТЧТовары = Объект.Товары.НайтиСтроки(СтруктураПоискаТоваровНакладной);
		КонецЕсли;
		
		Если МассивСтрокТЧТовары.Количество() = 0 Тогда
			
			СтрокаТЧТовары = Объект.Товары.Добавить();
			
			ДобавленныеСтроки.Добавить(СтрокаТЧТовары);
			
		ИначеЕсли МассивСтрокТЧТовары.Количество() = 1 Тогда
			
			СтрокаТЧТовары = МассивСтрокТЧТовары[0];
			
		ИначеЕсли МассивСтрокТЧТовары.Количество() > 1 Тогда
			
			Для Каждого СтрокаКУдалению Из МассивСтрокТЧТовары Цикл
				
				Объект.Товары.Удалить(СтрокаКУдалению);
				
			КонецЦикла;
			
			СтрокаТЧТовары = Объект.Товары.Добавить();
			
			ДобавленныеСтроки.Добавить(СтрокаТЧТовары);
			
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(СтрокаТЧТовары, СтрокаТоваров);
		
		ТоварыЗаказа.Добавить(СтрокаТЧТовары);
		
	КонецЦикла;
	
	КэшированныеЗначенияСлужебные = ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруКэшируемыеЗначения();
	
	СтруктураНаименованийТабличныхЧастей = Новый Структура("Товары");
	ЗаполнитьСлужебныеРеквизитыПоНоменклатуре(СтруктураНаименованийТабличныхЧастей);
	ЗакупкиСервер.ЗаполнитьСлужебныеРеквизитыНомераГТД(Объект.Товары);
	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ЗаполнитьПризнакТипНоменклатуры", Новый Структура("Номенклатура", "ТипНоменклатуры"));
	СтруктураДействий.Вставить("ЗаполнитьПризнакАртикул", Новый Структура("Номенклатура", "Артикул")); 
	СтруктураДействий.Вставить("ЗаполнитьПризнакВедетсяУчетПоГТД", Новый Структура("Номенклатура", "ВедетсяУчетПоГТД"));
	СтруктураДействий.Вставить("ЗаполнитьТНВЭД", Новый Структура("Номенклатура", "КодТНВЭД"));
	СтруктураДействий.Вставить("ЗаполнитьМаркируемаяПродукция", Новый Структура("Номенклатура", "Номенклатура"));
	ПараметрыЗаполнения = ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПараметрыЗаполненияСтраныПроисхождения();
	ПараметрыЗаполнения.НомерГТД = "НомерРНПТ";
	СтруктураДействий.Вставить("ЗаполнитьСтрануПроисхожденияНоменклатуры", ПараметрыЗаполнения);
	
	Если ИмпортПодакцизныхТоваров Тогда
		ПараметрыЗаполнения =
			ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПараметрыЗаполненияПризнакаПодакцизныйТовар(Объект);
		СтруктураДействий.Вставить("ЗаполнитьРеквизитыРасчетаАкциза", ПараметрыЗаполнения);
	КонецЕсли;
	СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиниц");
		
	ПараметрыЗаполненияСтавкиНДС = ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПараметрыЗаполненияСтавкиНДС(Объект, Истина);
	СтруктураДействий.Вставить("СкорректироватьСтавкуНДС", ПараметрыЗаполненияСтавкиНДС);
	УчетПрослеживаемыхТоваровКлиентСерверЛокализация.ДополнитьОписаниеНастроекЗаполненияСлужебныхРеквизитовТабличнойЧасти(СтруктураДействий);
	УчетПрослеживаемыхТоваровКлиентСерверЛокализация.ДополнитьОписаниеНастроекПересчетаРеквизитовТабличнойЧасти(
		Объект,
		СтруктураДействий);
	
	ПакетнаяОбработкаТабличнойЧастиСервер.ОбработатьСтрокиТЧ(
		ТоварыЗаказа,
		СтруктураДействий,
		Объект.Товары);
		
	Для Каждого СтрокаТЧ Из ТоварыЗаказа Цикл
		
		Если СтрокаТЧ.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.МногооборотнаяТара") Тогда
			СтрокаТЧ.ОсобыйПризнакДОПП = "1";
			СтрокаТЧ.СтавкаНДС = ПредопределенноеЗначение("Справочник.СтавкиНДС.ПустаяСсылка");
			Продолжить;
		Иначе
			СтрокаТЧ.ОсобыйПризнакДОПП = Объект.ОсобыйПризнакДОПП;
		КонецЕсли;
		
		СтрокаТЧ.ФактурнаяСтоимость = СтрокаТЧ.КоличествоУпаковок * СтрокаТЧ.Цена;
	
		Если ИмпортПодакцизныхТоваров Тогда
			
			РассчитатьСуммуАкцизаВТабЧасти(СтрокаТЧ);
			ЗаполнитьАналитикуАкцизов(СтрокаТЧ);
		
		КонецЕсли;
			
		ДанныеОбъекта = Новый Структура(
			"ВалютаРегламентированногоУчета,Дата,Валюта,ОсобыйПризнакЗаявителя",
			ВалютаРегламентированногоУчета, Объект.Дата, Объект.Валюта, Объект.ОсобыйПризнакЗаявителя);
		НоменклатураПриИзмененииСервер(СтрокаТЧ, ДанныеОбъекта);
		
	КонецЦикла;
	
	ОбновитьИтоги(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ДОПП

&НаСервере
Функция ПроверкиФорматаДОППВыполнены()
	
	ПроверкиВыполнены = Истина;
	
	// Проверка уникальности регистрационных номеров
	Если СокрЛП(Объект.РегистрационныйЗнак) = СокрЛП(Объект.РегистрационныйЗнакПрицепа)
	 Или СокрЛП(Объект.РегистрационныйЗнак) = СокрЛП(Объект.РегистрационныйЗнакПрицепаДополнительный) Тогда
		
		ОбщегоНазначения.СообщитьПользователю(
			НСтр("ru = 'Регистрационный номер не уникален.'"), ,
			"РегистрационныйЗнак",
			"Объект");
		ПроверкиВыполнены = Ложь;
	КонецЕсли;
	
	Если СокрЛП(Объект.РегистрационныйЗнакПрицепа) = СокрЛП(Объект.РегистрационныйЗнакПрицепаДополнительный)
	   И ЗначениеЗаполнено(Объект.РегистрационныйЗнакПрицепа) Тогда
		
		ОбщегоНазначения.СообщитьПользователю(
			НСтр("ru = 'Регистрационный номер прицепа не уникален.'"), ,
			"РегистрационныйЗнакПрицепа",
			"Объект");
		ПроверкиВыполнены = Ложь;
		
	КонецЕсли;
	
	Если КонецДня(Объект.ДатаВвоза) < Объект.Дата Тогда
	
		ОбщегоНазначения.СообщитьПользователю(
			НСтр("ru = 'Дата ввоза не может быть ранее даты регистрации ДОПП.'"), ,
			"ДатаВвоза",
			"Объект");
		ПроверкиВыполнены = Ложь;
	
	КонецЕсли;
	
	Возврат ПроверкиВыполнены;

КонецФункции

&НаСервере
Процедура ЗарегистрироватьАктуализироватьДОПП()
	
	Если Не ПроверкиФорматаДОППВыполнены() Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтатусДОППТекст) Тогда
		// ДОПП был зарегистрирован в СПОТ, актуализация не выполняется.
		// При необходимости исправления ранее зарегистрированного ДОПП необходимо формировать корректировочный ДОПП.
		Возврат;
	КонецЕсли;
	
	
КонецПроцедуры


&НаСервере
Процедура ЗаполнитьТекстПроДОПП()
	
	Элементы.ДекорацияСсылкаНаДОПП.Видимость           = Ложь;
	Элементы.ГруппаРегистрационныеДанныеДОПП.Видимость = Ложь;
	Элементы.ДекорацияСкорректироватьДОПП.Видимость    = Ложь;
	
	ЭтоУТ = ПолучитьФункциональнуюОпцию("УправлениеТорговлей");
	
	Если ЗначениеЗаполнено(СсылкаНаДОПП)  Или ЭтоУТ Тогда
		
		Элементы.ДекорацияСсылкаНаДОПП.Видимость           = Истина  И Не ЭтоУТ;
		Элементы.ДекорацияСкорректироватьДОПП.Видимость    = Истина  И Не ЭтоУТ;
		Элементы.ГруппаРегистрационныеДанныеДОПП.Видимость = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимость()
	
	ВидимостьКнопокВыгрузки = Ложь;
	ОрганизацияПодключенаК1СОтчетности = Ложь;
	
	
	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		Элементы.НастроитьПараметрыВыгрузки.Видимость = Истина;
	Иначе
		Элементы.НастроитьПараметрыВыгрузки.Видимость = Ложь;
	КонецЕсли;
		
	Элементы.ПодменюПроверка.Видимость = ВидимостьКнопокВыгрузки;
	Элементы.ЗаписатьНаДиск.Видимость = ВидимостьКнопокВыгрузки;
	Элементы.ОтправитьВКонтролирующийОрган.Видимость = ВидимостьКнопокВыгрузки;
	Элементы.ПечатьДОПП.Видимость = ВидимостьКнопокВыгрузки;
	
	Элементы.ТоварыЗаполнитьНомерРНПТИзКвитанции.Видимость = ОрганизацияПодключенаК1СОтчетности; 
	Элементы.ФормаСоздатьНаОсновании.Видимость = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросПередИзменениемПризнакаДОППЗавершение(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		УстановитьОсобыйПризнакДОППВТаблице();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОсобыйПризнакДОППВТаблице()
	
	Для каждого СтрокаТаблицы Из Объект.Товары Цикл
		СтрокаТаблицы.ОсобыйПризнакДОПП = Объект.ОсобыйПризнакДОПП;
		АктуализироватьНалогиПоСтрокеТовары(СтрокаТаблицы);
	КонецЦикла;
	
	УправлениеФормой(ЭтотОбъект);
	ОбновитьИтоги(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросПередИзменениемЗаказа(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ЗаполнитьТабличнуюЧастьТоварыПоЗаказу();
		УправлениеФормой(ЭтотОбъект);
		ОбновитьИтоги(ЭтотОбъект);
		ЗаказПоставщику = Объект.ЗаказПоставщику;
	Иначе
		Объект.ЗаказПоставщику = ЗаказПоставщику;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросПередЗаполнениемНомеровРНПТ(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ДлительнаяОперация = ЗаполнитьНомераРНПТИзКвитанцииСервер();
		ОповещениеОЗавершении = Новый ОписаниеОповещения("ЗаполнениеРНПТИзФНСЗавершение", ЭтотОбъект);
		ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
		ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТабличнуюЧастьТоварыПоЗаказу()
	
	ДОППОбъект = РеквизитФормыВЗначение("Объект");
	ДОППОбъект.ЗаполнитьДокументНаОснованииЗаказаПоставщику(Объект.ЗаказПоставщику, Ложь);
	Если ТипЗнч(ДОППОбъект.ДокументОснование) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
		ДОППОбъект.ДокументОснование = Объект.ЗаказПоставщику;
	КонецЕсли;
	
	ЗначениеВРеквизитФормы(ДОППОбъект, "Объект");
	
	СтруктураНаименованийТабличныхЧастей = Новый Структура("Товары");
	ЗаполнитьСлужебныеРеквизитыПоНоменклатуре(СтруктураНаименованийТабличныхЧастей);
	ЗаполнитьДобавленныеКолонкиТаблиц();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСлужебныеРеквизитыПоНоменклатуре(СтруктураНаименованийТабличныхЧастей)
	
	ПараметрыЗаполненияРеквизитов = Новый Структура;
	ПараметрыЗаполненияРеквизитов.Вставить("ЗаполнитьПризнакХарактеристикиИспользуются",
											Новый Структура("Номенклатура", "ХарактеристикиИспользуются"));
	ПараметрыЗаполненияРеквизитов.Вставить("ЗаполнитьПризнакТипНоменклатуры",
											Новый Структура("Номенклатура", "ТипНоменклатуры"));
	
	УчетПрослеживаемыхТоваровКлиентСерверЛокализация.ДополнитьОписаниеНастроекЗаполненияСлужебныхРеквизитовТабличнойЧасти(ПараметрыЗаполненияРеквизитов);
	
	ПакетнаяОбработкаТабличнойЧастиКлиентСерверЛокализация.ДополнитьСтруктуруДействийПриИзмененииЭлемента(ЭтотОбъект, "Номенклатура", ПараметрыЗаполненияРеквизитов);

	Если СтруктураНаименованийТабличныхЧастей.Свойство("Товары") Тогда
		НоменклатураСервер.ЗаполнитьСлужебныеРеквизитыПоНоменклатуреВКоллекции(Объект.Товары, ПараметрыЗаполненияРеквизитов);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьСписокВыбораСтавкиНДС()
	
	МассивСтавок = Новый Массив();
	СтавкаНДС10 = УчетНДСРФВызовСервера.СтавкаНДСПоЗначениюПеречисления(
				Перечисления.СтавкиНДС.НДС10, Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС);
	Если ЗначениеЗаполнено(СтавкаНДС10) Тогда
		МассивСтавок.Добавить(СтавкаНДС10);
	КонецЕсли;
	
	ОсновнаяСтавкаНДС = УчетНДСУП.СтавкаНДСПоУмолчанию(Неопределено, Объект.Дата);
	МассивСтавок.Добавить(ОсновнаяСтавкаНДС);
	
	Элементы["ТоварыСтавкаНДС"].СписокВыбора.ЗагрузитьЗначения(МассивСтавок);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область Инициализация

ЭтоНоваяСтрока = Ложь;

#КонецОбласти
