///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2026, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс            

// Функция параметры ПИоТ по подключаемому оборудованию
//
// Параметры:
//  ПодключаемоеОборудование - СправочникСсылка.ПодключаемоеОборудование.
//
// Возвращаемое значение:
//  - Структура 
//
Функция ПолучитьПараметрыТСПИоТ(ПодключаемоеОборудование) Экспорт
	
	Возврат МенеджерОборудованияТСПИоТ.ПолучитьПараметрыТСПИоТ(ПодключаемоеОборудование);
	
КонецФункции

// Записать cобытия эксплуатации ТС ПИоТ
// 
// Параметры:
//  ПодключаемоеОборудование - СправочникСсылка.ПодключаемоеОборудование
// 
Процедура ЗаписатьСобытиеЭксплуатацииТСПИоТ(ПодключаемоеОборудование, ВременнаяМетка, СобытиеЭксплуатации) Экспорт
	
	МенеджерОборудованияТСПИоТ.ЗаписатьСобытиеЭксплуатацииТСПИоТ(ПодключаемоеОборудование, ВременнаяМетка, СобытиеЭксплуатации);
	
КонецПроцедуры

// Очищает cобытия эксплуатации ТС ПИоТ для указанного подключаемого оборудования.
//
// Параметры:
//   ПодключаемоеОборудование - СправочникСсылка.ПодключаемоеОборудование - 
//
Процедура ОчиститьСобытияЭксплуатацииТСПИоТ(ПодключаемоеОборудование) Экспорт
	
	МенеджерОборудованияТСПИоТ.ОчиститьСобытияЭксплуатацииТСПИоТ(ПодключаемоеОборудование);
	
КонецПроцедуры   

// Записать cобытия эксплуатации ТС ПИоТ
// 
// Параметры:
//  ПодключаемоеОборудование - СправочникСсылка.ПодключаемоеОборудование
// 
Процедура ЗаписатьАутентификациюПользователяПИоТ(ПодключаемоеОборудование, ПараметрыАутентификации) Экспорт
	
	МенеджерОборудованияТСПИоТ.ЗаписатьАутентификациюПользователяПИоТ(ПодключаемоеОборудование, ПараметрыАутентификации);
	
КонецПроцедуры

// Очищает аутентификации пользователя ПИоТ для указанного подключаемого оборудования.
//
// Параметры:
//   ПодключаемоеОборудование - СправочникСсылка.ПодключаемоеОборудование - 
//
Процедура ОчиститьАутентификацииПользователяПИоТ(ПодключаемоеОборудование) Экспорт
	
	МенеджерОборудованияТСПИоТ.ОчиститьАутентификацииПользователяПИоТ(ПодключаемоеОборудование);
	
КонецПроцедуры 

#КонецОбласти
