
#Область ПрограммныйИнтерфейс

// Обработать штрихкоды после уточнения на ТС ПИоТ.
// 
// Параметры:
//  ДанныеКодовМаркировки        - СтрокаТаблицыЗначений из см. ШтрихкодированиеОбщегоНазначенияИС.ИнициализацияТаблицыДанныхКодовМаркировки
//  ДанныеНастройкиТСПИоТ        - Структура - результат проверки настройки:
//   * Настроено - Булево - Истина, если для указанного ФН используется проверка кодов маркировки через ТС ПИоТ
//   * НастройкиПодключения - см. ОбщегоНазначенияИСМПКлиентСервер.ПараметрыПодключенияТСПИоТ
//   * НастройкиПодключенияЛМЧЗ - см. ИнтеграцияТСПИоТКлиентСервер.НастройкиЛокальногоМодуляДляВнутреннегоТСПИоТ.
//  ПараметрыСканирования        - см. ШтрихкодированиеОбщегоНазначенияИС.ПараметрыСканирования
//  ФормаУникальныйИдентификатор - УникальныйИдентификатор - источник вызова
//  ДанныеАварийногоРежима - Структура из КлючИЗначение:
//   * АварийныйРежим               - Булево - Истина, если по результату проверки марки в ТС ПИоТ получен ответ 203
//   * АварийныйРежимДо             - Дата - срок установки аварийного режима
//  СтатусыСостоянияТСПИоТ       - см. ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыСтатусСостоянияПИоТ
//  ЗапросыДляЛогирования        - Массив из см. ШтрихкодированиеОбщегоНазначенияИСМПКлиентСервер.ЗаписатьВЛогОтветРазрешительногоРежимаГИСМТ
// 
// Возвращаемое значение:
//  - см. ШтрихкодированиеОбщегоНазначенияИС.ИнициализироватьРезультатОбработкиШтрихкода.
Функция ОбработатьШтрихкодыПослеУточненияНаТСПИоТ(ДанныеКодовМаркировки, ДанныеНастройкиТСПИоТ, ПараметрыСканирования, ФормаУникальныйИдентификатор, ДанныеАварийногоРежима, СтатусыСостоянияТСПИоТ = Неопределено, ЗапросыДляЛогирования = Неопределено) Экспорт
	
	РезультатыПроверок = Новый Соответствие;
	
	ДанныеПоШтрихкодам = ШтрихкодированиеОбщегоНазначенияИС.ИнициализацияДанныхПоШтрихкодам();
	ДанныеПоШтрихкодам.ДанныеКодовМаркировки = ШтрихкодированиеОбщегоНазначенияИС.ИнициализацияТаблицыДанныхКодовМаркировки();
	
	ПараметрыСканированияЛокальные = ОбщегоНазначения.СкопироватьРекурсивно(ПараметрыСканирования, Ложь);
	
	ПараметрыСканированияЛокальные.РазрешеноЗапрашиватьКодМаркировки             = Ложь;
	ПараметрыСканированияЛокальные.КэшМаркируемойПродукции                       = Неопределено;
	ПараметрыСканированияЛокальные.ВыводитьСообщенияОбОшибках                    = Ложь;
	ПараметрыСканированияЛокальные.ИспользуетсяСоответствиеШтрихкодовСтрокДерева = Ложь;
	ПараметрыСканированияЛокальные.ВозможнаЗагрузкаТСД                           = Ложь;
	
	ВидыПродукции = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ДанныеКодовМаркировки.ВидПродукции);
	
	Если ШтрихкодированиеОбщегоНазначенияИС.ДопустимаТабачнаяПродукция(ПараметрыСканированияЛокальные)
		И (ШтрихкодированиеОбщегоНазначенияИС.ПрисутствуетТабачнаяПродукция(ВидыПродукции)
		Или ДанныеПоШтрихкодам.ПрисутствуетТабачнаяПродукция) Тогда
		
		ШтрихкодированиеОбщегоНазначенияМОТП.ДобавитьКолонкиТаблицыДанныеКодовМаркировки(ДанныеПоШтрихкодам, ПараметрыСканированияЛокальные);
		
	КонецЕсли;
	
	Если ШтрихкодированиеОбщегоНазначенияИС.ДопустимаПродукцияИСМП(ПараметрыСканированияЛокальные)
		И ШтрихкодированиеОбщегоНазначенияИС.ПрисутствуетПродукцияИСМП(ВидыПродукции) Тогда
		
		ШтрихкодированиеОбщегоНазначенияИСМП.ДобавитьКолонкиТаблицыДанныеКодовМаркировки(ДанныеПоШтрихкодам, ПараметрыСканированияЛокальные);
		
	КонецЕсли;
	
	НоваяСтрокаТаблицыКодовМаркировки = ДанныеПоШтрихкодам.ДанныеКодовМаркировки.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрокаТаблицыКодовМаркировки, ДанныеКодовМаркировки);
	
	НоваяСтрокаТаблицыКодовМаркировки.ТребуетсяПроверкаРазрешительногоРежимаНаТСПИоТ = Ложь;
	
	Если ОбщегоНазначенияИСМПКлиентСервер.ЭтоРасширеннаяВерсияГосИС()
		И ЗначениеЗаполнено(НоваяСтрокаТаблицыКодовМаркировки.АдресДереваУпаковок) Тогда
		
		МодульШтрихкодированиеИСМПВызовСервера = ОбщегоНазначения.ОбщийМодуль("ШтрихкодированиеИСМПВызовСервера");
		МодульШтрихкодированиеИСМПВызовСервера.ДополнитьДеревоДаннымиРазрешительногоРежимаГИСМТ(НоваяСтрокаТаблицыКодовМаркировки.АдресДереваУпаковок, НоваяСтрокаТаблицыКодовМаркировки);
		ДеревоУпаковок = ПолучитьИзВременногоХранилища(НоваяСтрокаТаблицыКодовМаркировки.АдресДереваУпаковок);
		
		МодульШтрихкодированиеИС = ОбщегоНазначения.ОбщийМодуль("ШтрихкодированиеИС");
		ДанныеПоШтрихкодам.ВложенныеШтрихкоды = МодульШтрихкодированиеИС.ИнициализацияВложенныхШтрихкодов(ДеревоУпаковок, Ложь);
		
	КонецЕсли;
	
	ШтрихкодированиеОбщегоНазначенияИС.ЗаполнитьВидыПродукцииВДанныхПоШтрихкодам(ДанныеПоШтрихкодам, ПараметрыСканированияЛокальные);
	
	ЕстьОшибки = ШтрихкодированиеОбщегоНазначенияИС.ВыполнитьПроверкуНаОшибкиДанныхПоШтрихкодам(ДанныеПоШтрихкодам, ПараметрыСканированияЛокальные);
	
	ДанныеПоШтрихкодам.ЭтоСканированиеВФормеПроверкиИПодбора = Истина;
	РезультатыОбработок = ШтрихкодированиеОбщегоНазначенияИС.ОбработатьДанныеПоШтрихкодам(ДанныеПоШтрихкодам, ПараметрыСканированияЛокальные, ЕстьОшибки, ФормаУникальныйИдентификатор, РезультатыПроверок);
	
	Если СтатусыСостоянияТСПИоТ <> Неопределено Тогда
		
		ОбщегоНазначенияИСМПВызовСервера.ЗапуститьОбновлениеТокенаЛокальногоМодуляПоДаннымВнутреннегоТСПИоТ(ДанныеНастройкиТСПИоТ, СтатусыСостоянияТСПИоТ.ТокенЛМЧЗ, СтатусыСостоянияТСПИоТ.ТокенЛМЧЗДатаДействия);
		
		Для Каждого РезультатОбработок Из РезультатыОбработок Цикл
			РезультатОбработок.Значение.СтатусыГотовностиТСПИоТ = СтатусыСостоянияТСПИоТ;
		КонецЦикла;
		
	КонецЕсли;
	
	// Логирование результатов разбора штрихкода
	ЛогированиеЗапросовИСМПВызовСервера.Вывести("",, РезультатыОбработок);
	
	РезультатОбработки = РезультатыОбработок[ДанныеКодовМаркировки.Штрихкод];
	
	Если РезультатОбработки <> Неопределено Тогда
		РезультатОбработки.ПроверкаНаТСПИоТЗавершена = Истина;
	КонецЕсли;
	
	Если ДанныеАварийногоРежима.АварийныйРежим Тогда
		
		НачалоДействияАварийногоРежима    = ТекущаяУниверсальнаяДата();
		ОкончаниеДействияАварийногоРежима = ДанныеАварийногоРежима.АварийныйРежимДо;
		
		Если ЗначениеЗаполнено(ОкончаниеДействияАварийногоРежима) Тогда
			СрокУстановкиАварийногоРежима     = (ОкончаниеДействияАварийногоРежима - НачалоДействияАварийногоРежима) / 3600;
		Иначе
			СрокУстановкиАварийногоРежима = 0;
		КонецЕсли;
		
		ОбщегоНазначенияИСМП.ВключитьАварийныйРежимРазрешительнойСистемы(СрокУстановкиАварийногоРежима);
		
	КонецЕсли;
	
	Если ЗапросыДляЛогирования <> Неопределено Тогда
		ШтрихкодированиеОбщегоНазначенияИСМПВызовСервера.ЛогироватьРезультатыОперацийПроверкиКМ(ЗапросыДляЛогирования);
	КонецЕсли;
	
	//@skip-check constructor-function-return-section
	Возврат РезультатОбработки;
	
КонецФункции

// Обработать список штрихкодов после уточнения на ТС ПИоТ.
// 
// Параметры:
//  МассивКодовМаркировки        - Массив из СтрокаТаблицыЗначений из см. ШтрихкодированиеОбщегоНазначенияИС.ИнициализацияТаблицыДанныхКодовМаркировки
//  ДанныеНастройкиТСПИоТ        - Структура - результат проверки настройки:
//   * Настроено - Булево - Истина, если для указанного ФН используется проверка кодов маркировки через ТС ПИоТ
//   * НастройкиПодключения - см. ОбщегоНазначенияИСМПКлиентСервер.ПараметрыПодключенияТСПИоТ
//   * НастройкиПодключенияЛМЧЗ - см. ИнтеграцияТСПИоТКлиентСервер.НастройкиЛокальногоМодуляДляВнутреннегоТСПИоТ
//  ПараметрыСканирования        - см. ШтрихкодированиеОбщегоНазначенияИС.ПараметрыСканирования
//  ФормаУникальныйИдентификатор - УникальныйИдентификатор - источник вызова
//  ДанныеАварийногоРежима - Структура из КлючИЗначение:
//   * АварийныйРежим               - Булево - Истина, если по результату проверки марки в ТС ПИоТ получен ответ 203
//   * АварийныйРежимДо             - Дата - срок установки аварийного режима
//  СтатусыСостоянияТСПИоТ       - см. ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыСтатусСостоянияПИоТ
//  ЗапросыДляЛогирования        - Массив из см. ШтрихкодированиеОбщегоНазначенияИСМПКлиентСервер.ЗаписатьВЛогОтветРазрешительногоРежимаГИСМТ
// 
// Возвращаемое значение:
//  - Соответствие из КлючИЗначение:
//		Ключ     - см. ШтрихкодированиеОбщегоНазначенияИС.ИнициализацияДанныхПоШтрихкодам
//		Значение - см. ШтрихкодированиеОбщегоНазначенияИС.ИнициализироватьРезультатОбработкиШтрихкода.
Функция ОбработатьСписокШтрихкодовПослеУточненияНаТСПИоТ(МассивКодовМаркировки, ДанныеНастройкиТСПИоТ, ПараметрыСканирования, ФормаУникальныйИдентификатор, ДанныеАварийногоРежима, СтатусыСостоянияТСПИоТ = Неопределено, ЗапросыДляЛогирования = Неопределено) Экспорт
	
	ВозвращаемоеЗначение = Новый Соответствие();
	
	Для Каждого ДанныеШтрихкода Из МассивКодовМаркировки Цикл
		
		РезультатОбработкиШтрихкода = ОбработатьШтрихкодыПослеУточненияНаТСПИоТ(
			ДанныеШтрихкода,
			ДанныеНастройкиТСПИоТ,
			ПараметрыСканирования,
			ФормаУникальныйИдентификатор,
			ДанныеАварийногоРежима,
			СтатусыСостоянияТСПИоТ);
		
		ВозвращаемоеЗначение.Вставить(ДанныеШтрихкода, РезультатОбработкиШтрихкода);
		
	КонецЦикла;
	
	Если ЗапросыДляЛогирования <> Неопределено Тогда
		ШтрихкодированиеОбщегоНазначенияИСМПВызовСервера.ЛогироватьРезультатыОперацийПроверкиКМ(ЗапросыДляЛогирования);
	КонецЕсли;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

// Зафиксировать факт продажи/возврата марок из списка в локальной базе Локального модуля Честный знак.
// 
// Параметры:
//  ДанныеКодовМаркировки - Массив Из Строка - массив нормализованных кодов для записи в ЛМ ЧЗ
//  Операция - Строка - признак пробития чека возврата или продажи
//  НастройкиПодключенияЛокальногоМодуля - см. КонструкторПодключенияЛокальногоМодуляЧестныйЗнак
Процедура ЗафиксироватьФактПродажиВозвратаКодовМаркировки(ДанныеКодовМаркировки, Операция, НастройкиПодключенияЛокальногоМодуля) Экспорт
	
	РезультатФиксацииПродажи = ИнтерфейсИСМПОбщегоНазначенияКлиентСервер.ЗафиксироватьФактПродажиВозвратаКодовМаркировки(ДанныеКодовМаркировки, Операция, НастройкиПодключенияЛокальногоМодуля);
	ТекстОшибки              = "";
	
	Если ЗначениеЗаполнено(РезультатФиксацииПродажи.ТекстОшибки) Тогда
		ТекстОшибки = РезультатФиксацииПродажи.ТекстОшибки;
	ИначеЕсли РезультатФиксацииПродажи.НезавершеннаяНастройкаЛМ Тогда
		ТекстОшибки = НСтр("ru = 'Настройка по Локальному модулю Честный знак не завершена.
						   |Невозможно зафиксировать локально факт продажи/возврата марок.'");
	ИначеЕсли РезультатФиксацииПродажи.НекорректныеДанныеАвторизации Тогда
		ТекстОшибки = НСтр("ru = 'Некорректные данные авторизации в настройке Локального модуля Честный знак.
						   |Невозможно зафиксировать локально факт продажи/возврата марок.'");
	ИначеЕсли РезультатФиксацииПродажи.НекорректныйТокенПМСР Тогда
		ТекстОшибки = НСтр("ru = 'Указан некорректный или истекший временный идентификатор для работы с Локальным модулем ""Честный знак"".'");
	ИначеЕсли РезультатФиксацииПродажи.ОтсутствиеСинхронизацииЛМ Тогда
		ТекстОшибки = НСтр("ru = 'Статус Локального модуля Честный знак - ошибка синхронизации.
						   |Невозможно зафиксировать локально факт продажи/возврата марок.'");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекстОшибки) Тогда
		
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'Локальная фиксация факта продажи/возврата марок'"),
			УровеньЖурналаРегистрации.Предупреждение,
			РегистрыСведений.НастройкиПодключенияЛокальныхМодулейИСМП,
			,
			ТекстОшибки);
		
	КонецЕсли;
	
КонецПроцедуры

// Функция возвращает настройки подключения экземпляра ТС ПИоТ
// 
// Параметры:
//  ТСПИоТ - ОпределяемыйТип.ТСПИоТ
// 
// Возвращаемое значение:
//  см. ОбщегоНазначенияИСМПКлиентСервер.ПараметрыПодключенияТСПИоТ
Функция НастройкиПодключенияЭкземпляраТСПИоТ(ТСПИоТ) Экспорт
	
	НастройкиПодключения = ОбщегоНазначенияИСМПКлиентСервер.ПараметрыПодключенияТСПИоТ();
	
	Если Не ЗначениеЗаполнено(ТСПИоТ) Тогда
		Возврат НастройкиПодключения;
	КонецЕсли;
	
	ИмяПеречисления         = "ТипыТСПИоТ";
	ИмяЗначенияПеречисления = "Внутренний1С";
	
	УстановитьПривилегированныйРежим(Истина);
	
	СтрокаРеквизитовТСПИоТ = "Тип, ФискальноеУстройство, Сервер, Порт, ЗащищенноеСоединение, Таймаут, ОбменНаСервере, ИсключитьПроверкуКорневыхСертификатов";
	
	Если ТСПИоТ.Метаданные().Реквизиты.Найти("ВерсияAPI") <> Неопределено Тогда
		СтрокаРеквизитовТСПИоТ = СтрокаРеквизитовТСПИоТ + ", ВерсияAPI";
	КонецЕсли;
	
	РеквизитыНастроенногоТСПИоТа = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ТСПИоТ, СтрокаРеквизитовТСПИоТ);
	
	НастройкиПодключения.ТСПИоТ                   = ТСПИоТ;
	НастройкиПодключения.ПодключаемоеОборудование = РеквизитыНастроенногоТСПИоТа.ФискальноеУстройство;
	НастройкиПодключения.ВнутреннийТСПИоТ         = (РеквизитыНастроенногоТСПИоТа.Тип = Перечисления[ИмяПеречисления][ИмяЗначенияПеречисления]);
	
	НастройкиЛокальногоМодуля = ОбщегоНазначенияИСМП.НастройкиОсновногоПодключенияЛокальномуМодулюЧестныйЗнакПоККТ(НастройкиПодключения.ПодключаемоеОборудование);
	
	Если НастройкиЛокальногоМодуля.НастроеноПодключение И ЗначениеЗаполнено(НастройкиЛокальногоМодуля.Настройки.ТаймаутОжиданияОтветаДоПереходаВЛМ) Тогда
		НастройкиПодключения.Таймаут = 
			(НастройкиЛокальногоМодуля.Настройки.ТаймаутОжиданияОтветаДоПереходаВЛМ + 0.5 * НастройкиЛокальногоМодуля.Настройки.СреднееВремяОтветаТСПИоТ) / 1000;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Если Не НастройкиПодключения.ВнутреннийТСПИоТ Тогда
		ЗаполнитьЗначенияСвойств(НастройкиПодключения, РеквизитыНастроенногоТСПИоТа);
	КонецЕсли;
	
	НастройкиПодключения.АдресПодключения  = СтрШаблон(НСтр("ru = '%1://%2:%3'"),
		?(РеквизитыНастроенногоТСПИоТа.ЗащищенноеСоединение, "https", "http"),
		РеквизитыНастроенногоТСПИоТа.Сервер,
		?(ЗначениеЗаполнено(РеквизитыНастроенногоТСПИоТа.Порт), РеквизитыНастроенногоТСПИоТа.Порт, ?(РеквизитыНастроенногоТСПИоТа.ЗащищенноеСоединение, "443", "80")));
	
	Возврат НастройкиПодключения;
	
КонецФункции

// Получение настроек подключения ТС ПИоТ по переданной ККТ.
// 
// Параметры:
//  ККТПИоТ - СправочникСсылка.ПодключаемоеОборудование, ОпределяемыйТип.ТСПИоТ - подключаемое оборудование или ТС ПИоТ
// 
// Возвращаемое значение:
//  Структура - Настройки подключения экземпляра ТС ПИоТ по ККТ:
// * Настроено - Булево - Истина, если 
// * НастройкиПодключения - см. ОбщегоНазначенияИСМПКлиентСервер.ПараметрыПодключенияТСПИоТ
Функция НастройкиПодключенияЭкземпляраТСПИоТПоККТ(ККТПИоТ) Экспорт
	
	СтруктураВозврата = Новый Структура();
	
	СтруктураВозврата.Вставить("Настроено",            Ложь);
	СтруктураВозврата.Вставить("НастройкиПодключения", ОбщегоНазначенияИСМПКлиентСервер.ПараметрыПодключенияТСПИоТ());
	
	Если Метаданные.ОпределяемыеТипы.ТСПИоТ.Тип.СодержитТип(ТипЗнч(ККТПИоТ)) Тогда
		НастроенныйТСПИоТ = ККТПИоТ;
	Иначе
	
		МодульМенеджера = ОбщегоНазначения.ОбщийМодуль("МенеджерОборудованияТСПИоТ");
		НастроенныйТСПИоТ = МодульМенеджера.ПолучитьТСПИоТ(ККТПИоТ);
		
	КонецЕсли;
	
	СтруктураВозврата.Настроено = ЗначениеЗаполнено(НастроенныйТСПИоТ);
	
	Если Не СтруктураВозврата.Настроено Тогда
		Возврат СтруктураВозврата;
	КонецЕсли;
	
	СтруктураВозврата.НастройкиПодключения = НастройкиПодключенияЭкземпляраТСПИоТ(НастроенныйТСПИоТ);
	
	Возврат СтруктураВозврата;
	
КонецФункции

// Актуализация токенов Локального модуля по данным ТС ПИоТ в случае настройки ТС ПИоТ на сервере
// 
// Параметры:
//  ПараметрыПодключения - см. ОбщегоНазначенияИСМПКлиентСервер.ПараметрыПодключенияТСПИоТ()
Процедура АктуализацияТокеновЛокальногоМодуляЧерезТСПИоТ(ПараметрыПодключения) Экспорт
	
	РезультатНастроекЭкземпляра = ИнтеграцияТСПИоТКлиентСервер.ПолучитьНастройкиЭкземпляраТСПИоТ(ПараметрыПодключения);
	
	Если РезультатНастроекЭкземпляра.НастройкиЭкземпляраТСПИоТ <> Неопределено Тогда
		
		ДанныеНастройкиЛокальногоМодуля = РезультатНастроекЭкземпляра.НастройкиЭкземпляраТСПИоТ.ДанныеНастройкиЛокальногоМодуля;
		
		Если ДанныеНастройкиЛокальногоМодуля <> Неопределено И ДанныеНастройкиЛокальногоМодуля.Подключено Тогда
			ЗафиксироватьНастройкиЛокальногоМодуляИТокенПоДаннымТСПИоТ(ДанныеНастройкиЛокальногоМодуля, ПараметрыПодключения.ТСПИоТ);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура сохраняет в базу настройки Локального модуля по данным ТС ПИоТ и данные временного токена ПМСР.
// 
// Параметры:
//  НастройкиЛокальногоМодуля - см. ИнтеграцияТСПИоТКлиентСервер.КонструкторНастройкиЛокальногоМодуляПоДаннымТСПИоТ
//  ТСПИоТ - ОпределяемыйТип.ТСПИоТ
Процедура ЗафиксироватьНастройкиЛокальногоМодуляИТокенПоДаннымТСПИоТ(НастройкиЛокальногоМодуля, ТСПИоТ) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	НастройкиПодключенияЛокальныхМодулейИСМП.Организация  КАК Организация,
		|	НастройкиПодключенияЛокальныхМодулейИСМП.РабочееМесто КАК РабочееМесто,
		|	НастройкиПодключенияЛокальныхМодулейИСМП.Приоритет    КАК Приоритет
		|ИЗ
		|	РегистрСведений.НастройкиПодключенияЛокальныхМодулейИСМП КАК НастройкиПодключенияЛокальныхМодулейИСМП
		|ГДЕ
		|	НастройкиПодключенияЛокальныхМодулейИСМП.ТСПИоТ = &ТСПИоТ";
	
	Запрос.УстановитьПараметр("ТСПИоТ", ТСПИоТ);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	РеквизитыНастроенногоТСПИоТа = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ТСПИоТ,
		"ФискальноеУстройство.Организация, ФискальноеУстройство.РабочееМесто, ОбменНаСервере");
		
	ЗаписьРегистра = РегистрыСведений.НастройкиПодключенияЛокальныхМодулейИСМП.СоздатьМенеджерЗаписи();
	
	ЗаписьРегистра.Организация  = РеквизитыНастроенногоТСПИоТа.ФискальноеУстройствоОрганизация;
	ЗаписьРегистра.РабочееМесто = РеквизитыНастроенногоТСПИоТа.ФискальноеУстройствоРабочееМесто;
	ЗаписьРегистра.ТСПИоТ       = ТСПИоТ;
	
	ЗаписьРегистра.СерверПодключенияЛМ  = НастройкиЛокальногоМодуля.IPАдресУстановки;
	ЗаписьРегистра.ПортПодключенияЛМ    = НастройкиЛокальногоМодуля.ПортУстановки;
	ЗаписьРегистра.ЗащищенноеСоединение = Ложь;
	ЗаписьРегистра.ФорматОбмена         = ?(СтрНачинаетсяС(НастройкиЛокальногоМодуля.Версия, "2"),
		Перечисления.ВерсииФорматаОбменаЛокальногоМодуляИСМП.V2,
		Перечисления.ВерсииФорматаОбменаЛокальногоМодуляИСМП.V1);
	
	ЗаписьРегистра.Логин                              = НастройкиЛокальногоМодуля.Логин;
	ЗаписьРегистра.ОбменНаСервере                     = РеквизитыНастроенногоТСПИоТа.ОбменНаСервере;
	ЗаписьРегистра.Таймаут                            = 60;
	ЗаписьРегистра.ТокенПМСР                          = НастройкиЛокальногоМодуля.ТокенПМСР;
	ЗаписьРегистра.ДатаДействияТокенаПМСР             = НастройкиЛокальногоМодуля.ДатаДействияТокенаПМСР;
	ЗаписьРегистра.ТаймаутОжиданияОтветаДоПереходаВЛМ = НастройкиЛокальногоМодуля.ТаймаутОжиданияОтветаДоПереходаВЛМ;
	ЗаписьРегистра.СреднееВремяОтветаТСПИоТ           = НастройкиЛокальногоМодуля.СреднееВремяОтветаТСПИоТ;
	
	СтруктураПолученияПароля = РегистрыСведений.НастройкиПодключенияЛокальныхМодулейИСМП.КонструкторЗаписиВладельцаПароля();
	ЗаполнитьЗначенияСвойств(СтруктураПолученияПароля, ЗаписьРегистра);
	
	ЗаписьРегистра.ХешСумма = ОбщегоНазначения.КонтрольнаяСуммаСтрокой(СтруктураПолученияПароля);
	
	НачатьТранзакцию();
	
	Попытка
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			УдаляемаяЗапись        = РегистрыСведений.НастройкиПодключенияЛокальныхМодулейИСМП.СоздатьМенеджерЗаписи();
			УдаляемаяЗапись.ТСПИоТ = ТСПИоТ;
			
			ЗаполнитьЗначенияСвойств(УдаляемаяЗапись, ВыборкаДетальныеЗаписи);
			УдаляемаяЗапись.Записать();
			
		КонецЦикла;
		
		ЗаписьРегистра.Записать();
		
		РегистрыСведений.НастройкиПодключенияЛокальныхМодулейИСМП.СохранитьПарольАдминистратораВБезопасноеХранилище(
			ЗаписьРегистра.ХешСумма, НастройкиЛокальногоМодуля.Пароль);
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ЗаписьЖурналаРегистрации("Актуализация токенов ЛМ ЧЗ для ПМСР",
			УровеньЖурналаРегистрации.Ошибка,,, ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке));
			
		ОтменитьТранзакцию();
		
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ЛогироватьОтветОтВнутреннегоТСПИоТ(ККТ, ЗапросыДляЛогирования, ТекстЗапроса, ТекстОтвета, ЭтоОперацияПробития = Ложь) Экспорт
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, Символы.ПС, "");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, Символы.ВК, "");
	
	ДанныеЗаписи = ЛогированиеЗапросовИС.НоваяСтруктураДанныхЗаписи();
	ДанныеЗаписи.ВнутреннийТСПИоТККТ = ККТ;
	ДанныеЗаписи.HTTPЗапросОтветТело = ТекстОтвета;
	ДанныеЗаписи.Штрихкод            = ТекстЗапроса;
	
	ПараметрыЛогированияЗапросов = ЛогированиеЗапросовИСМП.ПараметрыЛогированияЗапросов();
	ЛогированиеЗапросовИС.Вывести(ДанныеЗаписи, ПараметрыЛогированияЗапросов);
	
	Если Не ЭтоОперацияПробития Тогда
		ШтрихкодированиеОбщегоНазначенияИСМПВызовСервера.ЛогироватьРезультатыОперацийПроверкиКМ(ЗапросыДляЛогирования);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
