
#Область ОписаниеПеременных

&НаКлиенте
Перем ПараметрыОповещенияДляПродолженияВызова;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.Страницы.ТекущаяСтраница = Элементы.Страницы.ПодчиненныеЭлементы.Основная;
	ТекстСообщения = НСтр("ru = 'Пожалуйста, подождите...'");
	Если Не ПустаяСтрока(Параметры.ТекстСообщения) Тогда
		ТекстСообщения = Параметры.ТекстСообщения + Символы.ПС + ТекстСообщения;
		Элементы.ДекорацияПоясняющийТекстДлительнойОперации.Заголовок = ТекстСообщения;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ИдентификаторЗадания) Тогда
		ОтменитьВыполнениеЗадания(ИдентификаторЗадания);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ОбменСБанкамиИдентификаторДлительнойОперации" Тогда
		ИдентификаторЗадания = Параметр;
	КонецЕсли;
	
	Если ИмяСобытия = "ОбменСБанкамиОкноОповещенияОбОперацияхЕстьОшибка" Тогда
		Если КлючУникальности = Параметр Тогда
			Элементы.Страницы.ТекущаяСтраница = Элементы.Страницы.ПодчиненныеЭлементы.Ошибка;
		КонецЕсли;
	КонецЕсли;
	
	Если ИмяСобытия = "ОбменСБанкамиОкноОповещенияОбОперациях" Тогда
		Если КлючУникальности = Параметр Тогда
			Закрыть();
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПродолжитьОжиданиеСменыСтатуса(Команда)
	
	Элементы.Страницы.ТекущаяСтраница = Элементы.Страницы.ПодчиненныеЭлементы.Основная;
	Элементы.ДекорацияТекстОшибки.Заголовок = "";
	Элементы.ДекорацияОшибка.Видимость = Истина;
	Элементы.ДекорацияПредупреждение.Видимость = Ложь;
	Элементы.ФормаПродолжитьОжиданиеСменыСтатуса.Видимость = Ложь;
	
	Если ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыОповещенияДляПродолженияВызова,
		"МоментЗапускаОжиданияПроверкиДокументовУниверсально") <> Неопределено Тогда
		
		ПараметрыОповещенияДляПродолженияВызова.МоментЗапускаОжиданияПроверкиДокументовУниверсально =
			ТекущаяУниверсальнаяДатаВМиллисекундах();
		
	КонецЕсли;
	
	Если ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыОповещенияДляПродолженияВызова,
		"ИнтервалПроверкиДокументов") <> Неопределено Тогда
		
		ПараметрыОповещенияДляПродолженияВызова.ИнтервалПроверкиДокументов = 0.1;
		
	КонецЕсли;
	
	ПодключитьОбработчикОжидания("Подключаемый_ПодписатьДокументыКодомИзSMS", 0.1, Истина);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПодписатьДокументыКодомИзSMS_ПродолжитьВызов(Результат, ПолученныеДополнительныеПараметры) Экспорт
	
	ПараметрыОповещенияДляПродолженияВызова = ПолученныеДополнительныеПараметры;
	ВремяОжиданияВСекундах = 0;
	ИнтервалПроверкиДокументов = 0.1;
	
	МоментЗапускаОжиданияПроверкиДокументовУниверсально = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
		ПолученныеДополнительныеПараметры, "МоментЗапускаОжиданияПроверкиДокументовУниверсально", 0);
	ИнтервалПроверкиДокументов = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
		ПолученныеДополнительныеПараметры, "ИнтервалПроверкиДокументов", 0.1);
	
	ТаймаутОжиданияПроверкиДокументов = 10 * 60;
	Если МоментЗапускаОжиданияПроверкиДокументовУниверсально > 0 Тогда
		
		ВремяОжиданияВСекундах = (ТекущаяУниверсальнаяДатаВМиллисекундах()
			- МоментЗапускаОжиданияПроверкиДокументовУниверсально) / 1000;
		
	КонецЕсли;
	
	Если ВремяОжиданияВСекундах > ТаймаутОжиданияПроверкиДокументов Тогда
		
		Элементы.ДекорацияОшибка.Видимость = Ложь;
		Элементы.ДекорацияПредупреждение.Видимость = Истина;
		Элементы.ФормаПродолжитьОжиданиеСменыСтатуса.Видимость = Истина;
		ТекстСообщенияПревышеноВремя = НСтр(
			"ru = 'Обработка документов в банке выполняется дольше ожидаемого.
			|Продолжить?'");
		Элементы.ДекорацияТекстОшибки.Заголовок = ТекстСообщенияПревышеноВремя;
		Элементы.Страницы.ТекущаяСтраница = Элементы.Страницы.ПодчиненныеЭлементы.Ошибка;
		
	Иначе
		
		ПодключитьОбработчикОжидания("Подключаемый_ПодписатьДокументыКодомИзSMS", ИнтервалПроверкиДокументов, Истина);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПодписатьДокументыКодомИзSMS()
	
	Результат = Неопределено;
	
	Если ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
		ПараметрыОповещенияДляПродолженияВызова, "ИнтервалПроверкиДокументов") <> Неопределено Тогда
		
		ОбновитьИнтервалПроверки(ПараметрыОповещенияДляПродолженияВызова.ИнтервалПроверкиДокументов);
		
	КонецЕсли;
	
	ПодписатьДокументыКодомИзSMS = Новый ОписаниеОповещения(
		"ПодписатьДокументыКодомИзSMS", ОбменСБанкамиСлужебныйКлиент, ПараметрыОповещенияДляПродолженияВызова);
	ПараметрыОповещенияДляПродолженияВызова = Неопределено;
	ВыполнитьОбработкуОповещения(ПодписатьДокументыКодомИзSMS, Результат);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОтменитьВыполнениеЗадания(ИдентификаторЗадания)
	
	ДлительныеОперации.ОтменитьВыполнениеЗадания(ИдентификаторЗадания);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьИнтервалПроверки(КоличествоСекунд)
	
	КоличествоСекунд = КоличествоСекунд * 1.5;
	Если КоличествоСекунд > 3 Тогда
		КоличествоСекунд = 3;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти