#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление();
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	ПервичнаяНастройкаФормы();
	
	ОбщегоНазначенияСобытияФормИСПереопределяемый.ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТаблицаДанных

&НаКлиенте
Процедура ТаблицаДанныхПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	УстановитьТипСпискаЗначенийВидыПродукции(Элемент);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыВидыПродукцииПоТоварнымГруппам

&НаКлиенте
Процедура ВидыПродукцииПоТоварнымГруппамПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	УстановитьТипСпискаЗначенийВидыПродукции(Элемент);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗагрузитьТабличныйДокумент(Команда)
	
	ЗагрузкаТабличногоДокумента();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДанные(Команда)
	
	Если ВозможноЗаполнениеДанных() Тогда
		ОчиститьСообщения();
		ЗаполнитьДанныеСервер();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьВидыПродукцииВДанных(Команда)
	
	ЗаполнениеВидовПродукцииВДанных();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьКоды(Команда)
	
	ОчиститьСообщения();
	
	Если Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаСтраница1 Тогда
		ПодготовитьКодыДляЗагрузки();
	Иначе
		ЗагрузитьПодготовленныеКоды();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Назад(Команда)
	
	ПерейтиНаСтраницу(ЭтотОбъект, 1);
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьНастройкиВФайл(Команда)
	
	СохранениеНастроекВФайл();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьНастройкиИзФайла(Команда)
	
	ЗагрузкаНастроекИзФайла();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьВидыПродукцииПоТоварнойГруппе(Команда)
	
	ЗаполнениеВидовПродукцииПоТоварнойГруппе();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаДанныхДляЗагрузкиТаблицаОКПД2.Имя);
	
	ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаДанныхДляЗагрузкиТаблицаОКПД2ТребуетсяЗагрузка.ПутьКДанным);
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;
	
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветТекстаНеТребуетВниманияГосИС);
	
КонецПроцедуры

&НаСервере
Процедура ПервичнаяНастройкаФормы()
	
	Элементы.ПояснениеНастройкиКолонок.Заголовок = НСтр("ru = '0 - колонка не используется'");
	Элементы.ПояснениеНастройки.Заголовок = НСтр(
	"ru = 'Колонка с кодом ТН ВЭД является обязательной. Коды ОКПД2 должны быть разделены символом "","" или "";"". Первая строка с именем колонок может отсутствовать.'");
	
	КолонкаНаименованиеТоварнойГруппы = 1;
	КолонкаКодТоварнойГруппы = 2;
	КолонкаКодТНВЭД = 3;
	КолонкаКодыОКПД2 = 4;
	
	Элементы.ВидыПродукцииПоТоварнымГруппамЗаполнитьВидыПродукцииПоТоварнойГруппе.Видимость = ОбщегоНазначения.ПодсистемаСуществует("ГосИС.ИСМП");
	
	Элементы.ГруппаСтраницы.ОтображениеСтраниц = ОтображениеСтраницФормы.Нет;
	
	ПерейтиНаСтраницу(ЭтотОбъект, 1);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьТипСпискаЗначенийВидыПродукции(Элемент)
	
	Типы = Новый Массив;
	Типы.Добавить(Тип("СправочникСсылка.ВидыПродукцииИС"));
	Элемент.ТекущиеДанные.ВидыПродукции.ТипЗначения = Новый ОписаниеТипов(Типы);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ПерейтиНаСтраницу(Форма, Страница)
	
	Если Страница = 1 Тогда
		Форма.ТаблицаДанныхДляЗагрузки.Очистить();
		Форма.Элементы.ФормаЗагрузить.Заголовок = "Обработать";
		Форма.Элементы.ФормаНазад.Видимость = Ложь;
		Форма.Элементы.ГруппаСтраницы.ТекущаяСтраница = Форма.Элементы.ГруппаСтраница1;
	Иначе
		Форма.Элементы.ФормаЗагрузить.Заголовок = "Загрузить";
		Форма.Элементы.ФормаНазад.Видимость = Истина;
		Форма.Элементы.ГруппаСтраницы.ТекущаяСтраница = Форма.Элементы.ГруппаСтраница2;
	КонецЕсли;
	
КонецПроцедуры

#Область ЗагрузкаТабличногоДокумента

&НаКлиенте
Процедура ЗагрузкаТабличногоДокумента()
	
	ПараметрыВыбораФайла = Новый ПараметрыДиалогаПомещенияФайлов;
	ПараметрыВыбораФайла.Заголовок          = НСтр("ru = 'Выбор файла с данными'");
	ПараметрыВыбораФайла.Фильтр             = НСтр("ru = 'Книга Excel (*.xls; *.xlsx)|*.xls;*.xlsx'");
	ПараметрыВыбораФайла.МножественныйВыбор = Ложь;
	
	НачатьПомещениеФайлаНаСервер(
		Новый ОписаниеОповещения("ЗагрузкаТабличногоДокументаЗавершение", ЭтотОбъект),,,,
		ПараметрыВыбораФайла,
		УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузкаТабличногоДокументаЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено
		И Не Результат.ПомещениеФайлаОтменено Тогда
		ЗагрузкаТабличногоДокументаНаСервере(Результат.Адрес, Результат.СсылкаНаФайл.Расширение);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузкаТабличногоДокументаНаСервере(АдресХранилища, РасширениеФайла)
	
	Путь = КаталогВременныхФайлов() + Строка(Новый УникальныйИдентификатор()) + РасширениеФайла;
	ПолучитьИзВременногоХранилища(АдресХранилища).Записать(Путь);
	ТабличныйДокумент.Очистить();
	ТабличныйДокумент.Прочитать(Путь);
	УдалитьФайлы(Путь);
	УдалитьИзВременногоХранилища(АдресХранилища);
	
КонецПроцедуры

#КонецОбласти

#Область ЗаполнениеДанных

&НаКлиенте
Функция ВозможноЗаполнениеДанных()
	
	Отказ = Ложь;
	
	Если КолонкаКодТНВЭД = 0 Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			НСтр("ru = 'Укажите колонку с кодом ТН ВЭД'"),,
			"КолонкаКодТНВЭД",,
			Отказ);
	КонецЕсли;
	
	Возврат Не Отказ;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьДанныеСервер()
	
	ТаблицаДанных.Очистить();
	
	ДобавленоТоварныхГрупп = 0;
	
	Отбор = Новый Структура;
	
	Для НомерСтроки = 1 по ТабличныйДокумент.ВысотаТаблицы Цикл
		
		Значение = СокрЛП(ТабличныйДокумент.Область(НомерСтроки, КолонкаКодТНВЭД).Текст);
		Если Значение = ""
			Или СтрНайти("0123456789", Лев(Значение, 1)) = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Отбор.Вставить("ТНВЭД", Значение);
		НайденныеСтроки = ТаблицаДанных.НайтиСтроки(Отбор);
		Если НайденныеСтроки.Количество() = 0 Тогда
			Строка = ТаблицаДанных.Добавить();
			Строка.ТНВЭД = Значение;
		Иначе
			Строка = НайденныеСтроки[0];
		КонецЕсли;
		
		Если КолонкаКодыОКПД2 > 0 Тогда
			ОКПД2 = СокрЛП(ТабличныйДокумент.Область(НомерСтроки, КолонкаКодыОКПД2).Текст);
			Если Строка.ОКПД2 = "" Тогда
				Строка.ОКПД2 = ОКПД2;
			Иначе
				Строка.ОКПД2 = Строка.ОКПД2 + РазделительОКПД2(ОКПД2) + ОКПД2;
			КонецЕсли;
		КонецЕсли;
		
		НайденнаяСтрока = Неопределено;
		
		Если КолонкаКодТоварнойГруппы > 0 Тогда
			Значение = СтроковыеФункцииКлиентСервер.СтрокаВЧисло(
				СокрЛП(ТабличныйДокумент.Область(НомерСтроки, КолонкаКодТоварнойГруппы).Текст));
			Если Значение <> Неопределено Тогда
				Строка.КодТоварнойГруппы = Значение;
			КонецЕсли;
			
			СтруктураПоиска = Новый Структура;
			СтруктураПоиска.Вставить("КодТоварнойГруппы", Строка.КодТоварнойГруппы);
			НайденныеСтроки = ВидыПродукцииПоТоварнымГруппам.НайтиСтроки(СтруктураПоиска);
			Если НайденныеСтроки.Количество() > 0 Тогда
				НайденнаяСтрока = НайденныеСтроки[0];
			КонецЕсли;
		КонецЕсли;
		
		Если КолонкаНаименованиеТоварнойГруппы > 0 Тогда
			Строка.НаименованиеТоварнойГруппы =
				СокрЛП(ТабличныйДокумент.Область(НомерСтроки, КолонкаНаименованиеТоварнойГруппы).Текст);
			Если НайденнаяСтрока = Неопределено Тогда
				СтруктураПоиска = Новый Структура;
				СтруктураПоиска.Вставить("НаименованиеТоварнойГруппы", Строка.НаименованиеТоварнойГруппы);
				НайденныеСтроки = ВидыПродукцииПоТоварнымГруппам.НайтиСтроки(СтруктураПоиска);
				Если НайденныеСтроки.Количество() > 0 Тогда
					НайденнаяСтрока = НайденныеСтроки[0];
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		Если НайденнаяСтрока = Неопределено
			И (ЗначениеЗаполнено(Строка.КодТоварнойГруппы)
				Или ЗначениеЗаполнено(Строка.НаименованиеТоварнойГруппы)) Тогда
			СтрокаТГ = ВидыПродукцииПоТоварнымГруппам.Добавить();
			СтрокаТГ.КодТоварнойГруппы = Строка.КодТоварнойГруппы;
			СтрокаТГ.НаименованиеТоварнойГруппы = Строка.НаименованиеТоварнойГруппы;
			ДобавленоТоварныхГрупп = ДобавленоТоварныхГрупп + 1;
		КонецЕсли;
		
	КонецЦикла;
	
	Если ДобавленоТоварныхГрупп > 0 Тогда
		ОбщегоНазначения.СообщитьПользователю(
			СтрШаблон(НСтр("ru = 'Добавлено %1 товарных групп - заполните для них соответствие видам продукции'"),
				ДобавленоТоварныхГрупп),,
			"ВидыПродукцииПоТоварнымГруппам");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СохранениеВосстановлениеНастроек

&НаКлиенте
Процедура СохранениеНастроекВФайл()
	
	НачатьПолучениеФайлаССервера(
		АдресФайлаНаСервере(),
		ИмяФайлаСохраненияНастроек(),
		Новый ПараметрыДиалогаПолученияФайлов(НСтр("ru = 'Сохранение файла настроек'"), Истина));

КонецПроцедуры

&НаКлиенте
Функция ИмяФайлаСохраненияНастроек()
	
	Возврат НСтр("ru = 'Настройки загрузки ТН ВЭД и ОКПД2.n1c'");
	
КонецФункции

&НаСервере
Функция АдресФайлаНаСервере()
	
	ВидыПродукции = Новый Массив;
	СоответствиеВидовПродукции = Новый Соответствие;
	Таблица = ВидыПродукцииПоТоварнымГруппам.Выгрузить(Новый Массив, "");
	
	Для Каждого Строка Из ВидыПродукцииПоТоварнымГруппам Цикл
		Для Каждого ЭлементСписка Из Строка.ВидыПродукции Цикл
			Если ВидыПродукции.Найти(ЭлементСписка.Значение) = Неопределено Тогда
				ВидыПродукции.Добавить(ЭлементСписка.Значение);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ВидыПродукции", ВидыПродукции);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВидыПродукцииИС.Ссылка КАК ВидПродукции,
	|	ВидыПродукцииИС.Идентификатор КАК Идентификатор
	|ИЗ
	|	Справочник.ВидыПродукцииИС КАК ВидыПродукцииИС
	|ГДЕ
	|	ВидыПродукцииИС.Ссылка В (&ВидыПродукции)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СоответствиеВидовПродукции.Вставить(Выборка.ВидПродукции, Выборка.Идентификатор);
	КонецЦикла;
	
	Для Каждого Строка Из ВидыПродукцииПоТоварнымГруппам Цикл
		СтрокаТаблицы = Таблица.Добавить();
		СтрокаТаблицы.КодТоварнойГруппы = Строка.КодТоварнойГруппы;
		СтрокаТаблицы.НаименованиеТоварнойГруппы = Строка.НаименованиеТоварнойГруппы;
		Для Каждого ЭлементСписка Из Строка.ВидыПродукции Цикл
			Идентификатор = СоответствиеВидовПродукции[ЭлементСписка.Значение];
			Если ЗначениеЗаполнено(Идентификатор) Тогда
				СтрокаТаблицы.ВидыПродукции.Добавить(Идентификатор);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Путь = КаталогВременныхФайлов() + Строка(Новый УникальныйИдентификатор()) + ".tmp";
	ЗначениеВФайл(Путь, Таблица);
	
	Адрес = ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(Путь));
	УдалитьФайлы(Путь);
	
	Возврат Адрес;
	
КонецФункции

&НаКлиенте
Процедура ЗагрузкаНастроекИзФайла()
	
	ПараметрыВыбораФайла = Новый ПараметрыДиалогаПомещенияФайлов;
	ПараметрыВыбораФайла.Заголовок          = НСтр("ru = 'Выбор файла настроек'");
	ПараметрыВыбораФайла.Фильтр             = НСтр("ru = 'Файлы настроек (*.n1c)|*.n1c|Все файлы(*.*)|*.*'");
	ПараметрыВыбораФайла.МножественныйВыбор = Ложь;
	
	НачатьПомещениеФайлаНаСервер(
		Новый ОписаниеОповещения("ЗагрузкаНастроекИзФайлаЗавершение", ЭтотОбъект),,,,
		ПараметрыВыбораФайла,
		УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузкаНастроекИзФайлаЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено
		И Не Результат.ПомещениеФайлаОтменено Тогда
		ЗагрузкаНастроекИзФайлаНаСервере(Результат.Адрес);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузкаНастроекИзФайлаНаСервере(АдресХранилища)
	
	Путь = КаталогВременныхФайлов() + Строка(Новый УникальныйИдентификатор()) + ".tmp";
	ПолучитьИзВременногоХранилища(АдресХранилища).Записать(Путь);
	ДанныеИзФайла = ЗначениеИзФайла(Путь);
	УдалитьФайлы(Путь);
	УдалитьИзВременногоХранилища(АдресХранилища);
	
	ВидыПродукцииПоТоварнымГруппам.Очистить();
	
	ВидыПродукции = Новый Массив;
	СоответствиеВидовПродукции = Новый Соответствие;
	
	Для Каждого Строка Из ДанныеИзФайла Цикл
		Для Каждого ЭлементСписка Из Строка.ВидыПродукции Цикл
			Если ВидыПродукции.Найти(ЭлементСписка.Значение) = Неопределено Тогда
				ВидыПродукции.Добавить(ЭлементСписка.Значение);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ВидыПродукции", ВидыПродукции);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВидыПродукцииИС.Ссылка КАК ВидПродукции,
	|	ВидыПродукцииИС.Идентификатор КАК Идентификатор
	|ИЗ
	|	Справочник.ВидыПродукцииИС КАК ВидыПродукцииИС
	|ГДЕ
	|	ВидыПродукцииИС.Идентификатор В (&ВидыПродукции)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СоответствиеВидовПродукции.Вставить(Выборка.Идентификатор, Выборка.ВидПродукции);
	КонецЦикла;
	
	Для Каждого Строка Из ДанныеИзФайла Цикл
		СтрокаТаблицы = ВидыПродукцииПоТоварнымГруппам.Добавить();
		СтрокаТаблицы.КодТоварнойГруппы = Строка.КодТоварнойГруппы;
		СтрокаТаблицы.НаименованиеТоварнойГруппы = Строка.НаименованиеТоварнойГруппы;
		Для Каждого ЭлементСписка Из Строка.ВидыПродукции Цикл
			ВидПродукции = СоответствиеВидовПродукции[ЭлементСписка.Значение];
			Если ЗначениеЗаполнено(ВидПродукции) Тогда
				СтрокаТаблицы.ВидыПродукции.Добавить(ВидПродукции);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ЗаполнениеВидовПродукцииПоТоварнойГруппе

&НаКлиенте
Процедура ЗаполнениеВидовПродукцииПоТоварнойГруппе()
	
	КодыТоварныхГрупп = Новый Массив;
	СтрокиДляОбработки = Новый Массив;
	
	Для Каждого Строка Из ВидыПродукцииПоТоварнымГруппам Цикл
		Если Строка.ВидыПродукции.Количество() = 0
			И Строка.КодТоварнойГруппы > 0 Тогда
			Если КодыТоварныхГрупп.Найти(Строка.КодТоварнойГруппы) = Неопределено Тогда
				КодыТоварныхГрупп.Добавить(Строка.КодТоварнойГруппы);
			КонецЕсли;
			СтрокиДляОбработки.Добавить(Строка);
		КонецЕсли;
	КонецЦикла;
	
	Если КодыТоварныхГрупп.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТоварныеГруппыПоКоду = ТоварныеГруппыПоКоду(КодыТоварныхГрупп);
	
	МодульИСМП = ОбщегоНазначенияКлиент.ОбщийМодуль("КонструкторИСМПОбщегоНазначенияКлиентСервер");
	
	Для Каждого Строка Из СтрокиДляОбработки Цикл
		ТоварнаяГруппа = ТоварныеГруппыПоКоду[Строка.КодТоварнойГруппы];
		Если ТоварнаяГруппа <> Неопределено Тогда
			ВидыПродукции = МодульИСМП.ВидыПродукцииПоТоварнойГруппе(ТоварнаяГруппа);
			Строка.ВидыПродукции.ЗагрузитьЗначения(ВидыПродукции);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ТоварныеГруппыПоКоду(КодыТоварныхГрупп)
	
	Результат = Новый Соответствие;
	
	Таблица = Новый ТаблицаЗначений;
	Таблица.Колонки.Добавить("Код", ОбщегоНазначения.ОписаниеТипаЧисло(12));
	Таблица.Колонки.Добавить("КодДляПоиска", ОбщегоНазначения.ОписаниеТипаЧисло(6));
	
	Для Каждого Код Из КодыТоварныхГрупп Цикл
		Строка = Таблица.Добавить();
		Строка.Код = Код;
		Если Код > 100000 Тогда
			Строка.КодДляПоиска = Код - Окр(Код, -5);
		Иначе
			Строка.КодДляПоиска = Код;
		КонецЕсли;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Таблица", Таблица);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Таблица.Код,
	|	Таблица.КодДляПоиска
	|ПОМЕСТИТЬ Таблица
	|ИЗ
	|	&Таблица КАК Таблица
	|;
	|ВЫБРАТЬ
	|	Таблица.Код КАК Код,
	|	ТоварныеГруппыГИСМТ.Ссылка КАК ТоварнаяГруппа
	|ИЗ
	|	Таблица КАК Таблица
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ТоварныеГруппыГИСМТ КАК ТоварныеГруппыГИСМТ
	|	ПО Таблица.КодДляПоиска = ТоварныеГруппыГИСМТ.Код";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Результат.Вставить(Выборка.Код, Выборка.ТоварнаяГруппа);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область ЗаполнениеВидовПродукцииВДанных

&НаКлиенте
Процедура ЗаполнениеВидовПродукцииВДанных()
	
	Если ТаблицаДанных.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ОчиститьСообщения();
	
	Если ВидыПродукцииПоТоварнымГруппам.Количество() = 0 Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			НСтр("ru = 'Отсутствуют данные для заполнения видов продукции'"),,
			"ВидыПродукцииПоТоварнымГруппам");
		Возврат;
	КонецЕсли;
	
	СтруктураПоиска = Новый Структура;
	
	Для Каждого Строка Из ТаблицаДанных Цикл
		Строка.ВидыПродукции.Очистить();
		СтруктураПоиска.Вставить("КодТоварнойГруппы", Строка.КодТоварнойГруппы);
		НайденныеСтроки = ВидыПродукцииПоТоварнымГруппам.НайтиСтроки(СтруктураПоиска);
		Если НайденныеСтроки.Количество() > 0 Тогда
			Строка.ВидыПродукции.ЗагрузитьЗначения(НайденныеСтроки[0].ВидыПродукции.ВыгрузитьЗначения());
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ПодготовкаКодовДляЗагрузки

&НаКлиенте
Процедура ПодготовитьКодыДляЗагрузки()
	
	Если ТаблицаДанных.Количество() = 0 Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			НСтр("ru = 'Отсутствуют данные для загрузки'"),,
			"ТаблицаДанных");
		Возврат;
	КонецЕсли;
	
	СтрокиДляЗагрузки = Новый Массив;
	
	Для Каждого Строка Из ТаблицаДанных Цикл
		Если ЗначениеЗаполнено(Строка.ТНВЭД)
			И Строка.ВидыПродукции.Количество() > 0 Тогда
			СтрокиДляЗагрузки.Добавить(Строка.ПолучитьИдентификатор());
		КонецЕсли;
	КонецЦикла;
	
	КоличествоСтрокДляЗагрузки = СтрокиДляЗагрузки.Количество();
	Если КоличествоСтрокДляЗагрузки = 0 Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			НСтр("ru = 'Не указаны виды продукции для загрузки данных'"),,
			"ТаблицаДанныхВидыПродукции");
		Возврат;
	ИначеЕсли КоличествоСтрокДляЗагрузки <> ТаблицаДанных.Количество() Тогда
		ПоказатьВопрос(
			Новый ОписаниеОповещения(
				"ПодготовкаКодовВопрос",
				ЭтотОбъект,
				Новый Структура("СтрокиДляЗагрузки", СтрокиДляЗагрузки)),
			СтрШаблон(
				НСтр("ru = 'Доступно для обработки %1 из %2 (строк). Продолжить?'"),
				КоличествоСтрокДляЗагрузки,
				ТаблицаДанных.Количество()),
			РежимДиалогаВопрос.ДаНет);
		Возврат;
	КонецЕсли;
	
	ПодготовкаКодовСервер(СтрокиДляЗагрузки);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодготовкаКодовВопрос(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ПодготовкаКодовСервер(ДополнительныеПараметры.СтрокиДляЗагрузки);
	
КонецПроцедуры

&НаСервере
Процедура ПодготовкаКодовСервер(СтрокиДляЗагрузки)
	
	ТаблицаДанныхДляЗагрузки.Очистить();
	
	Таблица = Новый ТаблицаЗначений;
	Таблица.Колонки.Добавить("ТНВЭД", ОбщегоНазначения.ОписаниеТипаСтрока(10));
	Таблица.Колонки.Добавить("ОКПД2", ОбщегоНазначения.ОписаниеТипаСтрока(12));
	Таблица.Колонки.Добавить("ВидПродукции", Новый ОписаниеТипов("СправочникСсылка.ВидыПродукцииИС"));
	Таблица.Колонки.Добавить("ИдентификаторСтроки", ОбщегоНазначения.ОписаниеТипаЧисло(10, 0, ДопустимыйЗнак.Неотрицательный));
	
	Для Каждого СтрокаДляЗагрузки Из СтрокиДляЗагрузки Цикл
		Строка = ТаблицаДанных.НайтиПоИдентификатору(СтрокаДляЗагрузки);
		ДобавитьДанныеСтрокиВТаблицу(Строка, Таблица, СтрокаДляЗагрузки);
	КонецЦикла;
	
	Если Таблица.Количество() > 0 Тогда
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Таблица", Таблица);
		Запрос.Текст = ТекстЗапросаКодовТНВЭДиОКПД2();
		
		Отбор = Новый Структура;
		Отбор.Вставить("ОКПД2", "");
		
		ТекущийИдентификаторСтроки = Неопределено;
		ТекущийВидПродукции = Неопределено;
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			
			Если ТекущийИдентификаторСтроки <> Выборка.ИдентификаторСтроки
				Или ТекущийВидПродукции <> Выборка.ВидПродукции Тогда
				ТекущийИдентификаторСтроки = Выборка.ИдентификаторСтроки;
				ТекущийВидПродукции = Выборка.ВидПродукции;
				Строка = ТаблицаДанных.НайтиПоИдентификатору(ТекущийИдентификаторСтроки);
				СтрокаТНВЭД = ТаблицаДанныхДляЗагрузки.Добавить();
				СтрокаТНВЭД.КодТоварнойГруппы = Строка.КодТоварнойГруппы;
				СтрокаТНВЭД.НаименованиеТоварнойГруппы = Строка.НаименованиеТоварнойГруппы;
				СтрокаТНВЭД.ТНВЭД = Строка.ТНВЭД;
				СтрокаТНВЭД.ВидПродукции = ТекущийВидПродукции;
				СтрокаТНВЭД.ТНВЭДПоВидуПродукции = Выборка.ТНВЭДПоВидуПродукции;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Выборка.ТНВЭДДругойВидПродукции)
				И СтрокаТНВЭД.ДругиеВидыПродукции.НайтиПоЗначению(Выборка.ТНВЭДДругойВидПродукции) = Неопределено Тогда
				СтрокаТНВЭД.ДругиеВидыПродукции.Добавить(Выборка.ТНВЭДДругойВидПродукции)
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Выборка.ОКПД2) Тогда
				
				Отбор.ОКПД2 = Выборка.ОКПД2;
				НайденныеСтроки = СтрокаТНВЭД.ТаблицаОКПД2.НайтиСтроки(Отбор);
				Если НайденныеСтроки.Количество() = 0 Тогда
					СтрокаОКПД2 = СтрокаТНВЭД.ТаблицаОКПД2.Добавить();
					СтрокаОКПД2.ОКПД2 = Выборка.ОКПД2;
					СтрокаОКПД2.ОКПД2ПоВидуПродукции = Выборка.ОКПД2ПоВидуПродукции;
					СтрокаОКПД2.ТребуетсяЗагрузка = Выборка.ОКПД2ТребуетсяЗагрузка;
				Иначе
					СтрокаОКПД2 = НайденныеСтроки[0];
				КонецЕсли;
				
				Если ЗначениеЗаполнено(Выборка.ОКПД2ДругойВидПродукции)
					И СтрокаОКПД2.ДругиеВидыПродукции.НайтиПоЗначению(Выборка.ОКПД2ДругойВидПродукции) = Неопределено Тогда
					СтрокаОКПД2.ДругиеВидыПродукции.Добавить(Выборка.ОКПД2ДругойВидПродукции)
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если ТаблицаДанныхДляЗагрузки.Количество() = 0 Тогда
		ОбщегоНазначения.СообщитьПользователю(
			НСтр("ru = 'Обработка кодов завершена. Данных для загрузки / изменения не обнаружено.'"));
	Иначе
		ПерейтиНаСтраницу(ЭтотОбъект, 2);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьДанныеСтрокиВТаблицу(Строка, Таблица, ИдентификаторСтроки)
	
	Если Строка = Неопределено
		Или Не ЗначениеЗаполнено(Строка.ТНВЭД)
		Или Строка.ВидыПродукции.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	КодыОКПД2 = Новый Массив;
	Если СтрДлина(Строка.ОКПД2) >= 12 Тогда
		Массив = СтрРазделить(Строка.ОКПД2, РазделительОКПД2(Строка.ОКПД2));
		Для Каждого Код Из Массив Цикл
			Код = СокрЛП(Код);
			Если СтрДлина(Код) = 12
				И КодыОКПД2.Найти(Код) = Неопределено Тогда
				КодыОКПД2.Добавить(Код);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	Если КодыОКПД2.Количество() = 0 Тогда
		КодыОКПД2.Добавить("");
	КонецЕсли;
	
	ВидыПродукции = Новый Массив;
	Для Каждого ЭлементСписка Из Строка.ВидыПродукции Цикл
		Если ЗначениеЗаполнено(ЭлементСписка.Значение)
			И ВидыПродукции.Найти(ЭлементСписка.Значение) = Неопределено Тогда
			ВидыПродукции.Добавить(ЭлементСписка.Значение);
		КонецЕсли;
	КонецЦикла;
	
	Если ВидыПродукции.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ВидПродукции Из ВидыПродукции Цикл
		Для Каждого ОКПД2 Из КодыОКПД2 Цикл
			СтрокаТаблицы = Таблица.Добавить();
			СтрокаТаблицы.ТНВЭД = Строка.ТНВЭД;
			СтрокаТаблицы.ВидПродукции = ВидПродукции;
			СтрокаТаблицы.ОКПД2 = ОКПД2;
			СтрокаТаблицы.ИдентификаторСтроки = ИдентификаторСтроки;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция РазделительОКПД2(ОКПД2)
	
	Разделители = Новый Массив;
	Разделители.Добавить(",");
	Разделители.Добавить(";");
	
	ТекущийРазделитель = ",";
	Для Каждого Разделитель Из Разделители Цикл
		Если СтрНайти(ОКПД2, Разделитель) > 0 Тогда
			ТекущийРазделитель = Разделитель;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ТекущийРазделитель;
	
КонецФункции	

&НаСервереБезКонтекста
Функция ТекстЗапросаКодовТНВЭДиОКПД2()
	
	Возврат
	"ВЫБРАТЬ
	|	Таблица.ТНВЭД,
	|	Таблица.ОКПД2,
	|	Таблица.ВидПродукции,
	|	Таблица.ИдентификаторСтроки
	|ПОМЕСТИТЬ Таблица
	|ИЗ
	|	&Таблица КАК Таблица
	|;
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Таблица.ТНВЭД,
	|	Таблица.ВидПродукции
	|ПОМЕСТИТЬ ТаблицаТНВЭД
	|ИЗ
	|	Таблица КАК Таблица
	|;
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Таблица.ОКПД2,
	|	Таблица.ВидПродукции
	|ПОМЕСТИТЬ ТаблицаОКПД2
	|ИЗ
	|	Таблица КАК Таблица
	|ГДЕ
	|	Таблица.ОКПД2 <> """"
	|;
	|ВЫБРАТЬ
	|	Таблица.ТНВЭД КАК ТНВЭД,
	|	Таблица.ВидПродукции КАК ВидПродукции,
	|	ТаблицаСправочника.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ КодыТНВЭД
	|ИЗ
	|	ТаблицаТНВЭД КАК Таблица
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ТНВЭДПоВидамПродукцииИС КАК ТаблицаСправочника
	|	ПО Таблица.ТНВЭД = ТаблицаСправочника.Код
	|		И Таблица.ВидПродукции = ТаблицаСправочника.ВидПродукции
	|		И ТаблицаСправочника.Код <> ТаблицаСправочника.КодЧЗ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Таблица.ТНВЭД КАК ТНВЭД,
	|	Таблица.ВидПродукции КАК ВидПродукции,
	|	NULL КАК Ссылка
	|ИЗ
	|	ТаблицаТНВЭД КАК Таблица
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТНВЭДПоВидамПродукцииИС КАК ТаблицаСправочника
	|	ПО (Таблица.ТНВЭД = ТаблицаСправочника.Код
	|			ИЛИ Таблица.ТНВЭД = ТаблицаСправочника.КодЧЗ)
	|		И Таблица.ВидПродукции = ТаблицаСправочника.ВидПродукции
	|ГДЕ
	|	ТаблицаСправочника.Ссылка ЕСТЬ NULL
	|;
	|ВЫБРАТЬ
	|	Таблица.ТНВЭД КАК ТНВЭД,
	|	Таблица.ВидПродукции КАК ВидПродукции,
	|	ТаблицаСправочника.ВидПродукции КАК ДругойВидПродукции
	|ПОМЕСТИТЬ ДругиеВидыПродукцииПоТНВЭД
	|ИЗ
	|	ТаблицаТНВЭД КАК Таблица
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ТНВЭДПоВидамПродукцииИС КАК ТаблицаСправочника
	|	ПО (Таблица.ТНВЭД = ТаблицаСправочника.Код
	|			ИЛИ Таблица.ТНВЭД = ТаблицаСправочника.КодЧЗ)
	|		И Таблица.ВидПродукции <> ТаблицаСправочника.ВидПродукции
	|;
	|ВЫБРАТЬ
	|	Таблица.ОКПД2 КАК ОКПД2,
	|	Таблица.ВидПродукции КАК ВидПродукции,
	|	ТаблицаСправочника.Ссылка КАК Ссылка,
	|	ИСТИНА КАК ТребуетсяЗагрузка
	|ПОМЕСТИТЬ КодыОКПД2
	|ИЗ
	|	ТаблицаОКПД2 КАК Таблица
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ОКПД2ПоВидамПродукцииИС КАК ТаблицаСправочника
	|	ПО Таблица.ОКПД2 = ТаблицаСправочника.Код
	|		И Таблица.ВидПродукции = ТаблицаСправочника.ВидПродукции
	|		И ТаблицаСправочника.Код <> ТаблицаСправочника.КодЧЗ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Таблица.ОКПД2 КАК ОКПД2,
	|	Таблица.ВидПродукции КАК ВидПродукции,
	|	NULL КАК Ссылка,
	|	ИСТИНА КАК ТребуетсяЗагрузка
	|ИЗ
	|	ТаблицаОКПД2 КАК Таблица
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ОКПД2ПоВидамПродукцииИС КАК ТаблицаСправочника
	|	ПО (Таблица.ОКПД2 = ТаблицаСправочника.Код
	|			ИЛИ Таблица.ОКПД2 = ТаблицаСправочника.КодЧЗ)
	|		И Таблица.ВидПродукции = ТаблицаСправочника.ВидПродукции
	|ГДЕ
	|	ТаблицаСправочника.Ссылка ЕСТЬ NULL
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Таблица.ОКПД2 КАК ОКПД2,
	|	Таблица.ВидПродукции КАК ВидПродукции,
	|	ТаблицаСправочника.Ссылка КАК Ссылка,
	|	ЛОЖЬ КАК ТребуетсяЗагрузка
	|ИЗ
	|	ТаблицаОКПД2 КАК Таблица
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ОКПД2ПоВидамПродукцииИС КАК ТаблицаСправочника
	|	ПО Таблица.ОКПД2 = ТаблицаСправочника.КодЧЗ
	|		И Таблица.ВидПродукции = ТаблицаСправочника.ВидПродукции
	|;
	|ВЫБРАТЬ
	|	Таблица.ОКПД2 КАК ОКПД2,
	|	Таблица.ВидПродукции КАК ВидПродукции,
	|	ТаблицаСправочника.ВидПродукции КАК ДругойВидПродукции
	|ПОМЕСТИТЬ ДругиеВидыПродукцииПоОКПД2
	|ИЗ
	|	ТаблицаОКПД2 КАК Таблица
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ОКПД2ПоВидамПродукцииИС КАК ТаблицаСправочника
	|	ПО (Таблица.ОКПД2 = ТаблицаСправочника.Код
	|			ИЛИ Таблица.ОКПД2 = ТаблицаСправочника.КодЧЗ)
	|		И Таблица.ВидПродукции <> ТаблицаСправочника.ВидПродукции
	|;
	|ВЫБРАТЬ
	|	Таблица.ТНВЭД КАК ТНВЭД,
	|	КодыОКПД2.ОКПД2 КАК ОКПД2,
	|	Таблица.ВидПродукции КАК ВидПродукции,
	|	Таблица.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	КодыТНВЭД.Ссылка КАК ТНВЭДПоВидуПродукции,
	|	ДругиеВидыПродукцииПоТНВЭД.ДругойВидПродукции КАК ТНВЭДДругойВидПродукции,
	|	КодыОКПД2.Ссылка КАК ОКПД2ПоВидуПродукции,
	|	ДругиеВидыПродукцииПоОКПД2.ДругойВидПродукции КАК ОКПД2ДругойВидПродукции,
	|	КодыОКПД2.ТребуетсяЗагрузка КАК ОКПД2ТребуетсяЗагрузка
	|ИЗ
	|	Таблица КАК Таблица
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ КодыТНВЭД КАК КодыТНВЭД
	|	ПО Таблица.ТНВЭД = КодыТНВЭД.ТНВЭД
	|		И Таблица.ВидПродукции = КодыТНВЭД.ВидПродукции
	|	ЛЕВОЕ СОЕДИНЕНИЕ ДругиеВидыПродукцииПоТНВЭД КАК ДругиеВидыПродукцииПоТНВЭД
	|	ПО Таблица.ТНВЭД = ДругиеВидыПродукцииПоТНВЭД.ТНВЭД
	|		И Таблица.ВидПродукции = ДругиеВидыПродукцииПоТНВЭД.ВидПродукции
	|	ЛЕВОЕ СОЕДИНЕНИЕ КодыОКПД2 КАК КодыОКПД2
	|	ПО Таблица.ОКПД2 = КодыОКПД2.ОКПД2
	|		И Таблица.ВидПродукции = КодыОКПД2.ВидПродукции
	|	ЛЕВОЕ СОЕДИНЕНИЕ ДругиеВидыПродукцииПоОКПД2 КАК ДругиеВидыПродукцииПоОКПД2
	|	ПО Таблица.ОКПД2 = ДругиеВидыПродукцииПоОКПД2.ОКПД2
	|		И Таблица.ВидПродукции = ДругиеВидыПродукцииПоОКПД2.ВидПродукции
	|УПОРЯДОЧИТЬ ПО
	|	ИдентификаторСтроки,
	|	ВидПродукции";
	
КонецФункции

#КонецОбласти

#Область ЗагрузкаКодов

&НаКлиенте
Процедура ЗагрузитьПодготовленныеКоды()
	
	СтрокиДляЗагрузки = Новый Массив;
	
	Для Каждого Строка Из ТаблицаДанныхДляЗагрузки Цикл
		Если ЗначениеЗаполнено(Строка.ТНВЭД)
			И ЗначениеЗаполнено(Строка.ВидПродукции) Тогда
			СтрокиДляЗагрузки.Добавить(Строка.ПолучитьИдентификатор());
		КонецЕсли;
	КонецЦикла;
	
	Если СтрокиДляЗагрузки.Количество() = 0 Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			НСтр("ru = 'Отсутствуют данные для загрузки'"),,
			"ТаблицаДанныхДляЗагрузки");
		Возврат;
	КонецЕсли;
	
	ПоказатьВопрос(
		Новый ОписаниеОповещения(
			"ЗагрузкаКодовВопрос",
			ЭтотОбъект,
			Новый Структура("СтрокиДляЗагрузки", СтрокиДляЗагрузки)),
		НСтр("ru = 'Выполнить загрузку кодов?'"),
		РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузкаКодовВопрос(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ЗагрузкаКодовСервер(ДополнительныеПараметры.СтрокиДляЗагрузки);
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузкаКодовСервер(СтрокиДляЗагрузки)
	
	Таблица = Новый ТаблицаЗначений;
	Таблица.Колонки.Добавить("ТНВЭД", Новый ОписаниеТипов("СправочникСсылка.ТНВЭДПоВидамПродукцииИС"));
	Таблица.Колонки.Добавить("ОКПД2", Новый ОписаниеТипов("СправочникСсылка.ОКПД2ПоВидамПродукцииИС"));
	
	ЗагруженныеОКПД2 = Новый ТаблицаЗначений;
	ЗагруженныеОКПД2.Колонки.Добавить("ВидПродукции",         Новый ОписаниеТипов("СправочникСсылка.ВидыПродукцииИС"));
	ЗагруженныеОКПД2.Колонки.Добавить("ОКПД2",                ОбщегоНазначения.ОписаниеТипаСтрока(12));
	ЗагруженныеОКПД2.Колонки.Добавить("ОКПД2ПоВидуПродукции", Новый ОписаниеТипов("СправочникСсылка.ОКПД2ПоВидамПродукцииИС"));
	
	СтруктураПоискаОКПД2 = Новый Структура("ОКПД2, ВидПродукции");
	
	КоличествоТНВЭД = 0;
	КоличествоОКПД2 = 0;
	ДобавленоСвязей = 0;
	УдаленоСвязей = 0;
	
	ТекущаяДата = ТекущаяДатаСеанса();
	
	Блокировка = Новый БлокировкаДанных;
	Блокировка.Добавить("Справочник.ТНВЭДПоВидамПродукцииИС");
	Блокировка.Добавить("Справочник.ОКПД2ПоВидамПродукцииИС");
	Блокировка.Добавить("РегистрСведений.СоответствиеТНВЭДиОКПД2ИС");
	
	НачатьТранзакцию();
	
	Попытка
		
		Блокировка.Заблокировать();
		
		Для Каждого СтрокаДляЗагрузки Из СтрокиДляЗагрузки Цикл
			
			СтрокаДляЗагрузкиТНВЭД = ТаблицаДанныхДляЗагрузки.НайтиПоИдентификатору(СтрокаДляЗагрузки);
			Если ЗначениеЗаполнено(СтрокаДляЗагрузкиТНВЭД.ТНВЭДПоВидуПродукции) Тогда
				ЭлементСправочника = СтрокаДляЗагрузкиТНВЭД.ТНВЭДПоВидуПродукции.ПолучитьОбъект();
			Иначе
				ЭлементСправочника = Справочники.ТНВЭДПоВидамПродукцииИС.СоздатьЭлемент();
			КонецЕсли;
			
			ЭлементСправочника.КодЧЗ = СтрокаДляЗагрузкиТНВЭД.ТНВЭД;
			ЭлементСправочника.ВидПродукции = СтрокаДляЗагрузкиТНВЭД.ВидПродукции;
			ЭлементСправочника.Статус = Перечисления.СтатусыКлассификаторовВидовПродукцииИС.Действующий;
			ЭлементСправочника.ДатаИзменения = ТекущаяДата;
			ЭлементСправочника.Записать();
			
			ТНВЭД = ЭлементСправочника.Ссылка;
			
			КоличествоТНВЭД = КоличествоТНВЭД + 1;
			
			Для Каждого СтрокаДляЗагрузкиОКПД2 Из СтрокаДляЗагрузкиТНВЭД.ТаблицаОКПД2 Цикл
				
				Если СтрокаДляЗагрузкиОКПД2.ТребуетсяЗагрузка Тогда
					
					СтруктураПоискаОКПД2.ОКПД2 = СтрокаДляЗагрузкиОКПД2.ОКПД2;
					СтруктураПоискаОКПД2.ВидПродукции = СтрокаДляЗагрузкиТНВЭД.ВидПродукции;
					НайденныеСтрокиОКПД2 = ЗагруженныеОКПД2.НайтиСтроки(СтруктураПоискаОКПД2);
					
					Если НайденныеСтрокиОКПД2.Количество() = 0 Тогда
						
						Если ЗначениеЗаполнено(СтрокаДляЗагрузкиОКПД2.ОКПД2ПоВидуПродукции) Тогда
							ЭлементСправочника = СтрокаДляЗагрузкиОКПД2.ОКПД2ПоВидуПродукции.ПолучитьОбъект();
						Иначе
							ЭлементСправочника = Справочники.ОКПД2ПоВидамПродукцииИС.СоздатьЭлемент();
						КонецЕсли;
						
						ЭлементСправочника.КодЧЗ = СтрокаДляЗагрузкиОКПД2.ОКПД2;
						ЭлементСправочника.ВидПродукции = СтрокаДляЗагрузкиТНВЭД.ВидПродукции;
						ЭлементСправочника.Статус = Перечисления.СтатусыКлассификаторовВидовПродукцииИС.Действующий;
						ЭлементСправочника.ДатаИзменения = ТекущаяДата;
						ЭлементСправочника.Записать();
						
						ОКПД2 = ЭлементСправочника.Ссылка;
						
						СтрокаОКПД2 = ЗагруженныеОКПД2.Добавить();
						СтрокаОКПД2.ВидПродукции = СтрокаДляЗагрузкиТНВЭД.ВидПродукции;
						СтрокаОКПД2.ОКПД2 = СтрокаДляЗагрузкиОКПД2.ОКПД2;
						СтрокаОКПД2.ОКПД2ПоВидуПродукции = ОКПД2;
						
						КоличествоОКПД2 = КоличествоОКПД2 + 1;
						
					Иначе
						
						ОКПД2 = НайденныеСтрокиОКПД2[0].ОКПД2ПоВидуПродукции;
						
					КонецЕсли;
					
				Иначе
					
					ОКПД2 = СтрокаДляЗагрузкиОКПД2.ОКПД2ПоВидуПродукции;
					
				КонецЕсли;
				
				Если ЗначениеЗаполнено(ОКПД2) Тогда
					СтрокаТаблицы = Таблица.Добавить();
					СтрокаТаблицы.ТНВЭД = ТНВЭД;
					СтрокаТаблицы.ОКПД2 = ОКПД2;
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЦикла;
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Таблица", Таблица);
		Запрос.Текст = ТекстЗапросаСвязейТНВЭДиОКПД2();
		РезультатЗапроса = Запрос.ВыполнитьПакет();
		ВГраница = РезультатЗапроса.ВГраница();
		
		Выборка = РезультатЗапроса[ВГраница - 1].Выбрать();
		Пока Выборка.Следующий() Цикл
			
			Запись = РегистрыСведений.СоответствиеТНВЭДиОКПД2ИС.СоздатьМенеджерЗаписи();
			Запись.ТНВЭД   = Выборка.ТНВЭД;
			Запись.ОКПД2   = Выборка.ОКПД2;
			Запись.Изменен = Истина;
			Запись.Записать();
			
			ДобавленоСвязей = ДобавленоСвязей + 1;
			
		КонецЦикла;
		
		Выборка = РезультатЗапроса[ВГраница].Выбрать();
		Пока Выборка.Следующий() Цикл
			
			Запись = РегистрыСведений.СоответствиеТНВЭДиОКПД2ИС.СоздатьМенеджерЗаписи();
			Запись.ТНВЭД   = Выборка.ТНВЭД;
			Запись.ОКПД2   = Выборка.ОКПД2;
			Запись.Изменен = Истина;
			Запись.ПометкаУдаления = Истина;
			Запись.Удалить();
			
			УдаленоСвязей = УдаленоСвязей + 1;
			
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
	ОбщегоНазначения.СообщитьПользователю(СтрШаблон(
		НСтр("ru = 'Коды успешно загружены: ТН ВЭД %1, ОКПД2 %2, Связи %3, Удалено связей %4'"),
		КоличествоТНВЭД, КоличествоОКПД2, ДобавленоСвязей, УдаленоСвязей));
	
	ПерейтиНаСтраницу(ЭтотОбъект, 1);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ТекстЗапросаСвязейТНВЭДиОКПД2()
	
	Возврат
	"ВЫБРАТЬ
	|	Таблица.ТНВЭД,
	|	Таблица.ОКПД2
	|ПОМЕСТИТЬ Таблица
	|ИЗ
	|	&Таблица КАК Таблица
	|;
	|ВЫБРАТЬ
	|	Таблица.ТНВЭД КАК ТНВЭД,
	|	Таблица.ОКПД2 КАК ОКПД2
	|ИЗ
	|	Таблица КАК Таблица
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СоответствиеТНВЭДиОКПД2ИС КАК ТаблицаРегистра
	|	ПО Таблица.ТНВЭД = ТаблицаРегистра.ТНВЭД
	|		И Таблица.ОКПД2 = ТаблицаРегистра.ОКПД2
	|ГДЕ
	|	ТаблицаРегистра.ТНВЭД ЕСТЬ NULL
	|;
	|ВЫБРАТЬ
	|	ТаблицаРегистра.ТНВЭД КАК ТНВЭД,
	|	ТаблицаРегистра.ОКПД2 КАК ОКПД2
	|ИЗ
	|	РегистрСведений.СоответствиеТНВЭДиОКПД2ИС КАК ТаблицаРегистра
	|ГДЕ
	|	ТаблицаРегистра.ТНВЭД.ВидПродукции <> ТаблицаРегистра.ОКПД2.ВидПродукции";
	
КонецФункции

#КонецОбласти

#КонецОбласти
