// @strict-types

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИдентификаторЭДО = Параметры.ИдентификаторЭДО;
	
	Если Не ЗначениеЗаполнено(ИдентификаторЭДО) Тогда
		ОбщегоНазначения.СообщитьПользователю(
			НСтр("ru = 'Не указан идентификатор учетной записи ЭДО для переноса документов'"),,,, Отказ);
		Возврат;
	КонецЕсли;
	
	ПараметрыВыгрузки = РегистрыСведений.СостоянияВыгрузкиВЦентрЭДО.ПараметрыВыгрузки(ИдентификаторЭДО);
	Если ПараметрыВыгрузки <> Неопределено Тогда
		ВыгружатьДокументыСДаты = ЗначениеЗаполнено(ПараметрыВыгрузки.ДатаВыгрузкиДокументов);
		ДатаВыгрузкиДокументов = ПараметрыВыгрузки.ДатаВыгрузкиДокументов;
		ВыгружатьНезавершенные = ПараметрыВыгрузки.ВыгружатьНезавершенные;
	КонецЕсли;
	
	НастроитьОтображениеПараметровВыгрузки(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВыгружатьДокументыСДатыПриИзменении(Элемент)
	
	НастроитьОтображениеПараметровВыгрузки(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗапуститьВыгрузку(Команда)
	
	Отказ = Ложь;
	
	Если Не ЗначениеЗаполнено(ИдентификаторЭДО) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Не выбрана учетная запись ЭДО для переноса документов'"),,,, Отказ);
	КонецЕсли;
	
	Если ВыгружатьДокументыСДаты И Не ЗначениеЗаполнено(ДатаВыгрузкиДокументов) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Не указана дата выгрузки документов'"),,
			Элементы.ДатаВыгрузкиДокументов.Имя,, Отказ);
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыВыгрузки = Новый Структура;
	ПараметрыВыгрузки.Вставить("ИдентификаторЭДО", ИдентификаторЭДО);
	ПараметрыВыгрузки.Вставить("ДатаВыгрузкиДокументов",
		?(ВыгружатьДокументыСДаты, ДатаВыгрузкиДокументов, '00010101'));
	ПараметрыВыгрузки.Вставить("ВыгружатьНезавершенные", ВыгружатьНезавершенные);
	Закрыть(ПараметрыВыгрузки);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьВыгрузку(Команда)
	
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОтображениеЭлементовФормы

&НаКлиентеНаСервереБезКонтекста
// Параметры:
//  Форма - см. РегистрСведений.СостоянияВыгрузкиВЦентрЭДО.Форма.ЗапускВыгрузки
Процедура НастроитьОтображениеПараметровВыгрузки(Форма)
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы,
		"ДатаВыгрузкиДокументов", "Доступность", Форма.ВыгружатьДокументыСДаты);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
