// @strict-types

#Область СлужебныйПрограммныйИнтерфейс

#Область РеализацияПрограммногоИнтерфейса

// См. СервисEDIКлиент.СоздатьЭТрН
Процедура СоздатьЭТрН(
	Знач Организация,
	Знач Контрагент,
	Знач Перевозчик,
	Знач ДокументОснования = Неопределено,
	Знач ФормаВладелец = Неопределено,
	Знач АдресХранилищаИнфоПолейЭТрН = Неопределено,
	Знач ПрикладныеДанныеЗаполнения = Неопределено,
	Знач Оповещение = Неопределено) Экспорт
	
	ПроверитьНаличиеПодсистемыБизнесСеть("СервисEDIСлужебныйКлиент.СоздатьЭТрН");
	
	ДополнительныеПараметры = НовыеПараметрыСозданияЭТрН();
	ДополнительныеПараметры.Организация                 = Организация;
	ДополнительныеПараметры.Контрагент                  = Контрагент;
	ДополнительныеПараметры.Перевозчик                  = Перевозчик;
	ДополнительныеПараметры.ДокументОснования           = ДокументОснования;
	ДополнительныеПараметры.ФормаВладелец               = ФормаВладелец;
	ДополнительныеПараметры.АдресХранилищаИнфоПолейЭТрН = АдресХранилищаИнфоПолейЭТрН;
	ДополнительныеПараметры.ПрикладныеДанныеЗаполнения = ПрикладныеДанныеЗаполнения;
	ДополнительныеПараметры.Оповещение                  = Оповещение;
	
	ВнутреннееОповещение = Новый ОписаниеОповещения(
		"СоздатьЭТрНПослеПодключенияБизнесСети", ЭтотОбъект, ДополнительныеПараметры);
	
	ОбщийМодульБизнесСетьСлужебныйКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("БизнесСетьСлужебныйКлиент");
	ОбщийМодульБизнесСетьСлужебныйКлиент.ПодготовитьОрганизациюКИспользованию(
		Организация, ФормаВладелец, ВнутреннееОповещение);
	
КонецПроцедуры

// См. СервисEDIКлиент.СоздатьЭЗЗ
Процедура СоздатьЭЗЗ(
	Знач Организация,
	Знач Контрагент,
	Знач ДокументОснования = Неопределено,
	Знач ПрикладныеДанныеЗаполнения = Неопределено,
	Знач ФормаВладелец = Неопределено,
	Знач Оповещение = Неопределено) Экспорт
	
	ДополнительныеПараметры = НовыеПараметрыСозданияЭЗЗ();
	ДополнительныеПараметры.Организация                 = Организация;
	ДополнительныеПараметры.Контрагент                  = Контрагент;
	ДополнительныеПараметры.ДокументОснования           = ДокументОснования;
	ДополнительныеПараметры.ФормаВладелец               = ФормаВладелец;
	ДополнительныеПараметры.Оповещение                  = Оповещение;
	ДополнительныеПараметры.ПрикладныеДанныеЗаполнения = ПрикладныеДанныеЗаполнения;
	
	ВнутреннееОповещение = Новый ОписаниеОповещения(
		"СоздатьЭЗЗПослеПодключенияБизнесСети", ЭтотОбъект, ДополнительныеПараметры);
	
	БизнесСетьСлужебныйКлиент.ПодготовитьОрганизациюКИспользованию(Организация, ФормаВладелец, ВнутреннееОповещение);
	
КонецПроцедуры

// См. СервисEDIКлиент.ПолучитьСообщения
Процедура ПолучитьСообщения(
	Знач ФормаВладелец = Неопределено, 
	Знач Оповещение = Неопределено, 
	Знач ПараметрыОжидания = Неопределено) Экспорт
	
	Если ПараметрыОжидания = Неопределено Тогда
		ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ФормаВладелец);
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Оповещение", Оповещение);
	
	ПромежуточноеОповещение = Новый ОписаниеОповещения(
		"ПродолжитьПолучениеСообщений", ЭтотОбъект, ДополнительныеПараметры);
	
	ДлительнаяОперация = СервисEDIВызовСервера.ЗапуститьПолучениеСообщений();
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ПромежуточноеОповещение, ПараметрыОжидания);
	
КонецПроцедуры

#КонецОбласти

#Область ИнтеграцияОбменСКонтрагентами

// Проверяет, является ли переданный ключ ключом обмена через сервис 1С:EDI
// 
// Параметры:
//  КлючНастроекЭДО - См. НастройкиЭДОКлиентСервер.НовыйКлючНастроекОтправки
// 
// Возвращаемое значение:
//  Булево - Истина, если это ключ настроек для обмена через сервис 1С:EDI.
//           Ложь, в ином случае.
Функция ЭтоКлючНастроекЧерезСервис1СEDI(Знач КлючНастроекЭДО) Экспорт
	Возврат СервисEDIВызовСервера.ЭтоКлючНастроекЧерезСервис1СEDI(КлючНастроекЭДО);
КонецФункции

// Ключ настроек обмена через сервис 1С:EDI
// 
// Возвращаемое значение:
//  Структура - Ключ настроек:
// * Организация  - ОпределяемыйТип.Организация             - Организация для настроек
//                - Неопределено                            - Не задана
// * Контрагент   - ОпределяемыйТип.УчастникЭДО             - Контрагент для настроек
//                - Неопределено                            - Не задан
// * Перевозчик   - ОпределяемыйТип.УчастникЭДО             - Перевозчик для настроек
//                - Неопределено                            - Не задан
// * Договор      - ОпределяемыйТип.ДоговорСКонтрагентомЭДО - Договор для настроек
//                - Неопределено                            - Не задан
// * ВидДокумента - СправочникСсылка.ВидыДокументовЭДО      - Вид документа ЭДО для настроек
Функция НовыйКлючНастроек() Экспорт
	
	Результат    = Новый Структура;
	ВидДокумента = ОбщегоНазначенияКлиент.ПредопределенныйЭлемент(
		"Справочник.ВидыДокументовЭДО.ПустаяСсылка"); // СправочникСсылка.ВидыДокументовЭДО
	
	Результат.Вставить("Организация"  , Неопределено);
	Результат.Вставить("Контрагент"   , Неопределено);
	Результат.Вставить("Перевозчик"   , Неопределено);
	Результат.Вставить("Договор"      , Неопределено);
	Результат.Вставить("ВидДокумента" , ВидДокумента);
	
	//@skip-check constructor-function-return-section - Особенность строгой типизации
	Возврат Результат;
	
КонецФункции

// Проверяет, требуется ли настройка обмена для сервиса 1С:EDI
// 
// Параметры:
//  КлючНастроек - См. СервисEDIСлужебныйКлиент.НовыйКлючНастроек
// 
// Возвращаемое значение:
//  Булево - Истина, если текущее состояние настроек с точки зрения сервиса 1С:EDI заполнено не полностью.
//           Ложь, в ином случае.
Функция ТребуетсяНастройкаОбмена(Знач КлючНастроек) Экспорт
	Возврат СервисEDIВызовСервера.ТребуетсяНастройкаОбмена(КлючНастроек);
КонецФункции

// Открыть форму настройки обмена через сервис 1С:EDI.
// 
// Параметры:
//  КлючНастроек  - См. СервисEDIСлужебныйКлиент.НовыйКлючНастроек
//  ФормаВладелец - ФормаКлиентскогоПриложения - Форма, из которой открывается форма настроек
//                - Неопределено               - Форма не задана
//  Оповещение    - ОписаниеОповещения         - Обработчик завершения настройки
//                - Неопределено               - Оповещать не требуется
Процедура ОткрытьФормуНастройкиОбменаЧерезСервис1СEDI(
	Знач КлючНастроек, 
	Знач ФормаВладелец = Неопределено,
	Знач Оповещение = Неопределено) Экспорт
	
	ПроверитьНаличиеПодсистемыБизнесСеть("СервисEDIСлужебныйКлиент.ОткрытьФормуНастройкиОбменаЧерезСервис1СEDI");
	
	ДополнительныеПараметры = НовыеПараметрыОткрытияФормыНастройкиОбмена();
	ДополнительныеПараметры.КлючНастроек      = КлючНастроек;
	ДополнительныеПараметры.ФормаВладелец     = ФормаВладелец;
	ДополнительныеПараметры.Оповещение        = Оповещение;
	
	ВнутреннееОповещение = Новый ОписаниеОповещения(
		"ОткрытьФормуНастройкиОбменаПослеПодключенияБизнесСети", ЭтотОбъект, ДополнительныеПараметры);
	
	ОбщийМодульБизнесСетьСлужебныйКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("БизнесСетьСлужебныйКлиент");
	ОбщийМодульБизнесСетьСлужебныйКлиент.ПодготовитьОрганизациюКИспользованию(
		КлючНастроек.Организация, ФормаВладелец, ВнутреннееОповещение);
	
КонецПроцедуры

// Проверяет, является ли способ обмена через сервис 1С:EDI
// 
// Параметры:
//  СпособОбмена - ПеречислениеСсылка.СпособыОбменаЭД - Способ обмена
// 
// Возвращаемое значение:
//  Булево - Истина, если это обмен через сервис 1С:EDI
Функция ЭтоОбменЧерезСервис1СEDI(Знач СпособОбмена) Экспорт
	Возврат СпособыОбмена().Найти(СпособОбмена) <> Неопределено;
КонецФункции

#КонецОбласти

#Область ДлительныеОперации

// Выполняет ДлительныеОперацииКлиент.ОжидатьЗавершение и обрабатывает результат с передачей обработки далее
// 
// Параметры:
//   ДлительнаяОперация     - см. ДлительныеОперации.ВыполнитьВФоне
//   ОповещениеОЗавершении  - ОписаниеОповещения - оповещение, которое вызывается после завершения
//                            длительной операции, в том числе после закрытия окна ожидания, если открывалось.
//                            Параметры процедуры-обработчика оповещения: 
//     # Результат          - Строка       - адрес результата во временном хранилище.
//                          - Неопределено - если задание было отменено
//     # ДополнительныеПараметры - Произвольный - произвольные данные, переданные в описании оповещения. 
//  ПараметрыОжидания      - см. ДлительныеОперацииКлиент.ПараметрыОжидания
//
Процедура ОжидатьЗавершение(
	Знач ДлительнаяОперация, 
	Знач ОповещениеОЗавершении = Неопределено, 
	Знач ПараметрыОжидания = Неопределено) Экспорт
	
	ОбработчикРезультата = Новый ОписаниеОповещения(
		"ПриЗавершенииДлительнойОперации", 
		ЭтотОбъект, 
		НовыеПараметрыОжиданияРезультата(ОповещениеОЗавершении));
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОбработчикРезультата, ПараметрыОжидания);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ДлительныеОперации

// Параметры:
//  ОповещениеОЗавершении - ОписаниеОповещения
//                        - Неопределено
// 
// Возвращаемое значение:
//  Структура:
// * ОповещениеОЗавершении - ОписаниеОповещения
//                         - Неопределено
Функция НовыеПараметрыОжиданияРезультата(Знач ОповещениеОЗавершении = Неопределено)
	
	Результат = Новый Структура;
	
	Результат.Вставить("ОповещениеОЗавершении", ОповещениеОЗавершении);
	
	Возврат Результат;
	
КонецФункции

// При завершении длительной операции.
// 
// Параметры:
//  РезультатВыполнения     - См. ДлительныеОперацииКлиент.НовыйРезультатДлительнойОперации
//                          - Неопределено
//  ДополнительныеПараметры - См. НовыеПараметрыОжиданияРезультата
Процедура ПриЗавершенииДлительнойОперации(РезультатВыполнения, ДополнительныеПараметры) Экспорт
	
	Если РезультатВыполнения = Неопределено Тогда
		// Задание было отменено
		ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ОповещениеОЗавершении, Неопределено);
		Возврат;
	КонецЕсли;
	
	Сообщения = РезультатВыполнения.Сообщения; // ФиксированныйМассив Из СообщениеПользователю
	
	Для Каждого Сообщение Из Сообщения Цикл
		Сообщение.Сообщить();
	КонецЦикла;
	
	Если РезультатВыполнения.Статус = "Ошибка" Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(РезультатВыполнения.ПодробноеПредставлениеОшибки);
		РезультатВыполнения.АдресРезультата = Неопределено;
	КонецЕсли;
	
	// Возвращаем управление вызывающему коду
	ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ОповещениеОЗавершении, РезультатВыполнения.АдресРезультата);
	
КонецПроцедуры

// Параметры:
//  РезультатВыполнения     - См. ДлительныеОперацииКлиент.НовыйРезультатДлительнойОперации
//  ДополнительныеПараметры - Структура - Дополнительные параметры:
//   * Оповещение - ОписаниеОповещения - Оповещение о завершении получения сообщений.
Процедура ПродолжитьПолучениеСообщений(Знач РезультатВыполнения, ДополнительныеПараметры) Экспорт
	
	Если РезультатВыполнения = Неопределено Тогда
		Возврат; // Задание было отменено пользователем
	КонецЕсли;
	
	ТранспортныеКонтейнеры = ПолучитьИзВременногоХранилища(
		РезультатВыполнения.АдресРезультата); // Массив Из ДокументСсылка.ТранспортныйКонтейнерЭДО
	
	ПараметрыВыполнения = ИнтерфейсДокументовЭДОКлиентСервер.НовыеПараметрыВыполненияДействийПоЭДО();
	ПараметрыВыполнения.ОбъектыДействий.ТранспортныеКонтейнеры = ТранспортныеКонтейнеры;
	
	ЭлектронныеДокументыЭДОКлиентСервер.ДобавитьДействие(
		ПараметрыВыполнения.НаборДействий, ПредопределенноеЗначение("Перечисление.ДействияПоЭДО.Загрузить"));
	
	ЭлектронныеДокументыЭДОКлиент.НачатьВыполнениеДействийПоЭДО(
		ДополнительныеПараметры.Оповещение, ПараметрыВыполнения);
	
КонецПроцедуры

#КонецОбласти

#Область СоздатьЭТрН

// Возвращаемое значение:
//  Структура:
// * Организация                 - ЛюбаяСсылка
//                               - Неопределено
// * Контрагент                  - ЛюбаяСсылка
//                               - Неопределено
// * Перевозчик                  - ЛюбаяСсылка
//                               - Неопределено                              
// * ДокументОснования           - ЛюбаяСсылка
//                               - Неопределено
// * ФормаВладелец               - ФормаКлиентскогоПриложения
//                               - Неопределено
// * АдресХранилищаИнфоПолейЭТрН - Строка
//                               - Неопределено
// * ПрикладныеДанныеЗаполнения  - Структура
//                               - Неопределено                              
// * Оповещение                  - ОписаниеОповещения
//                               - Неопределено
Функция НовыеПараметрыСозданияЭТрН()
	
	Результат = Новый Структура;
	
	Результат.Вставить("Организация"                , Неопределено);
	Результат.Вставить("Контрагент"                 , Неопределено);
	Результат.Вставить("Перевозчик"                 , Неопределено);
	Результат.Вставить("ДокументОснования"          , Неопределено);
	Результат.Вставить("ФормаВладелец"              , Неопределено);
	Результат.Вставить("АдресХранилищаИнфоПолейЭТрН", Неопределено);
	Результат.Вставить("ПрикладныеДанныеЗаполнения", Неопределено);
	Результат.Вставить("Оповещение"                 , Неопределено);
	
	Возврат Результат;
	
КонецФункции

// Возвращаемое значение:
//  Структура:
// * Организация                 - ЛюбаяСсылка
//                               - Неопределено
// * Контрагент                  - ЛюбаяСсылка
//                               - Неопределено
// * ДокументОснования           - ЛюбаяСсылка
//                               - Неопределено
// * ПрикладныеДанныеЗаполнения  - Структура
//                               - Неопределено                               
// * ФормаВладелец               - ФормаКлиентскогоПриложения
//                               - Неопределено
// * Оповещение                  - ОписаниеОповещения
//                               - Неопределено
Функция НовыеПараметрыСозданияЭЗЗ()
	
	Результат = Новый Структура;
	
	Результат.Вставить("Организация"                , Неопределено);
	Результат.Вставить("Контрагент"                 , Неопределено);
	Результат.Вставить("ДокументОснования"          , Неопределено);
	Результат.Вставить("ПрикладныеДанныеЗаполнения" , Неопределено);
	Результат.Вставить("ФормаВладелец"              , Неопределено);
	Результат.Вставить("Оповещение"                 , Неопределено);
	
	Возврат Результат;
	
КонецФункции

// Параметры:
//  ОрганизацияПодключена    - Булево
//  ДополнительныеПараметры - См. НовыеПараметрыСозданияЭТрН
Процедура СоздатьЭТрНПослеПодключенияБизнесСети(
	Знач ОрганизацияПодключена, 
	Знач ДополнительныеПараметры) Экспорт
	
	Если Не ОрганизацияПодключена Тогда
		Возврат;
	КонецЕсли;
	
	СервисEDIВызовСервера.ЗафиксироватьНастройкиЭТрН(
		ДополнительныеПараметры.Организация, 
		ДополнительныеПараметры.Контрагент);
	СервисEDIВызовСервера.ЗафиксироватьНастройкиЭТрН(
		ДополнительныеПараметры.Организация, 
		ДополнительныеПараметры.Перевозчик);	
	
	ДанныеЗаполнения = ОбменСГИСЭПДКлиент.НовыеДанныеЗаполненияЭТрН();
	
	ДанныеЗаполнения.Организация               = ДополнительныеПараметры.Организация;
	ДанныеЗаполнения.Грузоотправитель          = ДополнительныеПараметры.Организация;
	ДанныеЗаполнения.Грузополучатель           = ДополнительныеПараметры.Контрагент;
	ДанныеЗаполнения.Заказчик                  = ДополнительныеПараметры.Контрагент;
	ДанныеЗаполнения.Перевозчик                = ДополнительныеПараметры.Перевозчик;
	ДанныеЗаполнения.ДокументОснование         = ДополнительныеПараметры.ДокументОснования;
	ДанныеЗаполнения.ТаблицаИнформационныеПоля = ДополнительныеПараметры.АдресХранилищаИнфоПолейЭТрН;
	
	Если ЗначениеЗаполнено(ДополнительныеПараметры.ПрикладныеДанныеЗаполнения) Тогда
		ДанныеЗаполнения.ПрикладныеЗначенияЗаполнения = ДополнительныеПараметры.ПрикладныеДанныеЗаполнения;
	КонецЕсли;
	
	ОбменСГИСЭПДКлиент.СоздатьЭТрН(
		ДанныеЗаполнения, 
		ДополнительныеПараметры.ФормаВладелец, 
		ДополнительныеПараметры.Оповещение);
	
КонецПроцедуры

// Параметры:
//  ОрганизацияПодключена    - Булево
//  ДополнительныеПараметры - См. НовыеПараметрыСозданияЭЗЗ
Процедура СоздатьЭЗЗПослеПодключенияБизнесСети(
	Знач ОрганизацияПодключена, 
	Знач ДополнительныеПараметры) Экспорт
	
	Если Не ОрганизацияПодключена Тогда
		Возврат;
	КонецЕсли;
	
	СервисEDIВызовСервера.ЗафиксироватьНастройкиЭЗЗ(
		ДополнительныеПараметры.Организация, 
		ДополнительныеПараметры.Контрагент);
	
	ДанныеЗаполнения = ОбменСГИСЭПДКлиент.НовыеДанныеЗаполненияЭЗЗ();
	
	ДанныеЗаполнения.Организация       = ДополнительныеПараметры.Организация;
	ДанныеЗаполнения.Грузоотправитель  = ДополнительныеПараметры.Организация;
	ДанныеЗаполнения.Перевозчик        = ДополнительныеПараметры.Контрагент;
	ДанныеЗаполнения.ДокументОснование = ДополнительныеПараметры.ДокументОснования;
	
	Если ЗначениеЗаполнено(ДополнительныеПараметры.ПрикладныеДанныеЗаполнения) Тогда
		ДанныеЗаполнения.ПрикладныеЗначенияЗаполнения = ДополнительныеПараметры.ПрикладныеДанныеЗаполнения;
	КонецЕсли;
	
	ОбменСГИСЭПДКлиент.СоздатьЭЗЗ(
		ДанныеЗаполнения, 
		ДополнительныеПараметры.ФормаВладелец, 
		ДополнительныеПараметры.Оповещение);
	
КонецПроцедуры

#КонецОбласти

#Область ОткрытьФормуНастройкиОбменаЧерезСервис1СEDI

// Возвращаемое значение:
//  Структура:
// * КлючНастроек  - См. СервисEDIСлужебныйКлиент.НовыйКлючНастроек
//                 - Неопределено
// * ФормаВладелец - ФормаКлиентскогоПриложения
//                 - Неопределено
// * Оповещение    - ОписаниеОповещения
//                 - Неопределено
Функция НовыеПараметрыОткрытияФормыНастройкиОбмена()
	
	Результат = Новый Структура;
	
	Результат.Вставить("КлючНастроек"  , Неопределено);
	Результат.Вставить("ФормаВладелец" , Неопределено);
	Результат.Вставить("Оповещение"    , Неопределено);
	
	Возврат Результат;
	
КонецФункции

// Параметры:
//  ОрганизацияПодключена    - Булево
//  ДополнительныеПараметры - См. НовыеПараметрыОткрытияФормыНастройкиОбмена
Процедура ОткрытьФормуНастройкиОбменаПослеПодключенияБизнесСети(
	Знач ОрганизацияПодключена, 
	Знач ДополнительныеПараметры) Экспорт
	
	Если Не ОрганизацияПодключена Тогда
		Возврат;
	КонецЕсли;
	
	Если ДополнительныеПараметры.ФормаВладелец = Неопределено Тогда
		РежимОткрытия = РежимОткрытияОкнаФормы.Независимый;
	Иначе
		РежимОткрытия = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
	КонецЕсли;
	
	ОткрытьФорму(
		"ОбщаяФорма.ВводНастроекОтправкиЧерезСервис1СEDI",
		ДополнительныеПараметры.КлючНастроек,
		ДополнительныеПараметры.ФормаВладелец, , , , 
		ДополнительныеПараметры.Оповещение,
		РежимОткрытия);
	
КонецПроцедуры

#КонецОбласти

#Область Проверки

// Параметры:
//  Контекст - Строка
Процедура ПроверитьНаличиеПодсистемыБизнесСеть(Знач Контекст)
	
	ОбщегоНазначенияКлиентСервер.Проверить(
		ОбщегоНазначенияКлиент.ПодсистемаСуществует("ЭлектронноеВзаимодействие.БизнесСеть"),
		НСтр(
			"ru = 'Для отправки документов через сервис 1С:EDI требуется подсистема 1С:Бизнес-сеть'",
			ОбщегоНазначенияКлиент.КодОсновногоЯзыка()),
		Контекст);
	
КонецПроцедуры

#КонецОбласти

#Область Прочее

// Возвращаемое значение:
//  Массив Из ПеречислениеСсылка.СпособыОбменаЭД
Функция СпособыОбмена()
	
	Результат = Новый Массив; // Массив Из ПеречислениеСсылка.СпособыОбменаЭД
	
	Результат.Добавить(ПредопределенноеЗначение("Перечисление.СпособыОбменаЭД.Через1СБизнесСеть"));
	Результат.Добавить(ПредопределенноеЗначение("Перечисление.СпособыОбменаЭД.ЧерезСервис1СEDI"));
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецОбласти