#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ОбщегоНазначенияБЭД.ЭтоУдалениеНабораЗаписей(ЭтотОбъект, Замещение) Тогда
		Возврат;
	КонецЕсли;
	
	ОбщегоНазначенияБЭД.НормализоватьПустыеЗначенияСоставныхИзмеренийНабораЗаписей(ЭтотОбъект);
	
	Для Каждого Запись Из ЭтотОбъект Цикл
		ТипУчастникаЭДО = ИнтеграцияЭДОПовтИсп.ТипУчастникаЭДО(Запись.Отправитель);
		Если Не ТипУчастникаЭДО.ЭтоФизЛицо Тогда
			Продолжить;
		КонецЕсли;
		Запись.ИспользоватьУКД = Ложь;
		Запись.ИспользоватьУПД = Ложь;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли