#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Выполняет перенос данных и возвращает результаты переноса.
//
// Параметры:
//  Параметры		 - Структура - Параметры переноса данных, указанные в помощнике.
//  АдресХранилища	 - Строка - Адрес временного хранилища.
//
Процедура ВыполнитьПереносДанных(Параметры, АдресХранилища) Экспорт
	
	ОписаниеЗамера = ОценкаПроизводительности.НачатьЗамерДлительнойОперации("Обработка.ПомощникПереходаНаКомиссионныеПродажиВерсии25.ВыполнитьПереносДанных");
	
	ПараметрыОбработчика = ПараметрыОбработчика(Параметры, АдресХранилища);
	
	ПеренестиСоглашенияСКлиентами(ПараметрыОбработчика);
	ПеренестиДоговорыСКлиентами(ПараметрыОбработчика);
	ПеренестиОстаткиПереданныхТоваров(ПараметрыОбработчика);
	
	ПоместитьВоВременноеХранилище(ПараметрыОбработчика.РезультатыПереносаДанных, АдресХранилища);
	
	ОценкаПроизводительности.ЗакончитьЗамерДлительнойОперации(ОписаниеЗамера, ПараметрыОбработчика.РезультатыПереносаДанных.КоличествоДанных);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Возвращаемое значение:
//  Структура:
// * ПереходЗапущен - Булево
// * ДанныеОбработаны - Булево
// * ПереходЗавершен - Булево
// * СоглашенияОбработаны - Булево
// * ДоговорыОбработаны - Булево
// * ОстаткиОбработаны - Булево
//
Функция НовыйСтатусПереходаНаКомиссионныеПродажи25() Экспорт
	
	СостояниеПерехода = Новый Структура;
	СостояниеПерехода.Вставить("ПереходЗапущен", Ложь);
	СостояниеПерехода.Вставить("ДанныеОбработаны", Ложь);
	СостояниеПерехода.Вставить("ПереходЗавершен", Ложь);
	СостояниеПерехода.Вставить("СоглашенияОбработаны", Ложь);
	СостояниеПерехода.Вставить("ДоговорыОбработаны", Ложь);
	СостояниеПерехода.Вставить("ОстаткиОбработаны", Ложь);
	
	Возврат СостояниеПерехода;
	
КонецФункции

// Возвращает статус перехода на комиссионные продажи версии 2.5.
// 
// Возвращаемое значение:
//  см. НовыйСтатусПереходаНаКомиссионныеПродажи25
//
Функция СтатусПереходаНаКомиссионныеПродажи25() Экспорт
	
	СтатусПерехода = НовыйСтатусПереходаНаКомиссионныеПродажи25();
	
	Если КомиссионнаяТорговляСервер.ИспользуетсяТолькоКомиссионнаяПродажа25() Тогда
		СтатусПерехода.ПереходЗавершен = Истина;
		Возврат СтатусПерехода;
	КонецЕсли;
	
	ТекстЗапроса = 
		ТекстЗапросаСоглашенияСКлиентамиКПереносу()
		+ ОбщегоНазначения.РазделительПакетаЗапросов()
		+ ТекстЗапросаДоговорыСКлиентамиКПереносу()
		+ ОбщегоНазначения.РазделительПакетаЗапросов()
		+ ТекстЗапросаОстаткиКПереносу();
		
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("ХозяйственнаяОперация", Перечисления.ХозяйственныеОперации.ПередачаНаКомиссию);
	Запрос.УстановитьПараметр("СтатусСоглашения", Перечисления.СтатусыСоглашенийСКлиентами.Действует);
	Запрос.УстановитьПараметр("СтатусДоговора", Перечисления.СтатусыДоговоровКонтрагентов.Действует);
	
	Результаты = Запрос.ВыполнитьПакет();
	Соглашения = Результаты[2].Выгрузить();
	Договоры = Результаты[5].Выгрузить();
	Остатки = Результаты[10].Выгрузить();
	
	СтатусПерехода.СоглашенияОбработаны = (Соглашения.Количество() = 0);
	СтатусПерехода.ДоговорыОбработаны = (Договоры.Количество() = 0);
	СтатусПерехода.ОстаткиОбработаны = (Остатки.Количество() = 0);
	
	СтатусПерехода.ДанныеОбработаны = 
		СтатусПерехода.СоглашенияОбработаны
		И СтатусПерехода.ДоговорыОбработаны 
		И СтатусПерехода.ОстаткиОбработаны;
		
	Возврат СтатусПерехода;
	
КонецФункции

Процедура ЗавершитьПереходНаКомиссию25() Экспорт
	
	СоединенияЗаблокированы = СоединенияИБ.УстановленаБлокировкаСоединений();
	
	НачатьТранзакцию();
	
	Попытка
		
		ИнформацияОСоединениях = СоединенияИБ.ИнформацияОСоединениях();
		ТекстСообщенияБлокировки = ТекстПроверкиАктивныхСеансов();
		Если ИнформацияОСоединениях.НаличиеАктивныхСоединений Тогда
			ВызватьИсключение ТекстСообщенияБлокировки;
		КонецЕсли;
		
		Если Не СоединенияЗаблокированы Тогда
			
			БлокировкаУстановлена = СоединенияИБ.УстановитьБлокировкуСоединений(ТекстСообщенияБлокировки);
			Если Не БлокировкаУстановлена Тогда
				ТекстИсключения = НСтр("ru = 'Не удалось установить блокировку соединений информационной базы.'"); 
				ВызватьИсключение ТекстИсключения;
			КонецЕсли;
			
		КонецЕсли;
		
		Константы.ВыбиратьВерсиюКомиссионныхПродаж.Установить(Ложь);
		
		ОбновитьПовторноИспользуемыеЗначения();
		
		Если Не СоединенияЗаблокированы Тогда
			СоединенияИБ.РазрешитьРаботуПользователей();
		КонецЕсли;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		Если Не СоединенияЗаблокированы Тогда
			СоединенияИБ.РазрешитьРаботуПользователей();
		КонецЕсли;
		
		ВызватьИсключение;
		
	КонецПопытки;
	
КонецПроцедуры

Процедура СкорректироватьВерсиюКомиссии(Строка) Экспорт
	
	ПостфиксСхемыКомиссии20 = КомиссионнаяТорговляСервер.ПостфиксСхемыКомиссии20();
	Префикс = Лев(ПостфиксСхемыКомиссии20, СтрНайти(ПостфиксСхемыКомиссии20, "."));
	
	Строка = СтрЗаменить(Строка, "2.", Префикс);
	
КонецПроцедуры

// Возвращаемое значение:
//  Строка -
//
Функция ТекстПроверкиАктивныхСеансов() Экспорт
	
	ТекстСообщения = НСтр("ru = 'Для перехода на комиссионные продажи 2.5 необходимо закрыть все сеансы, кроме текущего.'");
	СкорректироватьВерсиюКомиссии(ТекстСообщения);
	
	Возврат ТекстСообщения;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПараметрыОбработчика(Параметры, АдресХранилища)

	ПараметрыОбработчика = Новый Структура;

	ПараметрыОбработчика.Вставить("АдресХранилища", АдресХранилища);
	ПараметрыОбработчика.Вставить("Параметры", Параметры);
	
	РезультатыПереносаДанных = Новый Структура;
	
	РезультатыПереносаДанных.Вставить("СозданоСоглашенийСКлиентами", 0);
	РезультатыПереносаДанных.Вставить("СозданоДоговоровСКлиентами", 0);
	РезультатыПереносаДанных.Вставить("СозданоДокументовВозвратОтКомиссионера", 0);
	РезультатыПереносаДанных.Вставить("СозданоДокументовПередачаКомиссионеру", 0);

	РезультатыПереносаДанных.Вставить("КоличествоДанных", 0);

	РезультатыПереносаДанных.Вставить("ОшибкиСоглашенияСКлиентами", 0);
	РезультатыПереносаДанных.Вставить("ОшибкиДоговорыСКлиентами", 0);
	РезультатыПереносаДанных.Вставить("ОшибкиДокументовВозвратОтКомиссионера", 0);
	РезультатыПереносаДанных.Вставить("ОшибкиДокументовПередачаКомиссионеру", 0);
	
	ПараметрыОбработчика.Вставить("РезультатыПереносаДанных", РезультатыПереносаДанных);
	
	Возврат ПараметрыОбработчика;
	
КонецФункции

Процедура ПеренестиСоглашенияСКлиентами(ПараметрыОбработчика)
	
	КоличествоСозданных = 0;
	КоличествоОшибочных = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапросаСоглашенияСКлиентамиКПереносу();
	
	Запрос.УстановитьПараметр("ХозяйственнаяОперация", Перечисления.ХозяйственныеОперации.ПередачаНаКомиссию);
	Запрос.УстановитьПараметр("СтатусСоглашения", Перечисления.СтатусыСоглашенийСКлиентами.Действует);
	
	Выборка = Запрос.Выполнить().Выбрать();

	Пока Выборка.Следующий() Цикл
	
		НачатьТранзакцию();
		
		Попытка
			
			Блокировка = Новый БлокировкаДанных();
			ЭлементБлокировки = Блокировка.Добавить("Справочник.СоглашенияСКлиентами");
			ЭлементБлокировки.УстановитьЗначение("Ссылка", Выборка.Ссылка20);
			Блокировка.Заблокировать();
			
			СтарыйОбъект = Выборка.Ссылка20.ПолучитьОбъект(); //СправочникОбъект.СоглашенияСКлиентами
			
			НовыйОбъект = СтарыйОбъект.Скопировать(); //СправочникОбъект.СоглашенияСКлиентами
			НовыйОбъект.КомиссионныеПродажи25 = Истина;
			ЗаполнитьКомментарий(НовыйОбъект.Комментарий);
			НовыйОбъект.Записать();
			
			СтарыйОбъект.Статус = Перечисления.СтатусыСоглашенийСКлиентами.Закрыто;
			СтарыйОбъект.Записать();
			
			КоличествоСозданных = КоличествоСозданных + 1;
			
			ЗафиксироватьТранзакцию();
			
		Исключение
			
			ОтменитьТранзакцию();
			
			КоличествоОшибочных = КоличествоОшибочных + 1;
			
			ПредставлениеОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ЗаписатьОшибкуСозданияОбъектаВЖурнал(ПараметрыОбработчика.Параметры.СобытиеЖурналаРегистрации, ПредставлениеОшибки, НСтр("ru = 'соглашение'"));
			
		КонецПопытки;
		
	КонецЦикла; 
	
	ПараметрыОбработчика.РезультатыПереносаДанных.СозданоСоглашенийСКлиентами = КоличествоСозданных;
	ПараметрыОбработчика.РезультатыПереносаДанных.ОшибкиСоглашенияСКлиентами = КоличествоОшибочных;
	ПараметрыОбработчика.РезультатыПереносаДанных.КоличествоДанных = 
		ПараметрыОбработчика.РезультатыПереносаДанных.КоличествоДанных
		+ КоличествоСозданных
		+ КоличествоОшибочных;
	
КонецПроцедуры

Процедура ПеренестиДоговорыСКлиентами(ПараметрыОбработчика)
	
	КоличествоСозданных = 0;
	КоличествоОшибочных = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапросаДоговорыСКлиентамиКПереносу();
	
	Запрос.УстановитьПараметр("ХозяйственнаяОперация", Перечисления.ХозяйственныеОперации.ПередачаНаКомиссию);
	Запрос.УстановитьПараметр("СтатусДоговора", Перечисления.СтатусыДоговоровКонтрагентов.Действует);
	
	Выборка = Запрос.Выполнить().Выбрать();

	Пока Выборка.Следующий() Цикл
	
		НачатьТранзакцию();
		
		Попытка
			
			Блокировка = Новый БлокировкаДанных();
			ЭлементБлокировки = Блокировка.Добавить("Справочник.ДоговорыКонтрагентов");
			ЭлементБлокировки.УстановитьЗначение("Ссылка", Выборка.Ссылка20);
			Блокировка.Заблокировать();
			
			СтарыйОбъект = Выборка.Ссылка20.ПолучитьОбъект(); // СправочникОбъект.ДоговорыКонтрагентов
			
			НовыйОбъект = СтарыйОбъект.Скопировать(); // СправочникОбъект.ДоговорыКонтрагентов
			НовыйОбъект.ОбъектРасчетов = Справочники.ОбъектыРасчетов.ПустаяСсылка();
			ЗаполнитьКомментарий(НовыйОбъект.Комментарий);
			НовыйОбъект.КомиссионныеПродажи25 = Истина;
			
			НовыйОбъект.Записать();
			
			СтарыйОбъект.Статус = Перечисления.СтатусыДоговоровКонтрагентов.Закрыт;
			СтарыйОбъект.Записать();
			
			КоличествоСозданных = КоличествоСозданных + 1;
			
			ЗафиксироватьТранзакцию();
			
		Исключение
			
			ОтменитьТранзакцию();
			
			КоличествоОшибочных = КоличествоОшибочных + 1;
			
			ПредставлениеОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ЗаписатьОшибкуСозданияОбъектаВЖурнал(ПараметрыОбработчика.Параметры.СобытиеЖурналаРегистрации, ПредставлениеОшибки, НСтр("ru = 'договор'"));
			
		КонецПопытки;
		
	КонецЦикла; 
	
	ПараметрыОбработчика.РезультатыПереносаДанных.СозданоДоговоровСКлиентами = КоличествоСозданных;
	ПараметрыОбработчика.РезультатыПереносаДанных.ОшибкиДоговорыСКлиентами = КоличествоОшибочных;
	ПараметрыОбработчика.РезультатыПереносаДанных.КоличествоДанных = 
		ПараметрыОбработчика.РезультатыПереносаДанных.КоличествоДанных
		+ КоличествоСозданных
		+ КоличествоОшибочных;
	
КонецПроцедуры

Процедура ПеренестиОстаткиПереданныхТоваров(ПараметрыОбработчика)
	
	КоличествоСозданныхВозвратов = 0;
	КоличествоОшибочныхВозвратов = 0;

	КоличествоСозданныхПередач = 0;
	КоличествоОшибочныхПередач = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		ТекстЗапросаСоглашенияСКлиентамиКПереносу(Истина)
		+ ОбщегоНазначения.РазделительПакетаЗапросов()
		+ ТекстЗапросаДоговорыСКлиентамиКПереносу(Истина)
		+ ОбщегоНазначения.РазделительПакетаЗапросов()
		+ ТекстЗапросаОстаткиКПереносу()
		+ ОбщегоНазначения.РазделительПакетаЗапросов()
		+ ТекстЗапросаДокументыРеализации();
	
	Запрос.УстановитьПараметр("ХозяйственнаяОперация", Перечисления.ХозяйственныеОперации.ПередачаНаКомиссию);
	Запрос.УстановитьПараметр("ХозяйственнаяОперацияВозврата", Перечисления.ХозяйственныеОперации.ВозвратОтКомиссионера);
	Запрос.УстановитьПараметр("СтатусДоговора", Перечисления.СтатусыДоговоровКонтрагентов.Действует);
	Запрос.УстановитьПараметр("СтатусСоглашения", Перечисления.СтатусыСоглашенийСКлиентами.Действует);
	
	Результаты = Запрос.ВыполнитьПакет();
	ТаблицаОстатков = Результаты[10].Выгрузить();
	ТаблицаРеализаций = Результаты[12].Выгрузить();
	
	СтрокаПоиска = "Соглашение, Организация, АналитикаУчетаНоменклатуры, ВидЗапасов, НомерГТД";
	
	ТаблицаВозвратов = Новый ТаблицаЗначений;
	ТаблицаВозвратов = ТаблицаОстатков.СкопироватьКолонки("Организация, АналитикаУчетаНоменклатуры, Номенклатура, Характеристика, 
		|ВидЗапасов, НомерГТД, Соглашение20, Соглашение25, Валюта, Договор20, Договор25, Количество, КоличествоПоРНПТ");
	ТаблицаВозвратов.Колонки.Добавить("Реализация", Новый ОписаниеТипов("ДокументСсылка.РеализацияТоваровУслуг"));
	
	ТаблицаОстатковБезРеализаций = Новый ТаблицаЗначений;
	ТаблицаОстатковБезРеализаций = ТаблицаОстатков.СкопироватьКолонки("Организация, Партнер, ПартнерПредставление, Соглашение20, Соглашение20Представление");
	
	Для каждого СтрокаОстаток Из ТаблицаОстатков Цикл
		
		СтруктураЗаполнения = Новый Структура(СтрокаПоиска);
		ЗаполнитьЗначенияСвойств(СтруктураЗаполнения, СтрокаОстаток);
		СтруктураЗаполнения.Вставить("Соглашение", СтрокаОстаток.Соглашение20);
		
		НайденныеРеализации = ТаблицаРеализаций.НайтиСтроки(СтруктураЗаполнения);
		Если НайденныеРеализации.Количество() = 0 Тогда
			НоваяСтрокаБезРеализации = ТаблицаОстатковБезРеализаций.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаБезРеализации, СтрокаОстаток);
			Продолжить;
		КонецЕсли;
		
		Пока СтрокаОстаток.Количество > 0 Цикл
		
			НоваяСтрока = ТаблицаВозвратов.Добавить();
			
			НоваяСтрока.Соглашение25 = СтрокаОстаток.Соглашение25;
			НоваяСтрока.Валюта = СтрокаОстаток.Валюта;
			НоваяСтрока.Договор20 = СтрокаОстаток.Договор20;
			НоваяСтрока.Договор25 = СтрокаОстаток.Договор25;
			
			НоваяСтрока.АналитикаУчетаНоменклатуры = НайденныеРеализации[0].АналитикаУчетаНоменклатуры;
			НоваяСтрока.Номенклатура = НайденныеРеализации[0].Номенклатура;
			НоваяСтрока.Характеристика = НайденныеРеализации[0].Характеристика;
			НоваяСтрока.ВидЗапасов = НайденныеРеализации[0].ВидЗапасов;
			НоваяСтрока.НомерГТД = НайденныеРеализации[0].НомерГТД;
			НоваяСтрока.Организация = НайденныеРеализации[0].Организация;
			НоваяСтрока.Соглашение20 = НайденныеРеализации[0].Соглашение;
			НоваяСтрока.Реализация = НайденныеРеализации[0].Регистратор;
			
			НоваяСтрока.Количество = Мин(НайденныеРеализации[0].Количество, НайденныеРеализации[0].КоличествоОстаток);
			НоваяСтрока.КоличествоПоРНПТ = Мин(НайденныеРеализации[0].КоличествоПоРНПТ, НайденныеРеализации[0].КоличествоПоРНПТОстаток);
			
			СтрокаОстаток.Количество = СтрокаОстаток.Количество - НоваяСтрока.Количество;
			СтрокаОстаток.КоличествоПоРНПТ = СтрокаОстаток.КоличествоПоРНПТ - НоваяСтрока.КоличествоПоРНПТ;
			
		КонецЦикла;
		
	КонецЦикла;
	
	СтрокаПоиска = "Реализация, Организация, Соглашение20, Соглашение25, Валюта, Договор20, Договор25";
	ТаблицаВозвратовСвернутая = ТаблицаВозвратов.Скопировать();
	ТаблицаВозвратовСвернутая.Свернуть(СтрокаПоиска);
	
	Для каждого СтрокаВозврата Из ТаблицаВозвратовСвернутая Цикл
		
		// формируем документ "Возврат товаров от комиссионера"
		
		СтруктураЗаполнения = Новый Структура();
		СтруктураЗаполнения.Вставить("ХозяйственнаяОперация", Перечисления.ХозяйственныеОперации.ВозвратОтКомиссионера);
		СтруктураЗаполнения.Вставить("Организация", СтрокаВозврата.Организация);
		СтруктураЗаполнения.Вставить("Соглашение", СтрокаВозврата.Соглашение20); 
		СтруктураЗаполнения.Вставить("ДокументРеализации", СтрокаВозврата.Реализация); 
		
		НовыйВозврат = Документы.ВозвратТоваровОтКлиента.СоздатьДокумент();
		НовыйВозврат.Дата = ТекущаяДатаСеанса();
		ЗаполнитьКомментарий(НовыйВозврат.Комментарий, Истина);
		
		ЗаполнитьВозврат(СтруктураЗаполнения, НовыйВозврат, ТаблицаВозвратов);
		
		// формируем документ "Передача товаров комиссионеру"
		
		НоваяПередача = Документы.ПередачаТоваровХранителю.СоздатьДокумент();
		НоваяПередача.Дата = НовыйВозврат.Дата + 1;
		НоваяПередача.Партнер = НовыйВозврат.Партнер;
		
		СтруктураЗаполнения = Новый Структура();
		
		СтруктураЗаполнения.Вставить("ХозяйственнаяОперация", Перечисления.ХозяйственныеОперации.ПередачаНаКомиссию);
		СтруктураЗаполнения.Вставить("Организация", НовыйВозврат.Организация);
		СтруктураЗаполнения.Вставить("Контрагент", НовыйВозврат.Контрагент);
		СтруктураЗаполнения.Вставить("Склад", НовыйВозврат.Склад);
		СтруктураЗаполнения.Вставить("Подразделение", НовыйВозврат.Подразделение);
		
		СтруктураЗаполнения.Вставить("Соглашение", СтрокаВозврата.Соглашение25);
		СтруктураЗаполнения.Вставить("Договор", СтрокаВозврата.Договор25);
		СтруктураЗаполнения.Вставить("Валюта", СтрокаВозврата.Валюта);
		
		ЗаполнитьЗначенияСвойств(НоваяПередача, СтруктураЗаполнения);
		НоваяПередача.Товары.Загрузить(НовыйВозврат.Товары.Выгрузить());
		
		НоваяПередача.Заполнить(СтруктураЗаполнения);
		
		ТребуетсяПровестиДокументы = НовыйВозврат.ПроверитьЗаполнение() 
			И НоваяПередача.ПроверитьЗаполнение();
			
		ТребуетсяЗаписатьДокументы = Ложь;
		
		Если ТребуетсяПровестиДокументы Тогда
			НачатьТранзакцию();
			Попытка
				НовыйВозврат.Записать(РежимЗаписиДокумента.Проведение);
				ДопСведения = НСтр("ru = ' по документу возврата №'") + НовыйВозврат.Номер;
				ЗаполнитьКомментарий(НоваяПередача.Комментарий, Истина, ДопСведения);
				НоваяПередача.Записать(РежимЗаписиДокумента.Проведение);
				КоличествоСозданныхВозвратов = КоличествоСозданныхВозвратов + 1;
				КоличествоСозданныхПередач = КоличествоСозданныхПередач + 1;
				ЗафиксироватьТранзакцию();
			Исключение
				ОтменитьТранзакцию();
				ТребуетсяЗаписатьДокументы = Истина;
				ПредставлениеОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			КонецПопытки;
		Иначе 
			ПредставлениеОшибки = НСтр("ru = 'В процессе проверки заполнения документов возникли ошибки'");
			ТребуетсяЗаписатьДокументы = Истина;
		КонецЕсли;
		
		Если ТребуетсяЗаписатьДокументы Тогда
			НачатьТранзакцию();
			Попытка
				НовыйВозврат.Записать(РежимЗаписиДокумента.Запись);
				ДопСведения = НСтр("ru = ' по документу возврата №'") + НовыйВозврат.Номер;
				ЗаполнитьКомментарий(НоваяПередача.Комментарий, Истина, ДопСведения);
				НоваяПередача.Записать(РежимЗаписиДокумента.Запись);
				ЗафиксироватьТранзакцию();
				ЗаписатьОшибкуПроведенияДокументаВЖурнал(ПараметрыОбработчика.Параметры.СобытиеЖурналаРегистрации, 
					ПредставлениеОшибки, НовыйВозврат.Ссылка, НоваяПередача.Ссылка);
			Исключение
				ОтменитьТранзакцию();
				ПредставлениеОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
				ЗаписатьОшибкуЗаписиДокументаВЖурнал(ПараметрыОбработчика.Параметры.СобытиеЖурналаРегистрации, ПредставлениеОшибки);
			КонецПопытки;
			КоличествоОшибочныхВозвратов = КоличествоОшибочныхВозвратов + 1;
			КоличествоОшибочныхПередач = КоличествоОшибочныхПередач + 1;
		КонецЕсли;
		
	КонецЦикла;
	
	ТаблицаОстатковБезРеализаций.Свернуть("Организация, Партнер, ПартнерПредставление, Соглашение20, Соглашение20Представление");
	Для каждого СтрокаБезРеализации Из ТаблицаОстатковБезРеализаций Цикл
		ЗаписатьОшибкуПоискаДокументаВЖурнал(ПараметрыОбработчика.Параметры.СобытиеЖурналаРегистрации, 
			СтрокаБезРеализации.ПартнерПредставление, СтрокаБезРеализации.Соглашение20Представление);
		КоличествоОшибочныхВозвратов = КоличествоОшибочныхВозвратов + 1;
		КоличествоОшибочныхПередач = КоличествоОшибочныхПередач + 1;
	КонецЦикла;
	
	ПараметрыОбработчика.РезультатыПереносаДанных.СозданоДокументовВозвратОтКомиссионера = КоличествоСозданныхВозвратов;
	ПараметрыОбработчика.РезультатыПереносаДанных.СозданоДокументовПередачаКомиссионеру = КоличествоСозданныхПередач;
	ПараметрыОбработчика.РезультатыПереносаДанных.ОшибкиДокументовВозвратОтКомиссионера = КоличествоОшибочныхВозвратов;
	ПараметрыОбработчика.РезультатыПереносаДанных.ОшибкиДокументовПередачаКомиссионеру = КоличествоОшибочныхПередач;
	ПараметрыОбработчика.РезультатыПереносаДанных.КоличествоДанных = 
		ПараметрыОбработчика.РезультатыПереносаДанных.КоличествоДанных
		+ КоличествоСозданныхВозвратов
		+ КоличествоСозданныхПередач
		+ КоличествоОшибочныхВозвратов
		+ КоличествоОшибочныхПередач;
	
КонецПроцедуры

Процедура ЗаполнитьВозврат(СтруктураЗаполнения, НовыйДокумент, ТаблицаВозвратов)
	
	СтруктураПоиска = Новый Структура;
	
	Если ТаблицаВозвратов.Количество() Тогда
		
		МассивУдаляемыхСтрок = Новый Массив();
		
		НовыйДокумент.Заполнить(СтруктураЗаполнения.ДокументРеализации);
		
		Для каждого СтрокаДокумента Из НовыйДокумент.Товары Цикл
			
			СтруктураПоиска = Новый Структура;
			СтруктураПоиска.Вставить("Организация", СтруктураЗаполнения.Организация);
			СтруктураПоиска.Вставить("Соглашение20", СтруктураЗаполнения.Соглашение);
			СтруктураПоиска.Вставить("Реализация", СтрокаДокумента.ДокументРеализации);
			СтруктураПоиска.Вставить("Номенклатура", СтрокаДокумента.Номенклатура);
			СтруктураПоиска.Вставить("Характеристика", СтрокаДокумента.Характеристика);
			
			НайденныеСтроки = ТаблицаВозвратов.НайтиСтроки(СтруктураПоиска);
			
			Если НайденныеСтроки.Количество() Тогда
				СтрокаДокумента.Количество = НайденныеСтроки[0].Количество;
				СтрокаДокумента.КоличествоПоРНПТ = НайденныеСтроки[0].КоличествоПоРНПТ;
				СтрокаДокумента.Упаковка = Справочники.УпаковкиЕдиницыИзмерения.ПустаяСсылка();
				СтрокаДокумента.КоличествоУпаковок = СтрокаДокумента.Количество;
				СтрокаДокумента.Сумма = СтрокаДокумента.Количество * СтрокаДокумента.Цена;
				СтрокаДокумента.СуммаНДС = ЦенообразованиеКлиентСервер.РассчитатьСуммуНДС(СтрокаДокумента.Сумма, СтрокаДокумента.СтавкаНДС, НовыйДокумент.ЦенаВключаетНДС);
				СтрокаДокумента.СуммаСНДС = ?(НовыйДокумент.ЦенаВключаетНДС, СтрокаДокумента.Сумма, СтрокаДокумента.Сумма+СтрокаДокумента.СуммаНДС);
			Иначе
				МассивУдаляемыхСтрок.Добавить(СтрокаДокумента);
			КонецЕсли;
		
		КонецЦикла;
		
		Для каждого ЭлементМассива Из МассивУдаляемыхСтрок Цикл
			НовыйДокумент.Товары.Удалить(ЭлементМассива);
		КонецЦикла;
		
		ПараметрыУказанияСерий = НоменклатураСервер.ПараметрыУказанияСерий(НовыйДокумент, Документы.ВозвратТоваровОтКлиента);
		НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(НовыйДокумент, ПараметрыУказанияСерий);
		
	КонецЕсли;
	
КонецПроцедуры

Функция ТекстЗапросаСоглашенияСКлиентамиКПереносу(ИгнорироватьИсходныйСтатус = Ложь)
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	СоглашенияСКлиентами.Ссылка КАК Ссылка,
	|	СоглашенияСКлиентами.Номер КАК Номер,
	|	СоглашенияСКлиентами.Дата КАК Дата,
	|	СоглашенияСКлиентами.Наименование КАК Наименование,
	|	СоглашенияСКлиентами.Типовое КАК Типовое,
	|	СоглашенияСКлиентами.Валюта КАК Валюта,
	|	СоглашенияСКлиентами.Организация КАК Организация,
	|	СоглашенияСКлиентами.Контрагент КАК Контрагент,
	|	СоглашенияСКлиентами.Партнер КАК Партнер
	|ПОМЕСТИТЬ ВТСоглашенияКомиссии20
	|ИЗ
	|	Справочник.СоглашенияСКлиентами КАК СоглашенияСКлиентами
	|ГДЕ
	|	СоглашенияСКлиентами.ХозяйственнаяОперация = &ХозяйственнаяОперация
	|	И НЕ СоглашенияСКлиентами.КомиссионныеПродажи25
	|	И &ИгнорироватьИсходныйСтатус
	|	И НЕ СоглашенияСКлиентами.ПометкаУдаления
	|	И НЕ СоглашенияСКлиентами.Предопределенный
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Наименование,
	|	Типовое,
	|	Валюта,
	|	Организация,
	|	Контрагент,
	|	Партнер
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СоглашенияСКлиентами.Ссылка КАК Ссылка,
	|	СоглашенияСКлиентами.Номер КАК Номер,
	|	СоглашенияСКлиентами.Дата КАК Дата,
	|	СоглашенияСКлиентами.Наименование КАК Наименование,
	|	СоглашенияСКлиентами.Типовое КАК Типовое,
	|	СоглашенияСКлиентами.Валюта КАК Валюта,
	|	СоглашенияСКлиентами.Организация КАК Организация,
	|	СоглашенияСКлиентами.Контрагент КАК Контрагент,
	|	СоглашенияСКлиентами.Партнер КАК Партнер
	|ПОМЕСТИТЬ ВТСоглашенияКомиссии25
	|ИЗ
	|	Справочник.СоглашенияСКлиентами КАК СоглашенияСКлиентами
	|ГДЕ
	|	СоглашенияСКлиентами.ХозяйственнаяОперация = &ХозяйственнаяОперация
	|	И СоглашенияСКлиентами.КомиссионныеПродажи25
	|	И СоглашенияСКлиентами.Статус = &СтатусСоглашения
	|	И НЕ СоглашенияСКлиентами.ПометкаУдаления
	|	И НЕ СоглашенияСКлиентами.Предопределенный
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Наименование,
	|	Типовое,
	|	Валюта,
	|	Организация,
	|	Контрагент,
	|	Партнер
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СоглашенияКомиссии20.Ссылка КАК Ссылка20
	|ИЗ
	|	ВТСоглашенияКомиссии20 КАК СоглашенияКомиссии20
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСоглашенияКомиссии25 КАК СоглашенияКомиссии25
	|		ПО СоглашенияКомиссии20.Наименование = СоглашенияКомиссии25.Наименование
	|			И СоглашенияКомиссии20.Организация = СоглашенияКомиссии25.Организация
	|			И СоглашенияКомиссии20.Номер = СоглашенияКомиссии25.Номер
	|			И СоглашенияКомиссии20.Дата = СоглашенияКомиссии25.Дата
	|			И СоглашенияКомиссии20.Контрагент = СоглашенияКомиссии25.Контрагент
	|			И СоглашенияКомиссии20.Партнер = СоглашенияКомиссии25.Партнер
	|			И СоглашенияКомиссии20.Типовое = СоглашенияКомиссии25.Типовое
	|			И СоглашенияКомиссии20.Валюта = СоглашенияКомиссии25.Валюта
	|
	|ГДЕ
	|	СоглашенияКомиссии25.Ссылка ЕСТЬ NULL"; 
	
	Если ИгнорироватьИсходныйСтатус Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ИгнорироватьИсходныйСтатус", "ИСТИНА");
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ИгнорироватьИсходныйСтатус", "СоглашенияСКлиентами.Статус = &СтатусСоглашения");
	КонецЕсли;
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаДоговорыСКлиентамиКПереносу(ИгнорироватьИсходныйСтатус = Ложь)
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ДоговорыКонтрагентов.Ссылка КАК Ссылка,
	|	ДоговорыКонтрагентов.Наименование КАК Наименование,
	|	ДоговорыКонтрагентов.Организация КАК Организация,
	|	ДоговорыКонтрагентов.Контрагент КАК Контрагент,
	|	ДоговорыКонтрагентов.Партнер КАК Партнер,
	|	ДоговорыКонтрагентов.Дата КАК Дата,
	|	ДоговорыКонтрагентов.Номер КАК Номер,
	|	ДоговорыКонтрагентов.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов
	|ПОМЕСТИТЬ ВТДоговорыСКомиссионерами20
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|ГДЕ
	|	НЕ ДоговорыКонтрагентов.ПометкаУдаления
	|	И &ИгнорироватьИсходныйСтатус
	|	И ДоговорыКонтрагентов.ХозяйственнаяОперация = &ХозяйственнаяОперация
	|	И НЕ ДоговорыКонтрагентов.КомиссионныеПродажи25
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Наименование,
	|	Организация,
	|	Контрагент,
	|	Партнер,
	|	Дата,
	|	Номер,
	|	ВалютаВзаиморасчетов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДоговорыКонтрагентов.Ссылка КАК Ссылка,
	|	ДоговорыКонтрагентов.Наименование КАК Наименование,
	|	ДоговорыКонтрагентов.Организация КАК Организация,
	|	ДоговорыКонтрагентов.Контрагент КАК Контрагент,
	|	ДоговорыКонтрагентов.Партнер КАК Партнер,
	|	ДоговорыКонтрагентов.Дата КАК Дата,
	|	ДоговорыКонтрагентов.Номер КАК Номер,
	|	ДоговорыКонтрагентов.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов
	|ПОМЕСТИТЬ ВТДоговорыСКомиссионерами25
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|ГДЕ
	|	НЕ ДоговорыКонтрагентов.ПометкаУдаления
	|	И ДоговорыКонтрагентов.Статус = &СтатусДоговора
	|	И ДоговорыКонтрагентов.ХозяйственнаяОперация = &ХозяйственнаяОперация
	|	И ДоговорыКонтрагентов.КомиссионныеПродажи25
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Наименование,
	|	Организация,
	|	Контрагент,
	|	Партнер,
	|	Дата,
	|	Номер,
	|	ВалютаВзаиморасчетов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДоговорыСКомиссионерами20.Ссылка КАК Ссылка20,
	|	ДоговорыСКомиссионерами25.Ссылка КАК Ссылка25,
	|	ДоговорыСКомиссионерами20.Организация КАК Организация,
	|	ДоговорыСКомиссионерами20.Партнер КАК Партнер,
	|	ДоговорыСКомиссионерами20.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов
	|ИЗ
	|	ВТДоговорыСКомиссионерами20 КАК ДоговорыСКомиссионерами20
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДоговорыСКомиссионерами25 КАК ДоговорыСКомиссионерами25
	|		ПО ДоговорыСКомиссионерами20.Наименование = ДоговорыСКомиссионерами25.Наименование
	|			И ДоговорыСКомиссионерами20.Организация = ДоговорыСКомиссионерами25.Организация
	|			И ДоговорыСКомиссионерами20.Контрагент = ДоговорыСКомиссионерами25.Контрагент
	|			И ДоговорыСКомиссионерами20.Партнер = ДоговорыСКомиссионерами25.Партнер
	|			И ДоговорыСКомиссионерами20.Дата = ДоговорыСКомиссионерами25.Дата
	|			И ДоговорыСКомиссионерами20.Номер = ДоговорыСКомиссионерами25.Номер
	|			И ДоговорыСКомиссионерами20.ВалютаВзаиморасчетов = ДоговорыСКомиссионерами25.ВалютаВзаиморасчетов
	|ГДЕ
	|	ДоговорыСКомиссионерами25.Ссылка ЕСТЬ NULL";
	
	Если ИгнорироватьИсходныйСтатус Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ИгнорироватьИсходныйСтатус", "ИСТИНА");
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ИгнорироватьИсходныйСтатус", "ДоговорыКонтрагентов.Статус = &СтатусДоговора");
	КонецЕсли;
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаОстаткиКПереносу()
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТоварыПереданные.Организация КАК Организация,
	|	ТоварыПереданные.АналитикаУчетаНоменклатуры.МестоХранения КАК Партнер,
	|	ТоварыПереданные.Соглашение КАК Соглашение,
	|	ТоварыПереданные.Соглашение.Валюта КАК Валюта,
	|	ТоварыПереданные.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	ТоварыПереданные.ВидЗапасов КАК ВидЗапасов,
	|	ТоварыПереданные.НомерГТД КАК НомерГТД,
	|	СУММА(ТоварыПереданные.КоличествоОстаток) КАК КоличествоОстаток,
	|	СУММА(ТоварыПереданные.КоличествоПоРНПТОстаток) КАК КоличествоПоРНПТОстаток
	|ПОМЕСТИТЬ ВТОстатки
	|ИЗ
	|	РегистрНакопления.ТоварыПереданныеНаКомиссию.Остатки(
	|			,
	|			АналитикаУчетаНоменклатуры.МестоХранения <> ЗНАЧЕНИЕ(Справочник.Партнеры.НашеПредприятие)
	|				И АналитикаУчетаНоменклатуры.ТипМестаХранения = ЗНАЧЕНИЕ(Перечисление.ТипыМестХранения.Партнер)) КАК ТоварыПереданные
	|
	|СГРУППИРОВАТЬ ПО
	|	ТоварыПереданные.Организация,
	|	ТоварыПереданные.АналитикаУчетаНоменклатуры.МестоХранения,
	|	ТоварыПереданные.Соглашение,
	|	ТоварыПереданные.Соглашение.Валюта,
	|	ТоварыПереданные.АналитикаУчетаНоменклатуры,
	|	ТоварыПереданные.ВидЗапасов,
	|	ТоварыПереданные.НомерГТД
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СоглашенияКомиссии20.Ссылка КАК Ссылка20,
	|	МАКСИМУМ(СоглашенияКомиссии25.Ссылка) КАК Ссылка25
	|ПОМЕСТИТЬ ВТСоглашения
	|ИЗ
	|	ВТСоглашенияКомиссии20 КАК СоглашенияКомиссии20
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСоглашенияКомиссии25 КАК СоглашенияКомиссии25
	|		ПО СоглашенияКомиссии20.Наименование = СоглашенияКомиссии25.Наименование
	|			И СоглашенияКомиссии20.Организация = СоглашенияКомиссии25.Организация
	|			И СоглашенияКомиссии20.Контрагент = СоглашенияКомиссии25.Контрагент
	|			И СоглашенияКомиссии20.Партнер = СоглашенияКомиссии25.Партнер
	|			И СоглашенияКомиссии20.Типовое = СоглашенияКомиссии25.Типовое
	|			И СоглашенияКомиссии20.Валюта = СоглашенияКомиссии25.Валюта
	|
	|СГРУППИРОВАТЬ ПО
	|	СоглашенияКомиссии20.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДоговорыСКомиссионерами20.Ссылка КАК Ссылка20,
	|	ДоговорыСКомиссионерами20.Организация КАК Организация,
	|	ДоговорыСКомиссионерами20.Партнер КАК Партнер,
	|	ДоговорыСКомиссионерами20.ВалютаВзаиморасчетов КАК Валюта,
	|	МАКСИМУМ(ДоговорыСКомиссионерами25.Ссылка) КАК Ссылка25
	|ПОМЕСТИТЬ ВТДоговоры
	|ИЗ
	|	ВТДоговорыСКомиссионерами20 КАК ДоговорыСКомиссионерами20
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДоговорыСКомиссионерами25 КАК ДоговорыСКомиссионерами25
	|		ПО ДоговорыСКомиссионерами20.Наименование = ДоговорыСКомиссионерами25.Наименование
	|			И ДоговорыСКомиссионерами20.Организация = ДоговорыСКомиссионерами25.Организация
	|			И ДоговорыСКомиссионерами20.Контрагент = ДоговорыСКомиссионерами25.Контрагент
	|			И ДоговорыСКомиссионерами20.Партнер = ДоговорыСКомиссионерами25.Партнер
	|			И ДоговорыСКомиссионерами20.Дата = ДоговорыСКомиссионерами25.Дата
	|			И ДоговорыСКомиссионерами20.Номер = ДоговорыСКомиссионерами25.Номер
	|			И ДоговорыСКомиссионерами20.ВалютаВзаиморасчетов = ДоговорыСКомиссионерами25.ВалютаВзаиморасчетов
	|
	|СГРУППИРОВАТЬ ПО
	|	ДоговорыСКомиссионерами20.Ссылка,
	|	ДоговорыСКомиссионерами20.Организация,
	|	ДоговорыСКомиссионерами20.ВалютаВзаиморасчетов,
	|	ДоговорыСКомиссионерами20.Партнер
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТДоговоры.Организация КАК Организация,
	|	ВТДоговоры.Партнер КАК Партнер,
	|	ВТДоговоры.Валюта КАК Валюта,
	|	МАКСИМУМ(ВТДоговоры.Ссылка20) КАК Ссылка
	|ПОМЕСТИТЬ ВТДоговорыУникальные20
	|ИЗ
	|	ВТДоговоры КАК ВТДоговоры
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТДоговоры.Организация,
	|	ВТДоговоры.Партнер,
	|	ВТДоговоры.Валюта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТОстатки.Организация КАК Организация,
	|	ВТОстатки.Партнер КАК Партнер,
	|	ВТОстатки.Партнер.Представление КАК ПартнерПредставление,
	|	ВТОстатки.Валюта КАК Валюта,
	|	ДоговорыКонтрагентов.Контрагент КАК Контрагент,
	|	ВТОстатки.Соглашение КАК Соглашение20,
	|	ВТОстатки.Соглашение.Представление КАК Соглашение20Представление,
	|	ВТСоглашения.Ссылка25 КАК Соглашение25,
	|	ВТДоговорыУникальные20.Ссылка КАК Договор20,
	|	ВТДоговоры.Ссылка25 КАК Договор25,
	|	ВТОстатки.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	ВТОстатки.АналитикаУчетаНоменклатуры.Номенклатура КАК Номенклатура,
	|	ВТОстатки.АналитикаУчетаНоменклатуры.Характеристика КАК Характеристика,
	|	ВТОстатки.ВидЗапасов КАК ВидЗапасов,
	|	ВТОстатки.НомерГТД КАК НомерГТД,
	|	ВТОстатки.КоличествоОстаток КАК Количество,
	|	ВТОстатки.КоличествоПоРНПТОстаток КАК КоличествоПоРНПТ
	|ИЗ
	|	ВТОстатки КАК ВТОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСоглашения КАК ВТСоглашения
	|		ПО ВТОстатки.Соглашение = ВТСоглашения.Ссылка20
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДоговорыУникальные20 КАК ВТДоговорыУникальные20
	|		ПО ВТОстатки.Организация = ВТДоговорыУникальные20.Организация
	|			И ВТОстатки.Партнер = ВТДоговорыУникальные20.Партнер
	|			И ВТОстатки.Валюта = ВТДоговорыУникальные20.Валюта
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДоговоры КАК ВТДоговоры
	|		ПО (ВТДоговорыУникальные20.Ссылка = ВТДоговоры.Ссылка20)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ПО (ВТДоговорыУникальные20.Ссылка = ДоговорыКонтрагентов.Ссылка)";
		
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаДокументыРеализации()
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ТоварыПереданные.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	ТоварыПереданные.Соглашение КАК Соглашение,
	|	ТоварыПереданные.Организация КАК Организация,
	|	ТоварыПереданные.ВидЗапасов КАК ВидЗапасов,
	|	ТоварыПереданные.НомерГТД КАК НомерГТД,
	|	ТоварыПереданные.КоличествоОстаток КАК КоличествоОстаток,
	|	ТоварыПереданные.КоличествоПоРНПТОстаток КАК КоличествоПоРНПТОстаток
	|ПОМЕСТИТЬ ТоварыПереданные
	|ИЗ
	|	РегистрНакопления.ТоварыПереданныеНаКомиссию.Остатки(
	|			,
	|			АналитикаУчетаНоменклатуры.МестоХранения <> ЗНАЧЕНИЕ(Справочник.Партнеры.НашеПредприятие)
	|				И АналитикаУчетаНоменклатуры.ТипМестаХранения = ЗНАЧЕНИЕ(Перечисление.ТипыМестХранения.Партнер)) КАК ТоварыПереданные
	|ГДЕ
	|	ТоварыПереданные.КоличествоОстаток > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыПереданные.Соглашение КАК Соглашение,
	|	ТоварыПереданные.Организация КАК Организация,
	|	ТоварыПереданные.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	ТоварыПереданные.АналитикаУчетаНоменклатуры.Номенклатура КАК Номенклатура,
	|	ТоварыПереданные.АналитикаУчетаНоменклатуры.Характеристика КАК Характеристика,
	|	ТоварыПереданные.ВидЗапасов КАК ВидЗапасов,
	|	ТоварыПереданные.НомерГТД КАК НомерГТД,
	|	ТоварыПереданные.КоличествоОстаток КАК КоличествоОстаток,
	|	ТоварыПереданные.КоличествоПоРНПТОстаток КАК КоличествоПоРНПТОстаток,
	|	ТоварыПереданныеДвижения.Регистратор КАК Регистратор,
	|	(ТоварыПереданныеДвижения.Количество - ЕСТЬNULL(ТоварыПереданныеДвиженияВозвратов.Количество,0)) КАК Количество,
	|	(ТоварыПереданныеДвижения.КоличествоПоРНПТ - ЕСТЬNULL(ТоварыПереданныеДвиженияВозвратов.КоличествоПоРНПТ,0)) КАК КоличествоПоРНПТ
	|ИЗ
	|	ТоварыПереданные КАК ТоварыПереданные
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыПереданныеНаКомиссию КАК ТоварыПереданныеДвижения
	|		ПО ТоварыПереданные.АналитикаУчетаНоменклатуры = ТоварыПереданныеДвижения.АналитикаУчетаНоменклатуры
	|			И ТоварыПереданные.Соглашение = ТоварыПереданныеДвижения.Соглашение
	|			И ТоварыПереданные.Организация = ТоварыПереданныеДвижения.Организация
	|			И ТоварыПереданные.ВидЗапасов = ТоварыПереданныеДвижения.ВидЗапасов
	|			И ТоварыПереданные.НомерГТД = ТоварыПереданныеДвижения.НомерГТД
	|			И (ТоварыПереданныеДвижения.ХозяйственнаяОперация = &ХозяйственнаяОперация)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыПереданныеНаКомиссию КАК ТоварыПереданныеДвиженияВозвратов
	|		ПО ТоварыПереданные.АналитикаУчетаНоменклатуры = ТоварыПереданныеДвиженияВозвратов.АналитикаУчетаНоменклатуры
	|			И (ТоварыПереданныеДвиженияВозвратов.ХозяйственнаяОперация = &ХозяйственнаяОперацияВозврата)
	|			И (ТоварыПереданныеДвиженияВозвратов.Регистратор.ДокументРеализации = ТоварыПереданныеДвижения.Регистратор)
	|			И (ТоварыПереданныеДвиженияВозвратов.ВидЗапасов = ТоварыПереданныеДвижения.ВидЗапасов)
	|			И (ТоварыПереданныеДвиженияВозвратов.НомерГТД = ТоварыПереданныеДвижения.НомерГТД)
	|ГДЕ
	|	(ТоварыПереданныеДвижения.Количество - ЕСТЬNULL(ТоварыПереданныеДвиженияВозвратов.Количество,0)) > 0
	|УПОРЯДОЧИТЬ ПО ТоварыПереданныеДвижения.Регистратор.Дата УБЫВ";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Процедура ЗаписатьОшибкуСозданияОбъектаВЖурнал(СобытиеЖурналаРегистрации, ПредставлениеОшибки, ПредставлениеЭлемента)
	
	ШаблонСообщения = НСтр("ru = 'Не удалось скопировать %1 по причине:
								 |%2'");
	
	ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		ШаблонСообщения,
		ПредставлениеЭлемента,
		ПредставлениеОшибки);
	
	ЗаписьЖурналаРегистрации(
		СобытиеЖурналаРегистрации,
		УровеньЖурналаРегистрации.Ошибка,
		,
		,
		ТекстСообщения);
	
КонецПроцедуры

Процедура ЗаписатьОшибкуПроведенияДокументаВЖурнал(СобытиеЖурналаРегистрации, ПредставлениеОшибки, Элемент1, Элемент2)
	
	ШаблонСообщения = НСтр("ru = 'Не удалось провести пару документов возврата (%1) и передачи (%2) по причине:
								 |%3.
								 |Необходимо вручную провести документы, устранив ошибки.'");
	
	ПредставлениеЭлемента1 = ОбщегоНазначения.ПредметСтрокой(Элемент1);
	ПредставлениеЭлемента2 = ОбщегоНазначения.ПредметСтрокой(Элемент2);
	
	ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		ШаблонСообщения,
		ПредставлениеЭлемента1,
		ПредставлениеЭлемента2,
		ПредставлениеОшибки);
	
	ЗаписьЖурналаРегистрации(
		СобытиеЖурналаРегистрации,
		УровеньЖурналаРегистрации.Ошибка,
		,
		,
		ТекстСообщения);
	
КонецПроцедуры

Процедура ЗаписатьОшибкуЗаписиДокументаВЖурнал(СобытиеЖурналаРегистрации, ПредставлениеОшибки)
	
	ШаблонСообщения = НСтр("ru = 'Не удалось записать пару документов по причине:
								 |%1.
								 |Неперенесенные остатки необходимо отразить вручную.'");
	
	ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		ШаблонСообщения,
		ПредставлениеОшибки);
	
	ЗаписьЖурналаРегистрации(
		СобытиеЖурналаРегистрации,
		УровеньЖурналаРегистрации.Ошибка,
		,
		,
		ТекстСообщения);
	
КонецПроцедуры

Процедура ЗаписатьОшибкуПоискаДокументаВЖурнал(СобытиеЖурналаРегистрации, ПартнерПредставление, СоглашениеПредставление)
	
	ШаблонСообщения = НСтр("ru = 'Не удалось найти документ реализации для формирования возврата от %1 по соглашению %2.
								 |Необходимо отразить возврат и передачу вручную.'");
	
	ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		ШаблонСообщения,
		ПартнерПредставление,
		СоглашениеПредставление);
	
	ЗаписьЖурналаРегистрации(
		СобытиеЖурналаРегистрации,
		УровеньЖурналаРегистрации.Ошибка,
		,
		,
		ТекстСообщения);
	
КонецПроцедуры

Процедура ЗаполнитьКомментарий(Комментарий, Очищать = Ложь, ДопСведения = "")
	
	Если ЗначениеЗаполнено(Комментарий) И Не Очищать Тогда
		Комментарий = Комментарий + Символы.ПС;
	КонецЕсли;
	
	Комментарий = Комментарий + НСтр("ru = '[Объект создан помощником перехода%1]'");
	
	Комментарий = СтрШаблон(Комментарий, ДопСведения);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли