// @strict-types

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбновлениеКонфигурации

// См. ОбновлениеИнформационнойБазыБСП.ПриДобавленииОбработчиковОбновления.
Процедура ПриДобавленииОбработчиковОбновления(Обработчики) Экспорт
	РегистрыСведений.СведенияОФайлахСообщенийЭДО.ПриДобавленииОбработчиковОбновления(Обработчики);
КонецПроцедуры

#КонецОбласти

#Область РеализацияПрограммногоИнтерфейса

// См. СервисEDI.ПолучитьСообщения 
Функция ПолучитьСообщения() Экспорт
	
	РезультатПолученияДокументов = СинхронизацияЭДОСлужебный.НовыйРезультатПолученияДокументов();
	КлючиСинхронизации           = СинхронизацияЭДОКлиентСервер.НовыеКлючиСинхронизации();
	КонтекстДиагностики          = ОбработкаНеисправностейБЭД.НовыйКонтекстДиагностики();
	РезультатыОтправкиПолучения  = ЭлектронныеДокументыЭДОКлиентСервер.НовыеРезультатыОтправкиПолучения();
	
	ПолучитьНовыеЭлектронныеДокументыЧерезСервис1СEDI(
		РезультатПолученияДокументов, 
		КлючиСинхронизации, 
		КонтекстДиагностики,
		РезультатыОтправкиПолучения);
	
	РаспаковатьКонтейнеры(РезультатПолученияДокументов.Контейнеры);
	
	Возврат РезультатПолученияДокументов.Контейнеры;
	
КонецФункции

#КонецОбласти

#Область ИнтеграцияОбменСКонтрагентами

// Отправляет транспортный контейнер через сервис 1С:EDI.
// 
// Параметры:
//  ПараметрыОтправки   - См. СинхронизацияЭДОСлужебный.НовыеПараметрыОтправкиТранспортногоКонтейнера
//  КонтекстДиагностики - См. ОбработкаНеисправностейБЭД.НовыйКонтекстДиагностики
// 
// Возвращаемое значение:
//  См. СинхронизацияЭДОСлужебный.НовыйРезультатОтправкиТранспортногоКонтейнера
Функция ОтправитьКонтейнер(Знач ПараметрыОтправки, КонтекстДиагностики) Экспорт
	
	Результат = СинхронизацияЭДОСлужебный.НовыйРезультатОтправкиТранспортногоКонтейнера();
	
	РезультатВыполнения = ОтправитьСообщение(ПараметрыОтправки);
	
	Если РезультатВыполнения.Отказ Тогда
		Ошибка = СинхронизацияЭДО.НоваяОшибкаПередачи();
		Ошибка.Код = КодОшибкиТранспорта();
		Ошибка.Блокирующая = Истина;
		Ошибка.Описание    = РезультатВыполнения.ТекстОшибки;
		
		Результат.Успех          = Ложь;
		Результат.ОшибкаПередачи = Ошибка;
		
		ВидОперации = НСтр(
			"ru = 'Отправка транспортного контейнера ЭДО через сервис 1С:EDI'",
			ОбщегоНазначения.КодОсновногоЯзыка());
		
		ТекстСообщения = 
			СтрШаблон(
				НСтр(
					"ru = 'Не удалось отправить сообщение через сервис 1С:EDI по причине: %1'",
					ОбщегоНазначения.КодОсновногоЯзыка()),
				РезультатВыполнения.ТекстОшибки);
		Ошибка = ОбработкаНеисправностейБЭД.НоваяОшибка(
			ВидОперации,
			ОбработкаНеисправностейБЭДКлиентСервер.ВидОшибкиНеизвестнаяОшибка(), 
			ТекстСообщения, 
			ТекстСообщения);
		ОбработкаНеисправностейБЭД.ДобавитьОшибку(КонтекстДиагностики, Ошибка,
			ОбщегоНазначенияБЭДКлиентСервер.ПодсистемыБЭД().ОбменСКонтрагентами);
	Иначе
		Результат.Успех = Истина;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Проверяет, является ли способ обмена через сервис 1С:EDI
// 
// Параметры:
//  СпособОбмена - ПеречислениеСсылка.СпособыОбменаЭД - Способ обмена
// 
// Возвращаемое значение:
//  Булево - Истина, если это обмен через сервис 1С:EDI
Функция ЭтоОбменЧерезСервис1СEDI(Знач СпособОбмена) Экспорт
	Возврат СпособыОбмена().Найти(СпособОбмена) <> Неопределено;
КонецФункции

// Возвращает способы обмена ЭД через сервис 1С:EDI
// 
// Возвращаемое значение:
//  Массив Из ПеречислениеСсылка.СпособыОбменаЭД - Способы обмена через сервис 1С:EDI
Функция СпособыОбмена() Экспорт
	
	Результат = Новый Массив; // Массив Из ПеречислениеСсылка.СпособыОбменаЭД
	
	Результат.Добавить(Перечисления.СпособыОбменаЭД.Через1СБизнесСеть);
	Результат.Добавить(Перечисления.СпособыОбменаЭД.ЧерезСервис1СEDI);
	
	Возврат Результат;
	
КонецФункции

// Получить новые электронные документы от оператора ЭДО.
//
// Параметры:
//  РезультатПолученияДокументов - См. СинхронизацияЭДОСлужебный.НовыйРезультатПолученияДокументов
//  КлючиСинхронизации           - См. СинхронизацияЭДОКлиентСервер.НовыеКлючиСинхронизации
//  КонтекстДиагностики          - См. ОбработкаНеисправностейБЭД.НовыйКонтекстДиагностики
//  РезультатыОтправкиПолучения  - См. ЭлектронныеДокументыЭДОКлиентСервер.НовыеРезультатыОтправкиПолучения
Процедура ПолучитьНовыеЭлектронныеДокументыЧерезСервис1СEDI(
	РезультатПолученияДокументов,
	КлючиСинхронизации, 
	КонтекстДиагностики, 
	РезультатыОтправкиПолучения) Экспорт
	
	Контекст      = "СервисEDIСлужебный.ПолучитьНовыеЭлектронныеДокументыЧерезСервис1СEDI";
	УчетныеЗаписи = УчетныеЗаписи();
	
	ПроверитьОтсутствиеТранзакции(Контекст);
	
	Для Каждого УчетнаяЗапись Из УчетныеЗаписи Цикл
		Попытка
			ПолучитьДокументыПоОрганизации(РезультатПолученияДокументов, УчетнаяЗапись);
		Исключение
			ТекстОшибки = ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
			Операция = НСтр("ru = 'Получение электронных документов через сервис 1С:EDI'");
			ПодробноеПредставлениеОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ОбработкаНеисправностейБЭД.ОбработатьОшибку(
				Операция, ОбщегоНазначенияБЭДКлиентСервер.ПодсистемыБЭД().ОбменСКонтрагентами,
				ПодробноеПредставлениеОшибки, ТекстОшибки);
			Продолжить; // Не прерываем обработку других учетных записей
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры

// Проверяет, является ли переданный ключ ключом обмена через сервис 1С:EDI
// 
// Параметры:
//  КлючНастроекЭДО - См. НастройкиЭДОКлиентСервер.НовыйКлючНастроекОтправки
// 
// Возвращаемое значение:
//  Булево - Истина, если это ключ настроек для обмена через сервис 1С:EDI.
//           Ложь, в ином случае.
Функция ЭтоКлючНастроекЧерезСервис1СEDI(Знач КлючНастроекЭДО) Экспорт
	
	НастройкиОтправки = НастройкиЭДО.НастройкиОтправки(КлючНастроекЭДО);
	
	Если НастройкиОтправки = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат ЭтоОбменЧерезСервис1СEDI(НастройкиОтправки.СпособОбмена);
	
КонецФункции

// Проверяет, является ли код ошибки кодом ошибки транспорта через сервис 1С:EDI
// 
// Параметры:
//  КодОшибки - Строка - Проверяемый код ошибки
// 
// Возвращаемое значение:
//  Булево - Истина, если это ошибка транспорта через сервис 1С:EDI
Функция ЭтоКодОшибкиТранспорта(Знач КодОшибки) Экспорт
	Возврат КодОшибки = КодОшибкиТранспорта();
КонецФункции

// Параметры:
//  СообщениеОбъект - ДокументОбъект.СообщениеЭДО
//  ОписаниеСообщения - см. ЭлектронныеДокументыЭДО.НовоеОписаниеСообщения
//  НастройкиДокумента - Структура:
//  * ТипДокумента           - ПеречислениеСсылка.ТипыДокументовЭДО
//  * ТипРегламента          - ПеречислениеСсылка.ТипыРегламентовЭДО
//  * ТребуетсяПодтверждение - Булево
//  * ОбменБезПодписи        - Булево
//  * СпособОбмена           - ПеречислениеСсылка.СпособыОбменаЭД
Процедура ЗафиксироватьСведенияОФайлахСообщенийЭДО(
	Знач СообщениеОбъект, 
	Знач ОписаниеСообщения, 
	Знач НастройкиДокумента) Экспорт
	
	ИдентификаторДокументооборота = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
		СообщениеОбъект.ЭлектронныйДокумент, "ИдентификаторДокументооборота");
	ИмяФайла = ОписаниеСообщения.Данные.Документ.ИмяФайла; 
	СтруктураИмениФайла = ОбщегоНазначенияКлиентСервер.РазложитьПолноеИмяФайла(ИмяФайла);
	
	Сведения = РегистрыСведений.СведенияОФайлахСообщенийЭДО.НовыеСведенияОСообщении();
	
	Сведения.ФайлСообщенияЭДО              = СообщениеОбъект.ОсновнойФайл;
	Сведения.ИдентификаторДокументооборота = ИдентификаторДокументооборота;
	//@skip-check property-return-type
	//@skip-check statement-type-change
	Сведения.ИмяФайла                      = СтруктураИмениФайла.ИмяБезРасширения; // Строка
	
	РегистрыСведений.СведенияОФайлахСообщенийЭДО.Зафиксировать(Сведения);
	
КонецПроцедуры

// Параметры:
//  ОписаниеКонтейнера - См. ТранспортныеКонтейнерыЭДО.РаспаковатьФайлКонтейнера
Процедура ВыполнитьПоискИдентификаторовДокументооборотаПоИмениФайла(ОписаниеКонтейнера) Экспорт
	
	ДокументыКонтейнера = ОбщегоНазначенияБЭД.ЗначениеПоПути(
		ОписаниеКонтейнера, 
		"Метаданные.Документы"); // Массив из См. ТранспортныеКонтейнерыЭДО.НовоеОписаниеДокументаКонтейнера
		
	Если ДокументыКонтейнера = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ДокументКонтейнера Из ДокументыКонтейнера Цикл
		ВыполнитьПоискИдентификаторовДокументооборотаДокументаПоИмениФайла(ДокументКонтейнера);
	КонецЦикла;
	
КонецПроцедуры

// Параметры:
//  ТаблицаНастроек - ТаблицаЗначений:
//   * СпособОбменаЭД - ПеречислениеСсылка.СпособыОбменаЭД
//   * Формировать    - Булево
Процедура ПриЗаполненииНастроекОтправкиЭлектронныхДокументовПоВидам(ТаблицаНастроек) Экспорт 
	
	СпособыОбменаЭД = ТаблицаНастроек.ВыгрузитьКолонку("СпособОбменаЭД");
	СпособыОбменаЭД = ОбщегоНазначенияКлиентСервер.СвернутьМассив(СпособыОбменаЭД);
	
	Индекс = СпособыОбменаЭД.Найти(Перечисления.СпособыОбменаЭД.ПустаяСсылка());
	
	Если Индекс <> Неопределено Тогда
		СпособыОбменаЭД.Удалить(Индекс);
	КонецЕсли;
	
	Если СпособыОбменаЭД.Количество() = 1
		И СпособыОбменаЭД[0] = СпособОбмена() Тогда
			
		Отбор = Новый Структура;
		Отбор.Вставить("СпособОбменаЭД", Перечисления.СпособыОбменаЭД.ПустаяСсылка());
		
		Строки = ТаблицаНастроек.НайтиСтроки(Отбор);
		
		Для каждого Строка Из Строки Цикл
			Строка.Формировать = Ложь;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область НастройкиЭДО

// См. СервисEDIСлужебныйКлиент.ТребуетсяНастройкаОбмена
Функция ТребуетсяНастройкаОбмена(КлючНастроек) Экспорт
	
	Если ИспользуетсяКонтрагентДляВидаДокументаЭПД(КлючНастроек.ВидДокумента) Тогда
		Возврат ТребуетсяНастройкаОбменаСУчастником(
				КлючНастроек.Организация,
				КлючНастроек.Перевозчик,
				КлючНастроек.Договор,
				КлючНастроек.ВидДокумента)
			Или ТребуетсяНастройкаОбменаСУчастником(
				КлючНастроек.Организация,
				КлючНастроек.Контрагент,
				КлючНастроек.Договор,
				КлючНастроек.ВидДокумента);
	Иначе
		Возврат ТребуетсяНастройкаОбменаСУчастником(
			КлючНастроек.Организация,
			КлючНастроек.Перевозчик,
			КлючНастроек.Договор,
			КлючНастроек.ВидДокумента);
	КонецЕсли;

КонецФункции

// Получает настройки обмена по организации, контрагенту и виду документа
// 
// Параметры:
//  Организация  - ОпределяемыйТип.Организация        - Отправитель для настроек
//  Контрагент   - ОпределяемыйТип.УчастникЭДО        - Получатель для настроек
//  ВидДокумента - СправочникСсылка.ВидыДокументовЭДО - Вид документа для настроек
// 
// Возвращаемое значение:
//  См. НастройкиОтправкиЭДО.НастройкиОтправки
Функция НастройкиОбмена(Знач Организация, Знач Контрагент, Знач ВидДокумента) Экспорт
	
	КлючНастроекЭДО = НастройкиЭДОКлиентСервер.НовыйКлючНастроекОтправки();
	
	КлючНастроекЭДО.Отправитель   = Организация;
	КлючНастроекЭДО.Получатель    = Контрагент;
	КлючНастроекЭДО.Договор       = ПустойДоговор();
	КлючНастроекЭДО.ВидДокумента  = ВидДокумента;
	
	Результат = НастройкиЭДО.НастройкиОтправки(КлючНастроекЭДО);
	
	Если Результат = Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	Если Не ЭтоОбменЧерезСервис1СEDI(Результат.СпособОбмена) Тогда
		ВызватьИсключение(
			СтрШаблон(
				НСтр(
					"ru = 'Недопустим ввод настроек через сервис 1С:EDI. 
					|Настройки введены ранее для другого оператора:
					|- Организация: %1
					|- Контрагент: %2
					|- Вид документа: %3
					|- Способ обмена: %4'",
					ОбщегоНазначения.КодОсновногоЯзыка()),
				Организация,
				Контрагент,
				ВидДокумента,
				Результат.СпособОбмена));
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Метод-конструктор настроек обмена ЭТрН через сервис 1С:EDI
// 
// Возвращаемое значение:
//  Структура - Настройки:
//   * Организация               - ОпределяемыйТип.Организация                - Организация настроек
//                               - Неопределено                               - Не задан
//   * Контрагент                - ОпределяемыйТип.УчастникЭДО                - Контрагент настроек
//                               - Неопределено                               - Не задан
//   * Перевозчик                - ОпределяемыйТип.УчастникЭДО                - Перевозчик настроек
//                               - Неопределено                               - Не задан
//   * ИдентификаторОрганизации  - Строка                                     - Идентификатор ЭДО организации
//   * ИдентификаторКонтрагента  - Строка                                     - Идентификатор ЭДО контрагента
//   * ИдентификаторПеревозчика  - Строка                                     - Идентификатор ЭДО перевозчика
//   * Сертификат                - СправочникСсылка.СертификатыКлючейЭлектроннойПодписиИШифрования - Сертификат
//   * Доверенность              - ОпределяемыйТип.МашиночитаемаяДоверенность - Доверенность сертификата
//                               - Неопределено                               - Не задана
Функция НовыеНастройкиЭТрН() Экспорт
	
	Результат = Новый Структура;
	
	Результат.Вставить("Организация" , Неопределено);
	Результат.Вставить("Контрагент"  , Неопределено);
	Результат.Вставить("Перевозчик"  , Неопределено);
	
	Результат.Вставить("ИдентификаторОрганизации", "");
	Результат.Вставить("ИдентификаторКонтрагента", "");
	Результат.Вставить("ИдентификаторПеревозчика", "");
	
	Результат.Вставить("Сертификат"  , Справочники.СертификатыКлючейЭлектроннойПодписиИШифрования.ПустаяСсылка());
	Результат.Вставить("Доверенность", Неопределено);
	
	Возврат Результат;
	
КонецФункции

// Метод-конструктор настроек обмена ЭЗЗ через сервис 1С:EDI
// 
// Возвращаемое значение:
//  Структура - Настройки:
//   * Организация               - ОпределяемыйТип.Организация                - Организация настроек
//                               - Неопределено                               - Не задан
//   * Перевозчик                - ОпределяемыйТип.УчастникЭДО                - Перевозчик настроек
//                               - Неопределено                               - Не задан
//   * ИдентификаторОрганизации  - Строка                                     - Идентификатор ЭДО организации
//   * ИдентификаторПеревозчика  - Строка                                     - Идентификатор ЭДО перевозчика
//   * Сертификат                - СправочникСсылка.СертификатыКлючейЭлектроннойПодписиИШифрования - Сертификат
//   * Доверенность              - ОпределяемыйТип.МашиночитаемаяДоверенность - Доверенность сертификата
//                               - Неопределено                               - Не задана
Функция НовыеНастройкиЭЗЗ() Экспорт
	
	Результат = Новый Структура;
	
	Результат.Вставить("Организация" , Неопределено);
	Результат.Вставить("Перевозчик"  , Неопределено);
	
	Результат.Вставить("ИдентификаторОрганизации", "");
	Результат.Вставить("ИдентификаторПеревозчика", "");
	
	Результат.Вставить("Сертификат"  , Справочники.СертификатыКлючейЭлектроннойПодписиИШифрования.ПустаяСсылка());
	Результат.Вставить("Доверенность", Неопределено);
	
	Возврат Результат;
	
КонецФункции

// Записывает настройки обмена через сервис 1С:EDI.
// 
// Параметры:
//  Настройки - См. НовыеНастройкиЭТрН
Процедура ЗаписатьНастройкиЭТрН(Знач Настройки) Экспорт
	
	Контекст = "СервисEDIСлужебный.ЗафиксироватьНастройки";
	
	ПроверитьНаличиеПодсистемыБизнесСеть(Контекст);
	
	ВидДокументаЭЗЗ = ВидДокумента(Перечисления.ТипыДокументовЭДО.ЭЗЗ);
	ВидДокументаЭТрН = ВидДокумента(Перечисления.ТипыДокументовЭДО.ЭТрН);
	
	Организация = Настройки.Организация;
	Контрагент  = Настройки.Контрагент;
	Перевозчик  = Настройки.Перевозчик;
	
	ПроверитьУчастника(Контекст, "Настройки.Организация", Организация, Метаданные.ОпределяемыеТипы.Организация.Тип);
	ПроверитьУчастника(Контекст, "Настройки.Контрагент", Контрагент, Метаданные.ОпределяемыеТипы.УчастникЭДО.Тип);
	ПроверитьУчастника(Контекст, "Настройки.Перевозчик", Перевозчик, Метаданные.ОпределяемыеТипы.УчастникЭДО.Тип);
	
	ИдентификаторОрганизации = Настройки.ИдентификаторОрганизации;
	ИдентификаторКонтрагента = Настройки.ИдентификаторКонтрагента;
	ИдентификаторПеревозчика = Настройки.ИдентификаторПеревозчика;
	
	ПроверитьИдентификатор(Контекст, "Настройки.ИдентификаторОрганизации", ИдентификаторОрганизации);
	ПроверитьИдентификатор(Контекст, "Настройки.ИдентификаторКонтрагента", ИдентификаторКонтрагента);
	ПроверитьИдентификатор(Контекст, "Настройки.ИдентификаторПеревозчика", ИдентификаторПеревозчика);
	
	НачатьТранзакцию();
	Попытка
		УстановитьБлокировкуУчетнойЗаписи(ИдентификаторОрганизации);
		УстановитьБлокировкуНастроекОтправкиПоВидам(ВидДокументаЭТрН, Организация, Контрагент);
		УстановитьБлокировкуНастроекОтправкиПоВидам(ВидДокументаЭТрН, Организация, Перевозчик);
		УстановитьБлокировкуНастроекОтправкиПоВидам(ВидДокументаЭЗЗ, Организация, Перевозчик);
		
		ЗаписатьУчетнуюЗапись(
			Организация, 
			ИдентификаторОрганизации);
		ЗаписатьСертификатУчетнойЗаписи(
			ИдентификаторОрганизации, 
			Настройки.Сертификат,
			Настройки.Доверенность);
		ЗаписатьИдентификаторы(
			ВидДокументаЭТрН,
			Организация, 
			Контрагент, 
			ИдентификаторОрганизации, 
			ИдентификаторКонтрагента);
		ЗаписатьИдентификаторы(
			ВидДокументаЭТрН,
			Организация, 
			Перевозчик, 
			ИдентификаторОрганизации, 
			ИдентификаторПеревозчика);
		ЗаписатьИдентификаторы(
			ВидДокументаЭЗЗ,
			Организация, 
			Перевозчик, 
			ИдентификаторОрганизации, 
			ИдентификаторПеревозчика);	
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
		
КонецПроцедуры

// Записывает настройки обмена через сервис 1С:EDI.
// 
// Параметры:
//  Настройки - См. НовыеНастройкиЭЗЗ
Процедура ЗаписатьНастройкиЭЗЗ(Знач Настройки) Экспорт
	
	Контекст = "СервисEDIСлужебный.ЗафиксироватьНастройки";
	
	ПроверитьНаличиеПодсистемыБизнесСеть(Контекст);
	
	ВидДокументаЭЗЗ = ВидДокумента(Перечисления.ТипыДокументовЭДО.ЭЗЗ);
	ВидДокументаЭТрН = ВидДокумента(Перечисления.ТипыДокументовЭДО.ЭТрН);
	
	Организация = Настройки.Организация;
	Перевозчик  = Настройки.Перевозчик;
	
	ПроверитьУчастника(Контекст, "Настройки.Организация", Организация, Метаданные.ОпределяемыеТипы.Организация.Тип);
	ПроверитьУчастника(Контекст, "Настройки.Перевозчик", Перевозчик, Метаданные.ОпределяемыеТипы.УчастникЭДО.Тип);
	
	ИдентификаторОрганизации = Настройки.ИдентификаторОрганизации;
	ИдентификаторПеревозчика = Настройки.ИдентификаторПеревозчика;
	
	ПроверитьИдентификатор(Контекст, "Настройки.ИдентификаторОрганизации", ИдентификаторОрганизации);
	ПроверитьИдентификатор(Контекст, "Настройки.ИдентификаторПеревозчика", ИдентификаторПеревозчика);
	
	НачатьТранзакцию();
	Попытка
		УстановитьБлокировкуУчетнойЗаписи(ИдентификаторОрганизации);
		УстановитьБлокировкуНастроекОтправкиПоВидам(ВидДокументаЭЗЗ, Организация, Перевозчик);
		УстановитьБлокировкуНастроекОтправкиПоВидам(ВидДокументаЭТрН, Организация, Перевозчик);
		
		ЗаписатьУчетнуюЗапись(
			Организация, 
			ИдентификаторОрганизации);
		ЗаписатьСертификатУчетнойЗаписи(
			ИдентификаторОрганизации, 
			Настройки.Сертификат,
			Настройки.Доверенность);
		ЗаписатьИдентификаторы(
			ВидДокументаЭЗЗ,
			Организация, 
			Перевозчик, 
			ИдентификаторОрганизации, 
			ИдентификаторПеревозчика);
		ЗаписатьИдентификаторы(
			ВидДокументаЭТрН,
			Организация, 
			Перевозчик, 
			ИдентификаторОрганизации, 
			ИдентификаторПеревозчика);	
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
		
КонецПроцедуры

// Используется контрагент для типа документа ЭПД.
// 
// Параметры:
//  ВидДокумента - СправочникСсылка.ВидыДокументовЭДО - Ссылка на вид электронного документа.
// 
// Возвращаемое значение:
//  Булево - Используется контрагент для типа документа
Функция ИспользуетсяКонтрагентДляВидаДокументаЭПД(ВидДокумента) Экспорт
	
	Массив = Новый Массив; // Массив из СправочникСсылка.ВидыДокументовЭДО - Ссылка на вид электронного документа.
	Массив.Добавить(ИнтерфейсДокументовЭДО.ВидДокументаПоТипу(Перечисления.ТипыДокументовЭДО.ЭТрН));
	
	//@skip-check invocation-parameter-type-intersect
	НайденныйВидДокумента = Массив.Найти(ВидДокумента);
	
	Возврат НайденныйВидДокумента <> Неопределено;
	
КонецФункции

// Фиксирует настройки обмена ЭТрН через сервис 1С:EDI
//
// Параметры:
//  Организация - ОпределяемыйТип.Организация - Грузоотправитель по ЭТрН
//  Контрагент  - ОпределяемыйТип.УчастникЭДО - Грузополучатель по ЭТрН
//
Процедура ЗафиксироватьНастройкиЭТрН(
	Знач Организация, 
	Знач Контрагент) Экспорт
	
	ЗафиксироватьНастройки(Перечисления.ТипыДокументовЭДО.ЭТрН, Организация, Контрагент);
	
КонецПроцедуры

// Фиксирует настройки обмена ЭЗЗ через сервис 1С:EDI
//
// Параметры:
//  Организация - ОпределяемыйТип.Организация - Грузоотправитель по ЭЗЗ
//  Контрагент  - ОпределяемыйТип.УчастникЭДО - Перевозчик по ЭЗЗ
//
Процедура ЗафиксироватьНастройкиЭЗЗ(
	Знач Организация, 
	Знач Контрагент) Экспорт
	
	ЗафиксироватьНастройки(Перечисления.ТипыДокументовЭДО.ЭЗЗ, Организация, Контрагент);
	
КонецПроцедуры

#КонецОбласти

#Область ДанныеУчастников

#Область Конструкторы

// Метод-конструктор таблицы участников
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Таблица участников:
// * Участник     - ЛюбаяСсылка - Ссылка на участника
// * ТипУчастника - Строка      - Тип участника, значения: См. ТипыУчастников.
Функция НоваяТаблицаУчастников() Экспорт
	
	Результат = Новый ТаблицаЗначений;
	
	Результат.Колонки.Добавить("Участник"     , ОбщегоНазначения.ОписаниеТипаВсеСсылки());
	Результат.Колонки.Добавить("ТипУчастника" , Новый ОписаниеТипов("Строка"));
	
	Возврат Результат;
	
КонецФункции

// Метод-конструктор данных участников
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Данные участников:
// * Участник      - ЛюбаяСсылка - Ссылка на участника
// * ИНН           - Строка      - ИНН участника
// * КПП           - Строка      - КПП участника
// * Представление - Строка      - Представление участника
Функция НовыеДанныеУчастников() Экспорт
	
	Результат = Новый ТаблицаЗначений;
	
	Результат.Колонки.Добавить("Участник"      , ОбщегоНазначения.ОписаниеТипаВсеСсылки());
	Результат.Колонки.Добавить("ИНН"           , ОбщегоНазначения.ОписаниеТипаСтрока(12));
	Результат.Колонки.Добавить("КПП"           , ОбщегоНазначения.ОписаниеТипаСтрока(9));
	Результат.Колонки.Добавить("Представление" , Новый ОписаниеТипов("Строка"));
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область Добавление

// Добавляет организацию в таблицу участников
// 
// Параметры:
//  ТаблицаУчастников - См. НоваяТаблицаУчастников
//  Организация       - ОпределяемыйТип.Организация
Процедура ДобавитьОрганизацию(ТаблицаУчастников, Знач Организация) Экспорт
	
	ОбщегоНазначенияКлиентСервер.ПроверитьПараметр(
		"СервисEDIСлужебный.ДобавитьОрганизацию",
		"Организация",
		Организация,
		Метаданные.ОпределяемыеТипы.Организация.Тип);
	
	ДобавитьУчастника(ТаблицаУчастников, Организация, ТипыУчастников().Организация);
	
КонецПроцедуры

// Добавляет контрагента в таблицу участников
// 
// Параметры:
//  ТаблицаУчастников - См. НоваяТаблицаУчастников
//  Контрагент        - ОпределяемыйТип.УчастникЭДО
Процедура ДобавитьКонтрагента(ТаблицаУчастников, Знач Контрагент) Экспорт
	
	ОбщегоНазначенияКлиентСервер.ПроверитьПараметр(
		"СервисEDIСлужебный.ДобавитьКонтрагента",
		"Контрагент",
		Контрагент,
		Метаданные.ОпределяемыеТипы.УчастникЭДО_ЭПД.Тип);
	
	ДобавитьУчастника(ТаблицаУчастников, Контрагент, ТипыУчастников().Контрагент);
	
КонецПроцедуры

#КонецОбласти

#Область Чтение

// Получает данные участников по таблице участников
// 
// Параметры:
//  ТаблицаУчастников - См. НоваяТаблицаУчастников
// 
// Возвращаемое значение:
//  См. НовыеДанныеУчастников
Функция ДанныеУчастников(Знач ТаблицаУчастников) Экспорт
	
	Результат = НовыеДанныеУчастников();
	
	Организации = Новый Массив; // Массив Из ЛюбаяСсылка
	Контрагенты = Новый Массив; // Массив Из ЛюбаяСсылка
	
	Для Каждого СтрокаУчастника Из ТаблицаУчастников Цикл
		
		Участник     = СтрокаУчастника.Участник;
		ТипУчастника = СтрокаУчастника.ТипУчастника;
		
		Если ЭтоТипУчастникаОрганизация(ТипУчастника) Тогда
			Организации.Добавить(Участник);
		ИначеЕсли ЭтоТипУчастникаКонтрагент(ТипУчастника) Тогда
			Контрагенты.Добавить(Участник);
		Иначе
			ВызватьИсключение(
				СтрШаблон(
					НСтр(
						"ru = 'Неизвестный тип участника %1'",
						ОбщегоНазначения.КодОсновногоЯзыка()),
					ТипУчастника));
		КонецЕсли;
		
	КонецЦикла;
	
	Организации = ОбщегоНазначенияКлиентСервер.СвернутьМассив(Организации);
	Контрагенты = ОбщегоНазначенияКлиентСервер.СвернутьМассив(Контрагенты);
	
	Запрос = Новый Запрос;
	
	ТекстыЗапросов = Новый Массив; // Массив Из Строка
	
	Если Организации.Количество() > 0  Тогда
		Запрос.УстановитьПараметр("Организации", Организации);
		ТекстыЗапросов.Добавить(
			ТекстЗапросаДанныеУчастникаИБ(
				"Организации",
				"ИННОрганизации",
				"КППОрганизации",
				"НаименованиеОрганизации",
				"Организации"));
	КонецЕсли;
	
	Если Контрагенты.Количество() > 0  Тогда
		Запрос.УстановитьПараметр("Контрагенты", Контрагенты);
		ТекстыЗапросов.Добавить(
			ТекстЗапросаДанныеУчастникаИБ(
				"Контрагенты",
				"ИННКонтрагента",
				"КППКонтрагента",
				"НаименованиеКонтрагента",
				"Контрагенты"));
	КонецЕсли;
	
	Если ТекстыЗапросов.Количество() = 0 Тогда
		Возврат Результат;
	КонецЕсли;
	
	Запрос.Текст = СтрСоединить(ТекстыЗапросов, ТекстРазделителяОбъединитьВсе());
	
	УстановитьПривилегированныйРежим(Истина);
	РезультатЗапроса = Запрос.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);
	
	ВыборкаЗапроса = РезультатЗапроса.Выбрать();
	
	Для Каждого СтрокаУчастника Из ТаблицаУчастников Цикл
		
		Участник = СтрокаУчастника.Участник;
		
		Отбор = Новый Структура;
		Отбор.Вставить("Участник", Участник);
		
		ВыборкаЗапроса.Сбросить();
		
		Если Не ВыборкаЗапроса.НайтиСледующий(Отбор) Тогда
			ВызватьИсключение(
				СтрШаблон(
					НСтр(
						"ru = 'Не удалось найти сведения об участнике %1'",
						ОбщегоНазначения.КодОсновногоЯзыка()),
					Участник));
		КонецЕсли;
		
		НоваяСтрока = Результат.Добавить();
		
		НоваяСтрока.Участник      = Участник;
		//@skip-check property-return-type - Особенности работы с выборкой запроса в строгой типизации
		//@skip-check statement-type-change - Особенности работы с выборкой запроса в строгой типизации
		НоваяСтрока.ИНН           = ВыборкаЗапроса.ИНН; // Строка
		//@skip-check property-return-type - Особенности работы с выборкой запроса в строгой типизации
		//@skip-check statement-type-change - Особенности работы с выборкой запроса в строгой типизации
		НоваяСтрока.КПП           = ВыборкаЗапроса.КПП; // Строка
		//@skip-check property-return-type - Особенности работы с выборкой запроса в строгой типизации
		//@skip-check statement-type-change - Особенности работы с выборкой запроса в строгой типизации
		НоваяСтрока.Представление = ВыборкаЗапроса.Представление; // Строка
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Получает данные участника по таблице данных участников
// 
// Параметры:
//  ДанныеУчастников - См. НовыеДанныеУчастников
//  Участник         - ЛюбаяСсылка
// 
// Возвращаемое значение:
//  См. НовыеДанныеУчастника
Функция ДанныеУчастника(Знач ДанныеУчастников, Знач Участник) Экспорт
	
	СтрокаУчастника = ДанныеУчастников.Найти(Участник, "Участник");
	
	Если СтрокаУчастника = Неопределено Тогда
		ВызватьИсключение(
			СтрШаблон(
				НСтр(
					"ru = 'Ошибка получения данных участника %1: участник не найден'",
					ОбщегоНазначения.КодОсновногоЯзыка()),
				Участник));
	КонецЕсли;
	
	Результат = НовыеДанныеУчастника();
	
	Результат.ИНН           = СтрокаУчастника.ИНН;
	Результат.КПП           = СтрокаУчастника.КПП;
	Результат.Представление = СтрокаУчастника.Представление;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область Запросы

#Область ОбщегоНазначения

// Метод-конструктор участников ЭТрН
// 
// Возвращаемое значение:
//  Структура - Участники ЭТрН:
// * Организация - ОпределяемыйТип.Организация     - Организация по ЭТрН 
//               - Неопределено                    - Не указана
// * Контрагент  - ОпределяемыйТип.УчастникЭДО_ЭПД - Контрагент по ЭТрН
//               - Неопределено                    - Не указан
// * Перевозчик  - ОпределяемыйТип.УчастникЭДО_ЭПД - Перевозчик по ЭТрН 
//               - Неопределено                    - Не указан
Функция НовыеУчастникиЭТрН() Экспорт
	
	Результат = Новый Структура;
	
	Результат.Вставить("Организация" , Неопределено);
	Результат.Вставить("Контрагент"  , Неопределено);
	Результат.Вставить("Перевозчик"  , Неопределено);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СвязьИдентификаторыУчастниковЭТрН

// Метод-конструктор сведений о связи идентификаторов участников ЭТрН
// 
// Возвращаемое значение:
//  Структура - Новая связь идентификаторы участников э тр Н:
// * Организация - См. НовыеСведенияОбУчастникеСвязи
// * Контрагент  - См. НовыеСведенияОбУчастникеСвязи
// * Перевозчик  - См. НовыеСведенияОбУчастникеСвязи
Функция НоваяСвязьИдентификаторовУчастниковЭТрН() Экспорт
	
	Результат = Новый Структура;
	
	Результат.Вставить("Организация" , НовыеСведенияОбУчастникеСвязи());
	Результат.Вставить("Контрагент"  , НовыеСведенияОбУчастникеСвязи());
	Результат.Вставить("Перевозчик"  , НовыеСведенияОбУчастникеСвязи());
	
	Возврат Результат;
	
КонецФункции

// Получает связь идентификаторов ЭПД по набору участников ЭТрН
// 
// Параметры:
//  УчастникиЭТрН - См. НовыеУчастникиЭТрН
// 
// Возвращаемое значение:
//  См. НоваяСвязьИдентификаторовУчастниковЭТрН
Функция СвязьИдентификаторыУчастниковЭТрН(Знач УчастникиЭТрН) Экспорт
	Возврат СвязьИдентификаторовУчастников(УчастникиЭТрН.Организация, УчастникиЭТрН);
КонецФункции

#КонецОбласти

#Область ИдентификаторыУчастниковЭТрН

// Получает идентификаторы ЭПД по набору участников ЭТрН
// 
// Параметры:
//  Организация   - ОпределяемыйТип.Организация - Организация для авторизации в сервисе 1С:Бизнес-сеть
//  УчастникиЭТрН - См. НовыеУчастникиЭТрН
// 
// Возвращаемое значение:
//  См. НовыеИдентификаторыУчастников
Функция ИдентификаторыУчастниковЭТрН(Знач Организация, Знач УчастникиЭТрН) Экспорт
	
	ТаблицаУчастников = НоваяТаблицаУчастников();
	
	Если УчастникиЭТрН.Организация <> Неопределено Тогда
		ДобавитьОрганизацию(ТаблицаУчастников, УчастникиЭТрН.Организация);
	КонецЕсли;
	
	Если УчастникиЭТрН.Контрагент <> Неопределено Тогда
		ДобавитьКонтрагента(ТаблицаУчастников, УчастникиЭТрН.Контрагент);
	КонецЕсли;
	
	Если УчастникиЭТрН.Перевозчик <> Неопределено Тогда
		ДобавитьКонтрагента(ТаблицаУчастников, УчастникиЭТрН.Перевозчик);
	КонецЕсли;
	
	Возврат ИдентификаторыУчастниковЭПД(Организация, ТаблицаУчастников);
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область ЗапускДлительныхОпераций

// Запускает фоновое получение сообщений через сервис 1С:EDI
// 
// Возвращаемое значение:
//  См. ДлительныеОперации.ВыполнитьФункцию
Функция ЗапуститьПолучениеСообщений() Экспорт
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияПроцедуры();
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = 
		НСтр(
			"ru = 'Получение сообщений через сервис 1С:EDI'", 
			ОбщегоНазначения.КодОсновногоЯзыка());
	
	Возврат ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения, "СервисEDIСлужебный.ПолучитьСообщения");
	
КонецФункции

#КонецОбласти

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.БазоваяФункциональность

// См. СтандартныеПодсистемыСервер.ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод
Процедура ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод(Методы) Экспорт
	
	Методы.Вставить("ПолучитьСообщения", Истина);
	Методы.Вставить("СвязьИдентификаторыУчастниковЭТрН", Истина);
	Методы.Вставить("ИдентификаторыУчастниковЭТрН", Истина);
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.БазоваяФункциональность

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ПоискДанныхОбменСКонтрагентами

// Возвращаемое значение:
//  ОпределяемыйТип.ДоговорСКонтрагентомЭДО
Функция ПустойДоговор()
	Возврат Метаданные.ОпределяемыеТипы.ДоговорСКонтрагентомЭДО.Тип.ПривестиЗначение(Неопределено);
КонецФункции

// Параметры:
//  ТипДокумента - ПеречислениеСсылка.ТипыДокументовЭДО
// 
// Возвращаемое значение:
//  ДокументСсылка.СообщениеЭДО
Функция ВидДокумента(Знач ТипДокумента)
	Возврат ИнтерфейсДокументовЭДО.ВидДокументаПоТипу(ТипДокумента);
КонецФункции

// Возвращаемое значение:
//  ПеречислениеСсылка.СпособыОбменаЭД
Функция СпособОбмена()
	Возврат Перечисления.СпособыОбменаЭД.ЧерезСервис1СEDI;
КонецФункции

#КонецОбласти

#Область Проверки

// Параметры:
//  Контекст - Строка
Процедура ПроверитьАктивностьТранзакции(Знач Контекст)
	ПроверитьСостояниеТранзакции(Контекст, Истина);
КонецПроцедуры

// Параметры:
//  Контекст - Строка
Процедура ПроверитьОтсутствиеТранзакции(Знач Контекст)
	ПроверитьСостояниеТранзакции(Контекст, Ложь);
КонецПроцедуры

// Параметры:
//  Контекст         - Строка
//  ЦелевоеСостояние - Булево
Процедура ПроверитьСостояниеТранзакции(Знач Контекст, Знач ЦелевоеСостояние)
	
	ТекущееСостояние      = ТранзакцияАктивна();
	ФорматированнаяСтрока = "БЛ='не активна'; БИ=активна;";
	
	ОбщегоНазначенияКлиентСервер.Проверить(
		ТекущееСостояние = ЦелевоеСостояние,
		СтрШаблон(
			НСтр(
				"ru = 'Недопустимое состояние транзакции:
				|Текущее состояние: %1
				|Ожидаемое состояние: %2'",
				ОбщегоНазначения.КодОсновногоЯзыка()),
			Формат(ТекущееСостояние, ФорматированнаяСтрока),
			Формат(ЦелевоеСостояние, ФорматированнаяСтрока)),
		Контекст);
	
КонецПроцедуры

// Параметры:
//  Контекст - Строка
Процедура ПроверитьНаличиеПодсистемыБизнесСеть(Знач Контекст)
	
	ОбщегоНазначенияКлиентСервер.Проверить(
		ОбщегоНазначения.ПодсистемаСуществует("ЭлектронноеВзаимодействие.БизнесСеть"),
		НСтр(
			"ru = 'Для отправки документов через сервис 1С:EDI требуется подсистема 1С:Бизнес-сеть'",
			ОбщегоНазначения.КодОсновногоЯзыка()),
		Контекст);
	
КонецПроцедуры

// Параметры:
//  Контекст          - Строка
//  ИмяПараметра      - Строка
//  ЗначениеПараметра - Строка
Процедура ПроверитьИдентификатор(Знач Контекст, Знач ИмяПараметра, Знач ЗначениеПараметра)
	
	ОбщегоНазначенияКлиентСервер.ПроверитьПараметр(Контекст, ИмяПараметра, ЗначениеПараметра, Тип("Строка"));
	ОбщегоНазначенияКлиентСервер.Проверить(
		Не ПустаяСтрока(ЗначениеПараметра),
		СтрШаблон(
			НСтр(
				"ru = 'Значение параметра %1 не может содержать пустую строку'",
				ОбщегоНазначения.КодОсновногоЯзыка()),
			ИмяПараметра),
		Контекст);
	
КонецПроцедуры

// Параметры:
//  Контекст          - Строка
//  ИмяПараметра      - Строка
//  ЗначениеПараметра - Произвольный
//  ТипПараметра      - ОписаниеТипов
Процедура ПроверитьУчастника(Знач Контекст, Знач ИмяПараметра, Знач ЗначениеПараметра, Знач ТипПараметра)
	
	ОбщегоНазначенияКлиентСервер.ПроверитьПараметр(Контекст, ИмяПараметра, ЗначениеПараметра, ТипПараметра);
	ОбщегоНазначенияКлиентСервер.Проверить(
		ЗначениеЗаполнено(ЗначениеПараметра),
		СтрШаблон(
			НСтр(
				"ru = 'Значение параметра %1 не может содержать пустое значение'",
				ОбщегоНазначения.КодОсновногоЯзыка()),
			ИмяПараметра),
		Контекст);
	
КонецПроцедуры

#КонецОбласти

#Область НастройкиОтправкиЭлектронныхДокументовПоВидам

// Параметры:
//  ТипДокумента - ПеречислениеСсылка.ТипыДокументовЭДО
//  Организация  - ОпределяемыйТип.Организация
//  Контрагент   - ОпределяемыйТип.УчастникЭДО
Процедура ЗафиксироватьНастройки(
	Знач ТипДокумента, 
	Знач Организация, 
	Знач Контрагент)
	
	ПроверитьНаличиеПодсистемыБизнесСеть("СервисEDIСлужебный.ЗафиксироватьНастройки");
	
	ВидДокумента  = ВидДокумента(ТипДокумента);
	Договор       = ПустойДоговор();
	СпособОбмена  = СпособОбмена();
	
	НачатьТранзакцию();
	Попытка
		УстановитьБлокировкуНастроекОтправкиПоВидам(ВидДокумента, Организация, Контрагент);
		
		НаборЗаписей = РегистрыСведений.НастройкиОтправкиЭлектронныхДокументовПоВидам.СоздатьНаборЗаписей();
		
		НаборЗаписей.Отбор.Отправитель.Установить(Организация);
		НаборЗаписей.Отбор.Получатель.Установить(Контрагент);
		НаборЗаписей.Отбор.Договор.Установить(Договор);
		НаборЗаписей.Отбор.ВидДокумента.Установить(ВидДокумента);
		
		НаборЗаписей.Прочитать();
		
		Если НаборЗаписей.Количество() > 1 Тогда
			
			ВызватьИсключение(
				СтрШаблон(
					НСтр(
						"ru = 'Выявлено дублирование настроек отправки по видам для:
						|Отправитель: %1
						|Получатель: %2
						|Вид документа: %3'",
						ОбщегоНазначения.КодОсновногоЯзыка()),
					Организация,
					Контрагент,
					ВидДокумента));
			
		ИначеЕсли НаборЗаписей.Количество() = 1 Тогда
			
			Если НаборЗаписей[0].СпособОбменаЭД <> СпособОбмена Тогда
				ВызватьИсключение(
					СтрШаблон(
						НСтр(
							"ru = 'Настройка отправки документа ""%1"" для организации ""%2"" и контрагента ""%3"" уже существует.'",
							ОбщегоНазначения.КодОсновногоЯзыка()),
						ВидДокумента,
						Организация,
						Контрагент));
			КонецЕсли;
			
			ЗафиксироватьТранзакцию();
			Возврат; // Настройки установлены ранее
			
		КонецЕсли;
		
		Запись = НаборЗаписей.Добавить();
		
		Запись.Отправитель       = Организация;
		Запись.Получатель        = Контрагент;
		Запись.Договор           = Договор;
		Запись.ВидДокумента      = ВидДокумента;
		Запись.СпособОбменаЭД    = СпособОбмена;
		Запись.Формировать       = Истина;
		Запись.МаршрутПодписания = Справочники.МаршрутыПодписания.ОднойДоступнойПодписью;
		
		НаборЗаписей.Записать();
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

// Параметры:
//  ВидДокумента - ДокументСсылка.СообщениеЭДО
//  Организация  - ОпределяемыйТип.Организация
//  Контрагент  - ОпределяемыйТип.УчастникЭДО
Процедура УстановитьБлокировкуНастроекОтправкиПоВидам(
	Знач ВидДокумента, 
	Знач Организация, 
	Знач Контрагент)
	
	ПроверитьАктивностьТранзакции("СервисEDIСлужебный.УстановитьБлокировкуНастроекОтправкиПоВидам");
	
	ИмяРегистра = Метаданные.РегистрыСведений.НастройкиОтправкиЭлектронныхДокументовПоВидам.ПолноеИмя();
	Блокировка  = Новый БлокировкаДанных;
	
	ЭлементБлокировки = Блокировка.Добавить(ИмяРегистра);
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	
	ЭлементБлокировки.УстановитьЗначение("Отправитель"  , Организация);
	ЭлементБлокировки.УстановитьЗначение("Получатель"   , Контрагент);
	ЭлементБлокировки.УстановитьЗначение("Договор"      , ПустойДоговор());	
	ЭлементБлокировки.УстановитьЗначение("ВидДокумента" , ВидДокумента);
	
	//@skip-check lock-out-of-try - Транзакция открывается выше по стеку
	Блокировка.Заблокировать();
	
КонецПроцедуры

#КонецОбласти

#Область НастройкиЭДО

// Требуется настройка обмена с участником.
// 
// Параметры:
//  Организация - ОпределяемыйТип.Организация - Организация.
//  Получатель - ОпределяемыйТип.УчастникЭДО - Получатель.
//  Договор - Неопределено, ОпределяемыйТип.ДоговорСКонтрагентомЭДО - Договор с Получателем
//  ВидДокумента - СправочникСсылка.ВидыДокументовЭДО - Вид документа ЭДО
// 
// Возвращаемое значение:
//  Булево - Требуется настройка обмена с участником
Функция ТребуетсяНастройкаОбменаСУчастником(Знач Организация, Знач Получатель, Знач Договор, Знач ВидДокумента)

	КлючНастроек = НастройкиЭДОКлиентСервер.НовыйКлючНастроекОтправки();
	
	КлючНастроек.Отправитель = Организация;
	КлючНастроек.Получатель = Получатель;
	КлючНастроек.Договор = Договор;
	КлючНастроек.ВидДокумента = ВидДокумента;

	НастройкиОтправки = НастройкиЭДО.НастройкиОтправки(КлючНастроек);

	Возврат ЭтоНастройкиОтправкиЧерезСервис1СEDI(НастройкиОтправки)
		И Не НастройкиОтправкиЗаполнены(НастройкиОтправки)
	
КонецФункции

#КонецОбласти

#Область ПриглашенияЭДО

// Параметры:
//  Ключ                     - Строка
//  ИдентификаторОрганизации - Строка
Процедура УстановитьБлокировкуПриглашенияЭДО(Знач Ключ, Знач ИдентификаторОрганизации)
	
	ПроверитьАктивностьТранзакции("СервисEDIСлужебный.УстановитьБлокировкуПриглашенияЭДО");
	
	ПространствоИмен = Метаданные.РегистрыСведений.ПриглашенияКОбменуЭлектроннымиДокументами.ПолноеИмя();
	
	БлокировкаДанных = Новый БлокировкаДанных();
	ЭлементБлокировки = БлокировкаДанных.Добавить(ПространствоИмен);
	ЭлементБлокировки.УстановитьЗначение("Ключ"                     , Ключ);
	ЭлементБлокировки.УстановитьЗначение("ИдентификаторОрганизации" , ИдентификаторОрганизации);
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	
	//@skip-check lock-out-of-try - Транзакция открывается выше по стеку
	БлокировкаДанных.Заблокировать();
	
КонецПроцедуры

// Параметры:
//  Отправитель              - ОпределяемыйТип.Организация
//  Получатель               - ОпределяемыйТип.УчастникЭДО
//  ИдентификаторОтправителя - Строка
//  ИдентификаторПолучателя  - Строка
Процедура ОтключитьПриглашенияЭДО(
	Знач Отправитель,
	Знач Получатель,
	Знач ИдентификаторОтправителя, 
	Знач ИдентификаторПолучателя)
	
	ДанныеКонтрагента = ДанныеКонтрагента(Получатель);
	Ключ              = Строка(Новый УникальныйИдентификатор);
	
	НачатьТранзакцию();
	Попытка
		УстановитьБлокировкуПриглашенияЭДО(Ключ, ИдентификаторОтправителя);
		
		НаборЗаписей = РегистрыСведений.ПриглашенияКОбменуЭлектроннымиДокументами.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Ключ.Установить(Ключ);
		НаборЗаписей.Отбор.ИдентификаторОрганизации.Установить(ИдентификаторОтправителя);
		
		Запись = НаборЗаписей.Добавить();
		
		Запись.Ключ = Ключ;
		Запись.ИдентификаторОрганизации = ИдентификаторОтправителя;
		
		Запись.ИдентификаторКонтрагента = ИдентификаторПолучателя;
		Запись.ИНН = ДанныеКонтрагента.ИНН;
		Запись.КПП = ДанныеКонтрагента.КПП;
		
		Запись.Статус = Перечисления.СтатусыПриглашений.НеТребуется;
		
		НаборЗаписей.Записать(Истина);
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#Область ЗаписьНастроек

// Параметры:
//  ИдентификаторЭДО - Строка
Процедура УстановитьБлокировкуУчетнойЗаписи(Знач ИдентификаторЭДО)
	
	ПроверитьАктивностьТранзакции("СервисEDIСлужебный.ЗаблокироватьУчетнуюЗапись");
	
	БлокировкаДанных = Новый БлокировкаДанных();
	ЭлементБлокировки = БлокировкаДанных.Добавить(Метаданные.РегистрыСведений.УчетныеЗаписиЭДО.ПолноеИмя());
	ЭлементБлокировки.УстановитьЗначение("ИдентификаторЭДО", ИдентификаторЭДО);
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	
	//@skip-check lock-out-of-try - Транзакция открывается выше по стеку
	БлокировкаДанных.Заблокировать();
	
КонецПроцедуры

// Создает учетную запись ЭДО
// 
// Параметры:
//  Организация      - ОпределяемыйТип.Организация - Организация
//  ИдентификаторЭДО - Строка                      - Идентификатор ЭДО
Процедура ЗаписатьУчетнуюЗапись(Знач Организация, Знач ИдентификаторЭДО)
	
	СпособОбменаЭД = СпособОбмена();
	
	НачатьТранзакцию();
	Попытка
		УстановитьБлокировкуУчетнойЗаписи(ИдентификаторЭДО);
		
		НаборЗаписей = РегистрыСведений.УчетныеЗаписиЭДО.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ИдентификаторЭДО.Установить(ИдентификаторЭДО);
		НаборЗаписей.Прочитать();
		
		Если НаборЗаписей.Количество() = 0 Тогда
			Запись = НаборЗаписей.Добавить();
			Запись.ИдентификаторЭДО          = ИдентификаторЭДО;
			Запись.Организация               = Организация;
			Запись.СпособОбменаЭД            = СпособОбмена();
			Запись.ОператорЭДО               = "2JM"; // ООО "СИСЛИНК"
			Запись.НаименованиеУчетнойЗаписи = 
				СтрШаблон(
					НСтр(
						"ru = '%1 (1С:EDI)'",
						ОбщегоНазначения.КодОсновногоЯзыка()),
					ПредставлениеОбъекта(Организация));
			Запись.НазначениеУчетнойЗаписи   = 
				НСтр("ru = 'Для обмена через сервис 1С:EDI'", ОбщегоНазначения.КодОсновногоЯзыка());
		Иначе
			Запись = НаборЗаписей[0];
			
			Если Запись.Организация <> Организация Тогда
				ВызватьИсключение(
					СтрШаблон(
						НСтр(
							"ru = 'Идентификатор %1 уже занят организацией %2 (организация для записи: %3)'",
							ОбщегоНазначения.КодОсновногоЯзыка()),
						ИдентификаторЭДО,
						Запись.Организация,
						Организация));
			КонецЕсли;
			
			Если Запись.СпособОбменаЭД <> СпособОбменаЭД Тогда
				ВызватьИсключение(
					СтрШаблон(
						НСтр(
							"ru = 'Для учетной записи %1 используется способ обмена %2 (способ обмена для записи: %3)'",
							ОбщегоНазначения.КодОсновногоЯзыка()),
						ИдентификаторЭДО,
						Запись.СпособОбменаЭД,
						СпособОбменаЭД));
			КонецЕсли;
			
		КонецЕсли;
		
		Запись.ПринятыУсловияИспользования = Истина;
		
		НаборЗаписей.Записать();
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

// Добавляет сертификат к учетной записи ЭДО
// 
// Параметры:
//  ИдентификаторЭДО - Строка                                                          - Идентификатор ЭДО
//  Сертификат       - СправочникСсылка.СертификатыКлючейЭлектроннойПодписиИШифрования - Сертификат
//  Доверенность     - ОпределяемыйТип.МашиночитаемаяДоверенность                      - Доверенность
Процедура ЗаписатьСертификатУчетнойЗаписи(Знач ИдентификаторЭДО, Знач Сертификат, Знач Доверенность = Неопределено)
	
	Сертификаты = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Сертификат);
	
	Доверенности = Новый Соответствие;
	
	Если Доверенность <> Неопределено Тогда
		Доверенности.Вставить(Сертификат, Доверенность);
	КонецЕсли;
	
	УчетныеЗаписиЭДО.ЗаписатьСертификатыУчетнойЗаписи(ИдентификаторЭДО, Сертификаты, , Доверенности);
	
КонецПроцедуры

// Фиксирует идентификаторы обмена.
// 
// Параметры:
//  ВидДокумента             - СправочникСсылка.ВидыДокументовЭДО - Вид документа
//  Отправитель              - ОпределяемыйТип.Организация - Организация-отправитель
//  Получатель               - ОпределяемыйТип.УчастникЭДО - Получатель
//  ИдентификаторОтправителя - Строка - Идентификатор отправителя
//  ИдентификаторПолучателя  - Строка - Идентификатор получателя
Процедура ЗаписатьИдентификаторы(
	Знач ВидДокумента, 
	Знач Отправитель, 
	Знач Получатель, 
	Знач ИдентификаторОтправителя, 
	Знач ИдентификаторПолучателя)
	
	Договор       = ПустойДоговор();
	СпособОбмена  = СпособОбмена();
	
	НачатьТранзакцию();
	Попытка
		УстановитьБлокировкуНастроекОтправкиПоВидам(ВидДокумента, Отправитель, Получатель);
		
		НаборЗаписей = РегистрыСведений.НастройкиОтправкиЭлектронныхДокументовПоВидам.СоздатьНаборЗаписей();
		
		НаборЗаписей.Отбор.Отправитель.Установить(Отправитель);
		НаборЗаписей.Отбор.Получатель.Установить(Получатель);
		НаборЗаписей.Отбор.Договор.Установить(Договор);
		НаборЗаписей.Отбор.ВидДокумента.Установить(ВидДокумента);
		
		НаборЗаписей.Прочитать();
		
		Если НаборЗаписей.Количество() > 1 Тогда
			
			ВызватьИсключение(
				СтрШаблон(
					НСтр(
						"ru = 'Выявлено дублирование настроек отправки по видам для:
						|Отправитель: %1
						|Получатель: %2
						|Вид документа: %3'",
						ОбщегоНазначения.КодОсновногоЯзыка()),
					Отправитель,
					Получатель,
					ВидДокумента));
			
		ИначеЕсли НаборЗаписей.Количество() = 1 Тогда
			
			Если НаборЗаписей[0].СпособОбменаЭД <> СпособОбмена Тогда
				ВызватьИсключение(
					СтрШаблон(
						НСтр(
							"ru = 'Настройка отправки документа ""%1"" для организации ""%2"" и контрагента ""%3"" уже существует.'",
							ОбщегоНазначения.КодОсновногоЯзыка()),
						ВидДокумента,
						Отправитель,
						Получатель));
			КонецЕсли;
			
			Запись = НаборЗаписей[0];
			
		Иначе
			
			Запись = НаборЗаписей.Добавить();
			
			Запись.Отправитель       = Отправитель;
			Запись.Получатель        = Получатель;
			Запись.Договор           = Договор;
			Запись.ВидДокумента      = ВидДокумента;
			Запись.СпособОбменаЭД    = СпособОбмена;
			
		КонецЕсли;
		
		Запись.ИдентификаторОтправителя = ИдентификаторОтправителя;
		Запись.ИдентификаторПолучателя  = ИдентификаторПолучателя;
		
		Запись.Формировать       = Истина;
		Запись.МаршрутПодписания = Справочники.МаршрутыПодписания.ОднойДоступнойПодписью;
		
		ОтключитьПриглашенияЭДО(
			Отправитель, 
			Получатель, 
			ИдентификаторОтправителя, 
			ИдентификаторПолучателя);
		
		НаборЗаписей.Записать();
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#Область ДанныеУчастников

// Метод-конструктор данных участника
// 
// Возвращаемое значение:
//  Структура - Новые данные участника:
// * ИНН           - Строка      - ИНН участника
// * КПП           - Строка      - КПП участника
// * Представление - Строка      - Представление участника
Функция НовыеДанныеУчастника()
	
	Результат = Новый Структура;
	
	Результат.Вставить("ИНН", "");
	Результат.Вставить("КПП", "");
	Результат.Вставить("Представление", "");
	
	Возврат Результат;
	
КонецФункции

// Перечисление типов участников
// 
// Возвращаемое значение:
//  Структура - Типы участников:
// * Организация - Строка - Организация
// * Контрагент  - Строка - Контрагент
Функция ТипыУчастников()
	
	Результат = Новый Структура;
	
	Результат.Вставить("Организация" , "Организация");
	Результат.Вставить("Контрагент"  , "Контрагент");
	
	Возврат Результат;
	
КонецФункции

// Проверяет, является ли тип участника организацией
// 
// Параметры:
//  ТипУчастника - Строка - Тип участника
// 
// Возвращаемое значение:
//  Булево - Истина, если это тип участника организация.
//           Ложь в ином случае.
Функция ЭтоТипУчастникаОрганизация(Знач ТипУчастника)
	Возврат ТипУчастника = ТипыУчастников().Организация;
КонецФункции

// Проверяет, является ли тип участника контрагентом
// 
// Параметры:
//  ТипУчастника - Строка - Тип участника
// 
// Возвращаемое значение:
//  Булево - Истина, если это тип участника контрагент.
//           Ложь в ином случае.
Функция ЭтоТипУчастникаКонтрагент(Знач ТипУчастника)
	Возврат ТипУчастника = ТипыУчастников().Контрагент;
КонецФункции

// Добавляет участника в таблицу участников
// 
// Параметры:
//  ТаблицаУчастников - См. НоваяТаблицаУчастников
//  Участник          - ЛюбаяСсылка - Добавляемый участник
//  ТипУчастника      - Строка      - Тип добавляемого участника
Процедура ДобавитьУчастника(ТаблицаУчастников, Знач Участник, Знач ТипУчастника)
	
	НайденнаяСтрока = ТаблицаУчастников.Найти(Участник, "Участник");
	
	Если НайденнаяСтрока = Неопределено Тогда
		
		НоваяСтрока = ТаблицаУчастников.Добавить();
		
		НоваяСтрока.Участник     = Участник;
		НоваяСтрока.ТипУчастника = ТипУчастника;
		
	ИначеЕсли НайденнаяСтрока.ТипУчастника = ТипУчастника Тогда 
		Возврат; // Ничего не делаем, участник уже добавлен ранее
	Иначе
		ВызватьИсключение(
			СтрШаблон(
				НСтр(
					"ru = 'Ошибка дублирования при добавлении участника %1:
					|- Тип добавляемого участника: %2
					|- Тип ранее добавленного участника: %3'",
					ОбщегоНазначения.КодОсновногоЯзыка()),
				Участник,
				ТипУчастника,
				НайденнаяСтрока.ТипУчастника));
	КонецЕсли;
	
КонецПроцедуры

// Получает шаблон текста запросов для данных участников
// 
// Возвращаемое значение:
//  Строка - Шаблон текста запроса
Функция ТекстЗапросаДанныеУчастника()
	
	Возврат
		"ВЫБРАТЬ
		|	Таблица.Ссылка КАК Участник,
		|	&ПутьИНН КАК ИНН,
		|	&ПутьКПП КАК КПП,
		|	&ПутьПредставление КАК Представление
		|ИЗ
		|	&Таблица КАК Таблица
		|ГДЕ
		|	Таблица.Ссылка В(&НаборСсылок)";
	
КонецФункции

// См. ОбщегоНазначенияБЭДПовтИсп.ИмяПрикладногоСправочника
Функция ИмяПрикладногоСправочника(Знач ИмяСправочника)
	Возврат ОбщегоНазначенияБЭДПовтИсп.ИмяПрикладногоСправочника(ИмяСправочника);
КонецФункции

// См. ОбщегоНазначенияБЭДПовтИсп.ИмяНаличиеОбъектаРеквизитаВПрикладномРешении
Функция ИмяРеквизитаПрикладногоСправочника(Знач ИмяРеквизита)
	Возврат ОбщегоНазначенияБЭДПовтИсп.ИмяНаличиеОбъектаРеквизитаВПрикладномРешении(ИмяРеквизита);
КонецФункции

// Получает текст запроса по данным типа участника.
// 
// Параметры:
//  ИмяПараметраСправочник            - Строка - Имя параметра для прикладного справочника
//  ИмяПараметраРеквизитИНН           - Строка - Имя параметра для реквизита ИНН
//  ИмяПараметраРеквизитКПП           - Строка - Имя параметра для реквизита КПП
//  ИмяПараметраРеквизитПредставление - Строка - Имя параметра для реквизита представления
//  ИмяПараметраНаборСсылок           - Строка - Имя параметра для набора ссылок
// 
// Возвращаемое значение:
//  Строка - Текст запроса по типа участника
Функция ТекстЗапросаДанныеУчастникаИБ(
	Знач ИмяПараметраСправочник,
	Знач ИмяПараметраРеквизитИНН,
	Знач ИмяПараметраРеквизитКПП,
	Знач ИмяПараметраРеквизитПредставление,
	Знач ИмяПараметраНаборСсылок)
	
	Результат = ТекстЗапросаДанныеУчастника();
	
	ИмяСправочника            = ИмяПрикладногоСправочника(ИмяПараметраСправочник);
	ИмяРеквизитаИНН           = ИмяРеквизитаПрикладногоСправочника(ИмяПараметраРеквизитИНН);
	ИмяРеквизитаКПП           = ИмяРеквизитаПрикладногоСправочника(ИмяПараметраРеквизитКПП);
	ИмяРеквизитаПредставление = ИмяРеквизитаПрикладногоСправочника(ИмяПараметраРеквизитПредставление);
	
	ПолноеИмяСправочника            = СтрШаблон("Справочник.%1" , ИмяСправочника);
	ПолноеИмяРеквизитаИНН           = СтрШаблон("Таблица.%1"    , ИмяРеквизитаИНН);
	ПолноеИмяРеквизитаКПП           = СтрШаблон("Таблица.%1"    , ИмяРеквизитаКПП);
	ПолноеИмяРеквизитаПредставление = СтрШаблон("Таблица.%1"    , ИмяРеквизитаПредставление);
	ПолноеИмяПараметра              = СтрШаблон("&%1"           , ИмяПараметраНаборСсылок);
	
	Результат = СтрЗаменить(Результат, "&Таблица"           , ПолноеИмяСправочника);
	Результат = СтрЗаменить(Результат, "&ПутьИНН"           , ПолноеИмяРеквизитаИНН);
	Результат = СтрЗаменить(Результат, "&ПутьКПП"           , ПолноеИмяРеквизитаКПП);
	Результат = СтрЗаменить(Результат, "&ПутьПредставление" , ПолноеИмяРеквизитаПредставление);
	Результат = СтрЗаменить(Результат, "&НаборСсылок"       , ПолноеИмяПараметра);
	
	Возврат Результат;
	
КонецФункции

// Текст разделителя запросов ОБЪЕДИНИТЬ ВСЕ.
// 
// Возвращаемое значение:
//  Строка - Текст разделителя запросов
Функция ТекстРазделителяОбъединитьВсе()
	Возврат Символы.ПС + Символы.ПС + "ОБЪЕДИНИТЬ ВСЕ" + Символы.ПС + Символы.ПС;
КонецФункции

// Получает данные контрагента по ссылке на контрагента
// 
// Параметры:
//  Контрагент - ОпределяемыйТип.УчастникЭДО
// 
// Возвращаемое значение:
//  См. НовыеДанныеУчастника
Функция ДанныеКонтрагента(Знач Контрагент)
	
	Участники = НоваяТаблицаУчастников();
	ДобавитьКонтрагента(Участники, Контрагент);
	ДанныеУчастников = ДанныеУчастников(Участники);
	Возврат ДанныеУчастника(ДанныеУчастников, Контрагент);
	
КонецФункции

#КонецОбласти

#Область Запросы

#Область ОбщегоНазначения

// Получает значение атрибута JSON
// 
// Параметры:
//  Объект              - Структура    - Объект, атрибут которого нужно получить
//  ИмяСвойства         - Строка       - Имя атрибута
//  ЗначениеПоУмолчанию - Неопределено - Значение по умолчанию
// 
// Возвращаемое значение:
//  Произвольный - Значение свойства
Функция ЗначениеАтрибута(Знач Объект, Знач ИмяСвойства, Знач ЗначениеПоУмолчанию = Неопределено)
	Возврат ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Объект, ИмяСвойства, ЗначениеПоУмолчанию)
КонецФункции

#КонецОбласти

#Область ЗапросСвязьИдентификаторовУчастников

// Метод-конструктор сведений об участнике связи
// 
// Возвращаемое значение:
//  Структура - Сведения об участнике связи:
//   * Идентификатор   - Строка          - Идентификатор ЭПД участника
//   * Идентификаторы  - ТаблицаЗначений - Допустимые идентификаторы участника:
//    ** Идентификатор - Строка          - Допустимый идентификатор ЭПД участника
//    ** Наименование  - Строка          - Наименование участника
//    ** Комментарий   - Строка          - Комментарий к идентификатору ЭПД
Функция НовыеСведенияОбУчастникеСвязи() Экспорт
	
	Результат = Новый Структура;
	
	Идентификаторы = Новый ТаблицаЗначений;
	Идентификаторы.Колонки.Добавить("Идентификатор" , Новый ОписаниеТипов("Строка"));
	Идентификаторы.Колонки.Добавить("Наименование"  , Новый ОписаниеТипов("Строка"));
	Идентификаторы.Колонки.Добавить("Комментарий"   , Новый ОписаниеТипов("Строка"));
	
	Результат.Вставить("Идентификатор", "");
	Результат.Вставить("Идентификаторы", Идентификаторы);
	
	Возврат Результат;
	
КонецФункции

// Метод конструктор параметров запроса связи идентификаторов участников
// 
// Возвращаемое значение:
//  Структура:
// * Организация   - ОпределяемыйТип.Организация
//                 - Неопределено 
// * УчастникиЭТрН - См. НовыеУчастникиЭТрН
Функция НовыеПараметрыЗапросаСвязьИдентификаторовУчастников()
	
	Результат = Новый Структура;
	
	Результат.Вставить("Организация"   , Неопределено);
	Результат.Вставить("УчастникиЭТрН" , НовыеУчастникиЭТрН());
	
	Возврат Результат;
	
КонецФункции

// Параметры запроса связи идентификаторов участников.
// 
// Параметры:
//  Организация   - ОпределяемыйТип.Организация - Организация для авторизации в сервисе 1С:Бизнес-сеть
//  УчастникиЭТрН - См. НовыеУчастникиЭТрН
// 
// Возвращаемое значение:
//  См. НовыеПараметрыЗапросаСвязьИдентификаторовУчастников
Функция ПараметрыЗапросаСвязьИдентификаторовУчастников(Знач Организация, Знач УчастникиЭТрН)
	
	Результат = НовыеПараметрыЗапросаСвязьИдентификаторовУчастников();
	
	Результат.Организация   = Организация;
	Результат.УчастникиЭТрН = УчастникиЭТрН;
	
	Возврат Результат;
	
КонецФункции

// Возвращаемое значение:
//  Структура:
// * inn - Строка
// * kpp - Строка
Функция ТелоЗапросаСвязьИдентификаторУчастника()
	
	Результат = Новый Структура;
	
	Результат.Вставить("inn" , "");
	Результат.Вставить("kpp" , "");
	
	Возврат Результат;
	
КонецФункции

// Возвращаемое значение:
//  Структура:
// * seller  - См. ТелоЗапросаСвязьИдентификаторУчастника
// * buyer   - См. ТелоЗапросаСвязьИдентификаторУчастника
Функция ТелоЗапросаСвязьИдентификаторовУчастников()
	
	Результат = Новый Структура;
	
	Результат.Вставить("seller"  , ТелоЗапросаСвязьИдентификаторУчастника());
	Результат.Вставить("buyer"   , ТелоЗапросаСвязьИдентификаторУчастника());
	
	Возврат Результат;
	
КонецФункции

// Параметры:
//  ТелоЗапроса      - См. ТелоЗапросаСвязьИдентификаторУчастника
//  ДанныеУчастников - См. НовыеДанныеУчастников
//  Участник         - ЛюбаяСсылка
Процедура ЗаполнитьДанныеУчастникаСвязи(ТелоЗапроса, Знач ДанныеУчастников, Знач Участник)
	
	ДанныеУчастника = ДанныеУчастника(ДанныеУчастников, Участник);
	
	ТелоЗапроса.inn = ДанныеУчастника.ИНН;
	ТелоЗапроса.kpp = ДанныеУчастника.КПП;
	
КонецПроцедуры

// Сериализатор набора участников в модель сервиса
// 
// Параметры:
//  УчастникиЭТрН - См. НовыеУчастникиЭТрН
// 
// Возвращаемое значение:
//  См. ТелоЗапросаСвязьИдентификаторовУчастников
Функция УчастникиЭТрНВМоделиСервиса(Знач УчастникиЭТрН)
	
	Результат = ТелоЗапросаСвязьИдентификаторовУчастников();
	
	ТаблицаУчастников = НоваяТаблицаУчастников();
	
	ДобавитьОрганизацию(ТаблицаУчастников, УчастникиЭТрН.Организация);
	ДобавитьКонтрагента(ТаблицаУчастников, УчастникиЭТрН.Контрагент);
	
	ДанныеУчастников = ДанныеУчастников(ТаблицаУчастников);
	
	ЗаполнитьДанныеУчастникаСвязи(Результат.seller, ДанныеУчастников, УчастникиЭТрН.Организация);
	ЗаполнитьДанныеУчастникаСвязи(Результат.buyer, ДанныеУчастников, УчастникиЭТрН.Контрагент);
	
	Возврат Результат;
	
КонецФункции

// Формирует запрос к сервису для получения идентификаторов ЭПД
// 
// Параметры:
//  ПараметрыЗапроса - См. НовыеПараметрыЗапросаСвязьИдентификаторовУчастников
// 
// Возвращаемое значение:
//  См. НовыйЗапрос
Функция ЗапросСервисаСвязьИдентификаторовУчастников(Знач ПараметрыЗапроса)
	
	Результат = НовыйЗапрос(
		"ПолучитьИдентификаторыУчастников", 
		ИнтернетСоединениеБЭД.HTTPМетоды().POST,
		ПараметрыЗапроса.Организация,
		"hub/identifiers/relation");
	
	Результат.ТипЗапроса   = "application/vnd.1cedi.identifiers.relation.filter.v1+json";
	Результат.ТипОтвета    = "application/vnd.1cedi.identifiers.relation.v1+json";
	Результат.Тело         = УчастникиЭТрНВМоделиСервиса(ПараметрыЗапроса.УчастникиЭТрН);
	Результат.ФорматОтвета = ФорматыОтвета().HTTPОтвет;
	Результат.КодыОтвета.Добавить(404);
	
	Возврат Результат;
	
КонецФункции

// Параметры:
//  Ответ - HTTPОтвет - Ответ от сервиса
// 
// Возвращаемое значение:
//  См. НоваяСвязьИдентификаторовУчастниковЭТрН
Функция СвязьИдентификаторовУчастниковИзМоделиСервиса(Знач Ответ)
	
	Результат = НоваяСвязьИдентификаторовУчастниковЭТрН();
	
	Если Ответ.КодСостояния <> 200 Тогда
		Возврат Результат;
	КонецЕсли;
	
	ТелоОтвета = ДанныеJSON(Ответ); // Структура
	
	Идентификатор = ЗначениеАтрибута(ТелоОтвета, "seller"); // Строка
	Результат.Организация.Идентификатор = Идентификатор;
	
	Идентификатор = ЗначениеАтрибута(ТелоОтвета, "buyer"); // Строка
	Результат.Контрагент.Идентификатор = Идентификатор;
	
	Возврат Результат;
	
КонецФункции

// Получает идентификаторы ЭПД из сервиса 1С:EDI по таблице поиска
// 
// Параметры:
//  Организация   - ОпределяемыйТип.Организация - Организация для авторизации в сервисе 1С:Бизнес-сеть
//  УчастникиЭТрН - См. НовыеУчастникиЭТрН
// 
// Возвращаемое значение:
//  См. НоваяСвязьИдентификаторовУчастниковЭТрН
Функция СвязьИдентификаторовУчастников(Знач Организация, Знач УчастникиЭТрН)
	
	ПараметрыЗапроса = ПараметрыЗапросаСвязьИдентификаторовУчастников(Организация, УчастникиЭТрН);
	ЗапросСервиса    = ЗапросСервисаСвязьИдентификаторовУчастников(ПараметрыЗапроса);
	РезультатЗапроса = ВыполнитьЗапрос(ЗапросСервиса);
	
	ОбщегоНазначенияКлиентСервер.Проверить(
		Не РезультатЗапроса.Отказ,
		СтрШаблон(
			НСтр(
				"ru = 'Ошибка получения идентификаторов из сервиса 1С:EDI по причине: %1'",
				ОбщегоНазначения.КодОсновногоЯзыка()),
			РезультатЗапроса.ТекстОшибки),
		"СервисEDIСлужебный.ИдентификаторыУчастниковПровайдераЭПД");
	
	Возврат СвязьИдентификаторовУчастниковИзМоделиСервиса(РезультатЗапроса.Данные);
	
КонецФункции

#КонецОбласти

#Область ИдентификаторыУчастниковЭТрН

// Метод-конструктор таблицы идентификаторов участников
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Идентификаторы участников:
// * Участник - ЛюбаяСсылка       - Участник ЭПД
// * ИдентификаторСтроки - Строка - Идентификатор строки таблицы (для поиска)
// * ИдентификаторЭПД    - Строка - Идентификатор ЭПД
// * Комментарий - Строка         - Комментарий для идентификатора ЭПД
Функция НовыеИдентификаторыУчастников() Экспорт
	
	Результат = Новый ТаблицаЗначений;
	
	Результат.Колонки.Добавить("Участник"            , ОбщегоНазначения.ОписаниеТипаВсеСсылки());
	Результат.Колонки.Добавить("ИдентификаторСтроки" , Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ИдентификаторЭПД"    , Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("Комментарий"         , Новый ОписаниеТипов("Строка"));
	
	Возврат Результат;
	
КонецФункции

// Метод-конструктор таблицы идентификаторов участников (по данным сервиса)
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Идентификаторы участников:
// * ИдентификаторСтроки - Строка - Идентификатор строки таблицы (для поиска)
// * ИдентификаторЭПД    - Строка - Идентификатор ЭПД
// * Комментарий - Строка         - Комментарий для идентификатора ЭПД
Функция НоваяТаблицаИдентификаторов()
	
	Результат = Новый ТаблицаЗначений;
	
	Результат.Колонки.Добавить("ИдентификаторСтроки" , Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ИдентификаторЭПД"    , Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("Комментарий"         , Новый ОписаниеТипов("Строка"));
	
	Возврат Результат;
	
КонецФункции

// Метод конструктор параметров запроса идентификаторов участников
// 
// Возвращаемое значение:
//  Структура:
// * Организация   - ОпределяемыйТип.Организация
//                 - Неопределено 
// * ТаблицаПоиска - См. НоваяТаблицаПоискаИдентификаторов
Функция НовыеПараметрыЗапросаИдентификаторыУчастников()
	
	Результат = Новый Структура;
	
	Результат.Вставить("Организация"   , Неопределено);
	Результат.Вставить("ТаблицаПоиска" , НоваяТаблицаПоискаИдентификаторов());
	
	Возврат Результат;
	
КонецФункции

// Получает идентификаторы ЭПД из сервиса 1С:EDI по таблице участников
// 
// Параметры:
//  Организация   - ОпределяемыйТип.Организация - Организация для авторизации в сервисе 1С:Бизнес-сеть
//  ТаблицаУчастников - См. НоваяТаблицаУчастников
// 
// Возвращаемое значение:
//  См. НовыеИдентификаторыУчастников
Функция ИдентификаторыУчастниковЭПД(Знач Организация, Знач ТаблицаУчастников)
	
	Результат = НовыеИдентификаторыУчастников();
	
	Если ТаблицаУчастников.Количество() = 0 Тогда
		Возврат Результат;
	КонецЕсли;
	
	ДанныеУчастников = ДанныеУчастников(ТаблицаУчастников);
	
	ТаблицаПоиска = НоваяТаблицаПоискаИдентификаторов();
	Индекс        = 0;
	
	ИдентификаторыСтрокУчастников = Новый Соответствие;
	
	Для Каждого ДанныеУчастника Из ДанныеУчастников Цикл
		Если ЭтоИННКПП(ДанныеУчастника.ИНН, ДанныеУчастника.КПП) Тогда
			Индекс = Индекс + 1;
			
			НоваяСтрока = ТаблицаПоиска.Добавить();
			НоваяСтрока.ИдентификаторСтроки = XMLСтрока(Индекс);
			НоваяСтрока.ИНН                 = ДанныеУчастника.ИНН;
			НоваяСтрока.КПП                 = ДанныеУчастника.КПП;
			
			ИдентификаторыСтрокУчастников.Вставить(НоваяСтрока.ИдентификаторСтроки, ДанныеУчастника.Участник);
		КонецЕсли;
	КонецЦикла;
	
	Если ТаблицаПоиска.Количество() = 0 Тогда
		Возврат Результат;
	КонецЕсли;
	
	ИдентификаторыУчастников = ИдентификаторыУчастниковПровайдераЭПД(Организация, ТаблицаПоиска);
	
	Для Каждого ИдентификаторУчастника Из ИдентификаторыУчастников Цикл
		НоваяСтрока = Результат.Добавить();
		НоваяСтрока.Участник            = ИдентификаторыСтрокУчастников[ИдентификаторУчастника.ИдентификаторСтроки];
		НоваяСтрока.ИдентификаторСтроки = ИдентификаторУчастника.ИдентификаторСтроки;
		НоваяСтрока.ИдентификаторЭПД    = ИдентификаторУчастника.ИдентификаторЭПД;
		НоваяСтрока.Комментарий         = ИдентификаторУчастника.Комментарий;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Метод-конструктор таблицы идентификаторов участников
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Идентификаторы участников:
// * ИдентификаторСтроки - Строка - Идентификатор строки таблицы (для поиска)
// * ИНН                 - Строка - Идентификатор ЭПД
// * КПП                 - Строка - Идентификатор ЭПД
Функция НоваяТаблицаПоискаИдентификаторов()
	
	Результат = Новый ТаблицаЗначений;
	
	Результат.Колонки.Добавить("ИдентификаторСтроки" , Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ИНН"                 , ОбщегоНазначения.ОписаниеТипаСтрока(12));
	Результат.Колонки.Добавить("КПП"                 , ОбщегоНазначения.ОписаниеТипаСтрока(9));
	
	Возврат Результат;
	
КонецФункции

// Параметры запроса идентификаторы участников.
// 
// Параметры:
//  Организация   - ОпределяемыйТип.Организация - Организация для авторизации в сервисе 1С:Бизнес-сеть
//  ТаблицаПоиска - См. НоваяТаблицаПоискаИдентификаторов
// 
// Возвращаемое значение:
//  См. НовыеПараметрыЗапросаИдентификаторыУчастников
Функция ПараметрыЗапросаИдентификаторыУчастников(Знач Организация, Знач ТаблицаПоиска)
	
	Результат = НовыеПараметрыЗапросаИдентификаторыУчастников();
	
	Результат.Организация   = Организация;
	Результат.ТаблицаПоиска = ТаблицаПоиска;
	
	Возврат Результат;
	
КонецФункции

// Метод-конструктор тела запроса для поиска идентификаторов участников.
// 
// Возвращаемое значение:
//  Структура - Тело запроса:
// * legal - Массив Из См. ТелоЗапросаИдентификаторУчастника 
Функция ТелоЗапросаИдентификаторыУчастников()
	
	Результат = Новый Структура;
	
	Результат.Вставить("legal", Новый Массив);
	
	Возврат Результат;
	
КонецФункции

// Метод-конструктор элемента тела запроса поиска идентификатор участника.
// 
// Возвращаемое значение:
//  Структура - Идентификатор участника:
// * id  - Строка - Идентификатор строки поиска
// * inn - Строка - ИНН участника
// * kpp - Строка - КПП участника
Функция ТелоЗапросаИдентификаторУчастника()
	
	Результат = Новый Структура;
	
	Результат.Вставить("id"  , "");
	Результат.Вставить("inn" , "");
	Результат.Вставить("kpp" , "");
	
	Возврат Результат;
	
КонецФункции

// Таблица поиска идентификаторов в модели сервиса.
// 
// Параметры:
//  ТаблицаПоиска - См. НоваяТаблицаПоискаИдентификаторов
// 
// Возвращаемое значение:
//  См. ТелоЗапросаИдентификаторыУчастников
Функция ТаблицаПоискаИдентификаторовВМоделиСервиса(Знач ТаблицаПоиска)
	
	Результат = ТелоЗапросаИдентификаторыУчастников();
	
	Для Каждого СтрокаТаблицыПоиска Из ТаблицаПоиска Цикл
		Элемент = ТелоЗапросаИдентификаторУчастника();
		
		Элемент.id  = СтрокаТаблицыПоиска.ИдентификаторСтроки;
		Элемент.inn = СтрокаТаблицыПоиска.ИНН;
		Элемент.kpp = СтрокаТаблицыПоиска.КПП;
		
		Результат.legal.Добавить(Элемент);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Формирует запрос к сервису для получения идентификаторов ЭПД
// 
// Параметры:
//  ПараметрыЗапроса - См. НовыеПараметрыЗапросаИдентификаторыУчастников
// 
// Возвращаемое значение:
//  См. НовыйЗапрос
Функция ЗапросСервисаИдентификаторыУчастников(Знач ПараметрыЗапроса)
	
	Результат = НовыйЗапрос(
		"ПолучитьИдентификаторыУчастников", 
		ИнтернетСоединениеБЭД.HTTPМетоды().POST,
		ПараметрыЗапроса.Организация,
		"hub/identifiers");
	
	Результат.ТипЗапроса   = "application/vnd.1cedi.identifiers.filter.v1+json";
	Результат.ТипОтвета    = "application/vnd.1cedi.identifiers.list.v1+json";
	Результат.Тело         = ТаблицаПоискаИдентификаторовВМоделиСервиса(ПараметрыЗапроса.ТаблицаПоиска);
	Результат.ФорматОтвета = ФорматыОтвета().JSON;
	
	Возврат Результат;
	
КонецФункции

// Читает идентификаторы участников из модели сервиса.
// 
// Параметры:
//  Ответ - Массив Из Структура - Тело ответа
// 
// Возвращаемое значение:
//  См. НоваяТаблицаИдентификаторов
Функция ИдентификаторыУчастниковИзМоделиСервиса(Знач Ответ)
	
	Результат = НоваяТаблицаИдентификаторов();
	
	Для Каждого ИдентификаторУчастника Из Ответ Цикл
		НоваяСтрока = Результат.Добавить();
		//@skip-check statement-type-change - Работа с JSON
		НоваяСтрока.ИдентификаторСтроки = ЗначениеАтрибута(ИдентификаторУчастника, "id"); // Строка
		//@skip-check statement-type-change - Работа с JSON
		НоваяСтрока.ИдентификаторЭПД    = ЗначениеАтрибута(ИдентификаторУчастника, "providerId"); // Строка
		//@skip-check statement-type-change - Работа с JSON
		НоваяСтрока.Комментарий         = ЗначениеАтрибута(ИдентификаторУчастника, "comment"); // Строка
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Получает идентификаторы ЭПД из сервиса 1С:EDI по таблице поиска
// 
// Параметры:
//  Организация   - ОпределяемыйТип.Организация - Организация для авторизации в сервисе 1С:Бизнес-сеть
//  ТаблицаПоиска - См. НоваяТаблицаПоискаИдентификаторов
// 
// Возвращаемое значение:
//  См. НоваяТаблицаИдентификаторов
Функция ИдентификаторыУчастниковПровайдераЭПД(Знач Организация, Знач ТаблицаПоиска)
	
	ПараметрыЗапроса = ПараметрыЗапросаИдентификаторыУчастников(Организация, ТаблицаПоиска);
	ЗапросСервиса    = ЗапросСервисаИдентификаторыУчастников(ПараметрыЗапроса);
	РезультатЗапроса = ВыполнитьЗапрос(ЗапросСервиса);
	
	ОбщегоНазначенияКлиентСервер.Проверить(
		Не РезультатЗапроса.Отказ,
		СтрШаблон(
			НСтр(
				"ru = 'Ошибка получения идентификаторов из сервиса 1С:EDI по причине: %1'",
				ОбщегоНазначения.КодОсновногоЯзыка()),
			РезультатЗапроса.ТекстОшибки),
		"СервисEDIСлужебный.ИдентификаторыУчастниковПровайдераЭПД");
	
	Возврат ИдентификаторыУчастниковИзМоделиСервиса(РезультатЗапроса.Данные);
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область Сообщения

#Область ЗапросОтправитьСообщение

// Метод-конструктор параметров для запроса отправить сообщение.
// 
// Возвращаемое значение:
//  Структура - Новые параметры запроса отправить сообщение:
// * Организация    - ОпределяемыйТип.Организация - Организация для авторизации в сервисе 1С:EDI
//                  - Неопределено                - Не задана
// * ДвоичныеДанные - ДвоичныеДанные              - Двоичные данные сообщения
//                  - Неопределено                - Не заданы
// * ИмяФайла       - Строка                      - Имя файла отправляемого сообщения
Функция НовыеПараметрыЗапросаОтправитьСообщение()
	
	Результат = Новый Структура;
	
	Результат.Вставить("Организация"    , Неопределено);
	Результат.Вставить("ДвоичныеДанные" , Неопределено);
	Результат.Вставить("ИмяФайла"       , "");
	
	Возврат Результат;
	
КонецФункции

// Формирует параметры для запроса отправить сообщение.
// 
// Параметры:
//  ПараметрыОтправки - См. СинхронизацияЭДОСлужебный.НовыеПараметрыОтправкиТранспортногоКонтейнера
// 
// Возвращаемое значение:
//  См. НовыеПараметрыЗапросаОтправитьСообщение
Функция ПараметрыЗапросаОтправитьСообщение(Знач ПараметрыОтправки)
	
	Результат = НовыеПараметрыЗапросаОтправитьСообщение();
	
	Результат.Организация    = УчетныеЗаписиЭДО.ОрганизацияУчетнойЗаписи(
		ПараметрыОтправки.РеквизитыКонтейнера.Отправитель);
	Результат.ДвоичныеДанные = ПараметрыОтправки.ДанныеДляОтправки.ДвоичныеДанные;
	Результат.ИмяФайла       = ПараметрыОтправки.ДанныеДляОтправки.Наименование;
	
	Возврат Результат;
	
КонецФункции

// Формирует запрос к сервису для отправки сообщения
// 
// Параметры:
//  ПараметрыЗапроса - См. НовыеПараметрыЗапросаОтправитьСообщение
// 
// Возвращаемое значение:
//  См. НовыйЗапрос
Функция ЗапросСервисаОтправитьСообщение(Знач ПараметрыЗапроса)
	
	Результат = НовыйЗапрос(
		"ОтправитьСообщение", 
		ИнтернетСоединениеБЭД.HTTPМетоды().POST,
		ПараметрыЗапроса.Организация,
		"hub/messages",
		201);
	
	Результат.ТипЗапроса   = "application/zip";
	Результат.Тело         = ПараметрыЗапроса.ДвоичныеДанные;
	Результат.ФорматОтвета = ФорматыОтвета().Неопределено;
	
	Результат.Заголовки.Вставить(ЗаголовкиHTTP().ИмяФайла, ПараметрыЗапроса.ИмяФайла);
	
	Возврат Результат;
	
КонецФункции

// Отправляет сообщение через сервис 1С:EDI.
// 
// Параметры:
//  ПараметрыОтправки - См. СинхронизацияЭДОСлужебный.НовыеПараметрыОтправкиТранспортногоКонтейнера
// 
// Возвращаемое значение:
//  См. НовыйРезультатВыполненияОперации
Функция ОтправитьСообщение(Знач ПараметрыОтправки)
	
	РезультатВыполнения = НовыйРезультатВыполненияОперации();
	ПараметрыЗапроса    = ПараметрыЗапросаОтправитьСообщение(ПараметрыОтправки);
	ЗапросСервиса       = ЗапросСервисаОтправитьСообщение(ПараметрыЗапроса);
	РезультатЗапроса    = ВыполнитьЗапрос(ЗапросСервиса);
	
	Если РезультатЗапроса.Отказ Тогда
		РезультатВыполнения.Отказ       = Истина;
		РезультатВыполнения.ТекстОшибки = РезультатЗапроса.ТекстОшибки;
	КонецЕсли;
	
	Возврат РезультатВыполнения;
	
КонецФункции

#КонецОбласти

#Область ЗапросПолучитьПорциюДокументов

// Возвращаемое значение:
//  Структура:
// * Организация      - ОпределяемыйТип.Организация
//                    - Неопределено
// * РазмерСтраницы   - Число
//                    - Неопределено
// * ПоложениеКурсора - Строка
//                    - Неопределено
Функция НовыеПараметрыЗапросаПолучитьПорциюДокументов()
	
	Результат = Новый Структура;
	
	Результат.Вставить("Организация"      , Неопределено);
	Результат.Вставить("РазмерСтраницы"   , Неопределено);
	Результат.Вставить("ПоложениеКурсора" , Неопределено);
	
	Возврат Результат;
	
КонецФункции

// Параметры:
//  Организация - ОпределяемыйТип.Организация
//  Пагинация   - См. НоваяПагинация 
// 
// Возвращаемое значение:
//  См. НовыеПараметрыЗапросаПолучитьПорциюДокументов
Функция ПараметрыЗапросаПолучитьПорциюДокументов(Знач Организация, Знач Пагинация)
	
	Результат = НовыеПараметрыЗапросаПолучитьПорциюДокументов();
	
	Результат.Организация      = Организация;
	Результат.РазмерСтраницы   = Пагинация.РазмерСтраницы;
	Результат.ПоложениеКурсора = Пагинация.ПоложениеКурсора;
	
	Возврат Результат;
	
КонецФункции

// Параметры:
//  ПараметрыЗапроса - См. НовыеПараметрыЗапросаПолучитьПорциюДокументов
// 
// Возвращаемое значение:
//  См. НовыйЗапрос
Функция ЗапросСервисаПолучитьПорциюДокументов(Знач ПараметрыЗапроса)
	
	Результат = НовыйЗапрос(
		"ПолучитьСообщения", 
		ИнтернетСоединениеБЭД.HTTPМетоды().GET,
		ПараметрыЗапроса.Организация,
		"hub/messages",
		200);
	
	Результат.ТипОтвета    = "application/vnd.1cedi.messages.list.v1+json";
	Результат.ФорматОтвета = ФорматыОтвета().JSON;
	
	Результат.Параметры.Вставить("size"   , ПараметрыЗапроса.РазмерСтраницы);
	Результат.Параметры.Вставить("cursor" , ПараметрыЗапроса.ПоложениеКурсора);
	
	Возврат Результат;
	
КонецФункции

// Возвращаемое значение:
//  Структура:
// * Список - См. НовыеДокументыОрганизации
// * ПоложениеКурсора - Строка
//                    - Неопределено
Функция НоваяПорцияДокументов()
	
	Результат = Новый Структура;
	
	Результат.Вставить("Список"           , НовыеДокументыОрганизации());
	Результат.Вставить("ПоложениеКурсора" , Неопределено);
	
	Возврат Результат;
	
КонецФункции

// Параметры:
//  Данные - Структура
// 
// Возвращаемое значение:
//  См. НоваяПорцияДокументов
Функция ПорцияДокументовИзМоделиСервиса(Знач Данные)
	
	Результат = НоваяПорцияДокументов();
	
	Результат.ПоложениеКурсора = ЗначениеПоПути(Данные, "page.next"); // Строка
	Файлы                      = ЗначениеПоПути(Данные, "embedded", Новый Массив); // Массив Из Структура
	
	Для Каждого Файл Из Файлы Цикл
		Идентификатор = ЗначениеПоПути(Файл, "id"); // Строка
		
		НоваяСтрока = Результат.Список.Добавить();
		НоваяСтрока.Идентификатор = Идентификатор;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Параметры:
//  Организация - ОпределяемыйТип.Организация
//  Пагинация   - См. НоваяПагинация 
// 
// Возвращаемое значение:
//  См. НоваяПорцияДокументов
Функция ПолучитьПорциюДокументов(Знач Организация, Знач Пагинация)
	
	ПараметрыЗапроса    = ПараметрыЗапросаПолучитьПорциюДокументов(Организация, Пагинация);
	ЗапросСервиса       = ЗапросСервисаПолучитьПорциюДокументов(ПараметрыЗапроса);
	РезультатЗапроса    = ВыполнитьЗапрос(ЗапросСервиса);
	
	ОбщегоНазначенияКлиентСервер.Проверить(
		Не РезультатЗапроса.Отказ,
		СтрШаблон(
			НСтр(
				"ru = 'Ошибка получения порции документов из сервиса 1С:EDI по причине: %1'",
				ОбщегоНазначения.КодОсновногоЯзыка()),
			РезультатЗапроса.ТекстОшибки),
		"СервисEDIСлужебный.ПолучитьПорциюДокументов");
	
	Возврат ПорцияДокументовИзМоделиСервиса(РезультатЗапроса.Данные);
	
КонецФункции

#КонецОбласти

#Область ЗапросОписаниеДокумента

// Возвращаемое значение:
//  Структура:
// * Организация      - ОпределяемыйТип.Организация
//                    - Неопределено
// * Идентификатор    - Строка
Функция НовыеПараметрыЗапросаОписаниеДокумента()
	
	Результат = Новый Структура;
	
	Результат.Вставить("Организация"   , Неопределено);
	Результат.Вставить("Идентификатор" , "");
	
	Возврат Результат;
	
КонецФункции

// Параметры:
//  Организация   - ОпределяемыйТип.Организация
//  Идентификатор - Строка
// 
// Возвращаемое значение:
//  См. НовыеПараметрыЗапросаОписаниеДокумента 
Функция ПараметрыЗапросаОписаниеДокумента(Знач Организация, Знач Идентификатор)
	
	Результат = НовыеПараметрыЗапросаОписаниеДокумента();
	
	Результат.Организация   = Организация;
	Результат.Идентификатор = Идентификатор;
	
	Возврат Результат;
	
КонецФункции

// Параметры:
//  ПараметрыЗапроса - См. НовыеПараметрыЗапросаОписаниеДокумента 
// 
// Возвращаемое значение:
//  См. НовыйЗапрос
Функция ЗапросСервисаОписаниеДокумента(ПараметрыЗапроса)
	
	Результат = НовыйЗапрос(
		"ОписаниеДокумента", 
		ИнтернетСоединениеБЭД.HTTPМетоды().GET,
		ПараметрыЗапроса.Организация,
		СтрШаблон("hub/messages/%1", ПараметрыЗапроса.Идентификатор),
		200);
	
	Результат.ТипОтвета    = "application/zip";
	Результат.ФорматОтвета = ФорматыОтвета().HTTPОтвет;
	
	Возврат Результат;
	
КонецФункции

// Параметры:
//  Данные           - HTTPОтвет
//  ПараметрыЗапроса - См. НовыеПараметрыЗапросаОписаниеДокумента
// 
// Возвращаемое значение:
//  См. НовоеОписаниеДокумента
Функция ОписаниеДокументаИзМоделиСервиса(Знач Данные, Знач ПараметрыЗапроса)
	
	Результат = НовоеОписаниеДокумента();
	
	Результат.Данные        = Данные.ПолучитьТелоКакДвоичныеДанные();
	Результат.Имя           = ЗначениеЗаголовка(Данные, ЗаголовкиHTTP().ИмяФайла);
	Результат.Идентификатор = ПараметрыЗапроса.Идентификатор;
	
	Возврат Результат;
	
КонецФункции

// Параметры:
//  Организация   - ОпределяемыйТип.Организация
//  Идентификатор - Строка
// 
// Возвращаемое значение:
//  См. НовоеОписаниеДокумента
Функция ОписаниеДокумента(Знач Организация, Знач Идентификатор)
	
	ПараметрыЗапроса    = ПараметрыЗапросаОписаниеДокумента(Организация, Идентификатор);
	ЗапросСервиса       = ЗапросСервисаОписаниеДокумента(ПараметрыЗапроса);
	РезультатЗапроса    = ВыполнитьЗапрос(ЗапросСервиса);
	
	ОбщегоНазначенияКлиентСервер.Проверить(
		Не РезультатЗапроса.Отказ,
		СтрШаблон(
			НСтр(
				"ru = 'Ошибка получения описания документа из сервиса 1С:EDI по причине: %1'",
				ОбщегоНазначения.КодОсновногоЯзыка()),
			РезультатЗапроса.ТекстОшибки),
		"СервисEDIСлужебный.ОписаниеДокумента");
	
	Возврат ОписаниеДокументаИзМоделиСервиса(РезультатЗапроса.Данные, ПараметрыЗапроса);
	
КонецФункции

#КонецОбласти

#Область ЗапросОтметитьПолучениеСообщения

// Возвращаемое значение:
//  Структура:
// * Организация      - ОпределяемыйТип.Организация
//                    - Неопределено
// * Идентификатор    - Строка
Функция НовыеПараметрыЗапросаОтметитьПолучениеСообщения()
	
	Результат = Новый Структура;
	
	Результат.Вставить("Организация"   , Неопределено);
	Результат.Вставить("Идентификатор" , "");
	
	Возврат Результат;
	
КонецФункции

// Параметры:
//  Организация   - ОпределяемыйТип.Организация
//  Идентификатор - Строка
// 
// Возвращаемое значение:
//  См. НовыеПараметрыЗапросаОтметитьПолучениеСообщения 
Функция ПараметрыЗапросаОтметитьПолучениеСообщения(Знач Организация, Знач Идентификатор)
	
	Результат = НовыеПараметрыЗапросаОтметитьПолучениеСообщения();
	
	Результат.Организация   = Организация;
	Результат.Идентификатор = Идентификатор;
	
	Возврат Результат;
	
КонецФункции

// Параметры:
//  ПараметрыЗапроса - См. НовыеПараметрыЗапросаОписаниеДокумента 
// 
// Возвращаемое значение:
//  См. НовыйЗапрос
Функция ЗапросСервисаОтметитьПолучениеСообщения(ПараметрыЗапроса)
	
	Результат = НовыйЗапрос(
		"ОписаниеДокумента", 
		ИнтернетСоединениеБЭД.HTTPМетоды().PATCH,
		ПараметрыЗапроса.Организация,
		СтрШаблон("hub/messages/%1", ПараметрыЗапроса.Идентификатор),
		200);
	
	Результат.ФорматОтвета = ФорматыОтвета().Неопределено;
	
	Возврат Результат;
	
КонецФункции

// Параметры:
//  Организация   - ОпределяемыйТип.Организация
//  Идентификатор - Строка
Процедура ОтметитьПолучениеСообщения(Знач Организация, Знач Идентификатор)
	
	ПараметрыЗапроса    = ПараметрыЗапросаОтметитьПолучениеСообщения(Организация, Идентификатор);
	ЗапросСервиса       = ЗапросСервисаОтметитьПолучениеСообщения(ПараметрыЗапроса);
	
	ВыполнитьЗапрос(ЗапросСервиса);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область Операции

// Метод-конструктор результата выполнения операции
// 
// Возвращаемое значение:
//  Структура - Новый результат выполнения запроса:
// * Отказ       - Булево       - Истина, если операция выполнена с ошибками.
//                                Ложь, в ином случае.
// * ТекстОшибки - Строка       - Текст ошибки при выполнении операции
// * Данные      - Произвольный - Результат выполнения операции
//               - Неопределено - Выходные данные отсутствуют
Функция НовыйРезультатВыполненияОперации()
	
	Результат = Новый Структура;
	
	Результат.Вставить("Отказ"       , Ложь);
	Результат.Вставить("ТекстОшибки" , "");
	Результат.Вставить("Данные"      , Неопределено);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область ВзаимодействиеССервисом

#Область Конструкторы

// Метод-конструктор запроса к сервису 1С:EDI
// 
// Параметры:
//  Имя         - Строка                      - Имя метода сервиса
//  Метод       - Строка                      - Имя HTTP-метода запроса
//  Организация - ОпределяемыйТип.Организация - Организация для получения абсолютного пути и токена
//  Адрес       - Строка                      - Путь к ресурсу на сервере
//  КодОтвета   - Число                       - Ожидаемый код ответа
// 
// Возвращаемое значение:
//  Структура - Запрос:
// * Имя          - Строка                        - Имя метода сервиса 
// * Метод        - Строка                        - Имя HTTP-метода запроса 
// * Организация  - ОпределяемыйТип.Организация   - Организация для получения абсолютного пути и токена
//                - Неопределено                  - Не задана
// * Адрес        - Строка                        - Путь к ресурсу на сервере
// * Тело         - Строка                        - Текст тела запроса
//                - Массив Из Произвольный        - JSON-объект
//                - Структура                     - JSON-объект
//                - ДвоичныеДанные                - Двоичные данные тела запроса
//                - Неопределено                  - Тело запроса не задано  
// * ТипЗапроса   - Строка                        - Заголовок Content-Type
//                - Неопределено                  - Не задан
// * ТипОтвета    - Строка                        - Заголовок Accept
//                - Неопределено                  - Не задан
// * Таймаут      - Число                         - Длительность таймаута запроса
// * КодыОтвета   - Массив Из Число               - Допустимые коды ответа
// * ФорматОтвета - Строка                        - Формат, в котором следует вернуть ответ сервиса
//                                                  См. ФорматыОтвета
// * Заголовки    - Соответствие Из КлючИЗначение - Заголовки запроса:
//  ** Ключ       - Строка                        - Имя заголовка
//  ** Значение   - Строка                        - Значение заголовка
// * Параметры    - Соответствие Из КлючИЗначение - Параметры запроса:
//  ** Ключ       - Строка                        - Имя параметра
//  ** Значение   - Строка                        - Значение параметра
Функция НовыйЗапрос(Знач Имя, Знач Метод, Знач Организация, Знач Адрес, Знач КодОтвета = 200)
	
	Результат = Новый Структура;
	
	Результат.Вставить("Имя"          , Имя);
	Результат.Вставить("Метод"        , Метод);
	Результат.Вставить("Организация"  , Организация);
	Результат.Вставить("Адрес"        , Адрес);
	Результат.Вставить("Тело"         , Неопределено);
	Результат.Вставить("ТипЗапроса"   , Неопределено);
	Результат.Вставить("ТипОтвета"    , Неопределено);
	Результат.Вставить("Таймаут"      , 60);
	Результат.Вставить("КодыОтвета"   , ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(КодОтвета));
	Результат.Вставить("ФорматОтвета" , ФорматыОтвета().HTTPОтвет);
	Результат.Вставить("Заголовки"    , Новый Соответствие);
	Результат.Вставить("Параметры"    , Новый Соответствие);
	
	Возврат Результат;
	
КонецФункции

// Метод-конструктор результата выполнения запроса к сервису
// 
// Возвращаемое значение:
//  Структура - Новый результат выполнения запроса:
// * Отказ       - Булево              - Истина, если запрос выполнен с ошибками.
//                                       Ложь, в ином случае.
// * ТекстОшибки - Строка              - Текст ошибки при выполнении запроса
// * Данные      - HTTPОтвет           - Если Запрос.ФорматОтвета=ФорматыОтвета().HTTPОтвет
//               - ДвоичныеДанные      - Если Запрос.ФорматОтвета=ФорматыОтвета().ДвоичныеДанные
//               - Поток               - Если Запрос.ФорматОтвета=ФорматыОтвета().Поток
//               - Строка              - Если Запрос.ФорматОтвета=ФорматыОтвета().Строка
//               - Структура           - Если Запрос.ФорматОтвета=ФорматыОтвета().JSON
//               - Массив Из Структура - Если Запрос.ФорматОтвета=ФорматыОтвета().JSON
//               - Неопределено        - Если Запрос.ФорматОтвета=ФорматыОтвета().Неопределено
Функция НовыйРезультатВыполненияЗапроса()
	
	Результат = Новый Структура;
	
	Результат.Вставить("Отказ"       , Ложь);
	Результат.Вставить("ТекстОшибки" , "");
	Результат.Вставить("Данные"      , Неопределено);
	
	Возврат Результат;
	
КонецФункции

// Метод-конструктор нового HTTP-соединения
// 
// Параметры:
//  СтруктураURI - См. ОбщегоНазначенияКлиентСервер.СтруктураURI
//  Таймаут      - Число - Длительность таймаута запроса
// 
// Возвращаемое значение:
//  HTTPСоединение
Функция НовоеHTTPСоединение(Знач СтруктураURI, Знач Таймаут)
	
	Если СтруктураURI.Схема = "https" Тогда
		ЗащищенноеСоединение = ОбщегоНазначенияКлиентСервер.НовоеЗащищенноеСоединение();
		ПортПоУмолчанию      = 443;
	Иначе
		ЗащищенноеСоединение = Неопределено;
		ПортПоУмолчанию      = 80;
	КонецЕсли;
	
	Порт = 
		?(СтруктураURI.Порт = Неопределено,
			ПортПоУмолчанию,
			СтруктураURI.Порт);
	
	Прокси = ПолучениеФайловИзИнтернета.ПолучитьПрокси(СтруктураURI.Схема);
	
	Возврат Новый HTTPСоединение(
		СтруктураURI.Хост, 
		Порт, 
		СтруктураURI.Логин, 
		СтруктураURI.Пароль, 
		Прокси,
		Таймаут, 
		ЗащищенноеСоединение);
	
КонецФункции

// Метод-конструктор нового HTTP-запроса
// 
// Параметры:
//  СтруктураURI - См. ОбщегоНазначенияКлиентСервер.СтруктураURI
//  Запрос       - См. НовыйЗапрос
// 
// Возвращаемое значение:
//  HTTPЗапрос
Функция НовыйHTTPЗапрос(Знач СтруктураURI, Знач Запрос)
	
	Заголовки = Новый Соответствие;
	Заголовки.Вставить(ЗаголовкиHTTP().Авторизация, ТокенОрганизацииБС(Запрос.Организация));
	
	Если Запрос.ТипЗапроса <> Неопределено Тогда
		Заголовки.Вставить(ЗаголовкиHTTP().ТипЗапроса, Запрос.ТипЗапроса);
	КонецЕсли;
	
	Если Запрос.ТипОтвета <> Неопределено Тогда
		Заголовки.Вставить(ЗаголовкиHTTP().ТипОтвета, Запрос.ТипОтвета);
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.ДополнитьСоответствие(Заголовки, Запрос.Заголовки);
	
	Адрес = АдресЗапроса(СтруктураURI.ПутьНаСервере, Запрос.Параметры);
	
	Результат = Новый HTTPЗапрос(Адрес, Заголовки);
	
	Если Запрос.Тело = Неопределено Тогда
		// Тело не задано
	ИначеЕсли ТипЗнч(Запрос.Тело) = Тип("Строка") Тогда
		Результат.УстановитьТелоИзСтроки(Запрос.Тело);
	ИначеЕсли ТипЗнч(Запрос.Тело) = Тип("ДвоичныеДанные") Тогда
		Результат.УстановитьТелоИзДвоичныхДанных(Запрос.Тело);
	ИначеЕсли ТипЗнч(Запрос.Тело) = Тип("Массив")
		Или ТипЗнч(Запрос.Тело) = Тип("Структура") Тогда
		Результат.УстановитьТелоИзДвоичныхДанных(ТелоЗапросаJSON(Запрос.Тело));
	Иначе
		ВызватьИсключение(
			СтрШаблон(
				НСтр(
					"ru = 'Неподдерживаемый тип тела запроса: %1'",
					ОбщегоНазначения.КодОсновногоЯзыка()),
				ТипЗнч(Запрос.Тело)));
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область Перечисления

// Заголовки HTTP-запросов
// 
// Возвращаемое значение:
//  Структура - Заголовки:
// * Авторизация - Строка - Заголовок Authorization
// * ТипЗапроса  - Строка - Заголовок Content-Type
// * ТипОтвета   - Строка - Заголовок Accept
// * ИмяФайла    - Строка - Заголовок Content-Disposition
Функция ЗаголовкиHTTP()
	
	Результат = Новый Структура;
	
	Результат.Вставить("Авторизация" , "Authorization");
	Результат.Вставить("ТипЗапроса"  , "Content-Type");
	Результат.Вставить("ТипОтвета"   , "Accept");
	Результат.Вставить("ИмяФайла"    , "Content-Disposition");
	
	Возврат Результат;
	
КонецФункции

// Форматы получения ответа HTTP-запроса
// 
// Возвращаемое значение:
//  Структура - Форматы ответа:
// * HTTPОтвет      - Строка - Сам HTTPОтвет
// * ДвоичныеДанные - Строка - HTTPОтвет.ПолучитьТелоКакДвоичныеДанные()
// * Поток          - Строка - HTTPОтвет.ПолучитьТелоКакПоток()
// * Строка         - Строка - HTTPОтвет.ПолучитьТелоКакСтроку()
// * JSON           - Строка - Прочитать тело HTTP-ответа как JSON-строку
// * Неопределено   - Строка - Читать ответ не требуется
Функция ФорматыОтвета()
	
	Результат = Новый Структура;
	
	Результат.Вставить("HTTPОтвет"      , "HTTPОтвет");
	Результат.Вставить("ДвоичныеДанные" , "ДвоичныеДанные");
	Результат.Вставить("Поток"          , "Поток");
	Результат.Вставить("Строка"         , "Строка");
	Результат.Вставить("JSON"           , "JSON");
	Результат.Вставить("Неопределено"   , "Неопределено");
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

// Параметры:
//  HTTPОтвет           - HTTPОтвет
//  ИмяЗаголовка        - Строка
//  ЗначениеПоУмолчанию - Строка
//                      - Неопределено
// 
// Возвращаемое значение:
//  Строка
//  Неопределено
Функция ЗначениеЗаголовка(Знач HTTPОтвет, Знач ИмяЗаголовка, Знач ЗначениеПоУмолчанию = Неопределено)
	
	Для Каждого Заголовок Из HTTPОтвет.Заголовки Цикл
		ИмяЗаголовкаОтвета = Заголовок.Ключ; // Строка
		Если СтрСравнить(ИмяЗаголовкаОтвета, ИмяЗаголовка) = 0 Тогда
			Возврат Заголовок.Значение;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ЗначениеПоУмолчанию;
	
КонецФункции

// Формирует полное имя запроса к сервису
// 
// Параметры:
//  Имя - Строка - Имя запроса к сервису для логирования
// 
// Возвращаемое значение:
//  Строка - Полное имя запроса
Функция ИмяЗапроса(Знач Имя = Неопределено)
	Возврат СтрШаблон("ЭлектронноеВзаимодействие.ОбменСКонтрагентами.СервисEDI.%1", Имя);
КонецФункции

// Параметры:
//  Параметры - См. АдресЗапроса.Параметры
// 
// Возвращаемое значение:
//  Строка
Функция СтрокаПараметровЗапроса(Знач Параметры)
	
	Результат = Новый Массив; // Массив Из Строка
	
	Для Каждого Параметр Из Параметры Цикл
		Результат.Добавить(
			СтрШаблон(
				"%1=%2",
				Параметр.Ключ,
				Параметр.Значение));
	КонецЦикла;
	
	Возврат СтрСоединить(Результат, "&");
	
КонецФункции

// Параметры:
//  Путь        - Строка
//  Параметры   - Соответствие Из КлючИЗначение:
//   * Ключ     - Строка
//   * Значение - Строка
// 
// Возвращаемое значение:
//  Строка
Функция АдресЗапроса(Знач Путь, Знач Параметры)
	
	Если Параметры.Количество() = 0 Тогда
		Возврат Путь;
	Иначе
		Возврат СтрШаблон("%1?%2", Путь, СтрокаПараметровЗапроса(Параметры));
	КонецЕсли;
	
КонецФункции

// Адрес сервиса 1С:EDI.
// 
// Возвращаемое значение:
//  Строка
Функция АдресСервиса()
	Возврат "https://edi.1cfresh.com/api";
КонецФункции

// Параметры:
//  Соединение - HTTPСоединение
//  Запрос     - HTTPЗапрос
//  Метод      - Строка
//  Имя        - Строка
// 
// Возвращаемое значение:
//  HTTPОтвет
Функция ВызватьHTTPМетод(Знач Соединение, Знач Запрос, Знач Метод, Знач Имя)
	Возврат Соединение.ВызватьHTTPМетод(Метод, Запрос);
КонецФункции

// Параметры:
//  Результат - См. НовыйРезультатВыполненияЗапроса
//  Запрос    - См. НовыйЗапрос
//  HTTPОтвет - HTTPОтвет
Процедура ПроверитьКодОтвета(Результат, Знач Запрос, Знач HTTPОтвет)
	
	Если Запрос.КодыОтвета.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если Запрос.КодыОтвета.Найти(HTTPОтвет.КодСостояния) = Неопределено Тогда
		Результат.Отказ       = Истина;
		Результат.ТекстОшибки = 
			СтрШаблон(
				НСтр(
					"ru = 'Полученный код ответа (%1) не входит в список ожидаемых: %2.'",
					ОбщегоНазначения.КодОсновногоЯзыка()),
				HTTPОтвет.КодСостояния,
				СтрСоединить(Запрос.КодыОтвета, ", "));
	КонецЕсли;
	
КонецПроцедуры

// Сериализует тело запроса в JSON.
// 
// Параметры:
//  Тело - Массив Из Произвольный - Тело запроса (JSON)
//       - Структура              - Тело запроса (JSON)
// 
// Возвращаемое значение:
//  ДвоичныеДанные - Тело запроса в виде двоичных данных
Функция ТелоЗапросаJSON(Знач Тело)
	
	Поток = Новый ПотокВПамяти;
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.ОткрытьПоток(Поток);
	ЗаписатьJSON(ЗаписьJSON, Тело);
	ЗаписьJSON.Закрыть();
	
	Возврат Поток.ЗакрытьИПолучитьДвоичныеДанные();
	
КонецФункции

// Параметры:
//  Результат - См. НовыйРезультатВыполненияЗапроса
//  Запрос    - См. НовыйЗапрос
//  HTTPОтвет - HTTPОтвет
Процедура ПрочитатьТелоОтветаJSON(Результат, Знач Запрос, Знач HTTPОтвет)
	
	ПотокДанных = HTTPОтвет.ПолучитьТелоКакПоток();
	
	Попытка
		Результат.Данные = ДанныеJSON(HTTPОтвет);
	Исключение
		Результат.Отказ       = Истина;
		Результат.ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
	КонецПопытки;
	
	ПотокДанных.Закрыть();
	
КонецПроцедуры

// Параметры:
//  HTTPОтвет - HTTPОтвет
// 
// Возвращаемое значение:
//  Произвольный
Функция ДанныеJSON(Знач HTTPОтвет)
	
	ПотокДанных = HTTPОтвет.ПолучитьТелоКакПоток();
	
	Попытка
		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.ОткрытьПоток(ПотокДанных);
		Результат = ПрочитатьJSON(ЧтениеJSON, , , ФорматДатыJSON.ISO);
		ЧтениеJSON.Закрыть();
		ПотокДанных.Закрыть();
	Исключение
		ПотокДанных.Закрыть();
		ВызватьИсключение;
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

// Параметры:
//  Результат - См. НовыйРезультатВыполненияЗапроса
//  Запрос    - См. НовыйЗапрос
//  HTTPОтвет - HTTPОтвет
Процедура ПрочитатьТелоОтвета(Результат, Знач Запрос, Знач HTTPОтвет)
	
	Если Запрос.ФорматОтвета = ФорматыОтвета().HTTPОтвет Тогда
		Результат.Данные = HTTPОтвет;
	ИначеЕсли Запрос.ФорматОтвета = ФорматыОтвета().ДвоичныеДанные Тогда
		Результат.Данные = HTTPОтвет.ПолучитьТелоКакДвоичныеДанные();
	ИначеЕсли Запрос.ФорматОтвета = ФорматыОтвета().Поток Тогда
		Результат.Данные = HTTPОтвет.ПолучитьТелоКакПоток();
	ИначеЕсли Запрос.ФорматОтвета = ФорматыОтвета().Строка Тогда
		Результат.Данные = HTTPОтвет.ПолучитьТелоКакСтроку();
	ИначеЕсли Запрос.ФорматОтвета = ФорматыОтвета().JSON Тогда
		ПрочитатьТелоОтветаJSON(Результат, Запрос, HTTPОтвет);
	ИначеЕсли Запрос.ФорматОтвета = ФорматыОтвета().Неопределено Тогда
		Результат.Данные = Неопределено;
	Иначе
		ВызватьИсключение(
			СтрШаблон(
				НСтр(
					"ru = 'Непредвиденный формат ответа: %1'",
					ОбщегоНазначения.КодОсновногоЯзыка()),
				Запрос.ФорматОтвета));
	КонецЕсли;
	
КонецПроцедуры

// Выполняет запрос к сервису 1С:EDI
// 
// Параметры:
//  Запрос - См. НовыйЗапрос
// 
// Возвращаемое значение:
//  См. НовыйРезультатВыполненияЗапроса
Функция ВыполнитьЗапрос(Знач Запрос)
	
	Результат = НовыйРезультатВыполненияЗапроса();
	
	ПолныйАдрес = 
		СтрШаблон(
			"%1/%2/%3",
				АдресСервиса(),
				ИдентификаторОрганизацииБС(Запрос.Организация),
				Запрос.Адрес);
	
	СтруктураURI   = ОбщегоНазначенияКлиентСервер.СтруктураURI(ПолныйАдрес);
	HTTPСоединение = НовоеHTTPСоединение(СтруктураURI, Запрос.Таймаут);
	HTTPЗапрос     = НовыйHTTPЗапрос(СтруктураURI, Запрос);
	
	Попытка
		HTTPОтвет = ВызватьHTTPМетод(HTTPСоединение, HTTPЗапрос, Запрос.Метод, ИмяЗапроса(Запрос.Имя));
	Исключение
		Результат.Отказ       = Истина;
		Результат.ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		Возврат Результат;
	КонецПопытки;
	
	ПроверитьКодОтвета(Результат, Запрос, HTTPОтвет);
	
	Если Результат.Отказ Тогда
		Возврат Результат;
	КонецЕсли;
	
	ПрочитатьТелоОтвета(Результат, Запрос, HTTPОтвет);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область БизнесСеть

// См. БизнесСеть.ИдентификаторОрганизации
Функция ИдентификаторОрганизацииБС(Знач Организация)
	ПроверитьНаличиеПодсистемыБизнесСеть("СервисEDIСлужебный.ИдентификаторОрганизацииБС");
	ОбщийМодульБизнесСеть = ОбщегоНазначения.ОбщийМодуль("БизнесСеть");
	Возврат ОбщийМодульБизнесСеть.ИдентификаторОрганизации(Организация)
КонецФункции

// Получает токен доступа 1С:Бизнес-сеть
// 
// Параметры:
//  Организация - ОпределяемыйТип.Организация - Организация
// 
// Возвращаемое значение:
//  Строка - Токен доступа 1С:Бизнес-сеть
Функция ТокенОрганизацииБС(Знач Организация)
	Контекст = "СервисEDIСлужебный.ТокенОрганизацииБС";
	
	ПроверитьНаличиеПодсистемыБизнесСеть(Контекст);
	
	ОбщийМодульБизнесСеть = ОбщегоНазначения.ОбщийМодуль("БизнесСеть");
	
	ИдентификаторОрганизации = ИдентификаторОрганизацииБС(Организация);
	
	Отказ = Ложь;
	
	Токен = ОбщийМодульБизнесСеть.СтрокаАутентификации(ИдентификаторОрганизации, Ложь, Отказ, Ложь); // Строка
	
	ОбщегоНазначенияКлиентСервер.Проверить(
		Не Отказ,
		НСтр(
			"ru = 'Ошибка получения токена доступа 1С:Бизнес-сеть'",
			ОбщегоНазначения.КодОсновногоЯзыка()),
		Контекст);
	
	Возврат Токен;
	
КонецФункции

#КонецОбласти

#Область ОшибкиБЭД

// Возвращаемое значение:
//  Строка
Функция КодОшибкиТранспорта()
	Возврат "ОшибкаТранспортаEDI";
КонецФункции

#КонецОбласти

#Область ВходящиеСообщения

#Область Перечисления

// Возвращаемое значение:
//  Структура:
// * НеНачато    - Строка
// * Выполняется - Строка
// * Завершено   - Строка
Функция СтатусыЗагрузкиДанных()
	
	Результат = Новый Структура;
	
	Результат.Вставить("НеНачато"    , "НеНачато");
	Результат.Вставить("Выполняется" , "Выполняется");
	Результат.Вставить("Завершено"   , "Завершено");
	
	Возврат Результат;
	
КонецФункции

// Возвращаемое значение:
//  Структура:
// * НеНачато    - Строка
// * Выполняется - Строка
// * Завершено   - Строка
Функция СтатусыЧтенияПорции()
	
	Результат = Новый Структура;
	
	Результат.Вставить("НеНачато"    , "НеНачато");
	Результат.Вставить("Выполняется" , "Выполняется");
	Результат.Вставить("Завершено"   , "Завершено");
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область Конструкторы

// Возвращаемое значение:
//  ТаблицаЗначений:
// * Организация   - ОпределяемыйТип.Организация
// * Идентификатор - Строка 
Функция НовыеУчетныеЗаписи()
	
	Результат = Новый ТаблицаЗначений;
	
	Результат.Колонки.Добавить("Организация"   , Метаданные.ОпределяемыеТипы.Организация.Тип);
	Результат.Колонки.Добавить("Идентификатор" , Новый ОписаниеТипов("Строка"));
	
	Возврат Результат;
	
КонецФункции

// Возвращаемое значение:
//  ТаблицаЗначений:
// * Идентификатор - Строка
Функция НовыеДокументыОрганизации()
	
	Результат = Новый ТаблицаЗначений;
	
	Результат.Колонки.Добавить("Идентификатор" , Новый ОписаниеТипов("Строка"));
	
	Возврат Результат;
	
КонецФункции

// Возвращаемое значение:
//  Структура:
// * РазмерСтраницы   - Число 
// * ПоложениеКурсора - Строка 
//                    - Неопределено
Функция НоваяПагинация()
	
	Результат = Новый Структура;
	
	Результат.Вставить("РазмерСтраницы"   , 100);
	Результат.Вставить("ПоложениеКурсора" , Неопределено);
	
	Возврат Результат;
	
КонецФункции

// Новые документы.
// 
// Возвращаемое значение:
//  Структура - Новые документы:
// * Список               - См. НовыеДокументыОрганизации
// * ТекущаяСтрока        - СтрокаТаблицыЗначений: См. НовыеДокументыОрганизации
//                        - Неопределено
// * НомерСтроки          - Число
// * СтатусЗагрузки       - Строка - См. СтатусыЗагрузкиДанных
// * СтатусЧтения         - Строка - См. СтатусыЧтенияПорции
Функция НовыеДокументы()
	
	Результат = Новый Структура;
	
	Результат.Вставить("Список"               , НовыеДокументыОрганизации());
	Результат.Вставить("ТекущаяСтрока"        , Неопределено);
	Результат.Вставить("НомерСтроки"          , 0);
	Результат.Вставить("СтатусЗагрузки"       , СтатусыЗагрузкиДанных().НеНачато);
	Результат.Вставить("СтатусЧтения"         , СтатусыЧтенияПорции().НеНачато);
	
	Возврат Результат;
	
КонецФункции

// Возвращаемое значение:
//  Структура:
// * Идентификатор - Строка
// * Имя           - Строка
// * Данные        - ДвоичныеДанные
//                 - Неопределено
Функция НовоеОписаниеДокумента()
	
	Результат = Новый Структура;
	
	Результат.Вставить("Идентификатор" , "");
	Результат.Вставить("Имя"           , "");
	Результат.Вставить("Данные"        , Неопределено);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

// Возвращаемое значение:
//  См. НовыеУчетныеЗаписи
Функция УчетныеЗаписи()
	
	Результат = НовыеУчетныеЗаписи();
	
	ПроверитьНаличиеПодсистемыБизнесСеть("СервисEDIСлужебный.УчетныеЗаписи");
	ОбщийМодульБизнесСеть = ОбщегоНазначения.ОбщийМодуль("БизнесСеть");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СпособОбменаЭД", СпособОбмена());
	Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Настройки.Отправитель КАК Организация,
		|	Настройки.ИдентификаторОтправителя КАК Идентификатор
		|ИЗ
		|	РегистрСведений.НастройкиОтправкиЭлектронныхДокументовПоВидам КАК Настройки
		|ГДЕ
		|	Настройки.СпособОбменаЭД = &СпособОбменаЭД";
	
	УстановитьПривилегированныйРежим(Истина);
	Выборка = Запрос.Выполнить().Выбрать();
	УстановитьПривилегированныйРежим(Ложь);
	
	Пока Выборка.Следующий() Цикл
		
		Организация   = Выборка.Организация; // ОпределяемыйТип.Организация
		Идентификатор = Выборка.Идентификатор; // Строка
		
		Если ОбщийМодульБизнесСеть.ОрганизацияНеПодключенаТребуетсяПовторноеПодключение(Организация) Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = Результат.Добавить();
		НоваяСтрока.Организация   = Организация;
		НоваяСтрока.Идентификатор = Идентификатор;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Параметры:
//  УчетнаяЗапись - СтрокаТаблицыЗначений: См. НовыеУчетныеЗаписи
// 
// Возвращаемое значение:
//  Структура:
// * УчетнаяЗапись - СтрокаТаблицыЗначений: См. НовыеУчетныеЗаписи
// * Документы     - См. НовыеДокументы
// * Пагинация     - См. НоваяПагинация
Функция ВыборкаДокументовОрганизации(Знач УчетнаяЗапись)
	
	Результат = Новый Структура;
	
	Результат.Вставить("УчетнаяЗапись"      , УчетнаяЗапись);
	Результат.Вставить("Документы"          , НовыеДокументы());
	Результат.Вставить("Пагинация"          , НоваяПагинация());
	
	Возврат Результат;
	
КонецФункции

// Параметры:
//  Выборка - См. ВыборкаДокументовОрганизации
Процедура ПрочитатьПорциюДокументов(Выборка)
	
	Контекст = "СервисEDIСлужебный.ПрочитатьПорциюДокументов";
	
	ОбщегоНазначенияКлиентСервер.Проверить(
		Выборка.Документы.СтатусЗагрузки <> СтатусыЗагрузкиДанных().Завершено,
		НСтр(
			"ru = 'Ошибка получения порции выборки: все данные получены'",
			ОбщегоНазначения.КодОсновногоЯзыка()),
		Контекст);
		
	Порция = ПолучитьПорциюДокументов(Выборка.УчетнаяЗапись.Организация, Выборка.Пагинация);
	
	Выборка.Документы.Список               = Порция.Список;
	Выборка.Пагинация.ПоложениеКурсора     = Порция.ПоложениеКурсора;
	Выборка.Документы.ТекущаяСтрока        = Неопределено;
	Выборка.Документы.НомерСтроки          = 0;
	
	Если Выборка.Документы.Список.Количество() = 0 Тогда
		Выборка.Документы.СтатусЧтения         = СтатусыЧтенияПорции().Завершено;
	Иначе
		Выборка.Документы.СтатусЧтения         = СтатусыЧтенияПорции().НеНачато;
	КонецЕсли;
	
	Если Выборка.Документы.Список.Количество() = Выборка.Пагинация.РазмерСтраницы Тогда
		Выборка.Документы.СтатусЗагрузки = СтатусыЗагрузкиДанных().Выполняется;
	Иначе
		Выборка.Документы.СтатусЗагрузки = СтатусыЗагрузкиДанных().Завершено;
	КонецЕсли;
	
КонецПроцедуры

// Параметры:
//  Выборка - См. ВыборкаДокументовОрганизации
Процедура ПерейтиКСледующемуДокументу(Выборка)
	
	Контекст = "СервисEDIСлужебный.ПерейтиКСледующемуДокументу";
	
	ОбщегоНазначенияКлиентСервер.Проверить(
		Выборка.Документы.СтатусЧтения <> СтатусыЧтенияПорции().Завершено,
		НСтр(
			"ru = 'Ошибка позиционирования выборки: обход не начат'",
			ОбщегоНазначения.КодОсновногоЯзыка()),
		Контекст);
	ОбщегоНазначенияКлиентСервер.Проверить(
		Выборка.Документы.Список.Количество() > Выборка.Документы.НомерСтроки,
		НСтр(
			"ru = 'Ошибка позиционирования выборки: обход завершен'",
			ОбщегоНазначения.КодОсновногоЯзыка()),
		Контекст);
	
	Выборка.Документы.НомерСтроки   = Выборка.Документы.НомерСтроки + 1;
	Выборка.Документы.ТекущаяСтрока = Выборка.Документы.Список[Выборка.Документы.НомерСтроки - 1];
	
	Если Выборка.Документы.Список.Количество() = Выборка.Документы.НомерСтроки Тогда
		Выборка.Документы.СтатусЧтения = СтатусыЧтенияПорции().Завершено;
	Иначе
		Выборка.Документы.СтатусЧтения = СтатусыЧтенияПорции().Выполняется;
	КонецЕсли; 
	
КонецПроцедуры

// Требуется загрузить порцию документов.
// 
// Параметры:
//  Выборка - См. ВыборкаДокументовОрганизации
// 
// Возвращаемое значение:
//  Булево
Функция ТребуетсяЗагрузитьПорциюДокументов(Выборка)
	
	Если Выборка.Документы.СтатусЗагрузки = СтатусыЗагрузкиДанных().НеНачато Тогда
		Возврат Истина;
	ИначеЕсли Выборка.Документы.СтатусЗагрузки = СтатусыЗагрузкиДанных().Выполняется
		И Выборка.Документы.СтатусЧтения = СтатусыЗагрузкиДанных().Завершено Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

// Требуется загрузить порцию документов.
// 
// Параметры:
//  Выборка - См. ВыборкаДокументовОрганизации
// 
// Возвращаемое значение:
//  Булево
Функция ЗавершенаОбработка(Выборка)
	
	Возврат Выборка.Документы.СтатусЗагрузки = СтатусыЗагрузкиДанных().Завершено
		И Выборка.Документы.СтатусЧтения = СтатусыЧтенияПорции().Завершено;
	
КонецФункции

// Параметры:
//  Выборка - См. ВыборкаДокументовОрганизации
// 
// Возвращаемое значение:
//  Булево
Функция СледующийДокумент(Выборка)
	
	Если ТребуетсяЗагрузитьПорциюДокументов(Выборка) Тогда
		ПрочитатьПорциюДокументов(Выборка);
	КонецЕсли;
	
	Если ЗавершенаОбработка(Выборка) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ПерейтиКСледующемуДокументу(Выборка);
	
	Возврат Истина;
	
КонецФункции

// Параметры:
//  Выборка - См. ВыборкаДокументовОрганизации
// 
// Возвращаемое значение:
//  См. НовоеОписаниеДокумента
Функция ПолучитьДокумент(Выборка)
	Возврат ОписаниеДокумента(Выборка.УчетнаяЗапись.Организация, Выборка.Документы.ТекущаяСтрока.Идентификатор);
КонецФункции

// Параметры:
//  Выборка - См. ВыборкаДокументовОрганизации
Процедура ОтметитьПолучениеДокумента(Выборка)
	ОтметитьПолучениеСообщения(Выборка.УчетнаяЗапись.Организация, Выборка.Документы.ТекущаяСтрока.Идентификатор);
КонецПроцедуры

// Параметры:
//  Результат     - См. СинхронизацияЭДОСлужебный.НовыйРезультатПолученияДокументов
//  УчетнаяЗапись - СтрокаТаблицыЗначений: См. НовыеУчетныеЗаписи
Процедура ПолучитьДокументыПоОрганизации(Результат, Знач УчетнаяЗапись)
	
	Выборка      = ВыборкаДокументовОрганизации(УчетнаяЗапись);
	СпособОбмена = СпособОбмена();
	
	КонтекстДиагностики = ОбработкаНеисправностейБЭД.НовыйКонтекстДиагностики();
	
	Пока СледующийДокумент(Выборка) Цикл
		ОписаниеДокумента = ПолучитьДокумент(Выборка);
		
		КлючСинхронизации = СинхронизацияЭДОКлиентСервер.НовыйКлючСинхронизации();
		КлючСинхронизации.СпособОбмена               = СпособОбмена;
		КлючСинхронизации.ИдентификаторУчетнойЗаписи = УчетнаяЗапись.Идентификатор;
		
		ОписаниеКонтейнера = СервисЭДО.НоваяТаблицаКонтейнеров().Добавить();
		ОписаниеКонтейнера.ИДДокумента             = ОписаниеДокумента.Идентификатор;
		ОписаниеКонтейнера.ДвоичныеДанные          = ОписаниеДокумента.Данные;
		
		РезультатСохраненияКонтейнера = ТранспортныеКонтейнерыЭДО.СохранитьКонтейнер(
			ОписаниеКонтейнера, КлючСинхронизации, КонтекстДиагностики);
		ТранспортныйКонтейнер = РезультатСохраненияКонтейнера.ТранспортныйКонтейнер;
		
		Если ЗначениеЗаполнено(ТранспортныйКонтейнер) Тогда
			Результат.Контейнеры.Добавить(ТранспортныйКонтейнер);
		КонецЕсли;
		
		ОтметитьПолучениеДокумента(Выборка);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область JSON

// Параметры:
//  Данные              - Структура
//                      - Неопределено
//  Путь                - Строка
//  ЗначениеПоУмолчанию - Произвольный
// 
// Возвращаемое значение:
//  Произвольный
Функция ЗначениеПоПути(Знач Данные, Знач Путь, Знач ЗначениеПоУмолчанию = Неопределено)
	
	Контекст  = Данные;
	Значение  = Неопределено;
	ЧастиПути = СтрРазделить(Путь, ".");
	
	Для Каждого ЧастьПути Из ЧастиПути Цикл
		
		Если Контекст = Неопределено Тогда
			Возврат ЗначениеПоУмолчанию;
		ИначеЕсли Не Контекст.Свойство(ЧастьПути, Значение) Тогда
			Возврат ЗначениеПоУмолчанию;
		КонецЕсли;
		
		Контекст = Значение;
		
	КонецЦикла;
	
	Возврат Контекст;
	
КонецФункции

#КонецОбласти

#Область СведенияОФайлахСообщенийЭДО

// Расположение ссылок на файл-источник в разных сообщениях
// 
// Возвращаемое значение:
//  Соответствие  Из КлючИЗначение - Расположения:
//   * Ключ     - Строка - Код регламента
//   * Значение - Строка - Путь к имени файла внутри файла
Функция РасположенияСсылокНаФайлИсточник()
	
	Результат = Новый Соответствие;
	
	Результат.Вставить("CarrierInformationDeliveryCargo", "Документ.ИдИнфГП.ИдФайлИнфГП");
	Результат.Вставить("ConsigneeInformation", "Документ.ИдИнфПрвПрием.ИдФайлИнфПрвПрием");
	Результат.Вставить("CarrierInformationAcceptanceCargo", "Документ.ИдИнфГО.ИдФайлИнфГО");
	
	Возврат Результат;
	
КонецФункции

// Параметры:
//  Документ      - ОбъектXDTO
//  КодТранзакции - Строка
// 
// Возвращаемое значение:
//  Строка
//  Неопределено
Функция ИмяФайлаИсточника(Знач Документ, Знач КодТранзакции)
	
	Путь = РасположенияСсылокНаФайлИсточник()[КодТранзакции];
	
	Если Путь = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат РаботаСФайламиБЭД.ЗначениеСвойстваXDTO(Документ, Путь);
	
КонецФункции

// Параметры:
//  ДокументКонтейнера - См. ТранспортныеКонтейнерыЭДО.НовоеОписаниеДокументаКонтейнера
Процедура ВыполнитьПоискИдентификаторовДокументооборотаДокументаПоИмениФайла(ДокументКонтейнера)
	
	Если Не ПустаяСтрока(ДокументКонтейнера.ИдентификаторДокументооборота) Тогда
		Возврат; // Идентификатор получен ранее
	КонецЕсли;
	
	Поток = ДокументКонтейнера.ОписаниеДанных.ДвоичныеДанные.ОткрытьПотокДляЧтения();
	
	Документ = РаботаСФайламиБЭД.ПрочитатьXDTO(Поток);
	ИмяФайла = ИмяФайлаИсточника(Документ, ДокументКонтейнера.КодТранзакции);
	
	Если ИмяФайла = Неопределено Тогда
		Возврат; // В формате не предполагается передача сведений о файле-источнике
	КонецЕсли;
	
	Сведения = РегистрыСведений.СведенияОФайлахСообщенийЭДО.СведенияОСообщении(ИмяФайла);
	
	Если Сведения = Неопределено Тогда
		Возврат; // Не известен файл-источник
	КонецЕсли;
	
	ДокументКонтейнера.ИдентификаторДокументооборота = Сведения.ИдентификаторДокументооборота;
	
КонецПроцедуры

#КонецОбласти

#Область ТранспортныеКонтейнеры

// Параметры:
//  Контейнеры - Массив из ДокументСсылка.ТранспортныйКонтейнерЭДО
Процедура РаспаковатьКонтейнеры(Знач Контейнеры)
	
	ПараметрыВыполнения = ЭлектронныеДокументыЭДОКлиентСервер.НовыеПараметрыВыполненияДействийПоЭДО();
	
	ЭлектронныеДокументыЭДОКлиентСервер.ДобавитьДействие(
		ПараметрыВыполнения.НаборДействий, 
		Перечисления.ДействияПоЭДО.Загрузить);
	
	ПараметрыВыполнения.ОбъектыДействий.ТранспортныеКонтейнеры = Контейнеры;
	
	ЭлектронныеДокументыЭДОСлужебный.ВыполнитьДействияЭДО(ПараметрыВыполнения);
	
КонецПроцедуры

#КонецОбласти

#Область НастройкиОтправки

// Параметры:
//  НастройкиОтправки - См. НастройкиЭДОКлиентСервер.НовыйКлючНастроекОтправки
// 
// Возвращаемое значение:
//  Булево
Функция ЭтоНастройкиОтправкиЧерезСервис1СEDI(Знач НастройкиОтправки)
	
	Если НастройкиОтправки = Неопределено Тогда
		Возврат Ложь;
	Иначе
		Возврат ЭтоОбменЧерезСервис1СEDI(НастройкиОтправки.СпособОбмена);
	КонецЕсли;
	
КонецФункции

// Параметры:
//  НастройкиОтправки - См. НастройкиЭДОКлиентСервер.НовыйКлючНастроекОтправки
// 
// Возвращаемое значение:
//  Булево
Функция НастройкиОтправкиЗаполнены(Знач НастройкиОтправки)
	
	Если НастройкиОтправки = Неопределено Тогда
		Возврат Ложь;
	Иначе
		Возврат Не ПустаяСтрока(НастройкиОтправки.ИдентификаторОтправителя)
			И Не ПустаяСтрока(НастройкиОтправки.ИдентификаторПолучателя);
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#Область ИННКПП

// Проверяет, являются ли переданные ИНН и КПП сведениями валидными
// 
// Параметры:
//  ИНН - Строка
//  КПП - Строка
// 
// Возвращаемое значение:
//  Булево - Истина, если данные валидны 
//           Ложь, в ином случае.
Функция ЭтоИННКПП(Знач ИНН, Знач КПП)
	Возврат ЭтоИННКППЮЛ(ИНН, КПП)
		Или ЭтоИННКППФЛ(ИНН, КПП);
КонецФункции

// Проверяет, являются ли переданные ИНН и КПП сведениями об юр. лице
// 
// Параметры:
//  ИНН - Строка
//  КПП - Строка
// 
// Возвращаемое значение:
//  Булево - Истина, если данные валидны для юр. лица
//           Ложь, в ином случае.
Функция ЭтоИННКППЮЛ(Знач ИНН, Знач КПП)
	Возврат ЭтоИННЮЛ(ИНН)
		И ЭтоКПП(КПП);
КонецФункции

// Проверяет, являются ли переданные ИНН и КПП сведениями об физ. лице
// 
// Параметры:
//  ИНН - Строка
//  КПП - Строка
// 
// Возвращаемое значение:
//  Булево - Истина, если данные валидны для физ. лица
//           Ложь, в ином случае.
Функция ЭтоИННКППФЛ(Знач ИНН, Знач КПП)
	Возврат ЭтоИННФЛ(ИНН)
		И ПустаяСтрока(КПП);
КонецФункции

// Проверяет, являются ли переданные ИНН валидными для юр. лица
// 
// Параметры:
//  ИНН - Строка
// 
// Возвращаемое значение:
//  Булево - Истина, если данные валидны
//           Ложь, в ином случае.
Функция ЭтоИННЮЛ(Знач ИНН)
	Возврат РегламентированныеДанныеКлиентСервер.ИННСоответствуетТребованиям(ИНН, Истина, "");
КонецФункции

// Проверяет, являются ли переданные ИНН валидными для физ. лица
// 
// Параметры:
//  ИНН - Строка
// 
// Возвращаемое значение:
//  Булево - Истина, если данные валидны
//           Ложь, в ином случае.
Функция ЭтоИННФЛ(Знач ИНН)
	Возврат РегламентированныеДанныеКлиентСервер.ИННСоответствуетТребованиям(ИНН, Ложь, "");
КонецФункции

// Проверяет, являются ли переданные КПП валидными
// 
// Параметры:
//  КПП - Строка
// 
// Возвращаемое значение:
//  Булево - Истина, если данные валидны
//           Ложь, в ином случае.
Функция ЭтоКПП(Знач КПП)
	Возврат РегламентированныеДанныеКлиентСервер.КППСоответствуетТребованиям(КПП, "");
КонецФункции

#КонецОбласти

#Область Прочее

// Получает представление объекта по ссылке на объект.
// 
// Параметры:
//  Объект - ЛюбаяСсылка - Ссылка на объект информационной базы
// 
// Возвращаемое значение:
//  Строка - Представление объекта
Функция ПредставлениеОбъекта(Объект)
	//@skip-check bsl-legacy-check-string-literal - Стандартное поле
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект, "Представление");
КонецФункции

#КонецОбласти

#КонецОбласти
