Функция ЭтоЭПД(ИсточникДанныхСсылка) Экспорт
	
	Если ТипЗнч(ИсточникДанныхСсылка) = Тип ("ДокументСсылка.ЭлектроннаяТранспортнаяНакладная")
		Или ТипЗнч(ИсточникДанныхСсылка) = Тип ("ДокументСсылка.ЭлектронныйЗаказНаряд")
		Или ТипЗнч(ИсточникДанныхСсылка) = Тип ("ДокументСсылка.ЭлектроннаяСопроводительнаяВедомость")
		Или ТипЗнч(ИсточникДанныхСсылка) = Тип ("ДокументСсылка.ЭлектронныйЗаказЗаявка")
		Или ТипЗнч(ИсточникДанныхСсылка) = Тип ("ДокументСсылка.ЭлектронныйПутевойЛист")
		Или ТипЗнч(ИсточникДанныхСсылка) = Тип ("ДокументСсылка.ЭлектронныйДоговорФрахтования")  
		Или ТипЗнч(ИсточникДанныхСсылка) = Тип ("ДокументСсылка.ЭлектронноеПоручениеЭкспедитору") 
		Или ТипЗнч(ИсточникДанныхСсылка) = Тип ("ДокументСсылка.ЭлектроннаяЭкспедиторскаяРасписка") 
		Или ТипЗнч(ИсточникДанныхСсылка) = Тип ("ДокументСсылка.ЭлектроннаяCкладскаяРасписка")
		Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции