
#Область СлужебныйПрограммныйИнтерфейс

// Запуск длительной операции отправки данных об абоненте в сервис настроек.
//
// Параметры:
// ДанныеУчетнойЗаписи - Строка - ИдентификаторУчетнойЗаписи,
// 		см. СервисНастроекЭДОКлиентСервер.ОписаниеИзмененийДанныхАбонентаСервисаНастроек
// ИдентификаторФормы - УникальныйИдентификатор
//
// Возвращаемое значение:
//  См. ДлительныеОперации.ВыполнитьФункцию
//
Функция НачатьОтправкуДанныхАбонентаВСервисНастроек(ДанныеУчетнойЗаписи, ИдентификаторФормы = Неопределено) Экспорт
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(ИдентификаторФормы);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Отправка данных абонента в сервис настроек 1С-ЭДО'");
	ПараметрыВыполнения.ЗапуститьВФоне = Истина;
	ПараметрыВыполнения.ОжидатьЗавершение = 0;
	
	Возврат ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения, 
		"СервисНастроекЭДО.ОтправитьДанныеАбонентаВСервисНастроек", ДанныеУчетнойЗаписи);
	
КонецФункции

// Параметры:
//  ИдентификаторОператора - Строка
//
// Возвращаемое значение:
//  Булево
Функция ОператорКонтролируетНедействительныеСертификаты(ИдентификаторОператора) Экспорт
	
	Возврат СервисНастроекЭДО.ОператорКонтролируетНедействительныеСертификаты(ИдентификаторОператора);
	
КонецФункции

// см. РегистрыСведений.ОператорыЭДО.ВерсияПоддерживаемогоРегистрационногоПакета
Функция ВерсияПоддерживаемогоРегистрационногоПакетаОператора(ИдентификаторОператора) Экспорт
	
	Возврат СервисНастроекЭДОПовтИсп.ВерсияПоддерживаемогоРегистрационногоПакетаОператора(ИдентификаторОператора);
	
КонецФункции

// см. СервисНастроекЭДОПовтИсп.ОператорПоддерживаетВерсиюФорматаРегистрации
Функция ОператорПоддерживаетВерсиюФорматаРегистрации(ИдентификаторОператора, Версия) Экспорт
	
	Возврат СервисНастроекЭДОПовтИсп.ОператорПоддерживаетВерсиюФорматаРегистрации(ИдентификаторОператора, Версия);
	
КонецФункции

#КонецОбласти