#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	
	ДоступныеФормыОплаты = ДенежныеСредстваСервер.ДоступныеФормыОплатыДляВыбора();
	
	ДанныеВыбора = Новый СписокЗначений;
	ДанныеВыбора.ЗагрузитьЗначения(ДоступныеФормыОплаты);
	
	ЭлементЛюбая = ДанныеВыбора.НайтиПоЗначению(Перечисления.ФормыОплаты.ПустаяСсылка());
	
	Если ЭлементЛюбая <> Неопределено Тогда
		ЭлементЛюбая.Представление = НСтр("ru = 'Любая'");
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#КонецЕсли