// @strict-types

#Область СлужебныйПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

#Область ИнтерфейсДокументовЭДО

// Параметры:
//  ЭлектронныйДокумент - ДокументСсылка.ЭлектронныйДокументВходящийЭДО
//  ЧерновикДокумента - ДокументСсылка.ЧерновикЭлектронногоДокументаЭДО
Процедура СоздатьДокументПоЧерновику(ЭлектронныйДокумент, ЧерновикДокумента) Экспорт
	
	СтандартнаяОбработка = Истина;
	
	ПараметрыОбработчика = Новый Структура;
	ПараметрыОбработчика.Вставить("ЭлектронныйДокумент", ЭлектронныйДокумент);
	ПараметрыОбработчика.Вставить("ЧерновикДокумента", ЧерновикДокумента);
	ОбработчикЗавершения = Новый ОписаниеОповещения("ПослеСозданияДокументаПоЧерновику",
		ЭтотОбъект, ПараметрыОбработчика);
	
	ПриВыполненииКомандыСоздатьДокументПоЧерновику(СтандартнаяОбработка,
		ЭлектронныйДокумент, ЧерновикДокумента, ОбработчикЗавершения);
	
	Если Не СтандартнаяОбработка Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти // ИнтерфейсДокументовЭДО

#КонецОбласти // ДляВызоваИзДругихПодсистем

#КонецОбласти // СлужебныйПрограммныйИнтерфейс

#Область СлужебныеПроцедурыИФункции

// Параметры:
//  СтандартнаяОбработка - Булево - выходной, переопределяемый параметр.
//  ЭлектронныйДокумент - ДокументСсылка.ЭлектронныйДокументВходящийЭДО
//  ЧерновикДокумента - ДокументСсылка.ЧерновикЭлектронногоДокументаЭДО
//  ОбработчикЗавершения - ОписаниеОповещения - обработчик, который необходимо вызвать после выполнения команды.
Процедура ПриВыполненииКомандыСоздатьДокументПоЧерновику(СтандартнаяОбработка,
	Знач ЭлектронныйДокумент, Знач ЧерновикДокумента, Знач ОбработчикЗавершения)
	
	СтандартнаяОбработка = Истина;
	
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("ЭлектронноеВзаимодействие.ОбменСГИСЭПД") Тогда
		МодульОбменСГИСЭПД = ОбщегоНазначенияКлиент.ОбщийМодуль("ОбменСГИСЭПДКлиент");
		МодульОбменСГИСЭПД.ПриВыполненииКомандыСоздатьДокументПоЧерновику(
			СтандартнаяОбработка, ЭлектронныйДокумент, ЧерновикДокумента, ОбработчикЗавершения);
	КонецЕсли;

КонецПроцедуры

// Параметры:
//  Результат - Неопределено
//            - См. ИнтерфейсДокументовЭДОКлиентСервер.НовыйИтогВыполненияДействийПоЭДО
//  ПараметрыОбработчика - Структура:
//                         * ЭлектронныйДокумент - ДокументСсылка.ЭлектронныйДокументВходящийЭДО
//                         * ЧерновикДокумента - ДокументСсылка.ЧерновикЭлектронногоДокументаЭДО
Процедура ПослеСозданияДокументаПоЧерновику(Результат, ПараметрыОбработчика) Экспорт
	
	Если Не ЗначениеЗаполнено(Результат)
		Или Не ЗначениеЗаполнено(Результат.ОбработанныеДокументы) Тогда
		Возврат;
	КонецЕсли;
	
	КонтекстДиагностики = ОбработкаНеисправностейБЭДКлиент.НовыйКонтекстДиагностики();
	ЧерновикиЭДОВызовСервера.ПослеСозданияЭлектронногоДокументаПоЧерновику(ПараметрыОбработчика.ЧерновикДокумента,
		КонтекстДиагностики);
		
	Если ОбработкаНеисправностейБЭДКлиентСервер.ЕстьОшибки(КонтекстДиагностики) Тогда
		ОбработкаНеисправностейБЭДКлиент.ОбработатьОшибки(КонтекстДиагностики);
		Возврат;
	КонецЕсли;
	
	ПараметрыСобытия = ИнтерфейсДокументовЭДОКлиент.НовыеПараметрыСобытияОбновленияСостоянияЭДО();
	ПараметрыСобытия.ЭлектронныеДокументы.Добавить(ПараметрыОбработчика.ЭлектронныйДокумент);
	Оповестить(ИнтерфейсДокументовЭДОКлиент.ИмяСобытияОбновленияСостоянияЭДО(), ПараметрыСобытия);

КонецПроцедуры

#КонецОбласти // СлужебныеПроцедурыИФункции