&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	                                                           
	ОбменСГИСЭПД.ПриСозданииНаСервереПодчиненнойФормы(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	
		
	Если Параметры.Свойство("ФормаБезОбработки") = Ложь И ЭтотОбъект.ЗапретитьИзменение = Ложь Тогда
		ОписаниеСтрокИСО = Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(4,ДопустимаяДлина.Фиксированная));
		Элементы.ТитулЭкспедитораГрузыСвКонтейнИСОКонтейн.ОграничениеТипа = ОписаниеСтрокИСО;
		
		ОписаниеСтрокИдКонтейнМежд = Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(11,ДопустимаяДлина.Фиксированная));
		Элементы.ТитулЭкспедитораГрузыСвКонтейнИдКонтейнМежд.ОграничениеТипа = ОписаниеСтрокИдКонтейнМежд;
	КонецЕсли;

		
КонецПроцедуры

&НаКлиенте
Процедура Сохранить(Команда) 
	
	Отбор = Новый Структура;
	Отбор.Вставить("ИдентификаторСтрокиРодителя", ЭтотОбъект.ИдентификаторСтрокиРодителя);

	НайденныеСтроки = ТитулЭкспедитораГрузыСвКонтейн.НайтиСтроки(Отбор);
	
	Если НайденныеСтроки.Количество() <=0 Тогда
		ПрзПрвз = "0";	
	Иначе 
		
		Если ПрзПрвз = "0" Тогда
			ПрзПрвз = "1";	
		КонецЕсли;
		
	КонецЕсли;
		
	ОбменСГИСЭПДКлиент.СохранитьПараметрыПодчиненнойФормы(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбменСГИСЭПДКлиент.ПриОткрытииПодчиненнойФормы(ЭтотОбъект);
																		
КонецПроцедуры
			
&НаКлиенте
Функция ОписаниеРеквизитовФормы() Экспорт
	
	Возврат ОписаниеРеквизитовФормыСервер();
	
КонецФункции

&НаСервере
Функция ОписаниеРеквизитовФормыСервер()
	
	Возврат ОбменСГИСЭПД.ОписаниеРеквизитовФормы(ЭтаФорма);
		
КонецФункции


&НаКлиенте
Процедура ПередУдалением(Элемент, Отказ)
	ТекущиеДанные = Элемент.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		ОбменСГИСЭПДКлиент.ОчиститьПодчиненныеТаблицы(ЭтотОбъект, Элемент.Имя, ТекущиеДанные.ИдентификаторСтроки, Отказ);
	КонецЕсли;
КонецПроцедуры

 &НаСервереБезКонтекста
 Функция ПолучитьНовыйПорядковыйНомерДляКонтейнеров(Знач ИдентификаторСтрокиРодителя, Знач СвКонтейн)  
	 
	Результат = 1;
	
	Отбор = Новый Структура;
	Отбор.Вставить("ИдентификаторСтрокиРодителя", ИдентификаторСтрокиРодителя);
	
	ТабЗнНомКонтейн = СвКонтейн.Выгрузить(Отбор, "НомКонтейн");

	Если ТабЗнНомКонтейн.Количество() > 0 Тогда 
		ТабЗнНомКонтейн.Сортировать("НомКонтейн УБЫВ");
		Результат = ТабЗнНомКонтейн[0].НомКонтейн+1;			
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

&НаКлиенте
Процедура ПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ОбменСГИСЭПДКлиент.ТаблицаПриНачалеРедактирования(Элемент, ЭтотОбъект, НоваяСтрока, Копирование); 
	
	Если НоваяСтрока Тогда   
		
		ТекущиеДанные = Элемент.ТекущиеДанные;
		
		ТекущиеДанные.НомКонтейн = ПолучитьНовыйПорядковыйНомерДляКонтейнеров(ЭтотОбъект.ИдентификаторСтрокиРодителя, 
			ТитулЭкспедитораГрузыСвКонтейн);
		
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ТитулЭкспедитораГрузыСвКонтейнИдКонтейнМеждПриИзменении(Элемент)
	ТекущиеДанные = Элементы.ТитулЭкспедитораГрузыСвКонтейн.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		ТекущиеДанные.ИдКонтейнНест = Неопределено;	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТитулЭкспедитораГрузыСвКонтейнИдКонтейнНестПриИзменении(Элемент)
	ТекущиеДанные = Элементы.ТитулЭкспедитораГрузыСвКонтейн.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		ТекущиеДанные.ИдКонтейнМежд = Неопределено;	
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ТитулЗаказчикаГрузыСвКонтейнВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя = "ЗаполнитьТитулЭкспедитораГрузыСвКонтейнНомПломб"  Тогда
		ОбменСГИСЭПДКлиент.ВывестиФормуВводаДанных(ЭтотОбъект, Поле.Имя, Элемент.ТекущиеДанные, ЭтотОбъект.ЗапретитьИзменение = Ложь);
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ОтметитьОбязательныеНеЗаполненныеЭлементыФормы" Тогда
		Если УникальныйИдентификатор <> Параметр Тогда
			Возврат;
		КонецЕсли;
		ОтметитьОбязательныеНеЗаполненныеЭлементыФормы(Параметр);
	ИначеЕсли ИмяСобытия = "ИзменитьОформлениеКнопокФормы" Тогда
		Если УникальныйИдентификатор <> Параметр.УникальныйИдентификаторОбновляемойФормы Тогда
			Возврат;
		КонецЕсли;
		ИзменитьОформлениеКнопок(Параметр);	 
	ИначеЕсли СтрНачинаетсяС(ИмяСобытия, "Запись_") Тогда
	КонецЕсли;
	
КонецПроцедуры

#Область ОбъектыОбязательныеДляЗаполнения

&НаКлиенте
Процедура ИзменитьОформлениеКнопок(Параметр) Экспорт

	Если Не ЭтотОбъект.НачальноеОформлениеВыполнено Тогда
		ЭтотОбъект.ТребуетсяДополнительноеОформлениеКнопок = Истина;
		Если ЭтотОбъект.СтруктураДополнительногоОформленияКнопок <> Неопределено Тогда
			ЭтотОбъект.СтруктураДополнительногоОформленияКнопок = 
				Новый ФиксированнаяСтруктура("ИмяКнопки, ИдентификаторСтроки");
		Иначе
			ЭтотОбъект.СтруктураДополнительногоОформленияКнопок = Параметр;
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	СтруктураСТекущимиДаннымиРеквизитов = ОбменСГИСЭПДКлиентСервер.ПолучитьСтруктуруПоТитулуИВерсии(ЭтотОбъект);
	СтруктураДанныхОбъекта = ОбменСГИСЭПДКлиентСервер.ПолучитьСериализуемыйОбъектСДаннымиДокумента(ЭтотОбъект);
	СтруктураСДаннымиФормыДляОформленияКнопок = 
		ОбменСГИСЭПДКлиентСервер.СтруктураСДаннымиФормыДляОформленияКнопок(ЭтотОбъект);
	
	Результат = ИзменитьОформлениеКнопокНаСервере(СтруктураСТекущимиДаннымиРеквизитов,
		Параметр.ИмяКнопки,
		Параметр.ИдентификаторСтроки,
		СтруктураДанныхОбъекта,
		СтруктураСДаннымиФормыДляОформленияКнопок);
		
	Если Результат.Успешно Тогда
		ЭтотОбъект.АдресДереваСоответствийИтаблицыКнопок = Результат.НовыйАдресВХранилище;	
		МассивОформления = Результат.МассивОформления;
		ОбменСГИСЭПДКлиентСервер.ОформлениеКнопокНаФорме(ЭтотОбъект,
			СтруктураСТекущимиДаннымиРеквизитов, МассивОформления);	
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ИзменитьОформлениеКнопокНаСервере(Знач СтруктураСТекущимиДаннымиРеквизитов,
	ИмяКнопки = Неопределено,
	ИдентификаторСтроки = Неопределено,
	Знач СтруктураДанныхОбъекта,
	Знач СтруктураСДаннымиФормыДляОформленияКнопок)
	
	НовыйАдресВХранилище = ОбменСГИСЭПД.ЗапуститьИзменениеОформленияКнопок(СтруктураСДаннымиФормыДляОформленияКнопок,
		СтруктураСТекущимиДаннымиРеквизитов, ИмяКнопки, ИдентификаторСтроки, СтруктураДанныхОбъекта);

	Результат = ОбменСГИСЭПД.ОбработатьРезультатИзмененияОформленияКнопок(НовыйАдресВХранилище);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ОтметитьОбязательныеНеЗаполненныеЭлементыФормы(Параметр)
	
	СтруктураСТекущимиДаннымиРеквизитов = ОбменСГИСЭПДКлиентСервер.ПолучитьСтруктуруПоТитулуИВерсии(ЭтотОбъект);
	ОтметитьОбязательныеНеЗаполненныеЭлементыФормыНаСервере(СтруктураСТекущимиДаннымиРеквизитов);
	
КонецПроцедуры

&НаСервере
Процедура ОтметитьОбязательныеНеЗаполненныеЭлементыФормыНаСервере(Знач СтруктураСТекущимиДанными)
	
	ОбменСГИСЭПД.ОтметитьОбязательныеНеЗаполненныеЭлементыФормы(ЭтотОбъект, СтруктураСТекущимиДанными);
	
КонецПроцедуры

#КонецОбласти