#Область ПрограммныйИнтерфейс

#Область КомандыСозданияНаОсновании

// Определяет список команд создания на основании.
//
// Параметры:
//  КомандыСозданияНаОсновании - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.КомандыСозданияНаОсновании
//  Параметры - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.Параметры
//
Процедура ДобавитьКомандыСозданияНаОсновании(КомандыСозданияНаОсновании, Параметры) Экспорт
	
	//++ Локализация
	
	КоличествоДоДобавления = КомандыСозданияНаОсновании.Количество();
	
	// ЭлектронноеВзаимодействие.КоммерческиеПредложения
	Документы.ЗапросКоммерческихПредложенийПоставщиков.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	// Конец ЭлектронноеВзаимодействие.КоммерческиеПредложения
	
	// Установка видимости команд запроса коммерческих предложений:
	Для ИндексКоманды = КоличествоДоДобавления По КомандыСозданияНаОсновании.Количество() - 1 Цикл
		
		Команда = КомандыСозданияНаОсновании[ИндексКоманды];
		
		СтатусыЗапросовКоммерческихПредложений = Новый Массив;
		СтатусыЗапросовКоммерческихПредложений.Добавить(Перечисления.СтатусыЗаявокНаОбеспечение.НаСогласовании);
		СтатусыЗапросовКоммерческихПредложений.Добавить(Перечисления.СтатусыЗаявокНаОбеспечение.НаВыполнении);
		ПодключаемыеКоманды.ДобавитьУсловиеВидимостиКоманды(Команда,
			"Статус",
			СтатусыЗапросовКоммерческихПредложений,
			ВидСравненияКомпоновкиДанных.ВСписке);
			
		ПодключаемыеКоманды.ДобавитьУсловиеВидимостиКоманды(Команда,
			"ОбеспечиваетсяЗакупкой",
			Истина);
		
	КонецЦикла;
	
	//-- Локализация
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти