#Если ВебКлиент Тогда

#Область ПрограммныйИнтерфейс

// Получение настроек экземпляра ТС ПИоТ по адресу подключения
// 
// Параметры:
//  ПараметрыНастройки - см. ОбщегоНазначенияИСМПКлиентСервер.ПараметрыПодключенияТСПИоТ
//  УникальныйИдентификатор - УникальныйИдентификатор, Неопределено - Уникальный идентификатор формы
// 
// Возвращаемое значение:
//  Структура:
//   * ЕстьОшибки - Булево - Истина, если есть ошибки
//   * НастройкиЭкземпляраТСПИоТ - см. ИнтеграцияТСПИоТКлиентСервер.КонструкторНастройкиЭкземпляраТСПИоТ
//   * ТекстОшибки - Строка - полный текст ошибки.
Асинх Функция ПолучитьДанныеНастройкиТСПИоТ(ПараметрыНастройки, УникальныйИдентификатор = Неопределено) Экспорт
	
	ВозвращаемоеЗначение = Новый Структура;
	ВозвращаемоеЗначение.Вставить("ЕстьОшибки",                Ложь);
	ВозвращаемоеЗначение.Вставить("ТекстОшибки",               "");
	ВозвращаемоеЗначение.Вставить("НастройкиЭкземпляраТСПИоТ", ИнтеграцияТСПИоТКлиентСервер.КонструкторНастройкиЭкземпляраТСПИоТ());
	
	РезультатОбновления = Ждать ПолучитьНастройкиЭкземпляраТСПИоТ(ПараметрыНастройки);
	
	ВозвращаемоеЗначение.ЕстьОшибки                 = ЗначениеЗаполнено(РезультатОбновления.ТекстОшибки);
	ВозвращаемоеЗначение.ТекстОшибки                = РезультатОбновления.ТекстОшибки;
	ВозвращаемоеЗначение.НастройкиЭкземпляраТСПИоТ  = РезультатОбновления.НастройкиЭкземпляраТСПИоТ;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область РазрешительныйРежим

// Запрос данных о подключенной ККТ к экземпляру ТС ПИоТ по адресу подключения.
// 
// Параметры:
//  ПараметрыПодключения - см. ОбщегоНазначенияИСМПКлиентСервер.ПараметрыПодключенияТСПИоТ
// 
// Возвращаемое значение:
//  Структура - Настройки экземпляра ТС ПИоТ:
// * РезультатОтправкиЗапроса - (См. ОбменДаннымиИСМПКлиентСервер.ОбработатьРезультатОтправкиHTTPЗапросаКакJSON).
// * ТекстОшибки - Строка - текст ошибки, полученной от ТС ПИоТ
// * НастройкиЭкземпляраТСПИоТ - см. ИнтеграцияТСПиоТКлиентСервер.КонструкторНастройкиЭкземпляраТСПИоТ
Асинх Функция ПолучитьНастройкиЭкземпляраТСПИоТ(ПараметрыПодключения) Экспорт
	
	ВозвращаемоеЗначение = Новый Структура;
	ВозвращаемоеЗначение.Вставить("РезультатОтправкиЗапроса",  Неопределено);
	ВозвращаемоеЗначение.Вставить("ТекстОшибки",                "");
	ВозвращаемоеЗначение.Вставить("НастройкиЭкземпляраТСПИоТ", Неопределено);
	
	ЗаголовокHTTP = Новый Соответствие();
	ЗаголовокHTTP.Вставить("Accept",         "application/json");
	ЗаголовокHTTP.Вставить("Accept-Charset", "utf-8");
	ЗаголовокHTTP.Вставить("Content-Type",   "application/json");
	
	URLЗапроса = СтрШаблон("api/%1/info", ИнтеграцияТСПИоТКлиентСервер.ВерсияAPIСтрокой(ПараметрыПодключения.ВерсияAPI));
	
	ПараметрыОтправкиHTTPЗапросов = Новый Структура;
	ПараметрыОтправкиHTTPЗапросов.Вставить("ПредставлениеСервиса",             НСтр("ru = 'ТС ПИоТ'"));
	ПараметрыОтправкиHTTPЗапросов.Вставить("Сервер",                           ПараметрыПодключения.Сервер);
	ПараметрыОтправкиHTTPЗапросов.Вставить("Порт",                             ПараметрыПодключения.Порт);
	ПараметрыОтправкиHTTPЗапросов.Вставить("Таймаут",                          60);
	ПараметрыОтправкиHTTPЗапросов.Вставить("ИспользоватьЗащищенноеСоединение", ПараметрыПодключения.ЗащищенноеСоединение);
	
	ВремяНачалаЗапроса = ТекущаяУниверсальнаяДатаВМиллисекундах();
	
	РезультатЗапроса = Ждать ОбщегоНазначенияИСМПВебКлиент.ОтправитьДанныеВСервис(
		URLЗапроса,
		,,
		"GET",
		ПараметрыОтправкиHTTPЗапросов,
		ЗаголовокHTTP);
		
	ВремяОкончанияЗапроса = ТекущаяУниверсальнаяДатаВМиллисекундах();
	
	РезультатОтправкиЗапроса = ОбменДаннымиИСМПКлиентСервер.ОбработатьРезультатОтправкиHTTPЗапросаКакJSON(РезультатЗапроса, Истина);
	
	ВозвращаемоеЗначение.РезультатОтправкиЗапроса = РезультатОтправкиЗапроса;
	
	Если РезультатОтправкиЗапроса.ОтветПолучен Тогда
		
		Если Не РезультатОтправкиЗапроса.КодСостояния = 200 Тогда
			
			ВозвращаемоеЗначение.ТекстОшибки = ОбщегоНазначенияИСКлиентСервер.ТекстОшибкиПоРезультатуОтправкиЗапроса(
				URLЗапроса,
				РезультатОтправкиЗапроса);
				
		Иначе
			
			ДанныеОбработки = ОбменДаннымиИСМПКлиентСервер.ТекстJSONВОбъект(РезультатОтправкиЗапроса.ТекстВходящегоСообщенияJSON, Истина);
			
			НастройкиЭкземпляраТСПИоТ = ИнтеграцияТСПИоТКлиентСервер.КонструкторНастройкиЭкземпляраТСПИоТ();
			
			НастройкиЭкземпляраТСПИоТ.НомерФискальногоНакопителя = ДанныеОбработки.Получить("fnSerial");
			НастройкиЭкземпляраТСПИоТ.ИдентификаторТСПИоТ        = ДанныеОбработки.Получить("tspiotId");
			НастройкиЭкземпляраТСПИоТ.ЗаводскойНомерККТ          = ДанныеОбработки.Получить("kktSerial");
			НастройкиЭкземпляраТСПИоТ.ИНН                        = ДанныеОбработки.Получить("kktInn");
			
			ДанныеПодключенияЛМЧЗ = ДанныеОбработки.Получить("lm");
			
			Если ДанныеПодключенияЛМЧЗ <> Неопределено Тогда
				
				НастройкиЛокальногоМодуля = НастройкиЭкземпляраТСПИоТ.ДанныеНастройкиЛокальногоМодуля;
				
				ДатаПоследнейСинхронизации = ДанныеПодключенияЛМЧЗ.Получить("lastSync");
				СрокДействияТокена         = ДанныеПодключенияЛМЧЗ.Получить("expDate");
				
				НастройкиЛокальногоМодуля.Подключено                         = Истина;
				НастройкиЛокальногоМодуля.Версия                             = ДанныеПодключенияЛМЧЗ.Получить("version");
				НастройкиЛокальногоМодуля.Статус                             = ДанныеПодключенияЛМЧЗ.Получить("status");
				НастройкиЛокальногоМодуля.ТокенПМСР                          = ДанныеПодключенияЛМЧЗ.Получить("token");
				НастройкиЛокальногоМодуля.IPАдресУстановки                   = ДанныеПодключенияЛМЧЗ.Получить("ip");
				НастройкиЛокальногоМодуля.ПортУстановки                      = ДанныеПодключенияЛМЧЗ.Получить("port");
				НастройкиЛокальногоМодуля.Логин                              = ДанныеПодключенияЛМЧЗ.Получить("login");
				НастройкиЛокальногоМодуля.Пароль                             = ДанныеПодключенияЛМЧЗ.Получить("pass");
				НастройкиЛокальногоМодуля.ТаймаутОжиданияОтветаДоПереходаВЛМ = ДанныеОбработки.Получить("codesCheckTimeout");
				НастройкиЛокальногоМодуля.СреднееВремяОтветаТСПИоТ           = ВремяОкончанияЗапроса - ВремяНачалаЗапроса;
				
				Если ЗначениеЗаполнено(ДатаПоследнейСинхронизации) Тогда
					НастройкиЛокальногоМодуля.ДатаВремяПоследнейСинхронизации = ОбщегоНазначенияИСКлиентСервер.ДатаИзСтрокиUNIX(ДатаПоследнейСинхронизации);
				КонецЕсли;
				
				Если ЗначениеЗаполнено(СрокДействияТокена) Тогда
					НастройкиЛокальногоМодуля.ДатаДействияТокенаПМСР = ИнтеграцияТСПИоТКлиентСервер.ДатаИзСтроки(ДанныеПодключенияЛМЧЗ.Получить("expDate"));
				КонецЕсли;
				
			КонецЕсли;
			
			ВозвращаемоеЗначение.НастройкиЭкземпляраТСПИоТ = НастройкиЭкземпляраТСПИоТ;
			
		КонецЕсли;
		
	Иначе
		
		// не получен ответ при инициализации, таймаут или иные проблемы
		ВозвращаемоеЗначение.ТекстОшибки = ОбщегоНазначенияИСКлиентСервер.ТекстОшибкиПоРезультатуОтправкиЗапроса(
			URLЗапроса,
			РезультатОтправкиЗапроса);
		
	КонецЕсли;
	
	//@skip-check constructor-function-return-section
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

// Запрос данных на проверку марки разрешительным режимом к экземпляру ТС ПИоТ по адресу подключения.
// 
// Параметры:
//  ПараметрыПодключения           - см. ОбщегоНазначенияИСМПКлиентСервер.ПараметрыПодключенияТСПИоТ
//  ДанныеПроверки                 - Массив Из СтрокаТабличнойЧасти: см. ШтрихкодированиеОбщегоНазначенияИС.ИнициализацияТаблицыДанныхКодовМаркировки - Коллекция строк таблицы
//  ПараметрыСканирования          - см. ШтрихкодированиеОбщегоНазначенияИС.ПараметрыСканирования
//  ДополнительныеПараметрыЗапроса - см. ИнтеграцияТСПИоТ.ДополнительныеДанныеЗапросаТСПИоТ
// 
// Возвращаемое значение:
//  Структура - Получить информацию по КМ от ККТ:
// * РезультатОтправкиЗапроса - (См. ОбменДаннымиИСМПКлиентСервер.ОбработатьРезультатОтправкиHTTPЗапросаКакJSON).
// * ТекстОшибки - Строка - текст ошибки, полученной от ТС ПИоТ
// * АварийныйРежим - Булево - Истина, если действует аварийный режим или в ходе проверки он был объявлен
// * СтатусыКодовМаркировкиГИСМТ - Соответствие Из КлючИЗначение - Статусы кодов маркировки:
//		** Ключ - СтрокаТабличнойЧасти: см. ШтрихкодированиеОбщегоНазначенияИС.ИнициализацияТаблицыДанныхКодовМаркировки - Код маркировки.
//		** Значение - см. ПараметрыКодаМаркировкиПоДаннымЛокальногоМодуля
// * ТребуетсяОбработкаМарокНаЛокальномМодуле - Соответствие Из КлючИЗначение:
//		** Ключ - СтрокаТабличнойЧасти: см. ШтрихкодированиеОбщегоНазначенияИС.ИнициализацияТаблицыДанныхКодовМаркировки - Код маркировки.
//		** Значение - Булево - Истина, если требуется проверка марки на ЛМ ЧЗ.
Асинх Функция ДанныеПоКодуМаркировкиПриРозничнойПродаже(ПараметрыПодключения, ДанныеПроверки, ПараметрыСканирования, ДополнительныеПараметрыЗапроса) Экспорт
	
	ВозвращаемоеЗначение = Новый Структура;
	ВозвращаемоеЗначение.Вставить("РезультатОтправкиЗапроса",                 Новый Массив);
	ВозвращаемоеЗначение.Вставить("ТекстОшибки",                              "");
	ВозвращаемоеЗначение.Вставить("СтатусыКодовМаркировкиГИСМТ",              Новый Соответствие());
	ВозвращаемоеЗначение.Вставить("АварийныйРежим",                           Ложь);
	ВозвращаемоеЗначение.Вставить("ЗапросыДляЛогирования",                    Новый Массив);
	ВозвращаемоеЗначение.Вставить("ТребуетсяОбработкаМарокНаЛокальномМодуле", Новый Соответствие);
	
	ЗаголовокHTTP = Новый Соответствие();
	ЗаголовокHTTP.Вставить("Accept",         "application/json");
	ЗаголовокHTTP.Вставить("Accept-Charset", "utf-8");
	ЗаголовокHTTP.Вставить("Content-Type",   "application/json");
	
	URLЗапроса = СтрШаблон("api/%1/codes/check", ИнтеграцияТСПИоТКлиентСервер.ВерсияAPIСтрокой(ПараметрыПодключения.ВерсияAPI));
	
	ПараметрыОтправкиHTTPЗапросов = Новый Структура;
	ПараметрыОтправкиHTTPЗапросов.Вставить("ПредставлениеСервиса",                  НСтр("ru = 'ТС ПИоТ'"));
	ПараметрыОтправкиHTTPЗапросов.Вставить("Сервер",                                ПараметрыПодключения.Сервер);
	ПараметрыОтправкиHTTPЗапросов.Вставить("Порт",                                  ПараметрыПодключения.Порт);
	ПараметрыОтправкиHTTPЗапросов.Вставить("Таймаут",                               ПараметрыПодключения.Таймаут);
	ПараметрыОтправкиHTTPЗапросов.Вставить("ИспользоватьЗащищенноеСоединение",      ПараметрыПодключения.ЗащищенноеСоединение);
	ПараметрыОтправкиHTTPЗапросов.Вставить("ИсключитьПроверкуКорневыхСертификатов", ПараметрыПодключения.ИсключитьПроверкуКорневыхСертификатов);
	
	ДанныеОКлиенте = Новый Структура();
	ДанныеОКлиенте.Вставить("name",      ДополнительныеПараметрыЗапроса.ДанныеКлиента.НаименованиеКассовогоПО);
	ДанныеОКлиенте.Вставить("version",   ДополнительныеПараметрыЗапроса.ДанныеКлиента.ВерсияКассовогоПО);
	ДанныеОКлиенте.Вставить("token",     ДополнительныеПараметрыЗапроса.ДанныеКлиента.КонтрольнаяСумма);
	ДанныеОКлиенте.Вставить("user_name", ДополнительныеПараметрыЗапроса.ДанныеКлиента.ИмяПользователя);
	
	Если ЗначениеЗаполнено(ДополнительныеПараметрыЗапроса.ДанныеКлиента.ИдентификаторПрикладногоРешения) Тогда
		ДанныеОКлиенте.Вставить("id",              ДополнительныеПараметрыЗапроса.ДанныеКлиента.ИдентификаторПрикладногоРешения);
		ДанныеОКлиенте.Вставить("lastkey",         ДополнительныеПараметрыЗапроса.ДанныеКлиента.ИдентификаторБГосИС);
	Иначе
		ДанныеОКлиенте.Вставить("id",              ДополнительныеПараметрыЗапроса.ДанныеКлиента.ИдентификаторБГосИС);
	КонецЕсли;
	
	Если ПараметрыПодключения.ВерсияAPI = ПредопределенноеЗначение("Перечисление.ВерсииAPIТСПИоТ.V3") Тогда
		ДанныеОКлиенте.Вставить("tz", ДополнительныеПараметрыЗапроса.ДанныеКлиента.ЧасоваяЗона);
	КонецЕсли;
	
	Для Каждого СтрокаДанныхПроверки Из ДанныеПроверки Цикл
		
		Если ПараметрыПодключения.ВерсияAPI = ПредопределенноеЗначение("Перечисление.ВерсииAPIТСПИоТ.V3") Тогда
			СтруктураКода = Новый Структура;
			СтруктураКода.Вставить("cis", СтрокаДанныхПроверки.ПолныйКодМаркировки);
			Если ЗначениеЗаполнено(СтрокаДанныхПроверки.ВидПродукции) Тогда
				СтруктураКода.Вставить("pg", ИнтерфейсИСМПОбщегоНазначенияКлиентСервер.ТоварнаяГруппаЧислом(СтрокаДанныхПроверки.ВидПродукции));
			КонецЕсли;
			МассивКодовИдентификацииДляОтправки = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(СтруктураКода);
		Иначе
			МассивКодовИдентификацииДляОтправки = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(СтрокаДанныхПроверки.ПолныйКодМаркировки);
		КонецЕсли;
	
		ПараметрыЗапроса = Новый Структура;
		ПараметрыЗапроса.Вставить("codes",       МассивКодовИдентификацииДляОтправки);
		ПараметрыЗапроса.Вставить("client_info", ДанныеОКлиенте);
		
		ТелоЗапросаJSON = ОбменДаннымиИСМПКлиентСервер.ОбъектВТекстJSON(ПараметрыЗапроса, Истина);
		
		РезультатЗапроса = Ждать ОбщегоНазначенияИСМПВебКлиент.ОтправитьДанныеВСервис(
			URLЗапроса,
			ТелоЗапросаJSON,,
			"POST",
			ПараметрыОтправкиHTTPЗапросов,
			ЗаголовокHTTP);
		
		РезультатОтправкиЗапроса = ОбменДаннымиИСМПКлиентСервер.ОбработатьРезультатОтправкиHTTPЗапросаКакJSON(РезультатЗапроса, Истина);
		
		ВозвращаемоеЗначение.РезультатОтправкиЗапроса.Добавить(РезультатОтправкиЗапроса);
		
		Если РезультатОтправкиЗапроса.ОтветПолучен Тогда
			
			Если РезультатОтправкиЗапроса.КодСостояния = ОбщегоНазначенияИСМПКлиентСерверПовтИсп.АварийныйРежимКодОтветаСервисаГИСМТ() Тогда
				
				ПараметрыЛогирования = ШтрихкодированиеОбщегоНазначенияИСМПКлиентСервер.ЗаписатьВЛогОтветРазрешительногоРежимаГИСМТ(
					ПараметрыПодключения.АдресПодключения, 
					Формат(РезультатЗапроса.HTTPОтвет.КодСостояния, "ЧГ=0;"),
					СтрокаДанныхПроверки,
					РезультатОтправкиЗапроса.ТекстВходящегоСообщенияJSON,
					РезультатЗапроса.HTTPЗапрос.ПолучитьТелоКакСтроку());
						
				ВозвращаемоеЗначение.ЗапросыДляЛогирования.Добавить(ПараметрыЛогирования);
				// если аварийный режим, остальные коды можно не проверять
				ВозвращаемоеЗначение.АварийныйРежим = Истина;
			
			ИначеЕсли РезультатОтправкиЗапроса.КодСостояния >= 514 И РезультатОтправкиЗапроса.КодСостояния <= 520 Тогда
				
				ПараметрыЛогирования = ШтрихкодированиеОбщегоНазначенияИСМПКлиентСервер.ЗаписатьВЛогОтветРазрешительногоРежимаГИСМТ(
					ПараметрыПодключения.АдресПодключения, 
					Формат(РезультатЗапроса.HTTPОтвет.КодСостояния, "ЧГ=0;"),
					СтрокаДанныхПроверки,
					РезультатОтправкиЗапроса.ТекстВходящегоСообщенияJSON,
					РезультатЗапроса.HTTPЗапрос.ПолучитьТелоКакСтроку());
					
				ВозвращаемоеЗначение.ЗапросыДляЛогирования.Добавить(ПараметрыЛогирования);
				ВозвращаемоеЗначение.ТребуетсяОбработкаМарокНаЛокальномМодуле.Вставить(СтрокаДанныхПроверки, Истина);
			
			ИначеЕсли Не РезультатОтправкиЗапроса.КодСостояния = 200 Тогда
				
				ПараметрыЛогирования = ШтрихкодированиеОбщегоНазначенияИСМПКлиентСервер.ЗаписатьВЛогОтветРазрешительногоРежимаГИСМТ(
					ПараметрыПодключения.АдресПодключения, 
					Формат(РезультатЗапроса.HTTPОтвет.КодСостояния, "ЧГ=0;"),
					СтрокаДанныхПроверки,
					РезультатОтправкиЗапроса.ТекстВходящегоСообщенияJSON,
					РезультатЗапроса.HTTPЗапрос.ПолучитьТелоКакСтроку());
					
				ВозвращаемоеЗначение.ЗапросыДляЛогирования.Добавить(ПараметрыЛогирования);
				ВозвращаемоеЗначение.ТекстОшибки = ВозвращаемоеЗначение.ТекстОшибки
					+ ?(ЗначениеЗаполнено(ВозвращаемоеЗначение.ТекстОшибки), Символы.ПС, "")
					+ ОбщегоНазначенияИСКлиентСервер.ТекстОшибкиПоРезультатуОтправкиЗапроса(
						URLЗапроса,
						РезультатОтправкиЗапроса);
					
			Иначе
				
				СтруктураПолучательДляЛогирования = ИнтеграцияТСПИоТКлиентСервер.ИнициализироватьСтруктуруДанныхПолучателяДляЛогирования();
				
				СтруктураПолучательДляЛогирования.URLЗапроса       = URLЗапроса;
				СтруктураПолучательДляЛогирования.АдресПодключения = ПараметрыПодключения.АдресПодключения;
				
				РезультатРазбораОтвета = ИнтеграцияТСПИоТКлиентСервер.РазобратьДанныеОтветаОтТСПИоТ(ДанныеПроверки, РезультатОтправкиЗапроса.ТекстВходящегоСообщенияJSON,
					СтруктураПолучательДляЛогирования, ДополнительныеПараметрыЗапроса, РезультатЗапроса.HTTPОтвет.КодСостояния);
					
				Если РезультатРазбораОтвета.ФорматОтветаНекорректен Тогда
					
					РезультатРазбораОтвета.ТекстОшибки = ОбщегоНазначенияИСКлиентСервер.ТекстОшибкиПоРезультатуОтправкиЗапроса(
						URLЗапроса,
						РезультатОтправкиЗапроса);
					
				КонецЕсли;
				
				ВозвращаемоеЗначение.ТекстОшибки = ВозвращаемоеЗначение.ТекстОшибки
					+ ?(ЗначениеЗаполнено(ВозвращаемоеЗначение.ТекстОшибки), Символы.ПС, "")
					+ РезультатРазбораОтвета.ТекстОшибки;
				
				ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ВозвращаемоеЗначение.ЗапросыДляЛогирования, РезультатРазбораОтвета.ЗапросыДляЛогирования);
				
				Для Каждого ДанныеСтатусаКодаМаркировки Из РезультатРазбораОтвета.СтатусыКодовМаркировкиГИСМТ Цикл
					ВозвращаемоеЗначение.СтатусыКодовМаркировкиГИСМТ.Вставить(ДанныеСтатусаКодаМаркировки.Ключ, ДанныеСтатусаКодаМаркировки.Значение);
				КонецЦикла;
				
			КонецЕсли;
			
		Иначе
			
			// не получен ответ при инициализации, таймаут или иные проблемы
			ПараметрыЛогирования = ШтрихкодированиеОбщегоНазначенияИСМПКлиентСервер.ЗаписатьВЛогОтветРазрешительногоРежимаГИСМТ(
				ПараметрыПодключения.АдресПодключения, 
				"Таймаут",
				СтрокаДанныхПроверки,
				РезультатОтправкиЗапроса.ТекстОшибки,
				РезультатЗапроса.HTTPЗапрос.ПолучитьТелоКакСтроку());
				
			ВозвращаемоеЗначение.ЗапросыДляЛогирования.Добавить(ПараметрыЛогирования);
			ВозвращаемоеЗначение.ТребуетсяОбработкаМарокНаЛокальномМодуле.Вставить(СтрокаДанныхПроверки, Истина);
			
		КонецЕсли;
		
	КонецЦикла;
	
	//@skip-check constructor-function-return-section
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли