#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Возвращает тег для карточки транспортного контейнера
//  Параметры:
//   ВидУчетнойЗаписи - ПеречислениеСсылка.ВидУчетнойЗаписиЭДО
//
//  Возвращаемое значение:
//   Строка
Функция ТегUserTypeДляКарточки(ВидУчетнойЗаписи) Экспорт
	
	ТегUserType = "";
	
	Если ВидУчетнойЗаписи = ФизическоеЛицо Тогда
		ТегUserType = "FL";
	КонецЕсли;
	
	Возврат ТегUserType;
	
КонецФункции

// Возвращает значение по тегу для карточки транспортного контейнера
//  Параметры:
//   ВидУчетнойЗаписи - ПеречислениеСсылка.ВидУчетнойЗаписиЭДО
//
//  Возвращаемое значение:
//   Строка
Функция ВидОрганизацииПоВидуУчетнойЗаписи(ВидУчетнойЗаписи) Экспорт
	
	ВидОрганизации = "";
	Если ВидУчетнойЗаписи = ЮридическоеЛицо Тогда
		ВидОрганизации = "ЮЛ";
	ИначеЕсли ВидУчетнойЗаписи = ИндивидуальныйПредприниматель Тогда
		ВидОрганизации = "ИП"
	ИначеЕсли ВидУчетнойЗаписи = ФизическоеЛицо Тогда
		ВидОрганизации = "ФЛ";
	КонецЕсли;
	
	Возврат ВидОрганизации
	
КонецФункции

#КонецОбласти

#КонецЕсли