
#Область ПрограммныйИнтерфейс

#Область КомандыСозданияНаОсновании

// Определяет список команд создания на основании.
//
// Параметры:
//  КомандыСозданияНаОсновании - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.КомандыСозданияНаОсновании
//  Параметры - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.Параметры
//
Процедура ДобавитьКомандыСозданияНаОсновании(КомандыСозданияНаОсновании, Параметры) Экспорт
	
	//++ Локализация
	
	// ЭлектронноеВзаимодействие.КоммерческиеПредложения
	Документы.ЗапросКоммерческихПредложенийПоставщиков.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	// Конец ЭлектронноеВзаимодействие.КоммерческиеПредложения
	
	//-- Локализация
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Дополняет текст запроса, описывающий связь заказов поставщиков и заявок на закупку.
// 
// Параметры:
//  ТекстЗапроса - Строка - Текст запроса в который будет добавлен запрос объединения с полями: "ЗаказПоставщику" и "ЗаявкаНаЗакупку"
//  ДоступныеОтборы - Структура:
//   * ЗаявкаНаЗакупку - Строка - Будет установлен текст для отбора по заявкам на закупку.
//   * ЗаказПоставщику - Строка - Будет установлен текст для отбора по заказам поставщикам.
//   * ЗаказСозданПоЗаявке - Строка - Будет установлен текст для отбора заказов, сформированных по заявкам на закупку.
//   * ЗаказПроведен - Строка - Будет установлен текст для отбора только проведенных заказов.
Процедура ДополнитьТекстЗапросаЗаказыЗаявок(ТекстЗапроса, ДоступныеОтборы) Экспорт
	
	//++ Локализация
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьКоммерческиеПредложенияПоставщиков") Тогда
		Возврат;
	КонецЕсли;
	
	ТекстЗапроса = ТекстЗапроса + ОбщегоНазначенияУТ.РазделительЗапросовВОбъединении() + 
	"ВЫБРАТЬ
	|	ДокументЗаказПоставщику.Ссылка КАК ЗаказПоставщику,
	|	ЗапросКоммерческихПредложенийПоставщиков.ДокументОснование КАК ЗаявкаНаЗакупку
	|ИЗ
	|	РегистрСведений.ЗаказыПоставщикамПоЗапросамКоммерческихПредложений КАК ЗаказыПоставщикамПоЗапросамКоммерческихПредложений
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗапросКоммерческихПредложенийПоставщиков КАК ЗапросКоммерческихПредложенийПоставщиков
	|		ПО ЗаказыПоставщикамПоЗапросамКоммерческихПредложений.ЗапросКоммерческихПредложений = ЗапросКоммерческихПредложенийПоставщиков.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказПоставщику КАК ДокументЗаказПоставщику
	|		ПО ЗаказыПоставщикамПоЗапросамКоммерческихПредложений.ЗаказПоставщику = ДокументЗаказПоставщику.Ссылка
	|ГДЕ
	|	 &ДоступныеОтборы";
	
	ДоступныеОтборы.ЗаявкаНаЗакупку = "ЗапросКоммерческихПредложенийПоставщиков.ДокументОснование";
	ДоступныеОтборы.ЗаказПоставщику = "ЗаказыПоставщикамПоЗапросамКоммерческихПредложений.ЗаказПоставщику";
	ДоступныеОтборы.ЗаказСозданПоЗаявке = "ДокументЗаказПоставщику.ДокументОснование ССЫЛКА Документ.ЗаявкаНаЗакупку";
	ДоступныеОтборы.ЗаказПроведен = "ДокументЗаказПоставщику.Проведен";
	
	//-- Локализация
	
	Возврат;
	
КонецПроцедуры

#КонецОбласти

