#Область СлужебныйПрограммныйИнтерфейс

// Возвращаемое значение:
//  Структура:
//  * ВидЧерновика - СправочникСсылка.ВидыДокументовЭДО
//  * НомерДокумента - Строка
//  * ДатаДокумента - Дата
Функция НовыеСвойстваДокументаДляПолученияПредставленияЧерновика() Экспорт
	Результат = Новый Структура;
	Результат.Вставить("ВидЧерновика", ПредопределенноеЗначение("Справочник.ВидыДокументовЭДО.ПустаяСсылка"));
	Результат.Вставить("НомерДокумента", "");
	Результат.Вставить("ДатаДокумента", Дата(1, 1, 1));
	Возврат Результат;
КонецФункции

// Параметры:
//  Поля - Массив из Строка
Процедура ПриОпределенииПолейПредставленияДокумента(Поля) Экспорт
	Поля.Добавить("ПредставлениеЧерновика");
КонецПроцедуры

// Параметры:
//  Представление - Строка
//  СвойстваДокумента - См. ПредставлениеДокументаПоСвойствам.СвойстваДокумента
Процедура ПриОпределенииПредставленияДокументаПоСвойствам(Представление, СвойстваДокумента) Экспорт
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(СвойстваДокумента, "ПредставлениеЧерновика")
		И ЗначениеЗаполнено(СвойстваДокумента.ПредставлениеЧерновика) Тогда
		Представление = СвойстваДокумента.ПредставлениеЧерновика;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти // СлужебныйПрограммныйИнтерфейс