// @strict-types

#Область СлужебныйПрограммныйИнтерфейс

// См. СервисEDIСлужебный.ЗафиксироватьНастройкиЭТрН
Процедура ЗафиксироватьНастройкиЭТрН(
	Знач Организация, 
	Знач Контрагент) Экспорт
	
	СервисEDIСлужебный.ЗафиксироватьНастройкиЭТрН(Организация, Контрагент);
	
КонецПроцедуры

// См. СервисEDIСлужебный.ЗафиксироватьНастройкиЭЗЗ
Процедура ЗафиксироватьНастройкиЭЗЗ(
	Знач Организация, 
	Знач Контрагент) Экспорт
	
	СервисEDIСлужебный.ЗафиксироватьНастройкиЭЗЗ(Организация, Контрагент);
	
КонецПроцедуры

// См. СервисEDIСлужебный.ЭтоКлючНастроекЧерезСервис1СEDI
Функция ЭтоКлючНастроекЧерезСервис1СEDI(Знач КлючНастроекЭДО) Экспорт
	Возврат СервисEDIСлужебный.ЭтоКлючНастроекЧерезСервис1СEDI(КлючНастроекЭДО);
КонецФункции

// См. СервисEDIСлужебныйКлиент.ТребуетсяНастройкаОбмена
Функция ТребуетсяНастройкаОбмена(КлючНастроек) Экспорт
	Возврат СервисEDIСлужебный.ТребуетсяНастройкаОбмена(КлючНастроек);
КонецФункции

// См. СервисEDIСлужебный.ЗапуститьПолучениеСообщений
Функция ЗапуститьПолучениеСообщений() Экспорт
	Возврат СервисEDIСлужебный.ЗапуститьПолучениеСообщений();
КонецФункции

#КонецОбласти
