///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2026, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

//@strict-types
#Если Не ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

#Область СервисыМобильногоПодписания

// Добавляет сертификат в регистр сведений СертификатыПодписантовМобильнойПодписиБЭД.
//
// Параметры:
//  Подписант - СправочникСсылка.ПодписантыСервисаМобильнойПодписи - Подписант
//  СсылкаНаСертификат - Строка - Ссылка на сертификат
//  ВидМобильнойПодписи - ПеречислениеСсылка.ВидыМобильныхПодписей - Вид мобильной подписи
//
Процедура ДобавитьСертификатПодписанта(Подписант, СсылкаНаСертификат, ВидМобильнойПодписи = Неопределено) Экспорт
	
	РегистрыСведений.СертификатыПодписантовМобильнойПодписиБЭД.ДобавитьЗапись(Подписант,
		СсылкаНаСертификат,
		ВидМобильнойПодписи);
	
КонецПроцедуры

#КонецОбласти // СервисыМобильногоПодписания

#КонецОбласти // СлужебныйПрограммныйИнтерфейс

#КонецЕсли