
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	СобытияФорм.ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	
	Список.Параметры.УстановитьЗначениеПараметра("ТипДокументаЭлектронныйБилет", НСтр("ru = 'Электронный билет'"));
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СоздатьБилет(Команда)
	ОткрытьФорму("Документ.ОперацияСЭлектроннымБилетом.Форма.ФормаДокумента", Новый Структура("Основание"));
КонецПроцедуры

&НаКлиенте
Процедура СоздатьДоплату(Команда)
	СоздатьОперациюСЭлектроннымБилетом(ПредопределенноеЗначение("Перечисление.ТипыОперацийСБилетами.Доплата"));
КонецПроцедуры

&НаКлиенте
Процедура СоздатьВозврат(Команда)
	СоздатьОперациюСЭлектроннымБилетом(ПредопределенноеЗначение("Перечисление.ТипыОперацийСБилетами.Возврат"));
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Элементы.Список);
	ОбновитьКомандыСозданияДокументов();
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Элементы.Список);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура ОбновитьКомандыСозданияДокументов()
	
	Элементы.СписокСоздатьДоплату.Видимость = Ложь;
	Элементы.СписокСоздатьВозврат.Видимость = Ложь;
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.СписокСоздатьДоплату.Видимость = ТекущиеДанные.ЭтоЭлектронныйБилет;
	Элементы.СписокСоздатьВозврат.Видимость = ТекущиеДанные.ЭтоЭлектронныйБилет;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура СоздатьОперациюСЭлектроннымБилетом(ТипОперации)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОписаниеОперации = Новый Структура;
	ОписаниеОперации.Вставить("ТипОперации", ТипОперации);
	ОписаниеОперации.Вставить("ЭтоПолныйВозврат", Ложь);
	
	ДанныеДляСозданияОперацииБилета = Новый Структура;
	ДанныеДляСозданияОперацииБилета.Вставить("ДанныеЭлектронногоБилета");
	ДанныеДляСозданияОперацииБилета.Вставить("ОписаниеОперации", ОписаниеОперации);
	ДанныеДляСозданияОперацииБилета.Вставить("ЭтоРазделениеБилета", Ложь);
	
	ПараметрыОснования = Новый Структура();
	ПараметрыОснования.Вставить("ЭлектронныйБилет", ТекущиеДанные.Ссылка);
	ПараметрыОснования.Вставить("ДанныеДляСозданияОперацииБилета", ДанныеДляСозданияОперацииБилета);
	
	ОткрытьФорму("Документ.ОперацияСЭлектроннымБилетом.Форма.ФормаОперацииЭлектронногоБилета", Новый Структура("Основание", ПараметрыОснования));
	
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Элементы.Список);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти
