#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ПустойИдентификаторОшибки = ОбщегоНазначенияКлиентСервер.ПустойУникальныйИдентификатор();
	
	Для Каждого Запись Из ЭтотОбъект Цикл
		
		Если Не ЗначениеЗаполнено(Запись.ДатаЗаписи) Тогда
			Запись.ДатаЗаписи = ТекущаяДатаСеанса();
		КонецЕсли;
		
		Запись.ПериодЗадания = НачалоДня(Запись.ПериодЗадания);
		
		Если Не Запись.ВыполненоСОшибкой И ЗначениеЗаполнено(Запись.ИдентификаторОшибки) Тогда
			Запись.ИдентификаторОшибки = ПустойИдентификаторОшибки;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли