
#Область СлужебныйПрограммныйИнтерфейс

#Область Абоненты

// Возвращает структуру описывающую не записанные изменения для передачи в сервис настроек
//
// Возвращаемое значение:
//  Структура:
//   * ИдентификаторУчетнойЗаписи - Строка
//   * НазначениеУчетнойЗаписи - Строка
//   * ПодробноеОписаниеУчетнойЗаписи - Строка
//   * НеИспользоватьПриглашения - Булево
//   * КодыТиповДокументовКОбмену - Массив из Строка
//   * СертификатыАбонента - Массив из СправочникСсылка.СертификатыКлючейЭлектроннойПодписиИШифрования
Функция ОписаниеИзмененийДанныхАбонентаСервисаНастроек() Экспорт
	
	ОписаниеИзменений = Новый Структура;
	ОписаниеИзменений.Вставить("ИдентификаторУчетнойЗаписи", "");
	ОписаниеИзменений.Вставить("НазначениеУчетнойЗаписи", "");
	ОписаниеИзменений.Вставить("ПодробноеОписаниеУчетнойЗаписи", "");
	ОписаниеИзменений.Вставить("НеИспользоватьПриглашения", Ложь);
	ОписаниеИзменений.Вставить("КодыТиповДокументовКОбмену", Новый Массив);
	ОписаниеИзменений.Вставить("СертификатыАбонента", Новый Массив);
	
	Возврат ОписаниеИзменений;
	
КонецФункции

#КонецОбласти

#Область Операторы

// Идентификатор Такскома
//
// Возвращаемое значение:
//  Строка
Функция ИдентификаторТакскома() Экспорт
	
	Возврат "2AL";
	
КонецФункции

// Идентификатор Калуги
//
// Возвращаемое значение:
//  Строка
Функция ИдентификаторКалуги() Экспорт
	
	Возврат "2AE";
	
КонецФункции

// см. СервисНастроекЭДОПовтИсп.ОператорПоддерживаетВерсиюФорматаРегистрации
Функция ОператорПоддерживаетВерсиюФорматаРегистрации(ИдентификаторОператора, Версия) Экспорт
	
	Возврат СервисНастроекЭДОВызовСервера.ОператорПоддерживаетВерсиюФорматаРегистрации(ИдентификаторОператора, Версия);
	
КонецФункции

#КонецОбласти

#КонецОбласти

