
#Область ПрограммныйИнтерфейс

// Обработчик события вызывается при получении имени кассира.
//
// Параметры:
//  ИмяКассира - Строка, Неопределено - Текст, используемый для заполнения документа
//  СтандартнаяОбработка - Булево
//
Процедура ОбработкаЗаполненияИмяКассира(ИмяКассира, СтандартнаяОбработка) Экспорт
	
	//++ Локализация
	//++ НЕ ГОСИС
	
	ИмяКассира = РозничныеПродажиВызовСервера.РеквизитыКассира().Наименование;
	СтандартнаяОбработка = Ложь;
	
	//-- НЕ ГОСИС
	//-- Локализация
	
КонецПроцедуры

// Обработчик события вызывается при получении имени кассира по подключенному оборудованию.
// Используется первым в цепочке заполнения кассира для фискальных операций.
// Если обработчик определил имя кассира, он должен заполнить ИмяКассира и установить
// СтандартнаяОбработка = Ложь.
// Если СтандартнаяОбработка останется Истина или ИмяКассира будет пустым, будет вызван
// обработчик ОбработкаЗаполненияИмяКассира.
//
// Параметры:
//  ИмяКассира - Строка, Неопределено - текст, используемый для заполнения фискальной операции.
//  ПодключенноеОборудование - СправочникСсылка.ПодключаемоеОборудование, Неопределено - выбранное оборудование.
//  СтандартнаяОбработка - Булево - признак продолжения стандартной цепочки заполнения.
//
Процедура ОбработкаЗаполненияИмяКассираПоПодключенномуОборудованию(
	ИмяКассира,
	ПодключенноеОборудование,
	СтандартнаяОбработка) Экспорт

КонецПроцедуры

// Обработчик события вызывается при получении ИНН кассира.
//
// Параметры:
//  ИННКассира - Строка, Неопределено - Текст, используемый для заполнения документа
//  СтандартнаяОбработка - Булево
//
Процедура ОбработкаЗаполненияИННКассира(ИННКассира, СтандартнаяОбработка) Экспорт
	
	//++ Локализация
	//++ НЕ ГОСИС
	
	ИННКассира = РозничныеПродажиВызовСервера.РеквизитыКассира().ИНН;
	СтандартнаяОбработка = Ложь;
	
	//-- НЕ ГОСИС
	//-- Локализация
	
КонецПроцедуры

// Обработчик события вызывается при получении ИНН кассира по подключенному оборудованию.
// Используется первым в цепочке заполнения ИНН кассира для фискальных операций.
// Если обработчик определил ИНН кассира, он должен заполнить ИННКассира и установить
// СтандартнаяОбработка = Ложь.
// Если СтандартнаяОбработка останется Истина или ИННКассира будет пустым, будет вызван
// обработчик ОбработкаЗаполненияИННКассира.
//
// Параметры:
//  ИННКассира - Строка, Неопределено - ИНН кассира, используемый для заполнения фискальной операции.
//  ПодключенноеОборудование - СправочникСсылка.ПодключаемоеОборудование, Неопределено - выбранное оборудование.
//  СтандартнаяОбработка - Булево - признак продолжения стандартной цепочки заполнения.
//
Процедура ОбработкаЗаполненияИННКассираПоПодключенномуОборудованию(
	ИННКассира,
	ПодключенноеОборудование,
	СтандартнаяОбработка) Экспорт

КонецПроцедуры

// Обработчик события вызывается при заполнения наименования рабочего места.
//
// Параметры:
//  Наименование - Строка - Наименование рабочего места.
//  ИмяПользователя - Строка - Имя пользователя информационной базы.
//  СтандартнаяОбработка - Булево
//
Процедура ОбработкаЗаполненияНаименованияРабочегоМеста(Наименование, ИмяПользователя, СтандартнаяОбработка)  Экспорт
	
КонецПроцедуры

#КонецОбласти
