#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	ЗначенияПроверкиПоМОД = Новый Соответствие();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЗаписиРегистра.Документ            КАК Документ,
		|	ЗаписиРегистра.ИдентификаторЗаписи КАК ИдентификаторЗаписи
		|ПОМЕСТИТЬ ВТ_ЗаписиРегистра
		|ИЗ
		|	&ЗаписиРегистра КАК ЗаписиРегистра
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РезультатыОбработкиДокументовИСМП.Документ                       КАК Документ,
		|	РезультатыОбработкиДокументовИСМП.ИдентификаторЗаписи            КАК ИдентификаторЗаписи,
		|	РезультатыОбработкиДокументовИСМП.ТребуетсяПроверкаМОДУчастников КАК ТребуетсяПроверкаМОДУчастников
		|ИЗ
		|	РегистрСведений.РезультатыОбработкиДокументовИСМП КАК РезультатыОбработкиДокументовИСМП
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ЗаписиРегистра КАК ВТ_ЗаписиРегистра
		|		ПО РезультатыОбработкиДокументовИСМП.Документ = ВТ_ЗаписиРегистра.Документ
		|		И РезультатыОбработкиДокументовИСМП.ИдентификаторЗаписи = ВТ_ЗаписиРегистра.ИдентификаторЗаписи";
	
	ТаблицаЗаписейРегистра = Выгрузить(, "Документ, ИдентификаторЗаписи");
	Запрос.УстановитьПараметр("ЗаписиРегистра", ТаблицаЗаписейРегистра);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		ДанныеПоДокументу = ЗначенияПроверкиПоМОД.Получить(ВыборкаДетальныеЗаписи.Документ);
		
		Если ДанныеПоДокументу = Неопределено Тогда
			ДанныеПоИдентификаторуЗаписи = Новый Соответствие();
		Иначе
			
			ДанныеПоИдентификаторуЗаписи = ДанныеПоДокументу.Получить(ВыборкаДетальныеЗаписи.ИдентификаторЗаписи);
			
			Если ДанныеПоИдентификаторуЗаписи = Неопределено Тогда
				ДанныеПоИдентификаторуЗаписи = Новый Соответствие();
			КонецЕсли;
			
		КонецЕсли;
		
		ДанныеПоИдентификаторуЗаписи.Вставить(ВыборкаДетальныеЗаписи.ИдентификаторЗаписи, ВыборкаДетальныеЗаписи.ТребуетсяПроверкаМОДУчастников);
		ЗначенияПроверкиПоМОД.Вставить(ВыборкаДетальныеЗаписи.Документ, ДанныеПоИдентификаторуЗаписи);
		
	КонецЦикла;
	
	ДополнительныеСвойства.Вставить("ЗначенияПроверкиПоМОД", ЗначенияПроверкиПоМОД);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ДополнительныеСвойства.Свойство("ЗначенияПроверкиПоМОД") Тогда
		Возврат;
	КонецЕсли;
	
	ДокументыПоТипамКПерерасчетуСтатусов = Новый Соответствие;
	
	Для Каждого Запись Из ЭтотОбъект Цикл
		
		ДанныеПоДокументу = ДополнительныеСвойства.ЗначенияПроверкиПоМОД.Получить(Запись.Документ);
		
		Если ДанныеПоДокументу = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ЗначениеПроверкиПоМОД = ДанныеПоДокументу.Получить(Запись.ИдентификаторЗаписи);
		
		Если ЗначениеПроверкиПоМОД = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Если ЗначениеПроверкиПоМОД = Запись.ТребуетсяПроверкаМОДУчастников Тогда
			Продолжить;
		КонецЕсли;
		
		ТипОснования = ТипЗнч(Запись.Документ);
		Элемент = ДокументыПоТипамКПерерасчетуСтатусов.Получить(ТипОснования);
		
		Если Элемент = Неопределено Тогда
			Элемент = Новый Массив;
		КонецЕсли;
		Элемент.Добавить(Запись.Документ);
		
		ДокументыПоТипамКПерерасчетуСтатусов.Вставить(ТипОснования, Элемент)
		
	КонецЦикла;
	
	ТипыКПроверке = Новый Массив;
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ТипыКПроверке, Метаданные.ОпределяемыеТипы.ОснованиеРазрешениеНаОтгрузкуИСМП.Тип.Типы(), Истина);
	
	Для Каждого Тип Из ТипыКПроверке Цикл
		ДокументыТипа = ДокументыПоТипамКПерерасчетуСтатусов.Получить(Тип);
		Если ДокументыТипа <> Неопределено Тогда
			РасчетСтатусовОформленияИСМП.РассчитатьСтатусыОформленияДокументов(ДокументыТипа);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли