#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиСобытийОбъекта

// Обработчик события "ПередЗаписью" для владельца протокола
// 
// Параметры:
//  Объект - ДокументОбъект- Владелец протокола.
//  Отказ - Булево.
//  РежимЗаписи - РежимЗаписиДокумента.
//  РежимПроведения - РежимПроведенияДокумента.
Процедура ПередЗаписью(Объект, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	НовоеСостояние = РаботаСПротоколомДокументаКлиентСервер.ИзменяемыеСвойстваПротокола();
	РаботаСПротоколомДокументаКлиентСервер.ЗаполнитьСвойстваПротоколаИзОбъекта(НовоеСостояние, Объект);
	
	Если ЗначениеЗаполнено(Объект.Протокол) Тогда

		ИсходноеСостояние = РаботаСПротоколомДокументаКлиентСервер.ИзменяемыеСвойстваПротокола();
		ПоследняяСтрока = РаботаСПротоколомДокументаКлиентСервер.ПоследняяСтрокаПротокола(Объект.Протокол);
		ЗаполнитьЗначенияСвойств(ИсходноеСостояние, ПоследняяСтрока);
		
		Если Не РаботаСПротоколомДокументаКлиентСервер.ИзменилисьСвойстваПротокола(НовоеСостояние, ИсходноеСостояние) Тогда
			Возврат; // Протокол не изменялся (в т.ч. программно), обновление данных не требуется.
		КонецЕсли;
		
	КонецЕсли;
	
	НоваяСтрокаПротокола(Объект.Протокол, НовоеСостояние);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийФормы

// Создает на форме вспомогательные реквизиты и заполняет представления протокола
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - Владелец протокола.
Процедура ЗаполнитьДанныеФормы(Форма) Экспорт

	ИнициализироватьФорму(Форма);
	РаботаСПротоколомДокументаКлиентСервер.ЗаполнитьДанныеФормыПоПротоколу(Форма);
	
КонецПроцедуры

#КонецОбласти

#Область КонтрактПеречисления

// Добавляет описание, влияющее на добавление установки нового исполнителя в поле "ПредставлениеСтатуса"
// Вызывается из методов "ЗаполнитьДоступныеМаршрутыСтатусов" модулей менеджеров перечислений статусов документов.
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - Владелец протокола.
//  ИсходныйСтатус - ПеречислениеСсылка - Статус, из которого можно установить новое значение исполнителя.
Процедура ДобавитьМаршрутПеренаправления(Форма, ИсходныйСтатус) Экспорт
	
	ДобавитьДоступныйМаршрут(Форма, ИсходныйСтатус, ИсходныйСтатус, НСтр("ru = 'Перенаправить'"));
	
КонецПроцедуры

// Добавляет описание, влияющее на добавление гиперссылки установки нового статуса в поле "ПредставлениеСтатуса".
// Вызывается из методов "ЗаполнитьДоступныеМаршрутыСтатусов" модулей менеджеров перечислений статусов документов.
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - Владелец протокола.
//  ИсходныйСтатус - ПеречислениеСсылка - Статус, из которого можно установить новое значение.
//  УстанавливаемыйСтатус - ПеречислениеСсылка - Статус, который можно установить из исходного.
//  ПредставлениеКоманды - Строка - Представление гиперссылки установки статуса.
//  ИмяРеквизитаИсполнителя - Строка - Путь к реквизиту Объекта, в котором хранится значение устанавливаемого исполнителя.
// 								Если не указан, то значение исполнителя не изменяется.
Процедура ДобавитьДоступныйМаршрут(Форма, ИсходныйСтатус, УстанавливаемыйСтатус, ПредставлениеКоманды, ИмяРеквизитаИсполнителя = "") Экспорт
	
	ДоступныеМаршрутыСтатусов = Форма.ДоступныеМаршрутыСтатусов; // ДанныеФормыКоллекция
	
	Маршрут = ДоступныеМаршрутыСтатусов.Добавить();
	Маршрут.ИсходныйСтатус = ИсходныйСтатус;
	Маршрут.УстанавливаемыйСтатус = УстанавливаемыйСтатус;
	Маршрут.ПредставлениеКоманды = ПредставлениеКоманды;
	Маршрут.ИмяРеквизитаИсполнителя = ИмяРеквизитаИсполнителя;
	
КонецПроцедуры

// Проверяет, что значение статуса завершает процесс работы с документом.
// 
// Параметры:
//  Статус - ПеречислениеСсылка - Проверяемый статус
// 
// Возвращаемое значение:
//  Булево - Истина, если значение статуса входит в список конечных статусов, описанных в модуле перечисления
Функция ЭтоКонечныйСтатусДокумента(Статус) Экспорт

	Возврат ОбщегоНазначения.МенеджерОбъектаПоСсылке(Статус).ЭтоКонечныйСтатус(Статус);

КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ИнициализацияФормы

Процедура ИнициализироватьФорму(Форма)

	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "ДоступныеМаршрутыСтатусов") Тогда
		// Есть реквизит, создаваемый при инициализации. Повторная инициализация не требуется.
		Возврат;
	КонецЕсли;
	
	ДобавляемыеРеквизиты = Новый Массив;
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы(
		"КэшПротокола", Новый ОписаниеТипов()));
	
	ТипСтатуса = ОбщегоНазначенияУТ.ОписаниеТиповПоТипу(ТипЗнч(Форма.Объект.Статус));
	Строка150 = ОбщегоНазначения.ОписаниеТипаСтрока(150);
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы(
		"ДоступныеМаршрутыСтатусов", Новый ОписаниеТипов("ТаблицаЗначений")));
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы(
		"ИсходныйСтатус", ТипСтатуса, "ДоступныеМаршрутыСтатусов"));
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы(
		"УстанавливаемыйСтатус", ТипСтатуса, "ДоступныеМаршрутыСтатусов"));
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы(
		"ПредставлениеКоманды", Строка150, "ДоступныеМаршрутыСтатусов"));
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы(
		"ЗначениеКоманды", Строка150, "ДоступныеМаршрутыСтатусов"));
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы(
		"ИмяРеквизитаИсполнителя", Строка150, "ДоступныеМаршрутыСтатусов"));
	Форма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
	ЗаполнитьДоступныеМаршрутыСтатусов(Форма);
	
	// Свойства для работы в клиент-серверном модуле:
	Форма.КэшПротокола = Новый Структура;
	Форма.КэшПротокола.Вставить("ЖирныйШрифт", ШрифтыСтиля.ЖирныйШрифт);
	Форма.КэшПротокола.Вставить("НачалоДня", НачалоДня(ТекущаяДатаСеанса()));
	
КонецПроцедуры

#КонецОбласти

#Область СтатусДокумента

Процедура ЗаполнитьДоступныеМаршрутыСтатусов(Форма)
	
	ДоступныеМаршрутыСтатусов = Форма.ДоступныеМаршрутыСтатусов; // ДанныеФормыКоллекция
	ДоступныеМаршрутыСтатусов.Очистить();
	
	Если Форма.ТолькоПросмотр Тогда
		// Статус является сохраняемым реквизитом. Редактирование по гиперссылкам недоступно, если форма недоступна
		Возврат;
	КонецЕсли;
	
	ТекущийСтатус = Форма.Объект.Статус;
	МенеджерСтатуса = ОбщегоНазначения.МенеджерОбъектаПоСсылке(ТекущийСтатус); // ПеречислениеМенеджер
	МенеджерСтатуса.ЗаполнитьДоступныеМаршрутыСтатусов(Форма);
	
	МетаданныеПеречисления = ТекущийСтатус.Метаданные(); // ОбъектМетаданныхПеречисление
	ИмяПеречисления = МетаданныеПеречисления.ПолноеИмя();
	ШаблонПредопределенногоЗначения = "%1.%2";
	
	Для Каждого Маршрут Из ДоступныеМаршрутыСтатусов Цикл
		
		Если Маршрут.ИсходныйСтатус = Маршрут.УстанавливаемыйСтатус Тогда
			Маршрут.ЗначениеКоманды = РаботаСПротоколомДокументаКлиентСервер.ЗначениеКомандыПеренаправить();
		Иначе
			Маршрут.ЗначениеКоманды = СтрШаблон(
				ШаблонПредопределенногоЗначения,
				ИмяПеречисления,
				МетаданныеПеречисления.ЗначенияПеречисления[МенеджерСтатуса.Индекс(Маршрут.УстанавливаемыйСтатус)].Имя);
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Область ИзменениеПротокола

// Добавляет новую строку в протокол документа
// 
// Параметры:
//  Протокол - ДанныеФормыКоллекция - В который будет добавлена новая строка
//  ДанныеПротокола - см. РаботаСПротоколомДокументаКлиентСервер.ИзменяемыеСвойстваПротокола 
// 
// Возвращаемое значение:
//  ДанныеФормыЭлементКоллекции - Новая строка протокола
Функция НоваяСтрокаПротокола(Протокол, ДанныеПротокола) Экспорт
	
	ДанныеСтроки = РаботаСПротоколомДокументаКлиентСервер.СтруктураСтрокиПротокола();
	ЗаполнитьЗначенияСвойств(ДанныеСтроки, ДанныеПротокола);
	ДанныеСтроки.Автор = Пользователи.ТекущийПользователь();
	ДанныеСтроки.Дата = ТекущаяДатаСеанса();
	
	Возврат РаботаСПротоколомДокументаКлиентСервер.НоваяСтрокаПротокола(Протокол, ДанныеСтроки);
	
КонецФункции

#КонецОбласти

#КонецОбласти