
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВидМаркетплейса = Параметры.ВидМаркетплейса;
	УчетнаяЗапись = Параметры.УчетнаяЗапись;
	
	ЭтоOzon = Параметры.ВидМаркетплейса = Перечисления.ВидыМаркетплейсов.МаркетплейсOzon;
	
	Элементы.ГруппаМаркетплейсOzon.Видимость = ЭтоOzon;
	Если ЭтоOzon Тогда
		ЭлементОтбора = СписокМаркетплейсOzon.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Статус");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
		ЭлементОтбора.ПравоеЗначение = Перечисления.СтатусыОбъектовМаркетплейсаOzon.ВАрхиве;
		ЭлементОтбора.Использование = Истина;
		
		СписокМаркетплейсOzon.Параметры.УстановитьЗначениеПараметра("УчетнаяЗапись", УчетнаяЗапись);
		ЭлементОтбора = СписокМаркетплейсOzon.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Номенклатура");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.Использование = Ложь;
	Иначе
		СвойстваСписка = ОбщегоНазначения.СтруктураСвойствДинамическогоСписка();
		СвойстваСписка.ТекстЗапроса = "";
		ОбщегоНазначения.УстановитьСвойстваДинамическогоСписка(Элементы.СписокМаркетплейсOzon, СвойстваСписка);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокМаркетплейсOzon

&НаКлиенте
Процедура СписокМаркетплейсOzonВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	
	Закрыть(ПолучитьРезультатВыбора(Значение));
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ПолучитьРезультатВыбора(ВыбранныеЗначения)
	
	Результат = Новый Соответствие;
	
	ТаблицаДляПоиска = Новый ТаблицаЗначений;
	Для Каждого Измерение Из Метаданные.РегистрыСведений.СтатусыПубликацииОбъектовМаркетплейсаOzon.Измерения Цикл
		ТаблицаДляПоиска.Колонки.Добавить(Измерение.Имя, Измерение.Тип);
	КонецЦикла;
	
	Для Каждого ВыбранноеЗначение Из ВыбранныеЗначения Цикл
		НоваяСтрока = ТаблицаДляПоиска.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыбранноеЗначение);
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаДляПоиска.УчетнаяЗаписьМаркетплейса КАК УчетнаяЗаписьМаркетплейса,
	|	ТаблицаДляПоиска.ВидОбъектаМаркетплейса КАК ВидОбъектаМаркетплейса,
	|	ТаблицаДляПоиска.Номенклатура КАК Номенклатура,
	|	ТаблицаДляПоиска.Характеристика КАК Характеристика,
	|	ТаблицаДляПоиска.Упаковка КАК Упаковка,
	|	ТаблицаДляПоиска.НоменклатураПартнера КАК НоменклатураПартнера,
	|	ТаблицаДляПоиска.ОбъектПубликации КАК ОбъектПубликации
	|ПОМЕСТИТЬ врТаблицаДляПоиска
	|ИЗ
	|	&ТаблицаДляПоиска КАК ТаблицаДляПоиска
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	УчетнаяЗаписьМаркетплейса,
	|	ВидОбъектаМаркетплейса,
	|	Номенклатура,
	|	Характеристика,
	|	Упаковка,
	|	НоменклатураПартнера,
	|	ОбъектПубликации
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеРегистра.ИдентификаторПубликации КАК ИдентификаторПубликации,
	|	ДанныеРегистра.НаименованиеОбъектаМаркетплейса КАК НаименованиеМП
	|ИЗ
	|	РегистрСведений.СтатусыПубликацииОбъектовМаркетплейсаOzon КАК ДанныеРегистра
	|ГДЕ
	|	(ДанныеРегистра.УчетнаяЗаписьМаркетплейса, ДанныеРегистра.ВидОбъектаМаркетплейса, ДанныеРегистра.Номенклатура,
	|		ДанныеРегистра.Характеристика, ДанныеРегистра.Упаковка, ДанныеРегистра.НоменклатураПартнера,
	|		ДанныеРегистра.ОбъектПубликации) В
	|		(ВЫБРАТЬ
	|			врТаблицаДляПоиска.УчетнаяЗаписьМаркетплейса,
	|			врТаблицаДляПоиска.ВидОбъектаМаркетплейса,
	|			врТаблицаДляПоиска.Номенклатура,
	|			врТаблицаДляПоиска.Характеристика,
	|			врТаблицаДляПоиска.Упаковка,
	|			врТаблицаДляПоиска.НоменклатураПартнера,
	|			врТаблицаДляПоиска.ОбъектПубликации
	|		ИЗ
	|			врТаблицаДляПоиска КАК врТаблицаДляПоиска)";
	
	Запрос.УстановитьПараметр("ТаблицаДляПоиска", ТаблицаДляПоиска);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат.Вставить(Выборка.ИдентификаторПубликации, Выборка.НаименованиеМП);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
