#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ВидДокумента) = Ложь Тогда
		ВидДокумента = ЭлектронныеДокументыЭДО.ВидДокументаПоТипу(Перечисления.ТипыДокументовЭДО.ЭТрН);
	КонецЕсли;
	
	Если РольУчастника = 0 Тогда 
		РольУчастника = 3;
	КонецЕсли;
	
	Если РольУчастника = 1 И ТипЗнч(СсылкаТитулГрузоотправителяПеревозчик) = Тип("СправочникСсылка.Организации") Тогда
		Организация = СсылкаТитулГрузоотправителяПеревозчик;
	ИначеЕсли РольУчастника = 2 Тогда
		Если ТипЗнч(СсылкаТитулГрузоотправителяГрузополучатель) = Тип("СправочникСсылка.Организации") Тогда
			Организация = СсылкаТитулГрузоотправителяГрузополучатель;
		ИначеЕсли ТипЗнч(СсылкаДопТитулПереадресовкаНовыйГрузополучатель) = Тип("СправочникСсылка.Организации") Тогда
			Организация = СсылкаДопТитулПереадресовкаНовыйГрузополучатель;
		ИначеЕсли ТипЗнч(СсылкаТитулПереадресовкаНовыйГрузополучатель) = Тип("СправочникСсылка.Организации") Тогда
			Организация = СсылкаТитулПереадресовкаНовыйГрузополучатель;
		КонецЕсли;
	ИначеЕсли РольУчастника = 3 Тогда
		Если ТипЗнч(СсылкаТитулГрузоотправителяГрузоотправитель) = Тип("СправочникСсылка.Организации") Тогда
			Организация = СсылкаТитулГрузоотправителяГрузоотправитель;
		ИначеЕсли ТипЗнч(СсылкаТитулГрузоотправителяСоставитель) = Тип("СправочникСсылка.Организации") Тогда
			Организация = СсылкаТитулГрузоотправителяСоставитель;
		КонецЕсли;
	КонецЕсли;
	
	ОбменСГИСЭПД.УстановитьТекущийШаг(ЭтотОбъект);
	
КонецПроцедуры


Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;
	
	// Запишем новую версию
	ВерсияТитула = Неопределено;
	Если ДополнительныеСвойства.Свойство("ВерсияТитула", ВерсияТитула) Тогда
		ЗаписьВерсии = РегистрыСведений.ВерсииТитуловЭПД.СоздатьМенеджерЗаписи();
		ЗаписьВерсии.Документ = Ссылка;
		ЗаписьВерсии.Организация = Организация;
		ЗаписьВерсии.Титул = ВерсияТитула.Титул;
		ЗаписьВерсии.НомерВерсии = ВерсияТитула.НомерВерсии;
		
		ЗаписьВерсии.ИдентификаторФайла = ВерсияТитула.ИдентификаторФайла;
		ЗаписьВерсии.ДатаВерсии = ВерсияТитула.ДатаВерсии;
		ЗаписьВерсии.Записать();
	КонецЕсли;
	
	// Запишем реквизиты
	Если ВерсияТитула <> Неопределено Тогда
		СтруктураРеквизитовТитула = Неопределено;
		Если ДополнительныеСвойства.Свойство("СтруктураРеквизитов", СтруктураРеквизитовТитула) Тогда
			НомерВерсии = Неопределено;
			ДополнительныеСвойства.Свойство("НомерВерсии", НомерВерсии);
			Если НомерВерсии = Неопределено Тогда
				НомерВерсии = 0;
			КонецЕсли;
			НаборЗаписейЗначений = РегистрыСведений.ЗначенияРеквизитовДокументовЭПД.СоздатьНаборЗаписей();
			НаборЗаписейЗначений.Отбор.Документ.Установить(Ссылка);
			НаборЗаписейЗначений.Отбор.Титул.Установить(ВерсияТитула.Титул);
			НаборЗаписейЗначений.Отбор.НомерВерсии.Установить(НомерВерсии);
			Для Каждого КиЗ Из СтруктураРеквизитовТитула Цикл
				МассивЧастей = ОбменСГИСЭПДКлиентСервер.РазделитьСтрокуСоСложнымРазделителем(КиЗ.Ключ, "__");
				Если МассивЧастей.Количество() = 3 Тогда
					ИмяТабличнойЧасти = МассивЧастей[0];
					НомерСтрокиРеквизита = Число(МассивЧастей[1]);
					ИмяРеквизита = МассивЧастей[2];
				Иначе
					ИмяТабличнойЧасти = "";
					НомерСтрокиРеквизита = 0;
					ИмяРеквизита = КиЗ.Ключ;
				КонецЕсли;	
				НоваяЗапись = НаборЗаписейЗначений.Добавить();
				НоваяЗапись.Документ = Ссылка;
				НоваяЗапись.Организация = Организация;
				НоваяЗапись.Титул = ВерсияТитула.Титул;
				НоваяЗапись.НомерВерсии = НомерВерсии;
				НоваяЗапись.ИмяТабличнойЧасти = ИмяТабличнойЧасти;
				НоваяЗапись.НомерСтрокиРеквизита = НомерСтрокиРеквизита;
				НоваяЗапись.ИмяРеквизита = ИмяРеквизита;
				Если КиЗ.Значение = Неопределено Или ТипЗнч(КиЗ.Значение) = Тип("Строка") Тогда 
					НоваяЗапись.ЗначениеРеквизитаСтрока = КиЗ.Значение;
					НоваяЗапись.ТипРеквизита = Перечисления.ТипыРеквизитовЭПД.НеограниченнаяСтрока;
				ИначеЕсли ТипЗнч(КиЗ.Значение) = Тип("Число")
					Или ТипЗнч(КиЗ.Значение) = Тип("Дата")
					Или ТипЗнч(КиЗ.Значение) = Тип("Булево") Тогда
						НоваяЗапись.ЗначениеРеквизита = КиЗ.Значение;
						НоваяЗапись.ТипРеквизита = Перечисления.ТипыРеквизитовЭПД.ПростойКромеСтроки;
				Иначе
					НоваяЗапись.ЗначениеРеквизитаСсылка = КиЗ.Значение;
					НоваяЗапись.ТипРеквизита = Перечисления.ТипыРеквизитовЭПД.СсылочныйТип;
				КонецЕсли;
			КонецЦикла;
			НаборЗаписейЗначений.Записать();
		КонецЕсли;
	КонецЕсли;
	
	СтруктураДляРеестра = ОбменСГИСЭПДКлиентСервер.НоваяСтруктураДляРеестраЭПД();
	
	СтруктураДляРеестра.Ссылка = Ссылка;
	Если ЗначениеЗаполнено(СсылкаТитулГрузоотправителяСоставитель) Тогда
		СтруктураДляРеестра.Грузоотправитель = СсылкаТитулГрузоотправителяСоставитель;
	Иначе
		СтруктураДляРеестра.Грузоотправитель = СсылкаТитулГрузоотправителяГрузоотправитель;
	КонецЕсли;
	СтруктураДляРеестра.Грузополучатель = СсылкаТитулГрузоотправителяГрузополучатель;
	СтруктураДляРеестра.ДатаДокументаИБ = Дата;
	СтруктураДляРеестра.Комментарий = Комментарий;
	СтруктураДляРеестра.НомерДокументаИБ = Номер;
	СтруктураДляРеестра.НомерЭПД = ТитулГрузоотправителяТранспортнаяНакладнаяНомер;
	СтруктураДляРеестра.ДатаЭПД = ТитулГрузоотправителяТранспортнаяНакладнаяДата;
	СтруктураДляРеестра.Организация = Организация;
	СтруктураДляРеестра.Перевозчик = СсылкаТитулГрузоотправителяПеревозчик;
	СтруктураДляРеестра.ПометкаУдаления = ПометкаУдаления;
	СтруктураДляРеестра.Проведен = Проведен;	
	СтруктураДляРеестра.ТипСсылки = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ТипЗнч(Ссылка));
	СтруктураДляРеестра.ТекущийШаг = ТекущийШаг;
	СтруктураДляРеестра.ТекущийШагВыполнен = ТекущийШагВыполнен;
	СтруктураДляРеестра.РольУчастника = РольУчастника;
	
	ЗаписьИзФормы = Неопределено;
	Если ДополнительныеСвойства.Свойство("ЗаписьИзФормы", ЗаписьИзФормы) = Ложь Тогда
		ЗаписьИзФормы = Ложь;
	КонецЕсли;	
	
	ЭлектронныйДокумент = Неопределено;
	Если ДополнительныеСвойства.Свойство("ЭлектронныйДокумент", ЭлектронныйДокумент) Тогда
		СоответствиеЭлектронныхДокументов = Новый Соответствие;
		СоответствиеЭлектронныхДокументов.Вставить(Ссылка, ЭлектронныйДокумент);
	Иначе
		СоответствиеЭлектронныхДокументов = Неопределено;
	КонецЕсли;
	
	ОбменСГИСЭПД.ЗаписатьВРеестрЭПД(СтруктураДляРеестра, ЗаписьИзФормы, СоответствиеЭлектронныхДокументов);
	
	Если РольУчастника = 3 Тогда
		ОбменСГИСЭПД.ИзменитьИспользованиеЗаданияОтправкиQR(Истина);
	КонецЕсли;

КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") 
		И ДанныеЗаполнения.Свойство("СоздатьЭТрН") Тогда
		ОбработкаЗаполненияПоСтруктуре(ДанныеЗаполнения);
	КонецЕсли;
	
	ОбменСГИСЭПДПереопределяемый.ОбработкаЗаполненияЭТрН(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка);
	
КонецПроцедуры


Процедура ПриКопировании(ОбъектКопирования)
	
	Если ОбъектКопирования.ЭтоВходящий = Истина Тогда
		ВызватьИсключение НСтр("ru='Нельзя копировать входящий документ'");
	КонецЕсли;
	
	УИДМинтранс = Неопределено;
	ТитулГрузоотправителяТранспортнаяНакладнаяНомер = Неопределено;
	ТитулГрузоотправителяТранспортнаяНакладнаяДата = Неопределено;
	
	ПрефиксыТитулов = ОбменСГИСЭПДКлиентСервер.ПрефиксыТитуловДокумента("Документ.ЭлектроннаяТранспортнаяНакладная");
	Для Каждого ПрефиксТитула Из ПрефиксыТитулов Цикл
		ЭтотОбъект[ПрефиксТитула + "ИдентификаторФайла"] = Неопределено;
		ЭтотОбъект[ПрефиксТитула + "ДатаФормированияФайла"] = Неопределено;
		ЭтотОбъект[ПрефиксТитула + "ВремяФормированияФайла"] = Неопределено;
	КонецЦикла;
	СсылкаТитулПереадресовкаНовыйГрузополучатель = Неопределено;
	СсылкаДопТитулПереадресовкаНовыйГрузополучатель = Неопределено;
	ИныеПолучателиСтрока = Неопределено;
	ТекущийШаг = Неопределено;
	ТекущийШагВыполнен = Ложь;
	РольУчастника = 3;	
	
	ТекущийТитул = ПредопределенноеЗначение("Перечисление.ТипыЭлементовРегламентаЭДО.ЭТрН_Титул1");
	ТекущийПолученныйТитул = Неопределено;
	
КонецПроцедуры

#Область СлужебныеПроцедурыИФункции

Процедура УстановитьДокументОснование(Знач ДокументОснование)
	
	Если ДокументОснование = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.ПроверитьПараметр(
		"Документы.ЭлектроннаяТранспортнаяНакладная.МодульОбъекта.УстановитьДокументОснование",
		"ДокументОснование",
		ДокументОснование,
		Метаданные.ОпределяемыеТипы.ДокументыОснованияЭТрН_ЭПД.Тип);
	
	НоваяСтрока = ДокументыОснования.Добавить();
	НоваяСтрока.ДокументОснование = ДокументОснование;
	
КонецПроцедуры

// Параметры:
//  ИмяСвойства       - Строка
//  ПрефиксРеквизитов - Строка
//  ДанныеЗаполнения  - Структура
Процедура ЗаполнитьРеквизитыУчастника(
	Знач ИмяСвойства,
	Знач ПрефиксРеквизитов,
	Знач ДанныеЗаполнения)
	
	Участник = Неопределено;
	
	Если Не ДанныеЗаполнения.Свойство(ИмяСвойства, Участник) Тогда
		Возврат;
	КонецЕсли;
	
	ОбменСГИСЭПДКлиентСервер.ЗаполнитьРеквизитыУчастника(
		Участник,
		ПрефиксРеквизитов,
		ДанныеЗаполнения,
		Неопределено);
	
КонецПроцедуры

// Параметры:
//  ДанныеЗаполнения - Структура
Процедура ОбработкаЗаполненияПоСтруктуре(Знач ДанныеЗаполнения)
	
	ЗаполнитьРеквизитыУчастника(
		"СсылкаТитулГрузоотправителяГрузоотправитель",
		"ТитулГрузоотправителяГрузоотправитель",
		ДанныеЗаполнения);
		
	ЗаполнитьРеквизитыУчастника(
		"СсылкаТитулГрузоотправителяГрузополучатель",
		"ТитулГрузоотправителяГрузополучатель",
		ДанныеЗаполнения);
		
	ЗаполнитьРеквизитыУчастника(
		"СсылкаТитулГрузоотправителяПеревозчик",
		"ТитулГрузоотправителяПеревозчик",
		ДанныеЗаполнения);
	
	ЗаполнитьАдрес(
		ДанныеЗаполнения,
		"СсылкаТитулГрузоотправителяГрузополучатель",
		"ТитулГрузоотправителяГрузополучательАдресДоставки");
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
	
	Если ДанныеЗаполнения.Свойство("ДокументОснование") Тогда
		УстановитьДокументОснование(ДанныеЗаполнения.ДокументОснование);
	КонецЕсли;
	
КонецПроцедуры

// Параметры:
//  ДанныеЗаполнения - Структура
//  Префикс          - Строка
// 
// Возвращаемое значение:
//  Булево
Функция АдресЗаполнен(ДанныеЗаполнения, Знач Префикс)
	
	СтрокаПоиска = НРег(Префикс);
	
	Для каждого КлючИЗначение Из ДанныеЗаполнения Цикл
		Если СтрНачинаетсяС(НРег(КлючИЗначение.Ключ), СтрокаПоиска)
			И Не ПустаяСтрока(КлючИЗначение.Значение) Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

// Параметры:
//  ДанныеЗаполнения - Структура
//  ПрефиксАдреса    - Строка
//  ЧастьАдреса      - Строка
//  Значение1        - Строка
//  Значение2        - Строка
//                   - Неопределено
Процедура УстановитьЧастьАдреса(
	ДанныеЗаполнения, 
	Знач ПрефиксАдреса, 
	Знач ЧастьАдреса, 
	Знач Значение1, 
	Знач Значение2 = Неопределено)
	
	ЧастиЗначенияАдреса = Новый Массив;
	
	Если Не ПустаяСтрока(Значение1) Тогда
		ЧастиЗначенияАдреса.Добавить(Значение1);
	КонецЕсли;
	
	Если Не ПустаяСтрока(Значение2) Тогда
		ЧастиЗначенияАдреса.Добавить(Значение2);
	КонецЕсли;
	
	Если ЧастиЗначенияАдреса.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ЗначениеАдреса = СтрСоединить(ЧастиЗначенияАдреса, " ");
	
	Если ПустаяСтрока(ЗначениеАдреса) Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеЗаполнения.Вставить(ПрефиксАдреса + ЧастьАдреса, ЗначениеАдреса);
	
КонецПроцедуры

// Параметры:
//  ДанныеЗаполнения   - Структура
//  ИмяРеквизитаСсылка - Строка
//  ПрефиксАдреса      - Строка
Процедура ЗаполнитьАдрес(ДанныеЗаполнения, Знач ИмяРеквизитаСсылка, Знач ПрефиксАдреса)
	
	Если АдресЗаполнен(ДанныеЗаполнения, ПрефиксАдреса) Тогда
		Возврат;
	КонецЕсли;
	
	Участник = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеЗаполнения, ИмяРеквизитаСсылка);
	
	Если Не ЗначениеЗаполнено(Участник) Тогда
		Возврат;
	КонецЕсли;
	
	Адреса = ОбменСГИСЭПДКлиентСервер.ПолучитьАдресаДоставки(ДанныеЗаполнения.СсылкаТитулГрузоотправителяГрузополучатель);
	СведенияОбАдресе = Неопределено;
	
	Для каждого Адрес Из Адреса Цикл
		Если Адрес.Значение.Основной Тогда
			СведенияОбАдресе = Адрес.Значение;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если Не ЗначениеЗаполнено(СведенияОбАдресе) Тогда
		Возврат;
	КонецЕсли; 

	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("БезПредставлений" , Ложь);
	ДополнительныеПараметры.Вставить("ПроверитьАдрес"   , Истина);
	ДополнительныеПараметры.Вставить("КодыАдреса"       , Истина);
	
	СтруктураАдреса = РаботаСАдресами.СведенияОбАдресе(СведенияОбАдресе.Адрес, ДополнительныеПараметры);
	
	Если СтруктураАдреса.ТипАдреса = "ВСвободнойФорме" Тогда
		
		УстановитьЧастьАдреса(ДанныеЗаполнения, ПрефиксАдреса, 
			"Представление",   СтруктураАдреса.Представление);
		УстановитьЧастьАдреса(ДанныеЗаполнения, ПрефиксАдреса, 
			"КодСтраны",       СтруктураАдреса.КодСтраны);
		
	Иначе
		
		УстановитьЧастьАдреса(ДанныеЗаполнения, ПрефиксАдреса, 
			"Индекс",          СтруктураАдреса.Индекс);
		УстановитьЧастьАдреса(ДанныеЗаполнения, ПрефиксАдреса, 
			"КодРегиона",      СтруктураАдреса.КодРегиона);
		УстановитьЧастьАдреса(ДанныеЗаполнения, ПрефиксАдреса, 
			"Город",           СтруктураАдреса.Город, СтруктураАдреса.ГородТипКраткий);
		УстановитьЧастьАдреса(ДанныеЗаполнения, ПрефиксАдреса, 
			"Район",           СтруктураАдреса.Район, СтруктураАдреса.РайонТипКраткий);
		УстановитьЧастьАдреса(ДанныеЗаполнения, ПрефиксАдреса, 
			"НаселенныйПункт", СтруктураАдреса.НаселенныйПункт, СтруктураАдреса.НаселенныйПунктТипКраткий);
		УстановитьЧастьАдреса(ДанныеЗаполнения, ПрефиксАдреса, 
			"Улица",           СтруктураАдреса.Улица, СтруктураАдреса.УлицаТипКраткий);
		УстановитьЧастьАдреса(ДанныеЗаполнения, ПрефиксАдреса, 
			"Дом",             СтруктураАдреса.Здание.Номер);
		
		Если СтруктураАдреса.Корпуса.Количество() = 1 Тогда
			УстановитьЧастьАдреса(ДанныеЗаполнения, ПрефиксАдреса, 
				"Корпус",      СтруктураАдреса.Корпуса[0].Номер);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
