// @strict-types

#Область СлужебныйПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

#Область ТранспортныеКонтейнерыЭДО

// См. ТранспортныеКонтейнерыЭДО.ПриФормированииТаблицыТиповЭлементовРегламента
Процедура ПриФормированииТаблицыТиповЭлементовРегламента(Таблица) Экспорт
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.КодТранзакции = "Template";
	НоваяСтрока.ТипЭлементаРегламента = Перечисления.ТипыЭлементовРегламентаЭДО.ИнформацияОтправителя;
КонецПроцедуры

// См. ТранспортныеКонтейнерыЭДО.ПриФормированииТаблицыТиповРегламентов
Процедура ПриФормированииТаблицыТиповРегламентов(Таблица) Экспорт
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.КодРегламента = "Template";
	НоваяСтрока.КодДокумента = "Template";
	НоваяСтрока.ТипРегламента = Перечисления.ТипыРегламентовЭДО.Черновик;
	НоваяСтрока.ТипДокумента = Перечисления.ТипыДокументовЭДО.ПустаяСсылка();
КонецПроцедуры

// Возвращаемое значение:
//  Структура:
// * Идентификатор - Строка - идентификатор черновика. Должен быть указан в описании документа,
//                            созданного в ответ на Черновик.
// * Тип - Строка - тип технологии роуминга или type Name Такском.
// * ОжидаетсяИзвещениеОПолучении - Булево - отправитель черновика ожидает УС (1999). Значение по умолчанию: false.
// * ДействителенС - Дата
// * ДействителенПо - Дата
// * ПолучательДокумента - Строка - на случай если отправитель черновика не является получателем ответа на Черновик.
// * ПлательщикДокумента - Строка - есть в рабочих переписках, в версии РГ - нет. Тот, кто будет оплачивать документ
//                                  по черновику. Сейчас в 1С всегда платит отправитель документа.
// * МаксимальноеКоличествоОтветов - Число - на первом этапе всегда 1.
// * РедактируемыеДанные - Массив из Строка - xpath строки доступных для редактирования полей.
Функция НовыеДанныеЧерновика() Экспорт
	Результат = Новый Структура;
	Результат.Вставить("Идентификатор", "");
	Результат.Вставить("Тип", "");
	Результат.Вставить("ОжидаетсяИзвещениеОПолучении", Ложь);
	Результат.Вставить("ДействителенС", Дата(1, 1, 1));
	Результат.Вставить("ДействителенПо", Дата(1, 1, 1));
	Результат.Вставить("ПолучательДокумента", "");
	Результат.Вставить("ПлательщикДокумента", "");
	Результат.Вставить("МаксимальноеКоличествоОтветов", 1);
	Результат.Вставить("РедактируемыеДанные", Новый Массив);
	Возврат Результат;
КонецФункции

// Параметры:
//  ДанныеЧерновика - Неопределено - возвращаемый параметр, если данные черновика есть в дополнительных параметрах карточки
//                                   возвращается структура. См. НовыеДанныеЧерновика
//  ДополнительныеПараметры - Структура
// @skip-check statement-type-change,property-return-type
Процедура ЗаполнитьДанныеЧерновикаПоДаннымДополнительныхПараметровКарточкиДокумента(ДанныеЧерновика,
	Знач ДополнительныеПараметры) Экспорт
	
	ОписаниеТипаЧисло = ОбщегоНазначения.ОписаниеТипаЧисло(2);
	ОписаниеТипаБулево = Новый ОписаниеТипов("Булево");
	
	ДанныеЧерновика = НовыеДанныеЧерновика();
	ДанныеЧерновика.Идентификатор = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеПараметры, 
		"ШаблонИдентификатор", "");
	ДанныеЧерновика.Тип = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеПараметры, 
		"ШаблонТип", "");
		
	Если ДополнительныеПараметры.Свойство("ШаблонОжидаетсяИзвещениеОПолучении")
		И ЗначениеЗаполнено(ДополнительныеПараметры.ШаблонОжидаетсяИзвещениеОПолучении) Тогда
		ДанныеЧерновика.ОжидаетсяИзвещениеОПолучении = ОписаниеТипаБулево.ПривестиЗначение(
			ДополнительныеПараметры.ШаблонОжидаетсяИзвещениеОПолучении);
	КонецЕсли;
	
	Если ДополнительныеПараметры.Свойство("ШаблонДействителенС")
		И ЗначениеЗаполнено(ДополнительныеПараметры.ШаблонДействителенС) Тогда
		ДанныеЧерновика.ДействителенС = XMLЗначение(Тип("Дата"), ДополнительныеПараметры.ШаблонДействителенС);
	КонецЕсли;
	
	Если ДополнительныеПараметры.Свойство("ШаблонДействителенПо")
		И ЗначениеЗаполнено(ДополнительныеПараметры.ШаблонДействителенПо) Тогда 
		ДанныеЧерновика.ДействителенПо = XMLЗначение(Тип("Дата"), ДополнительныеПараметры.ШаблонДействителенПо);
	КонецЕсли;
	
	ДанныеЧерновика.ПолучательДокумента = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеПараметры, 
		"ШаблонПолучательДокумента", "");
	ДанныеЧерновика.ПлательщикДокумента = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеПараметры, 
		"ШаблонПлательщикДокумента", "");
	
	Если ДополнительныеПараметры.Свойство("ШаблонМаксимальноеКоличествоОтветов")
		И ЗначениеЗаполнено(ДополнительныеПараметры.ШаблонМаксимальноеКоличествоОтветов) Тогда
		ДанныеЧерновика.МаксимальноеКоличествоОтветов = ОписаниеТипаЧисло.ПривестиЗначение(
			ДополнительныеПараметры.ШаблонМаксимальноеКоличествоОтветов);
	КонецЕсли;
	
	ДанныеЧерновика.РедактируемыеДанные = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеПараметры, 
		"ШаблонРедактируемыеДанные", ДанныеЧерновика.РедактируемыеДанные);
	
КонецПроцедуры

#КонецОбласти // ТранспортныеКонтейнерыЭДО

#Область ЭлектронныеДокументыЭДО

// Возвращаемое значение:
//  Структура:
// * Идентификатор - Строка
// * ЭлектронныйДокументИсточник - ДокументСсылка.ЭлектронныйДокументИсходящийЭДО
// * ВидЧерновика - СправочникСсылка.ВидыДокументовЭДО
// * ОтправительЧерновика - Неопределено,ОпределяемыйТип.УчастникЭДО
// * ОтправительДляДокумента - Неопределено,ОпределяемыйТип.УчастникЭДО
// * ПолучательДляДокумента - Неопределено,ОпределяемыйТип.УчастникЭДО
// * РедактируемыеПоля - Массив из Строка
Функция НовыеПараметрыЧерновикаДокументаДляЗагрузки() Экспорт
	Параметры = Новый Структура;
	Параметры.Вставить("Идентификатор", "");
	Параметры.Вставить("ЭлектронныйДокументИсточник", Документы.ЧерновикЭлектронногоДокументаЭДО.ПустаяСсылка());
	Параметры.Вставить("ВидЧерновика", Справочники.ВидыДокументовЭДО.ПустаяСсылка());
	Параметры.Вставить("ОтправительЧерновика", Неопределено);
	Параметры.Вставить("ОтправительДляДокумента", Неопределено);
	Параметры.Вставить("ПолучательДляДокумента", Неопределено);
	Параметры.Вставить("РедактируемыеПоля", Новый Массив);
	Возврат Параметры;
КонецФункции

// Параметры:
//  ПараметрыЧерновика - Неопределено - возвращаемый параметр. См. НовыеПараметрыЧерновикаДокументаДляЗагрузки
//  ДанныеОбъекта - СтрокаТаблицыЗначений из См. СинхронизацияЭДО.НовыеДанныеОбъектов
// @skip-check statement-type-change,property-return-type,variable-value-type
Процедура ЗаполнитьПараметрыЧерновикаДокумента(ПараметрыЧерновика, Знач ДанныеОбъекта) Экспорт
	
	Карточка = ДанныеОбъекта.Карточка;
	
	ДанныеЧерновика = Неопределено; // См. НовыеДанныеЧерновика
	Если Карточка = Неопределено
		Или Не Карточка.Свойство("ДанныеЧерновика", ДанныеЧерновика)
		Или ДанныеЧерновика = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СодержаниеДокумента = ДанныеОбъекта.Содержание;
	
	ПараметрыЧерновика = НовыеПараметрыЧерновикаДокументаДляЗагрузки();
	ПараметрыЧерновика.Идентификатор = ДанныеЧерновика.Идентификатор;
	ПараметрыЧерновика.ВидЧерновика = ДанныеОбъекта.ВидДокумента;
	
	ТипДокументаИзСодержания = Перечисления.ТипыДокументовЭДО.Прочее;
	Если СодержаниеДокумента <> Неопределено
		И СодержаниеДокумента.ТипДокумента <> Перечисления.ТипыДокументовЭДО.Черновик Тогда
		ТипДокументаИзСодержания = СодержаниеДокумента.ТипДокумента;
	КонецЕсли;
	ПараметрыЧерновика.ВидЧерновика = ЭлектронныеДокументыЭДО.ВидДокументаПоТипу(ТипДокументаИзСодержания);
	
	ПараметрыЧерновика.ОтправительЧерновика =
		УчетныеЗаписиЭДО.ОрганизацияУчетнойЗаписи(ДанныеОбъекта.ИдентификаторОтправителя);
	Если Не ЗначениеЗаполнено(ПараметрыЧерновика.ОтправительЧерновика) Тогда
		ПараметрыЧерновика.ОтправительЧерновика = ДанныеОбъекта.Контрагент;
	КонецЕсли;
	ПараметрыЧерновика.ОтправительДляДокумента = ДанныеОбъекта.Контрагент;
	ПараметрыЧерновика.ПолучательДляДокумента = ДанныеОбъекта.Организация;
	
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ПараметрыЧерновика.РедактируемыеПоля, ДанныеЧерновика.РедактируемыеДанные);
	
КонецПроцедуры

// Параметры:
//  ПараметрыСоздания - См. НовыеПараметрыЧерновикаДокументаДляЗагрузки
// 
// Возвращаемое значение:
//  ДокументОбъект.ЧерновикЭлектронногоДокументаЭДО
//@skip-check variable-value-type
Функция СоздатьЧерновикДокументаЭДО(ПараметрыСоздания) Экспорт
	
	ЧерновикОбъект = Документы.ЧерновикЭлектронногоДокументаЭДО.СоздатьДокумент();
	ЗаполнитьЗначенияСвойств(ЧерновикОбъект, ПараметрыСоздания);
	Для Каждого РедактируемоеПоле Из ПараметрыСоздания.РедактируемыеПоля Цикл
		НоваяСтрока = ЧерновикОбъект.РедактируемыеПоля.Добавить();
		НоваяСтрока.Поле = РедактируемоеПоле;
	КонецЦикла;
	ЧерновикОбъект.Записать();
	
	Возврат ЧерновикОбъект;
	
КонецФункции

// Параметры:
//  СвойстваДокумента - См. ЧерновикиЭДОКлиентСервер.НовыеСвойстваДокументаДляПолученияПредставленияЧерновика
// 
// Возвращаемое значение:
//  Строка
Функция ПредставлениеЧерновика(СвойстваДокумента) Экспорт
	ПредставлениеДокумента = СтрШаблон(НСтр("ru = '%1 № %2 от %3'"), Строка(СвойстваДокумента.ВидЧерновика),
		СвойстваДокумента.НомерДокумента, Формат(СвойстваДокумента.ДатаДокумента, "ДЛФ=D;"));
	
	ПредставлениеДокументаРП = ПолучитьСклоненияСтроки(ПредставлениеДокумента, "L=ru_RU", "CS=Genitive;")[0];
	Возврат СтрШаблон(НСтр("ru='Черновик %1'"), ПредставлениеДокументаРП);
КонецФункции

// Параметры:
//  СообщениеОбъект - ДокументОбъект.СообщениеЭДО
Процедура ПриЗагрузкеСообщенияУжеСозданногоДокумента(СообщениеОбъект) Экспорт
	
	Если СообщениеОбъект.ТипЭлементаРегламента = Перечисления.ТипыЭлементовРегламентаЭДО.УС_ОтзывЧерновика Тогда
		УстановитьПометкуОтзываЧерновикаДокумента(СообщениеОбъект.ЭлектронныйДокумент);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти // ЭлектронныеДокументыЭДО

#Область ИнтерфейсДокументовЭДО

// Параметры:
//  Черновик - ДокументСсылка.ЧерновикЭлектронногоДокументаЭДО
// 
// Возвращаемое значение:
//  ПеречислениеСсылка.ТипыДокументовЭДО
Функция ТипДокументаЧерновика(Черновик) Экспорт
	
	РеквизитыЧерновика = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Черновик, "ВидЧерновика.ТипДокумента");
	//@skip-check property-return-type
	Возврат РеквизитыЧерновика.ВидЧерновикаТипДокумента;
	
КонецФункции

// Параметры:
//  КомандаВидна - Булево - выходной, переопределяемый параметр
//  ТипДокументаЧерновика - ПеречислениеСсылка.СостоянияДокументовЭДО
Процедура ПриОпределенииВидимостиКомандыСозданияДокументаНаОснованииЧерновика(КомандаВидна,
	Знач ТипДокументаЧерновика) Экспорт

	КомандаВидна = Ложь;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЭлектронноеВзаимодействие.ОбменСГИСЭПД") Тогда
		МодульОбменСГИСЭПД = ОбщегоНазначения.ОбщийМодуль("ОбменСГИСЭПД");
		МодульОбменСГИСЭПД.ПриОпределенииВидимостиКомандыСозданияДокументаНаОснованииЧерновика(
			КомандаВидна, ТипДокументаЧерновика);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти // ИнтерфейсДокументовЭДО

#КонецОбласти // ДляВызоваИзДругихПодсистем

// Параметры:
//  Ссылка - ОпределяемыйТип.ОснованияЭлектронныхДокументовЭДО
// 
// Возвращаемое значение:
//  Булево
Функция ЭтоЧерновик(Ссылка) Экспорт
	
	ДопустимыеТипы = Новый Массив(2);
	ДопустимыеТипы[0] = Тип("ДокументСсылка.ЭлектронныйДокументВходящийЭДО");
	ДопустимыеТипы[1] = Тип("ДокументСсылка.ЭлектронныйДокументИсходящийЭДО");
	
	ТипСсылки = ТипЗнч(Ссылка);
	Если ДопустимыеТипы.Найти(ТипСсылки) = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ЭтоЧерновик = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "ЭтоЧерновик");
	Возврат ЭтоЧерновик;
	
КонецФункции

// Возвращаемое значение:
//  Строка - строка длиной 32 символа
Функция НовыйИдентификаторЧерновика() Экспорт
	
	Возврат СтрЗаменить(Строка(Новый УникальныйИдентификатор()), "-", "");
	
КонецФункции

// Параметры:
//  ЧерновикОснование - ДокументСсылка.ЧерновикЭлектронногоДокументаЭДО
//  КонтекстДиагностики - См. ОбработкаНеисправностейБЭД.НовыйКонтекстДиагностики
Процедура ПослеСозданияЭлектронногоДокументаПоЧерновику(ЧерновикОснование, КонтекстДиагностики) Экспорт
	
	УстановитьПометкуОбработан(ЧерновикОснование);
	ЗавершитьОбменДляДокументаИсточникаЧерновика(ЧерновикОснование, КонтекстДиагностики);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Параметры:
//  ЭлектронныйДокумент - ДокументСсылка.ЭлектронныйДокументВходящийЭДО
//                      - ДокументСсылка.ЭлектронныйДокументИсходящийЭДО
Процедура УстановитьПометкуОтзываЧерновикаДокумента(ЭлектронныйДокумент)

	Черновик = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭлектронныйДокумент, "ЧерновикОснование");
	
	Если Не ЗначениеЗаполнено(Черновик) Тогда
		Возврат;
	КонецЕсли;
	
	НачатьТранзакцию();
	
	Попытка
		
		ЧерновикОбъект = ОбщегоНазначенияБЭД.ОбъектПоСсылкеДляИзменения(Черновик);
		ЧерновикОбъект.Отозван = Истина;
		ЧерновикОбъект.Записать();
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		Операция = НСтр("ru = 'Установка пометки отзыва черновика электронного документа'");
		ПодробныйТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ТекстСообщения = НСтр("ru = 'Не удалось установить пометку отзыва черновика электронного документа.
			|Подробности в журнале регистрации'");
		ОбработкаНеисправностейБЭД.ОбработатьОшибку(Операция,
			ОбщегоНазначенияБЭДКлиентСервер.ПодсистемыБЭД().ОбменСКонтрагентами,
			ПодробныйТекстОшибки, ТекстСообщения, Черновик);
		
	КонецПопытки;

КонецПроцедуры

// Параметры:
//  Черновик - ДокументСсылка.ЧерновикЭлектронногоДокументаЭДО
Процедура УстановитьПометкуОбработан(Черновик)
	
	НачатьТранзакцию();
	
	Попытка
		
		ЧерновикОбъект = ОбщегоНазначенияБЭД.ОбъектПоСсылкеДляИзменения(Черновик);
		ЧерновикОбъект.Обработан = Истина;
		ЧерновикОбъект.Записать();
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		Операция = НСтр("ru = 'Установка признака обработки черновика электронного документа'");
		ПодробныйТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ТекстСообщения = НСтр("ru = 'Не удалось установить пометку обработки черновика электронного документа.
			|Подробности в журнале регистрации'");
		ОбработкаНеисправностейБЭД.ОбработатьОшибку(Операция,
			ОбщегоНазначенияБЭДКлиентСервер.ПодсистемыБЭД().ОбменСКонтрагентами,
			ПодробныйТекстОшибки, ТекстСообщения, Черновик);
		
	КонецПопытки;

КонецПроцедуры

// Параметры:
//  Черновик - ДокументСсылка.ЧерновикЭлектронногоДокументаЭДО
//  КонтекстДиагностики - См. ОбработкаНеисправностейБЭД.НовыйКонтекстДиагностики
Процедура ЗавершитьОбменДляДокументаИсточникаЧерновика(Черновик, КонтекстДиагностики)
	
	ДокументИсточник = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Черновик, "ЭлектронныйДокументИсточник");
	
	Если Не ЗначениеЗаполнено(ДокументИсточник) Тогда
		Возврат;
	КонецЕсли;
	
	Действие = Перечисления.ДействияПоЭДО.СоздатьДокументПоЧерновику;
	
	ЭлектронныеДокументыЭДОСлужебный.ОбновитьСостояниеДокументаПоДействию(ДокументИсточник, Действие,
		КонтекстДиагностики);
	
КонецПроцедуры

#КонецОбласти