#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// См. СтандартныеПодсистемыСервер.ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод
Процедура ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод(Методы) Экспорт
	
	Методы.Вставить("УстановитьКонстантуНеИспользованияЗарплатаИКадры");
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОбработчикиОбновленияИнформационнойБазы	

Процедура УстановитьКонстантуНеИспользованияЗарплатаИКадры() Экспорт
	
	ИспользоватьЗарплатаИКадры = Константы.ИспользоватьЗарплатаИКадрыWE.Получить();
	НеИспользоватьЗарплатаИКадры = Константы.НеИспользоватьЗарплатаИКадрыWE.Получить();
	Если ИспользоватьЗарплатаИКадры <> НеИспользоватьЗарплатаИКадры Тогда
		Возврат;                 
	КонецЕсли;
	
	Константы.НеИспользоватьЗарплатаИКадрыWE.Установить(Не ИспользоватьЗарплатаИКадры);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли