&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	                                                           
	ОбменСГИСЭПД.ПриСозданииНаСервереПодчиненнойФормы(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура Сохранить(Команда)  
	
	Отбор = Новый Структура;
	Отбор.Вставить("ИдентификаторСтрокиРодителя", ЭтотОбъект.ИдентификаторСтрокиРодителя);

	НайденныеСтроки = ТитулЭкспедитораОписаниеГрузаСвГосСист.НайтиСтроки(Отбор);

	УчГосСист = НайденныеСтроки.Количество() > 0;
		
	ОбменСГИСЭПДКлиент.СохранитьПараметрыПодчиненнойФормы(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбменСГИСЭПДКлиент.ПриОткрытииПодчиненнойФормы(ЭтотОбъект);
																		
КонецПроцедуры
			
&НаКлиенте
Функция ОписаниеРеквизитовФормы() Экспорт
	
	Возврат ОписаниеРеквизитовФормыСервер();
	
КонецФункции

&НаСервере
Функция ОписаниеРеквизитовФормыСервер()
	
	Возврат ОбменСГИСЭПД.ОписаниеРеквизитовФормы(ЭтаФорма);
		
КонецФункции


&НаКлиенте
Процедура ТитулЭкспедитораОписаниеГрузаСвГосСистПередУдалением(Элемент, Отказ)
	ТекущиеДанные = Элемент.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		ОбменСГИСЭПДКлиент.ОчиститьПодчиненныеТаблицы(ЭтотОбъект, Элемент.Имя, ТекущиеДанные.ИдентификаторСтроки, Отказ);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТитулЭкспедитораОписаниеГрузаСвГосСистПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	ОбменСГИСЭПДКлиент.ТаблицаПриНачалеРедактирования(Элемент, ЭтотОбъект, НоваяСтрока, Копирование); 	
КонецПроцедуры


&НаКлиенте
Процедура ТитулЗаказчикаОписаниеГрузаСвГосСистНаимГосСистПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ТитулЭкспедитораОписаниеГрузаСвГосСист.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда
		Если ТекущиеДанные.НаимГосСист <> "99" Тогда
			ТекущиеДанные.НаимГосСистИное = Неопределено;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

