#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("ИдентификаторКабинета", ИдентификаторКабинета); 
	Если ЗначениеЗаполнено(ИдентификаторКабинета) Тогда 
		Элементы.ИдентификаторКабинета.ТолькоПросмотр = Истина;
	КонецЕсли;
	
	ДанныеАвторизации     = ИнтеграцияСЯндексМаркетСервер.ДанныеАвторизацииПоИдентификаторуКабинета(ИдентификаторКабинета);
	Если ДанныеАвторизации <> Неопределено И ДанныеАвторизации.Свойство("apikey_token") Тогда
		НаименованиеКабинета = ДанныеАвторизации.business_name;
		КлючДоступа          = ДанныеАвторизации.apikey_token;
	КонецЕсли;   	
	
	Если ЗначениеЗаполнено(КлючДоступа) Тогда 
		Элементы.УдалитьПодключение.Видимость = Истина;
	Иначе 
		Элементы.УдалитьПодключение.Видимость = Ложь;
	КонецЕсли;     
	
	УстановитьВидимостьЭлементов();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;
	
	Если РезультатПодключения Тогда
		Оповестить("ЯндексМаркет_ПодключениеКСервису", ИдентификаторКабинета);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	Если ЗначениеЗаполнено(КлючДоступа) Тогда	
		ПолучитьПраваДоступаКлючаНаКлиенте();
	КонецЕсли;

КонецПроцедуры   

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Подключить(Команда) 
	
	Если ОбязательныеПоляЗаполнены() Тогда   
		Если ЕстьКлючДляКабинета() Тогда 	
			ОповещениеОЗавершении = Новый ОписаниеОповещения("ОбработатьВопросЗавершение", ЭтотОбъект);
			ПоказатьВопрос(ОповещениеОЗавершении, 
			НСтр("ru = 'Для указанного кабинета уже есть сохраненный ключ доступа. Заменить значение ключа?'"), 
			РежимДиалогаВопрос.ДаНет, 
			, 
			КодВозвратаДиалога.Нет, 
			НСтр("ru = 'Сохранение ключа доступа'"), 
			КодВозвратаДиалога.Нет);
		Иначе
			ОбработатьПодключение();	
		КонецЕсли;
	КонецЕсли; 
	
КонецПроцедуры   
	
&НаКлиенте
Процедура УдалитьПодключение(Команда)

	ОповещениеОЗавершении = Новый ОписаниеОповещения("УдалитьНастройкиЗавершение", ЭтотОбъект);
	ПоказатьВопрос(ОповещениеОЗавершении, 
		НСтр("ru = 'После удаления настроек авторизации обмен данными для всех магазинов текущего кабинета будет невозможен. 
				   |Очистить настройки?'"), 
		РежимДиалогаВопрос.ДаНет, 
		, 
		КодВозвратаДиалога.Нет, 
		НСтр("ru = 'Яндекс Маркет'"), 
		КодВозвратаДиалога.Нет);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьВидимостьЭлементов()
	
	Элементы.ГруппаПолучитьКод.Видимость = ЗначениеЗаполнено(Элементы.ДекорацияОписаниеПравДоступа.Заголовок) И ЗначениеЗаполнено(КлючДоступа);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьПраваДоступаКлючаНаКлиенте()
	
	ДлительнаяОперация = ПолучитьПраваДоступаКлюча();
	
	Элементы.ДекорацияОписаниеПравДоступа.Заголовок = "";
	УстановитьВидимостьЭлементов();
	
	ОжидатьЗавершениеДлительнойОперации(ДлительнаяОперация, "ПолучениеПраваДоступаКлючаЗавершение");  
	
КонецПроцедуры

&НаКлиенте
Функция ОбязательныеПоляЗаполнены()
	
	Результат = Истина;
	ОчиститьСообщения(); 
	
	Если Не ЗначениеЗаполнено(НаименованиеКабинета) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Не заполнено поле ""Наименование кабинета""'"));
		Результат = Ложь;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ИдентификаторКабинета) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Не заполнено поле ""Идентификатор кабинета""'"));
		Результат = Ложь;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(КлючДоступа) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Не заполнено поле ""Ключ доступа""'"));
		Результат = Ложь;
	КонецЕсли;
	
	Возврат Результат; 
	
КонецФункции

&НаКлиенте
Процедура ОбработатьВопросЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт 
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда 
		ОбработатьПодключение();	
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура ОбработатьПодключение()
	
	Результат     = ПодключитьНаСервере();
	Если Результат = Неопределено Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'При выполнении запроса к интернет-ресурсу возникли ошибки. Подробности см. в журнале регистрации.'"));
		Возврат;
	КонецЕсли;
	
	#Если ВебКлиент Или МобильныйКлиент Тогда
		ВыводитьСообщения = Истина;
	#Иначе
		ВыводитьСообщения = Не ПоказатьСтраницуСРезультатамиАвторизации(Результат);
	#КонецЕсли
	
	Если Не ВыводитьСообщения Тогда
		Возврат;
	КонецЕсли;
	
	Закрыть(ИдентификаторКабинета);
	
	ИдентификаторНазначения = Неопределено;
	Если ТипЗнч(ВладелецФормы) = Тип("ФормаКлиентскогоПриложения") Тогда
		ИдентификаторНазначения = ВладелецФормы.УникальныйИдентификатор;
	КонецЕсли;
	
	Если Результат Тогда
		ТекстСообщения = НСтр("ru = 'Авторизация пройдена.'");
	Иначе
		ТекстСообщения = НСтр("ru = 'Ошибка авторизации. Подробности см. в журнале регистрации.'");
	КонецЕсли;
	
	Сообщение = Новый СообщениеПользователю;
	Сообщение.ИдентификаторНазначения = ИдентификаторНазначения;
	Сообщение.Текст = ТекстСообщения;
	Сообщение.Сообщить();
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьНастройкиЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт 
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		УдалитьНастройкиНаСервере();
		Оповестить("ЯндексМаркет_УдалитьНастройкиПодключения", ИдентификаторКабинета);      
		Закрыть(ИдентификаторКабинета);
	КонецЕсли;
	
КонецПроцедуры  

&НаСервере
Процедура УдалитьНастройкиНаСервере()
	
	ИнтеграцияСЯндексМаркетСервер.УдалитьДанныеАвторизации(ИдентификаторКабинета);  
	УведомленияКлиента.ОтправитьУведомление("УдалениеКлюча",ИдентификаторКабинета); 
		
КонецПроцедуры

&НаСервере
Функция ЕстьКлючДляКабинета() 
	
	Результат = Ложь;
	ДанныеАвторизации = ИнтеграцияСЯндексМаркетСервер.ДанныеАвторизацииПоИдентификаторуКабинета(СокрЛП(ИдентификаторКабинета));   
	Если ДанныеАвторизации<>Неопределено И ДанныеАвторизации.Свойство("apikey_token") Тогда 
		Результат = Истина;
	КонецЕсли;
		
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ПодключитьНаСервере()
	
	Результат     = Неопределено;
		
	// сохранение ключа
	ДанныеАвторизации = Новый Структура;
	ДанныеАвторизации.Вставить("apikey_token",СокрЛП(КлючДоступа));
	ДанныеАвторизации.Вставить("business_name",СокрЛП(НаименованиеКабинета));
					
	// проверка вызова с новым ключом
	Попытка
		Сервер            = ИнтеграцияСЯндексМаркетСервер.СерверПартнерскогоAPI();
		АдресРесурса      = "";

		ИнтернетПрокси = Неопределено;
		Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.ПолучениеФайловИзИнтернета") Тогда
			МодульПолучениеФайловИзИнтернета = ОбщегоНазначения.ОбщийМодуль("ПолучениеФайловИзИнтернета");
			ИнтернетПрокси = МодульПолучениеФайловИзИнтернета.ПолучитьПрокси("https");
		КонецЕсли;
		СоединениеOpenSSL = ОбщегоНазначенияКлиентСервер.НовоеЗащищенноеСоединение();
		
		HTTPСоединение = Новый HTTPСоединение(Сервер,,,, ИнтернетПрокси,60, СоединениеOpenSSL);
		
		Заголовки = Новый Соответствие;
		Заголовки.Вставить("Content-Type",  "application/json");
		Заголовки.Вставить("Api-Key", ДанныеАвторизации.apikey_token);
		
		HTTPЗапрос = Новый HTTPЗапрос(АдресРесурса, Заголовки);
		
		HTTPОтвет    = HTTPСоединение.Получить(HTTPЗапрос);  
		КодСостояния = HTTPОтвет.КодСостояния;
		СтрокаОтвета = HTTPОтвет.ПолучитьТелоКакСтроку();
		РезультатОтвета    = ИнтеграцияСЯндексМаркетСервер.ИзJSON(СтрокаОтвета);
		
		Если КодСостояния <> 200 Тогда
			Если РезультатОтвета.Свойство("status") И РезультатОтвета.status = "ERROR" Тогда
				ОписаниеОшибок = ИнтеграцияСЯндексМаркетСервер.ТекстОшибки(РезультатОтвета.errors);
			Иначе
				ОписаниеОшибок = ""; 
			КонецЕсли;
			
			Результат = Ложь;
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Проверка авторизации не успешна %1: %2%3'", 
					ОбщегоНазначения.КодОсновногоЯзыка()), 
				Сервер + АдресРесурса, 
				ОписаниеОшибок,
				СтрокаОтвета);
				
			ЗаписьЖурналаРегистрации(ИнтеграцияСЯндексМаркетСервер.СобытиеЖурналаРегистрации(), 
				УровеньЖурналаРегистрации.Ошибка,,, 
				ТекстОшибки);
		Иначе
			Для Каждого ЭлементКоллекции Из РезультатОтвета.campaigns Цикл
				Если СокрЛП(Формат(ЭлементКоллекции.business.id, "ЧН=; ЧГ=0"))=СокрЛП(ИдентификаторКабинета) Тогда
					Результат = Истина;
				Иначе
					Результат = Ложь;
				КонецЕсли; 
				Прервать;
			КонецЦикла;
			
			Если Результат <> Истина Тогда
				ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Проверьте ключ доступа к методам кабинета ""%1"" и наличие зарегистрированных магазинов, затем повторите добавление кабинета.'"),
					ИдентификаторКабинета);
				ЗаписьЖурналаРегистрации(ИнтеграцияСЯндексМаркетСервер.СобытиеЖурналаРегистрации(), 
					УровеньЖурналаРегистрации.Ошибка, , ,
					ТекстОшибки);
			КонецЕсли;
		КонецЕсли;

	Исключение 
		Результат = Ложь;
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Отсутствует соединение с сервером %1 по причине: %2'", 
				ОбщегоНазначения.КодОсновногоЯзыка()),
			Сервер,
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ЗаписьЖурналаРегистрации(ИнтеграцияСЯндексМаркетСервер.СобытиеЖурналаРегистрации(), 
			УровеньЖурналаРегистрации.Ошибка,,, 
			ТекстОшибки);
	КонецПопытки; 
	
	Если Результат = Истина Тогда
		Результат = ИнтеграцияСЯндексМаркетСервер.УстановитьНастройкиАвторизации(ДанныеАвторизации,СокрЛП(ИдентификаторКабинета));	
	КонецЕсли; 
	
	РезультатПодключения = (Результат = Истина);

	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ПолучитьПраваДоступаКлюча()
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.ЗапуститьВФоне = Истина;
	
	ДлительнаяОперация = ДлительныеОперации.ВыполнитьФункцию(
		ПараметрыВыполнения,
		"ИнтеграцияСЯндексМаркетСервер.ПолучитьДанныеКлючаДоступа",
		КлючДоступа);
	
	Возврат ДлительнаяОперация;
	
КонецФункции

&НаКлиенте
Процедура ОжидатьЗавершениеДлительнойОперации(ДлительнаяОперация, ИмяПроцедурыЗавершения)

	Если ДлительнаяОперация <> Неопределено Тогда
		ОповещениеОЗавершении = Новый ОписаниеОповещения(ИмяПроцедурыЗавершения, ЭтотОбъект);
		
		ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
		ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
		
		ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПолучениеПраваДоступаКлючаЗавершение(РезультатЗадания, ДополнительныеПараметры = Неопределено) Экспорт

	Если ТипЗнч(РезультатЗадания) = Тип("Структура") Тогда
		Если РезультатЗадания.Статус = "Ошибка" Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(РезультатЗадания.ПодробноеПредставлениеОшибки);
		
		ИначеЕсли РезультатЗадания.Статус = "Выполнено" 
		 		  И РезультатЗадания.Свойство("АдресРезультата") Тогда
			Результат = ИнтеграцияСЯндексМаркетВызовСервера.ПолучитьРезультатВыполненияФоновогоЗадания(РезультатЗадания.АдресРезультата);

			Если Не ПустаяСтрока(Результат.КодОшибки) Тогда
				ОбщегоНазначенияКлиент.СообщитьПользователю(Результат.ОписаниеОшибки);
			Иначе
				Элементы.ДекорацияОписаниеПравДоступа.Заголовок = Результат.Описание; 
				УстановитьВидимостьЭлементов();
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПутьКФайлуМакета(АвторизацияУспешна)  
	
	ТекстСтраницы = ТекстСтраницы(АвторизацияУспешна);
	
	ПотокФайла = Новый ПотокВПамяти();
	ТекстовыйДокумент = Новый ТекстовыйДокумент;
	ТекстовыйДокумент.УстановитьТекст(ТекстСтраницы);
	ТекстовыйДокумент.Записать(ПотокФайла);
	
	Результат = ПоместитьВоВременноеХранилище(ПотокФайла.ЗакрытьИПолучитьДвоичныеДанные(), УникальныйИдентификатор);
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ПоказатьСтраницуСРезультатамиАвторизации(АвторизацияУспешна)
	
	Результат = Истина;
	Если АвторизацияУспешна Тогда
		ИмяФайла = "УспешнаяАвторизация.html";
	Иначе
		ИмяФайла = "НеУспешнаяАвторизация.html";
	КонецЕсли;

	Попытка	
		ПутьКФайлу = ПутьКФайлуМакета(АвторизацияУспешна);
		ФайловаяСистемаКлиент.ОткрытьФайл(ПутьКФайлу, , ИмяФайла);
		Закрыть(ИдентификаторКабинета);
	Исключение
		ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ДобавитьЗаписьВЖурналРегистрации(ПутьКФайлу, ТекстОшибки);
		Результат = Ложь;
	КонецПопытки;

	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Функция ТекстСтраницы(АвторизацияУспешна)
	
	Если АвторизацияУспешна Тогда
		ТекстСтраницы = ПолучитьОбщийМакет("УспешнаяАвторизация").ПолучитьТекст();
	Иначе
		ТекстСтраницы = ПолучитьОбщийМакет("НеУспешнаяАвторизация").ПолучитьТекст();
	КонецЕсли;
	
	ТекстСтраницы = СтрЗаменить(ТекстСтраницы, 
		НСтр("ru = 'Все права защищены'"),
		СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = '© ООО 1С-Софт, %1. Все права защищены'"),
			Формат(Год(ТекущаяДатаСеанса()), "ЧГ=0")));
	
	Возврат ТекстСтраницы;
	
КонецФункции

&НаСервереБезКонтекста
Процедура ДобавитьЗаписьВЖурналРегистрации(Знач ПутьКФайлу, Знач ТекстОшибки)
	
	ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Не удалось открыть приложение по адресу %1 по причине: %2'", 
			ОбщегоНазначения.КодОсновногоЯзыка()), 
		ПутьКФайлу, 
		ТекстОшибки);
	ЗаписьЖурналаРегистрации(ИнтеграцияСЯндексМаркетСервер.СобытиеЖурналаРегистрации(), 
		УровеньЖурналаРегистрации.Ошибка,,, 
		ТекстОшибки);
	
КонецПроцедуры

&НаКлиенте
Процедура КлючДоступаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ТекущийЭлемент = Элементы.Подключить;
	ТекущийРежимПароля = Элементы.КлючДоступа.РежимПароля;
	Элементы.КлючДоступа.РежимПароля = Не ТекущийРежимПароля;  
	Если Элементы.КлючДоступа.КартинкаКнопкиВыбора = БиблиотекаКартинок.СкрытьПароль Тогда
		Элементы.КлючДоступа.КартинкаКнопкиВыбора = БиблиотекаКартинок.ПоказатьПароль;
	Иначе   
		Элементы.КлючДоступа.КартинкаКнопкиВыбора = БиблиотекаКартинок.СкрытьПароль;
	КонецЕсли;
	ОбновитьОтображениеДанных(Элемент);
	ТекущийЭлемент = Элемент;
	
КонецПроцедуры

&НаКлиенте
Процедура КлючДоступаПриИзменении(Элемент)
	
	ПолучитьПраваДоступаКлючаНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеКабинетаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)  
	
	СтандартнаяОбработка = Ложь;
	ПолучитьИзБуфераОбменаНаименованиеКабинета();
	
КонецПроцедуры

&НаКлиенте
Процедура ИдентификаторКабинетаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка) 
	
	СтандартнаяОбработка = Ложь;   
	ПолучитьИзБуфераОбменаИдентификаторКабинета();
	
КонецПроцедуры

&НаКлиенте
Процедура КлючДоступаРасширеннаяПодсказкаОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)

	Если НавигационнаяСсылкаФорматированнойСтроки = "СсылкаВставитьИзБуфераОбмена" Тогда
		СтандартнаяОбработка = Ложь;	
		ПолучитьИзБуфераОбменаКлючДоступа(); 
	Иначе
		СтандартнаяОбработка = Истина;		
	КонецЕсли;

КонецПроцедуры  

&НаКлиенте
Асинх Процедура ПолучитьИзБуфераОбменаКлючДоступа() 
	
	КлючДоступа = Ждать СодержимоеБуфераОбмена();	

КонецПроцедуры 

&НаКлиенте
Асинх Процедура ПолучитьИзБуфераОбменаНаименованиеКабинета() 
	
	НаименованиеКабинета = Ждать СодержимоеБуфераОбмена();	

КонецПроцедуры

&НаКлиенте
Асинх Процедура ПолучитьИзБуфераОбменаИдентификаторКабинета() 
	
	ИдентификаторКабинета = Ждать СодержимоеБуфераОбмена();	

КонецПроцедуры

&НаКлиенте
Асинх Функция СодержимоеБуфераОбмена()
	
	Если СредстваБуфераОбмена.ИспользованиеДоступно() Тогда
		Если Ждать СредстваБуфераОбмена.СодержитДанныеАсинх(СтандартныйФорматДанныхБуфераОбмена.Текст) Тогда
			Возврат Ждать СредстваБуфераОбмена.ПолучитьДанныеАсинх(СтандартныйФорматДанныхБуфераОбмена.Текст);
		КонецЕсли;
	КонецЕсли;   
	
	Возврат Неопределено;
	
КонецФункции

#КонецОбласти