
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;

	УправлениеЭлементами();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОткрытьСпособыОбеспеченияПотребностей(Команда)
	
	ОткрытьФорму("Справочник.СпособыОбеспеченияПотребностей.ФормаСписка", , ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСхемыОбеспечения(Команда)
	
	ОткрытьФорму("Справочник.СхемыОбеспечения.ФормаСписка", , ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьЗоныДоставки(Команда)
	
	ОткрытьФорму("Справочник.ЗоныДоставки.ФормаСписка", , ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьТипыТранспортныхСредств(Команда)

	ОткрытьФорму("Справочник.ТипыТранспортныхСредств.ФормаСписка", , ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПравилаРазмещения(Команда)

	ОткрытьФорму("РегистрСведений.ПравилаРазмещенияТоваровВЯчейках.ФормаСписка", , ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьТипоразмерыЯчеек(Команда)

	ОткрытьФорму("Справочник.ТипоразмерыЯчеек.ФормаСписка", , ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПрогнозыРасходаУпаковок(Команда)
	
	ОткрытьФорму("РегистрСведений.ПрогнозыРасходаУпаковок.ФормаСписка", , ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПричиныБлокировкиТоваров(Команда)
	
	ОткрытьФорму("Справочник.ПричиныБлокировкиТоваров.ФормаСписка", , ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьКартыИсследованияТоваров(Команда)
	Возврат;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриВыполненииКоманды(Команда)
	
	СкладыКлиентЛокализация.ПриВыполненииКоманды_ПанельСправочниковСклад(Команда, ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УправлениеЭлементами()
	
	ПравоДоступаЗоныДоставки 				= ПравоДоступа("Просмотр", Метаданные.Справочники.ЗоныДоставки);
	ПравоДоступаТипыТранспортныхСредств 	= ПравоДоступа("Просмотр", Метаданные.Справочники.ТипыТранспортныхСредств);
	ПравоДоступаПравилаРазмещения 			= ПравоДоступа("Просмотр", Метаданные.РегистрыСведений.ПравилаРазмещенияТоваровВЯчейках);
	ПравоДоступаТипоразмерыЯчеек 			= ПравоДоступа("Просмотр", Метаданные.Справочники.ТипоразмерыЯчеек);
	ПравоДоступаПрогнозыРасходаУпаковок 	= ПравоДоступа("Просмотр", Метаданные.РегистрыСведений.ПрогнозыРасходаУпаковок);
	ПравоДоступаСпособыОбеспеченияПотребностей = ПравоДоступа("Изменение", Метаданные.Справочники.СпособыОбеспеченияПотребностей);
	ПравоДоступаСхемыОбеспечения               = ПравоДоступа("Изменение", Метаданные.РегистрыСведений.СхемыОбеспечения);
	ПравоДоступаПричиныБлокировкиТоваров = ПравоДоступа("Просмотр", Метаданные.Справочники.ПричиныБлокировкиТоваров);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"ОткрытьЗоныДоставки",
		"Видимость",
		ПравоДоступаЗоныДоставки);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"ОткрытьТипыТранспортныхСредств",
		"Видимость",
		ПравоДоступаТипыТранспортныхСредств);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"ОткрытьПравилаРазмещения",
		"Видимость",
		ПравоДоступаПравилаРазмещения);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"ОткрытьТипоразмерыЯчеек",
		"Видимость",
		ПравоДоступаТипоразмерыЯчеек);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"ОткрытьПрогнозыРасходаУпаковок",
		"Видимость",
		ПравоДоступаПрогнозыРасходаУпаковок);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"ОткрытьСпособыОбеспеченияПотребностей",
		"Видимость",
		ПравоДоступаСпособыОбеспеченияПотребностей);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"ОткрытьСхемыОбеспечения",
		"Видимость",
		ПравоДоступаСхемыОбеспечения);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"ОткрытьПричиныБлокировкиТоваров",
		"Видимость",
		ПравоДоступаПричиныБлокировкиТоваров);
		
	ЕстьДанныеДляОтображения =
		ПолучитьФункциональнуюОпцию("ИспользоватьУпаковкиНоменклатуры")
		ИЛИ ПолучитьФункциональнуюОпцию("ИспользоватьУправлениеДоставкой")
		ИЛИ ПолучитьФункциональнуюОпцию("ИспользоватьАдресноеХранение")
		ИЛИ ПолучитьФункциональнуюОпцию("ИспользоватьВнутреннееПотребление")
		ИЛИ ПолучитьФункциональнуюОпцию("ИспользоватьРасширенноеОбеспечениеПотребностей")
		ИЛИ ПравоДоступаЗоныДоставки
		ИЛИ ПравоДоступаТипыТранспортныхСредств
		ИЛИ ПравоДоступаПравилаРазмещения
		ИЛИ ПравоДоступаТипоразмерыЯчеек
		ИЛИ ПравоДоступаПрогнозыРасходаУпаковок
		ИЛИ ПравоДоступаПричиныБлокировкиТоваров;
		
	СкладыЛокализация.УправлениеЭлементами_ПанельСправочниковСклад(Элементы, ЕстьДанныеДляОтображения);
		
	Элементы.ГруппаНеУстановленыНеобходимыеНастройки.Видимость = НЕ ЕстьДанныеДляОтображения;
	
КонецПроцедуры

#КонецОбласти