
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2026, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТекстОшибки = "";
	
	ВыполнитьОбязательныеПроверкиПараметровФормы(ТекстОшибки);
	Если НЕ ПустаяСтрока(ТекстОшибки) Тогда
		
		ВызватьИсключение ТекстОшибки;
		
	КонецЕсли;
	
	Объект.ИспользоватьОбъектнуюЗагрузкуДанныхXDTO = ВключенаОбъектнаяЗагрузкаДанных(Параметры.УзелИнформационнойБазы);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Объект.ИспользоватьОбъектнуюЗагрузкуДанныхXDTO Тогда
		
		ВыключитьИспользованиеКомандыПерехода();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДекорацияДействияПриЗагрузкиОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если НавигационнаяСсылкаФорматированнойСтроки = "ОткрытьФормуДействияПриПолученияДанных" Тогда
		
		ДействияПриПолученииДанныхОбмена();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВключитьОбъектнуюЗагрузкуДанных(Команда)
	
	Если ВключитьОбъектнуюЗагрузкуДанныхНаСервере(Параметры.УзелИнформационнойБазы) Тогда
		
		ВыключитьИспользованиеКомандыПерехода();
		ДействияПриПолученииДанныхОбмена();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ВыключитьИспользованиеКомандыПерехода()
	
	Элементы.ФормаИзменитьСпособЗагрузкиДанных.Доступность = Ложь;
	Элементы.ДекорацияВключено.Видимость = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ДействияПриПолученииДанныхОбмена()
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеПодтвержденияДействийПриЗагрузкеДанных", ЭтотОбъект);
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("УзелПланаОбмена", Параметры.УзелИнформационнойБазы);
	ПараметрыОткрытия.Вставить("ТребующиеПодтверждения", Истина);
	
	ИмяФормыПодтверждения = "РегистрСведений.ДействияПриПолученииДанныхОбмена.Форма.НастройкаДействий";
	ОткрытьФорму(ИмяФормыПодтверждения, ПараметрыОткрытия, ЭтотОбъект,,,, ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеПодтвержденияДействийПриЗагрузкеДанных(Результат, ДополнительныеПараметры) Экспорт
	
	Если НужноПодтвердитьДействияПриПолученииДанныхОбмена(Параметры.УзелИнформационнойБазы) Тогда
		
		ТекстШаблона = НСтр("ru ='Для некоторых видов данных действия при загрузке остались не подтвержденными.
			|
			|Это можно сделать позже, из панели навигации формы синхронизации (узла обмена):
			|<%1>'",
			ОбщегоНазначенияКлиент.КодОсновногоЯзыка());
			
		ТекстПредупреждения = СтрШаблон(ТекстШаблона, Параметры.УзелИнформационнойБазы);
		ПоказатьПредупреждение(Неопределено, ТекстПредупреждения);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ВключенаОбъектнаяЗагрузкаДанных(Знач УзелИнформационнойБазы)
	
	Возврат РегистрыСведений.ОбщиеНастройкиУзловИнформационныхБаз.СпособОбъектнойКонвертацииXDTO(УзелИнформационнойБазы);
	
КонецФункции

&НаСервереБезКонтекста
Функция ВключитьОбъектнуюЗагрузкуДанныхНаСервере(Знач УзелИнформационнойБазы)
	
	РегистрыСведений.ОбщиеНастройкиУзловИнформационныхБаз.ИзменитьСпособОбъектнойКонвертацииXDTO(УзелИнформационнойБазы, Истина);
	
	Возврат ВключенаОбъектнаяЗагрузкаДанных(УзелИнформационнойБазы);
	
КонецФункции

&НаСервереБезКонтекста
Функция НужноПодтвердитьДействияПриПолученииДанныхОбмена(Знач УзелИнформационнойБазы)
	
	КоличествоОбъектов = РегистрыСведений.ДействияПриПолученииДанныхОбмена.КоличествоОбъектовЗначенияУстановленыАвтоматически(УзелИнформационнойБазы);
	Возврат (КоличествоОбъектов > 0);
	
КонецФункции

&НаСервере
Процедура ВыполнитьОбязательныеПроверкиПараметровФормы(ТекстОшибки)
	
	КодЯзыка = ОбщегоНазначения.КодОсновногоЯзыка();
	Если НЕ ЗначениеЗаполнено(Параметры.УзелИнформационнойБазы) Тогда
		
		ТекстОшибки = НСтр("ru = 'Эта форма не предназначена для непосредственного открытия.'", КодЯзыка);
		
	ИначеЕсли НЕ ОбменДаннымиСервер.ЭтоПланОбменаXDTO(Параметры.УзелИнформационнойБазы) Тогда
		
		ТекстОшибки = НСтр("ru = 'Переход на объектный способ загрузки данных доступен только обменов в формате EnterpriseData.'", КодЯзыка);
		
	Иначе
		
		ТекстОшибки = "";
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти