
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	ОбщегоНазначенияСобытияФормИСПереопределяемый.ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	ВерсияБПОСПоддержкойТСПИоТ = ОбщегоНазначенияИСМП.ВерсияБПОПоддерживаетПроверкуКМЧерезТСПИоТ();
	
	УстановитьВидимостьДоступность();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПодсказкаПриРаботеСБПОСПоддержкойТСПИоТОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если НавигационнаяСсылкаФорматированнойСтроки = "ИнтеграцияСИСМП" Тогда
		
		ОткрытьФорму("Обработка.ПанельАдминистрированияИСМП.Форма.НастройкиИСМП");
		
	ИначеЕсли НавигационнаяСсылкаФорматированнойСтроки = "СправочникТСПИоТ" Тогда
		
		ИмяФормыСписокТСПИоТ = "Справочник.ТСПИоТ.Форма.ФормаСписка";
		ОткрытьФорму(ИмяФормыСписокТСПИоТ);
		
	Иначе
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьВидимостьДоступность()
	
	Элементы.ПодсказкаПриРаботеСБПОСПоддержкойТСПИоТ.Видимость = ВерсияБПОСПоддержкойТСПИоТ;
	
	Если ВерсияБПОСПоддержкойТСПИоТ Тогда
		Элементы.Список.ТолькоПросмотр = ВерсияБПОСПоддержкойТСПИоТ;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
