&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	                                                           
	ОбменСГИСЭПД.ПриСозданииНаСервереПодчиненнойФормы(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	
	Элементы.ТитулЗаказчикаОписаниеГрузаМаркМаркировка.СписокВыбора.ЗагрузитьЗначения(ОбменСГИСЭПДКлиентСервер.ПолучитьМассивМаркировокГруза());
		
КонецПроцедуры

&НаКлиенте
Процедура Сохранить(Команда)
	
	Отбор = Новый Структура;
	Отбор.Вставить("ИдентификаторСтрокиРодителя", ЭтотОбъект.ИдентификаторСтрокиРодителя);

	НайденныеСтроки = ТитулЗаказчикаОписаниеГрузаМарк.НайтиСтроки(Отбор); 
	
	Если НайденныеСтроки.Количество() > 1 Тогда
		Для Каждого Строка Из НайденныеСтроки Цикл
			Если Строка.Маркировка = "Отсутствует" Тогда
				ТитулЗаказчикаОписаниеГрузаМарк.Удалить(Строка);	
			КонецЕсли;     
		КонецЦикла;
	КонецЕсли;

			
	ОбменСГИСЭПДКлиент.СохранитьПараметрыПодчиненнойФормы(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбменСГИСЭПДКлиент.ПриОткрытииПодчиненнойФормы(ЭтотОбъект);
																		
КонецПроцедуры
			
&НаКлиенте
Функция ОписаниеРеквизитовФормы() Экспорт
	
	Возврат ОписаниеРеквизитовФормыСервер();
	
КонецФункции

&НаСервере
Функция ОписаниеРеквизитовФормыСервер()
	
	Возврат ОбменСГИСЭПД.ОписаниеРеквизитовФормы(ЭтаФорма);
		
КонецФункции


&НаКлиенте
Процедура ТитулЗаказчикаОписаниеГрузаМаркПередУдалением(Элемент, Отказ)
	ТекущиеДанные = Элемент.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		ОбменСГИСЭПДКлиент.ОчиститьПодчиненныеТаблицы(ЭтотОбъект, Элемент.Имя, ТекущиеДанные.ИдентификаторСтроки, Отказ);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТитулЗаказчикаОписаниеГрузаМаркПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	ОбменСГИСЭПДКлиент.ТаблицаПриНачалеРедактирования(Элемент, ЭтотОбъект, НоваяСтрока, Копирование);
КонецПроцедуры

