#Область ПрограммныйИнтерфейс

// Функция выполняет проверку того, что данные нужно переностить в данный узел
//
// Параметры:
//  Данные - Произвольный - Объект или набор записей, который нужно проверить.
//    То, что переносится везде, не обрабатывается.
//  УзелОбмена - ПланОбменаСсылка - узел плана обмена, куда осуществляется перенос.
//
// Возвращаемое значение:
//  Булево - Истина - необходимо выполнять перенос, 
//    Ложь - перенос выполнять не нужно.
//
Функция НуженПереносДанных(Данные, УзелОбмена) Экспорт
	
	Перенос = Истина;

#Если НЕ МобильныйАвтономныйСервер Тогда

	Если ТипЗнч(Данные) = Тип("РегистрСведенийНаборЗаписей.БлокировкиСкладскихЯчеек") Тогда
		// Проверяем, что регистратор блокировки — это использующиеся документы
		Если ТипЗнч(Данные.Отбор.Регистратор.Значение) <> Тип("ДокументСсылка.УстановкаБлокировокЯчеек")
			И ТипЗнч(Данные.Отбор.Регистратор.Значение) <> Тип("ДокументСсылка.ПересчетТоваров") Тогда
			Перенос = Ложь;
		КонецЕсли;
	КонецЕсли;
	
#КонецЕсли
 	
	Возврат Перенос;
	
КонецФункции

// Процедура записывает данные в формат XML.
// Процедура анализирует переданный объект данных и на основе этого анализа
// записывает его определенным образом в формат XML.
//
// Параметры:
//  ЗаписьXML - ЗаписьXML - объект, записывающий XML данные.
//  Данные - Произвольный - данные, подлежащие записи в формат XML.
//
Процедура ЗаписатьДанные(ЗаписьXML, Данные) Экспорт
	
	// В данном случае, нет данных, которые требуют нестандартной обработки
	// Записываем данные с помощью стандартного метода
	
	Если ТипЗнч(Данные) = Тип("СправочникОбъект.УпаковкиЕдиницыИзмерения") Тогда
		УпаковкиЕдиницыИзмеренияВXML(ЗаписьXML, Данные);
	ИначеЕсли ТипЗнч(Данные) = Тип("СправочникОбъект.НаборыУпаковок") Тогда
		НаборыУпаковокВXML(ЗаписьXML, Данные);
	ИначеЕсли ТипЗнч(Данные) = Тип("СправочникОбъект.Назначения") Тогда
		НазначенияВXML(ЗаписьXML, Данные);
	ИначеЕсли ТипЗнч(Данные) = Тип("СправочникОбъект.ИдентификаторыОбъектовМетаданных") Тогда
		ИдентификаторыОбъектовМетаданныхВXML(ЗаписьXML, Данные);
	ИначеЕсли ТипЗнч(Данные) = Тип("СправочникОбъект.Номенклатура") Тогда
		НоменклатураВXML(ЗаписьXML, Данные);
	ИначеЕсли ТипЗнч(Данные) = Тип("СправочникОбъект.Пользователи") Тогда
		ПользователиВXML(ЗаписьXML, Данные);
	ИначеЕсли ТипЗнч(Данные) = Тип("СправочникОбъект.Склады") Тогда
		СкладыВXML(ЗаписьXML, Данные);
	ИначеЕсли ТипЗнч(Данные) = Тип("СправочникОбъект.СкладскиеПомещения") Тогда
		СкладскиеПомещенияВXML(ЗаписьXML, Данные);
	ИначеЕсли ТипЗнч(Данные) = Тип("СправочникОбъект.СкладскиеЯчейки") Тогда
		СкладскиеЯчейкиВXML(ЗаписьXML, Данные);
	ИначеЕсли ТипЗнч(Данные) = Тип("СправочникОбъект.ХарактеристикиНоменклатуры") Тогда
		ХарактеристикиНоменклатурыВXML(ЗаписьXML, Данные);
	ИначеЕсли ТипЗнч(Данные) = Тип("СправочникОбъект.ВидыНоменклатуры") Тогда
		ВидыНоменклатурыВXML(ЗаписьXML, Данные);
	ИначеЕсли ТипЗнч(Данные) = Тип("СправочникОбъект.ВариантыОтчетов") Тогда
		ВариантыОтчетовВXML(ЗаписьXML, Данные);
	ИначеЕсли ТипЗнч(Данные) = Тип("СправочникОбъект.ДашбордыМЦП") Тогда
		ДашбордыМЦПВXML(ЗаписьXML, Данные); 
	ИначеЕсли ТипЗнч(Данные) = Тип("ДокументОбъект.УстановкаБлокировокЯчеек") Тогда
		УстановкаБлокировокЯчеекВXML(ЗаписьXML, Данные);  
	ИначеЕсли ТипЗнч(Данные) = Тип("ДокументОбъект.ПересчетТоваров") Тогда	
		ПересчетТоваровВXML(ЗаписьXML, Данные);   
	ИначеЕсли ТипЗнч(Данные) = Тип("ДокументОбъект.ПриходныйОрдерНаТовары") Тогда	
		ПриходныйОрдерВXML(ЗаписьXML, Данные);
	ИначеЕсли ТипЗнч(Данные) = Тип("ДокументОбъект.РасходныйОрдерНаТовары") Тогда	
		РасходныйОрдерВXML(ЗаписьXML, Данные);  
	ИначеЕсли ТипЗнч(Данные) = Тип("ДокументОбъект.ОтборРазмещениеТоваров") Тогда	
		ОтборРазмещениеТоваровВXML(ЗаписьXML, Данные);	
	ИначеЕсли ТипЗнч(Данные) = Тип("РегистрСведенийНаборЗаписей.ШтрихкодыНоменклатуры") Тогда
		ШтрихкодыНоменклатурыВXML(ЗаписьXML, Данные);
	ИначеЕсли ТипЗнч(Данные) = Тип("РегистрСведенийНаборЗаписей.РазмещениеНоменклатурыПоСкладскимЯчейкам") Тогда
		РазмещениеНоменклатурыПоСкладскимЯчейкамВXML(ЗаписьXML, Данные);
	ИначеЕсли ТипЗнч(Данные) = Тип("РегистрСведенийНаборЗаписей.СнимкиОтчетов") Тогда
		СнимкиОтчетовВXML(ЗаписьXML, Данные); 
	ИначеЕсли ТипЗнч(Данные) = Тип("РегистрСведенийНаборЗаписей.БлокировкиСкладскихЯчеек") Тогда
		БлокировкиСкладскихЯчеекВXML(ЗаписьXML, Данные);
	ИначеЕсли ТипЗнч(Данные) = Тип("ДокументОбъект.ЗаказПоставщику") Тогда	
		ЗаказПоставщикуВXML(ЗаписьXML, Данные);
	ИначеЕсли ТипЗнч(Данные) = Тип("СправочникОбъект.СерииНоменклатуры") Тогда
		СерииНоменклатурыВXML(ЗаписьXML, Данные);
	ИначеЕсли ТипЗнч(Данные) = Тип("СправочникОбъект.ПолитикиУчетаСерий") Тогда
		ПолитикиУчетаСерийВXML(ЗаписьXML, Данные);
	ИначеЕсли ТипЗнч(Данные) = Тип("РегистрСведенийНаборЗаписей.НастройкиАдресныхСкладов") Тогда
		НастройкиАдресныхСкладовВXML(ЗаписьXML, Данные);
	ИначеЕсли ТипЗнч(Данные) = Тип("СправочникОбъект.Партнеры") Тогда
		ПартнерыВXML(ЗаписьXML, Данные);
	ИначеЕсли ТипЗнч(Данные) = Тип("СправочникОбъект.ВариантыКомплектацииНоменклатуры") Тогда
		ВариантыКомплектацииНоменклатурыВXML(ЗаписьXML, Данные);
	ИначеЕсли ТипЗнч(Данные) = Тип("ДокументОбъект.КорректировкаПоОрдеруНаТовары") Тогда
		КорректировкаПоОрдеруВXML(ЗаписьXML, Данные);
	Иначе
		ТипЗначения = СтрРазделить(ТипЗнч(Данные), " ")[0];
		Если ТипЗначения = "Справочник" Тогда
			ПрочиеСправочникиВXML(ЗаписьXML, Данные);
		ИначеЕсли ТипЗначения = "Документ" Тогда
			ПрочиеДокументыВXML(ЗаписьXML, Данные);
		ИначеЕсли ТипЗначения = "Константа" Тогда
			КонстантыВXML(ЗаписьXML, Данные);
		КонецЕсли;
	КонецЕсли;
	
#Если МобильныйАвтономныйСервер Тогда
	Константы.ОтправленоЗаписей.Установить(Константы.ОтправленоЗаписей.Получить() + 1);
#КонецЕсли
	
КонецПроцедуры

// Функция читает данные из формат XML.
// Анализирует переданный объект ЧтениеXML и на основе этого анализа
// читает из него данные определенным образом.
//
// Параметры:
//  ЧтениеXML - ЧтениеXML - Объект, читающий XML-данные.
//
// Возвращаемое значение:
//  Произвольный - значение, прочитанное из объекта ЧтениеXML.
//
Функция ПрочитатьДанные(ЧтениеXML) Экспорт
	
	Если ЧтениеXML.Имя = "CatalogObject.УпаковкиЕдиницыИзмерения" Тогда
		Данные = УпаковкиЕдиницыИзмеренияИзXML(ЧтениеXML);
	ИначеЕсли ЧтениеXML.Имя = "CatalogObject.НаборыУпаковок" Тогда
		Данные = НаборыУпаковокИзXML(ЧтениеXML);
	ИначеЕсли ЧтениеXML.Имя = "CatalogObject.Назначения" Тогда
		Данные = НазначенияИзXML(ЧтениеXML);
	ИначеЕсли ЧтениеXML.Имя = "CatalogObject.ИдентификаторыОбъектовМетаданных" Тогда
		Данные = ИдентификаторыОбъектовМетаданныхИзXML(ЧтениеXML);
	ИначеЕсли ЧтениеXML.Имя = "CatalogObject.Номенклатура" Тогда
		Данные = НоменклатураИзXML(ЧтениеXML);
	ИначеЕсли ЧтениеXML.Имя = "CatalogObject.Пользователи" Тогда
		Данные = ПользователиИзXML(ЧтениеXML);
	ИначеЕсли ЧтениеXML.Имя = "CatalogObject.Склады" Тогда
		Данные = СкладыИзXML(ЧтениеXML);
	ИначеЕсли ЧтениеXML.Имя = "CatalogObject.СкладскиеПомещения" Тогда
		Данные = СкладскиеПомещенияИзXML(ЧтениеXML);
	ИначеЕсли ЧтениеXML.Имя = "CatalogObject.СкладскиеЯчейки" Тогда
		Данные = СкладскиеЯчейкиИзXML(ЧтениеXML);
	ИначеЕсли ЧтениеXML.Имя = "CatalogObject.ХарактеристикиНоменклатуры" Тогда
		Данные = ХарактеристикиНоменклатурыИзXML(ЧтениеXML);
	ИначеЕсли ЧтениеXML.Имя = "CatalogObject.ВидыНоменклатуры" Тогда
		Данные = ВидыНоменклатурыИзXML(ЧтениеXML);
	ИначеЕсли ЧтениеXML.Имя = "CatalogObject.ВариантыОтчетов" Тогда
		Данные = ВариантыОтчетовИзXML(ЧтениеXML);
	ИначеЕсли ЧтениеXML.Имя = "CatalogObject.ДашбордыМЦП" Тогда
		Данные = ДашбордыМЦПИзXML(ЧтениеXML); 
	ИначеЕсли ЧтениеXML.Имя =  "DocumentObject.УстановкаБлокировокЯчеек" Тогда	
		Данные = УстановкаБлокировокЯчеекИзXML(ЧтениеXML);
	ИначеЕсли ЧтениеXML.Имя =  "DocumentObject.ПересчетТоваров" Тогда	
		Данные = ПересчетТоваровИзXML(ЧтениеXML);
	ИначеЕсли ЧтениеXML.Имя =  "DocumentObject.ПриходныйОрдерНаТовары" Тогда	
		Данные = ПриходныйОрдерИзXML(ЧтениеXML); 
	ИначеЕсли ЧтениеXML.Имя =  "DocumentObject.РасходныйОрдерНаТовары" Тогда	
		Данные = РасходныйОрдерИзXML(ЧтениеXML);   
	ИначеЕсли ЧтениеXML.Имя = "DocumentObject.ОтборРазмещениеТоваров" Тогда	
		Данные = ОтборРазмещениеТоваровИзXML(ЧтениеXML);
	ИначеЕсли ЧтениеXML.Имя = "InformationRegisterRecordSet.ШтрихкодыНоменклатуры" Тогда
		Данные = ШтрихкодыНоменклатурыИзXML(ЧтениеXML);
	ИначеЕсли ЧтениеXML.Имя = "InformationRegisterRecordSet.РазмещениеНоменклатурыПоСкладскимЯчейкам" Тогда
		Данные = РазмещениеНоменклатурыПоСкладскимЯчейкамИзXML(ЧтениеXML);
	ИначеЕсли ЧтениеXML.Имя = "InformationRegisterRecordSet.СнимкиОтчетов" Тогда
		Данные = СнимкиОтчетовИзXML(ЧтениеXML);
	ИначеЕсли ЧтениеXML.Имя = "InformationRegisterRecordSet.БлокировкиСкладскихЯчеек" Тогда
		Данные = БлокировкиСкладскихЯчеекИзXML(ЧтениеXML);
	ИначеЕсли ЧтениеXML.Имя =  "DocumentObject.ЗаказПоставщику" Тогда	
		Данные = ЗаказПоставщикуИзXML(ЧтениеXML);
	ИначеЕсли ЧтениеXML.Имя = "CatalogObject.СерииНоменклатуры" Тогда
		Данные = СерииНоменклатурыИзXML(ЧтениеXML);
	ИначеЕсли ЧтениеXML.Имя = "CatalogObject.ПолитикиУчетаСерий" Тогда
		Данные = ПолитикиУчетаСерийИзXML(ЧтениеXML);
	ИначеЕсли ЧтениеXML.Имя = "InformationRegisterRecordSet.НастройкиАдресныхСкладов" Тогда
		Данные = НастройкиАдресныхСкладовИзXML(ЧтениеXML);
	ИначеЕсли ЧтениеXML.Имя = "CatalogObject.Партнеры" Тогда
		Данные = ПартнерыИзXML(ЧтениеXML);
	ИначеЕсли ЧтениеXML.Имя = "CatalogObject.ВариантыКомплектацииНоменклатуры" Тогда
		Данные = ВариантыКомплектацииНоменклатурыИзXML(ЧтениеXML);
	ИначеЕсли ЧтениеXML.Имя =  "DocumentObject.КорректировкаПоОрдеруНаТовары" Тогда	
		Данные = КорректировкаПоОрдеруИзXML(ЧтениеXML);
	Иначе
		ИмяОбъекта = СтрРазделить(ЧтениеXML.Имя, ".")[0];
		Если ИмяОбъекта = "DocumentObject" Тогда
			Данные = ПрочиеДокументыИзXML(ЧтениеXML);
		ИначеЕсли ИмяОбъекта = "CatalogObject" Тогда
			Данные = ПрочиеСправочникиИзXML(ЧтениеXML);
		ИначеЕсли ИмяОбъекта = "ConstantValueManager" Тогда
			Данные = КонстантыИзXML(ЧтениеXML);
		КонецЕсли;
	КонецЕсли;
	
#Если НЕ МобильныйАвтономныйСервер Тогда
#Иначе
	Константы.ПринятоЗаписей.Установить(Константы.ПринятоЗаписей.Получить() + 1);
#КонецЕсли
	
	Возврат Данные;
	
КонецФункции

// Процедура регистрирует изменения, для всех данных, входящих в состав плана обмена
// Параметры:
//  УзелОбмена - ПланОбменаСсылка - Узел плана обмена, для которого регистрируются изменения.
Процедура ЗарегистрироватьИзмененияДанных(УзелОбмена) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СнимкиОтчетов.Вариант КАК Вариант
	|ИЗ
	|	РегистрСведений.СнимкиОтчетов КАК СнимкиОтчетов
	|ГДЕ
	|	СнимкиОтчетов.Вариант ССЫЛКА Справочник.ВариантыОтчетов";
	
	СоставПланаОбмена = УзелОбмена.Метаданные().Состав;
	Для Каждого ЭлементСоставаПланаОбмена Из СоставПланаОбмена Цикл
		
		Если ЭлементСоставаПланаОбмена.Метаданные = Метаданные.Справочники.ВариантыОтчетов Тогда
			МассивСсылок = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Вариант");
			Если МассивСсылок.Количество() > 0 Тогда
				ПланыОбмена.ЗарегистрироватьИзменения(УзелОбмена, МассивСсылок);
			КонецЕсли;
		Иначе
			ПланыОбмена.ЗарегистрироватьИзменения(УзелОбмена,ЭлементСоставаПланаОбмена.Метаданные);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗарегистрироватьИзмененияДляАвтономногоРежимаПриЗаписи(Источник, Отказ) Экспорт
	
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ТипЗнч(Источник) = Тип("СправочникОбъект.ВариантыОтчетов") Тогда
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Вариант", Источник.Ссылка);
		Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	СнимкиОтчетов.Вариант КАК Вариант
		|ИЗ
		|	РегистрСведений.СнимкиОтчетов КАК СнимкиОтчетов
		|ГДЕ
		|	СнимкиОтчетов.Вариант = &Вариант";
		Если Запрос.Выполнить().Пустой() Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	УзлыДляРегистрации = УзлыДляРегистрации();
	
	ЗарегистрироватьИзмененияДляУзловОбмена(УзлыДляРегистрации, Источник);
	
КонецПроцедуры

// Регистрирует объекты в узлах обмена мобильного приложения.
//
// Параметры:
//  МассивУзлов - Массив из ПланОбменаСсылка - Содержит узлы для регистрации изменений объекта;
//  Объект - СправочникОбъект, РегистрСведенийНаборЗаписей - объект для которого регистрируются изменения.
//
Процедура ЗарегистрироватьИзмененияДляУзловОбмена(МассивУзлов, Объект) Экспорт
	
	Если МассивУзлов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	ПланыОбмена.ЗарегистрироватьИзменения(МассивУзлов, Объект.Ссылка);
	
КонецПроцедуры

Процедура ЗарегистрироватьИзмененияДляАвтономногоРежимаРегистрыПриЗаписи(Источник, Отказ, Замещение) Экспорт
	
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	УзлыДляРегистрации = УзлыДляРегистрации();
	
	ЗарегистрироватьИзмененияДляУзловОбменаРегистры(УзлыДляРегистрации, Источник);
	
КонецПроцедуры

// Регистрирует объекты в узлах обмена мобильного приложения.
//
// Параметры:
//  МассивУзлов - Массив из ПланОбменаСсылка - содержит узлы для регистрации изменений объекта;
//  НаборЗаписей - РегистрСведенийНаборЗаписей - объект для которого регистрируются изменения.
//
Процедура ЗарегистрироватьИзмененияДляУзловОбменаРегистры(МассивУзлов, НаборЗаписей) Экспорт
	
	Если МассивУзлов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	ЕстьНезаполненныйОтбор = Ложь;
	Для Каждого ПолеОтбора Из НаборЗаписей.Отбор Цикл
		Если Не ПолеОтбора.Использование Тогда
			Если НаборЗаписей.Количество() Тогда
				ЕстьНезаполненныйОтбор = Истина;
				Прервать;
			Иначе
				Возврат;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Если ЕстьНезаполненныйОтбор Тогда
		Если ТипЗнч(НаборЗаписей) = Тип("РегистрСведенийНаборЗаписей.ШтрихкодыНоменклатуры") Тогда
			
			Для Каждого Запись Из НаборЗаписей Цикл
				НаборЗаписейШтрихкоды = РегистрыСведений.ШтрихкодыНоменклатуры.СоздатьНаборЗаписей();
				
				НаборЗаписейШтрихкоды.Отбор.Штрихкод.Установить(Запись.Штрихкод, Истина);
				НаборЗаписейШтрихкоды.Отбор.Номенклатура.Установить(Запись.Номенклатура, Истина);
				НаборЗаписейШтрихкоды.Отбор.Характеристика.Установить(Запись.Характеристика, Истина);
				НаборЗаписейШтрихкоды.Отбор.Серия.Установить(Запись.Серия, Истина);
				НаборЗаписейШтрихкоды.Отбор.Упаковка.Установить(Запись.Упаковка, Истина);
				
				НоваяЗапись = НаборЗаписейШтрихкоды.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяЗапись, Запись);
				
				ПланыОбмена.ЗарегистрироватьИзменения(МассивУзлов, НаборЗаписейШтрихкоды);
			КонецЦикла;
			
		ИначеЕсли ТипЗнч(НаборЗаписей) = Тип("РегистрСведенийНаборЗаписей.РазмещениеНоменклатурыПоСкладскимЯчейкам") Тогда
			
			Для Каждого Запись Из НаборЗаписей Цикл
				НаборЗаписейРазмещение = РегистрыСведений.РазмещениеНоменклатурыПоСкладскимЯчейкам.СоздатьНаборЗаписей();
				
				НаборЗаписейРазмещение.Отбор.Номенклатура.Установить(Запись.Номенклатура, Истина);
				НаборЗаписейРазмещение.Отбор.Склад.Установить(Запись.Склад, Истина);
				НаборЗаписейРазмещение.Отбор.Помещение.Установить(Запись.Помещение, Истина);
				НаборЗаписейРазмещение.Отбор.Ячейка.Установить(Запись.Ячейка, Истина);
				
				НоваяЗапись = НаборЗаписейРазмещение.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяЗапись, Запись);
				
				ПланыОбмена.ЗарегистрироватьИзменения(МассивУзлов, НаборЗаписейРазмещение);
			КонецЦикла;
			
		ИначеЕсли ТипЗнч(НаборЗаписей) = Тип("РегистрСведенийНаборЗаписей.СнимкиОтчетов") Тогда
			
			Для Каждого Запись Из НаборЗаписей Цикл
				НаборЗаписейСнимки = РегистрыСведений.СнимкиОтчетов.СоздатьНаборЗаписей();
				
				НаборЗаписейСнимки.Отбор.Пользователь.Установить(Запись.Пользователь, Истина);
				НаборЗаписейСнимки.Отбор.Отчет.Установить(Запись.Отчет, Истина);
				НаборЗаписейСнимки.Отбор.Вариант.Установить(Запись.Вариант, Истина);
				НаборЗаписейСнимки.Отбор.ХешПользовательскойНастройки.Установить(Запись.ХешПользовательскойНастройки, Истина);
				
				НоваяЗапись = НаборЗаписейСнимки.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяЗапись, Запись);
				
				ПланыОбмена.ЗарегистрироватьИзменения(МассивУзлов, НаборЗаписейСнимки);
			КонецЦикла;
			
		ИначеЕсли ТипЗнч(НаборЗаписей) = Тип("РегистрСведенийНаборЗаписей.БлокировкиСкладскихЯчеек") Тогда
			
			Для Каждого Запись Из НаборЗаписей Цикл
				НаборЗаписейБлокировки = РегистрыСведений.БлокировкиСкладскихЯчеек.СоздатьНаборЗаписей();
				
				НаборЗаписейБлокировки.Отбор.Ячейка.Установить(Запись.Ячейка, Истина);
				
				НоваяЗапись = НаборЗаписейБлокировки.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяЗапись, Запись);
				
				ПланыОбмена.ЗарегистрироватьИзменения(МассивУзлов, НаборЗаписейБлокировки);
			КонецЦикла;
			
		ИначеЕсли ТипЗнч(НаборЗаписей) = Тип("РегистрСведенийНаборЗаписей.НастройкиАдресныхСкладов") Тогда
			
			Для Каждого Запись Из НаборЗаписей Цикл
				НаборЗаписейНастройки = РегистрыСведений.НастройкиАдресныхСкладов.СоздатьНаборЗаписей();
				
				НаборЗаписейНастройки.Отбор.Склад.Установить(Запись.Склад, Истина);
				НаборЗаписейНастройки.Отбор.Помещение.Установить(Запись.Помещение, Истина);
				
				НоваяЗапись = НаборЗаписейНастройки.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяЗапись, Запись);
				
				ПланыОбмена.ЗарегистрироватьИзменения(МассивУзлов, НаборЗаписейНастройки);
			КонецЦикла;
			
		КонецЕсли;
	Иначе
		ПланыОбмена.ЗарегистрироватьИзменения(МассивУзлов, НаборЗаписей);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ВыгрузкаДанных

Процедура КонстантыВXML(ЗаписьXML, Данные)
	
	ИмяОбъекта = СтрРазделить(Данные.Метаданные().ПолноеИмя(), ".");
	ЗаписьXML.ЗаписатьНачалоЭлемента("ConstantValueManager." + ИмяОбъекта[1]);
	
	Тип = Строка(ТипЗнч(Данные.Значение));
	Если Тип = "Число" Или Тип = "Строка" Или Тип = "Дата" Или Тип = "Булево" Тогда	
		ЗаписьXML.ЗаписатьНачалоЭлемента("ЗначениеКонстанты");
		ЗаписьXML.ЗаписатьТекст(Строка(Данные.Значение));
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("ТипЗначения");
		ЗаписьXML.ЗаписатьТекст(Тип);
		ЗаписьXML.ЗаписатьКонецЭлемента();
	Иначе
		Тип = Данные.Значение.Метаданные().ПолноеИмя();
		
		Если СтрРазделить(Тип, ".")[0] = "Перечисление" Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("ЗначениеКонстанты");
			ЗаписьXML.ЗаписатьТекст(XMLСтрока(Данные.Значение));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		Иначе
			ЗаписьXML.ЗаписатьНачалоЭлемента("ЗначениеКонстанты");
			ЗаписьXML.ЗаписатьТекст(Строка(Данные.Значение.УникальныйИдентификатор()));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕсли;
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("ТипЗначения");
		ЗаписьXML.ЗаписатьТекст(Тип);
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЕсли;
	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
КонецПроцедуры

#Область Справочники

Процедура ПрочиеСправочникиВXML(ЗаписьXML, Данные)
	
	ИмяОбъекта = СтрРазделить(Данные.Ссылка.Метаданные().ПолноеИмя(), ".");
	ЗаписьXML.ЗаписатьНачалоЭлемента("CatalogObject." + ИмяОбъекта[1]);
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Ссылка");
	ЗаписьXML.ЗаписатьТекст(Строка(Данные.Ссылка.УникальныйИдентификатор()));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("ПометкаУдаления");
	ЗаписьXML.ЗаписатьТекст(Строка(Данные.ПометкаУдаления));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	Если ЗначениеЗаполнено(Данные.Наименование) Тогда
		ЗаписьXML.ЗаписатьНачалоЭлемента("Наименование");
		ЗаписьXML.ЗаписатьТекст(Данные.Наименование);
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЕсли;
	
	Если Метаданные.ОпределяемыеТипы.РаспоряжениеНаПоступление.Тип.СодержитТип(ТипЗнч(Данные.Ссылка)) Тогда
		ЗаписьXML.ЗаписатьНачалоЭлемента("Организация");
		ЗаписьXML.ЗаписатьТекст(Строка(Данные.Организация.УникальныйИдентификатор()));
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЕсли;
	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
КонецПроцедуры

Процедура НоменклатураВXML(ЗаписьXML, Данные)
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("CatalogObject.Номенклатура");
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Ссылка");
	ЗаписьXML.ЗаписатьТекст(Строка(Данные.Ссылка.УникальныйИдентификатор()));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	Если ЗначениеЗаполнено(Данные.Родитель) Тогда
		ЗаписьXML.ЗаписатьНачалоЭлемента("Родитель");
		ЗаписьXML.ЗаписатьТекст(Строка(Данные.Родитель.УникальныйИдентификатор()));
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЕсли;
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Наименование");
	ЗаписьXML.ЗаписатьТекст(Данные.Наименование);
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("ПометкаУдаления");
	ЗаписьXML.ЗаписатьТекст(Строка(Данные.ПометкаУдаления));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("ЭтоГруппа");
	ЗаписьXML.ЗаписатьТекст(Строка(Данные.ЭтоГруппа));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	Если НЕ Данные.ЭтоГруппа Тогда
		Если ЗначениеЗаполнено(Данные.Артикул) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("Артикул");
			ЗаписьXML.ЗаписатьТекст(Данные.Артикул);
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Данные.НаименованиеПолное) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("НаименованиеПолное");
			ЗаписьXML.ЗаписатьТекст(Данные.НаименованиеПолное);
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Данные.КодДляПоиска) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("КодДляПоиска");
			ЗаписьXML.ЗаписатьТекст(Данные.КодДляПоиска);
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Данные.КодПоКВПД) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("КодПоКВПД");
			ЗаписьXML.ЗаписатьТекст(Данные.КодПоКВПД);
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕсли;
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("ЕдиницаИзмерения");
		ЗаписьXML.ЗаписатьТекст(Строка(Данные.ЕдиницаИзмерения.УникальныйИдентификатор()));
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("ВидНоменклатуры");
		ЗаписьXML.ЗаписатьТекст(Строка(Данные.ВидНоменклатуры.УникальныйИдентификатор()));
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("НаборУпаковок");
		ЗаписьXML.ЗаписатьТекст(Строка(Данные.НаборУпаковок.УникальныйИдентификатор()));
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		Если ЗначениеЗаполнено(Данные.ОсобенностьУчета) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("ОсобенностьУчета");
			ЗаписьXML.ЗаписатьТекст(XMLСтрока(Данные.ОсобенностьУчета));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕсли;
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("ТипНоменклатуры");
		ЗаписьXML.ЗаписатьТекст(XMLСтрока(Данные.ТипНоменклатуры));
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("ИспользованиеХарактеристик");
		ЗаписьXML.ЗаписатьТекст(XMLСтрока(Данные.ИспользованиеХарактеристик));
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("ВесИспользовать");
		ЗаписьXML.ЗаписатьТекст(Строка(Данные.ВесИспользовать));
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("ВесМожноУказыватьВДокументах");
		ЗаписьXML.ЗаписатьТекст(Строка(Данные.ВесМожноУказыватьВДокументах));
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		Если ЗначениеЗаполнено(Данные.ВесЕдиницаИзмерения) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("ВесЕдиницаИзмерения");
			ЗаписьXML.ЗаписатьТекст(Строка(Данные.ВесЕдиницаИзмерения.УникальныйИдентификатор()));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕсли;
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("ВесЧислитель");
		ЗаписьXML.ЗаписатьТекст(Строка(Данные.ВесЧислитель));
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("ВесЗнаменатель");
		ЗаписьXML.ЗаписатьТекст(Строка(Данные.ВесЗнаменатель));
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("ПлощадьИспользовать");
		ЗаписьXML.ЗаписатьТекст(Строка(Данные.ПлощадьИспользовать));
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("ПлощадьМожноУказыватьВДокументах");
		ЗаписьXML.ЗаписатьТекст(Строка(Данные.ПлощадьМожноУказыватьВДокументах));
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		Если ЗначениеЗаполнено(Данные.ПлощадьЕдиницаИзмерения) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("ПлощадьЕдиницаИзмерения");
			ЗаписьXML.ЗаписатьТекст(Строка(Данные.ПлощадьЕдиницаИзмерения.УникальныйИдентификатор()));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕсли;
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("ПлощадьЧислитель");
		ЗаписьXML.ЗаписатьТекст(Строка(Данные.ПлощадьЧислитель));
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("ПлощадьЗнаменатель");
		ЗаписьXML.ЗаписатьТекст(Строка(Данные.ПлощадьЗнаменатель));
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("ОбъемИспользовать");
		ЗаписьXML.ЗаписатьТекст(Строка(Данные.ОбъемИспользовать));
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("ОбъемМожноУказыватьВДокументах");
		ЗаписьXML.ЗаписатьТекст(Строка(Данные.ОбъемМожноУказыватьВДокументах));
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		Если ЗначениеЗаполнено(Данные.ОбъемЕдиницаИзмерения) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("ОбъемЕдиницаИзмерения");
			ЗаписьXML.ЗаписатьТекст(Строка(Данные.ОбъемЕдиницаИзмерения.УникальныйИдентификатор()));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕсли;
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("ОбъемЧислитель");
		ЗаписьXML.ЗаписатьТекст(Строка(Данные.ОбъемЧислитель));
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("ОбъемЗнаменатель");
		ЗаписьXML.ЗаписатьТекст(Строка(Данные.ОбъемЗнаменатель));
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("ДлинаИспользовать");
		ЗаписьXML.ЗаписатьТекст(Строка(Данные.ДлинаИспользовать));
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("ДлинаМожноУказыватьВДокументах");
		ЗаписьXML.ЗаписатьТекст(Строка(Данные.ДлинаМожноУказыватьВДокументах));
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		Если ЗначениеЗаполнено(Данные.ДлинаЕдиницаИзмерения) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("ДлинаЕдиницаИзмерения");
			ЗаписьXML.ЗаписатьТекст(Строка(Данные.ДлинаЕдиницаИзмерения.УникальныйИдентификатор()));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕсли;
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("ДлинаЧислитель");
		ЗаписьXML.ЗаписатьТекст(Строка(Данные.ДлинаЧислитель));
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("ДлинаЗнаменатель");
		ЗаписьXML.ЗаписатьТекст(Строка(Данные.ДлинаЗнаменатель));
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("ИспользоватьУпаковки");
		ЗаписьXML.ЗаписатьТекст(Строка(Данные.ИспользоватьУпаковки));
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("ЕдиницаИзмеренияСрокаГодности");
		ЗаписьXML.ЗаписатьТекст(XMLСтрока(Данные.ЕдиницаИзмеренияСрокаГодности));
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		Если ЗначениеЗаполнено(Данные.СрокГодности) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("СрокГодности");
			ЗаписьXML.ЗаписатьТекст(Строка(Данные.СрокГодности));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Данные.ВладелецХарактеристик) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("ВладелецХарактеристик");
			ЗаписьXML.ЗаписатьТекст(Строка(Данные.ВладелецХарактеристик.УникальныйИдентификатор()));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕсли;
		
	КонецЕсли;
	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
КонецПроцедуры

Процедура УпаковкиЕдиницыИзмеренияВXML(ЗаписьXML, Данные)
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("CatalogObject.УпаковкиЕдиницыИзмерения");
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Ссылка");
	ЗаписьXML.ЗаписатьТекст(Строка(Данные.Ссылка.УникальныйИдентификатор()));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("ПометкаУдаления");
	ЗаписьXML.ЗаписатьТекст(Строка(Данные.ПометкаУдаления));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	Если ЗначениеЗаполнено(Данные.Владелец) Тогда
		ЗаписьXML.ЗаписатьНачалоЭлемента("Владелец");
		ЗаписьXML.ЗаписатьТекст(Строка(Данные.Владелец.УникальныйИдентификатор()));
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("ТипВладелец");
		ЗаписьXML.ЗаписатьТекст(Данные.Владелец.Метаданные().ПолноеИмя());
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЕсли;
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Родитель");
	ЗаписьXML.ЗаписатьТекст(Строка(Данные.Родитель.УникальныйИдентификатор()));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Наименование");
	ЗаписьXML.ЗаписатьТекст(Данные.Наименование);
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Предопределенный");
	ЗаписьXML.ЗаписатьТекст(Строка(Данные.Предопределенный));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	Если Данные.Предопределенный Тогда
		ЗаписьXML.ЗаписатьНачалоЭлемента("ИмяПредопределенныхДанных");
		ЗаписьXML.ЗаписатьТекст(Данные.ИмяПредопределенныхДанных);
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЕсли;
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Безразмерная");
	ЗаписьXML.ЗаписатьТекст(Строка(Данные.Безразмерная));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	Если ЗначениеЗаполнено(Данные.Вес) Тогда
		ЗаписьXML.ЗаписатьНачалоЭлемента("Вес");
		ЗаписьXML.ЗаписатьТекст(Строка(Данные.Вес));
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Данные.ВесЕдиницаИзмерения) Тогда
		ЗаписьXML.ЗаписатьНачалоЭлемента("ВесЕдиницаИзмерения");
		ЗаписьXML.ЗаписатьТекст(Строка(Данные.ВесЕдиницаИзмерения.УникальныйИдентификатор()));
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Данные.Высота) Тогда
		ЗаписьXML.ЗаписатьНачалоЭлемента("Высота");
		ЗаписьXML.ЗаписатьТекст(Строка(Данные.Высота));
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Данные.ВысотаЕдиницаИзмерения) Тогда
		ЗаписьXML.ЗаписатьНачалоЭлемента("ВысотаЕдиницаИзмерения");
		ЗаписьXML.ЗаписатьТекст(Строка(Данные.ВысотаЕдиницаИзмерения.УникальныйИдентификатор()));
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Данные.Глубина) Тогда
		ЗаписьXML.ЗаписатьНачалоЭлемента("Глубина");
		ЗаписьXML.ЗаписатьТекст(Строка(Данные.Глубина));
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Данные.ГлубинаЕдиницаИзмерения) Тогда
		ЗаписьXML.ЗаписатьНачалоЭлемента("ГлубинаЕдиницаИзмерения");
		ЗаписьXML.ЗаписатьТекст(Строка(Данные.ГлубинаЕдиницаИзмерения.УникальныйИдентификатор()));
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЕсли;
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("ЕдиницаИзмерения");
	ЗаписьXML.ЗаписатьТекст(Строка(Данные.ЕдиницаИзмерения.УникальныйИдентификатор()));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Числитель");
	ЗаписьXML.ЗаписатьТекст(Строка(Данные.Числитель));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Знаменатель");
	ЗаписьXML.ЗаписатьТекст(Строка(Данные.Знаменатель));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	Если ЗначениеЗаполнено(Данные.ЛинейныеРазмерыПредставление) Тогда
		ЗаписьXML.ЗаписатьНачалоЭлемента("ЛинейныеРазмерыПредставление");
		ЗаписьXML.ЗаписатьТекст(Строка(Данные.ЛинейныеРазмерыПредставление));
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Данные.Объем) Тогда
		ЗаписьXML.ЗаписатьНачалоЭлемента("Объем");
		ЗаписьXML.ЗаписатьТекст(Строка(Данные.Объем));
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Данные.ОбъемЕдиницаИзмерения) Тогда
		ЗаписьXML.ЗаписатьНачалоЭлемента("ОбъемЕдиницаИзмерения");
		ЗаписьXML.ЗаписатьТекст(Строка(Данные.ОбъемЕдиницаИзмерения.УникальныйИдентификатор()));
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Данные.СкладскаяГруппа) Тогда
		ЗаписьXML.ЗаписатьНачалоЭлемента("СкладскаяГруппа");
		ЗаписьXML.ЗаписатьТекст(Строка(Данные.СкладскаяГруппа.УникальныйИдентификатор()));
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Данные.Типоразмер) Тогда
		ЗаписьXML.ЗаписатьНачалоЭлемента("Типоразмер");
		ЗаписьXML.ЗаписатьТекст(Строка(Данные.Типоразмер.УникальныйИдентификатор()));
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Данные.Ширина) Тогда
		ЗаписьXML.ЗаписатьНачалоЭлемента("Ширина");
		ЗаписьXML.ЗаписатьТекст(Строка(Данные.Ширина));
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Данные.ШиринаЕдиницаИзмерения) Тогда
		ЗаписьXML.ЗаписатьНачалоЭлемента("ШиринаЕдиницаИзмерения");
		ЗаписьXML.ЗаписатьТекст(Строка(Данные.ШиринаЕдиницаИзмерения.УникальныйИдентификатор()));
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЕсли;
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("КоличествоУпаковок");
	ЗаписьXML.ЗаписатьТекст(Строка(Данные.КоличествоУпаковок));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("ПоставляетсяВМногооборотнойТаре");
	ЗаписьXML.ЗаписатьТекст(Строка(Данные.ПоставляетсяВМногооборотнойТаре));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("НоменклатураМногооборотнаяТара");
	ЗаписьXML.ЗаписатьТекст(Строка(Данные.НоменклатураМногооборотнаяТара.УникальныйИдентификатор()));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("ХарактеристикаМногооборотнаяТара");
	ЗаписьXML.ЗаписатьТекст(Строка(Данные.ХарактеристикаМногооборотнаяТара.УникальныйИдентификатор()));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	Если ЗначениеЗаполнено(Данные.МинимальноеКоличествоУпаковокМногооборотнойТары) Тогда
		ЗаписьXML.ЗаписатьНачалоЭлемента("МинимальноеКоличествоУпаковокМногооборотнойТары");
		ЗаписьXML.ЗаписатьТекст(Строка(Данные.МинимальноеКоличествоУпаковокМногооборотнойТары));
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Данные.ТипИзмеряемойВеличины) Тогда
		ЗаписьXML.ЗаписатьНачалоЭлемента("ТипИзмеряемойВеличины");
		ЗаписьXML.ЗаписатьТекст(XMLСтрока(Данные.ТипИзмеряемойВеличины));
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Данные.НаименованиеПолное) Тогда
		ЗаписьXML.ЗаписатьНачалоЭлемента("НаименованиеПолное");
		ЗаписьXML.ЗаписатьТекст(Данные.НаименованиеПолное);
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Данные.МеждународноеСокращение) Тогда
		ЗаписьXML.ЗаписатьНачалоЭлемента("МеждународноеСокращение");
		ЗаписьXML.ЗаписатьТекст(Данные.МеждународноеСокращение);
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЕсли;
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("ТипУпаковки");
	ЗаписьXML.ЗаписатьТекст(XMLСтрока(Данные.ТипУпаковки));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	Если ЗначениеЗаполнено(Данные.НаименованиеЯзык1) Тогда
		ЗаписьXML.ЗаписатьНачалоЭлемента("НаименованиеЯзык1");
		ЗаписьXML.ЗаписатьТекст(Строка(Данные.НаименованиеЯзык1));
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Данные.НаименованиеЯзык2) Тогда
		ЗаписьXML.ЗаписатьНачалоЭлемента("НаименованиеЯзык2");
		ЗаписьXML.ЗаписатьТекст(Строка(Данные.НаименованиеЯзык2));
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЕсли;
	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
КонецПроцедуры

Процедура НаборыУпаковокВXML(ЗаписьXML, Данные)
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("CatalogObject.НаборыУпаковок");
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Ссылка");
	ЗаписьXML.ЗаписатьТекст(Строка(Данные.Ссылка.УникальныйИдентификатор()));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("ПометкаУдаления");
	ЗаписьXML.ЗаписатьТекст(Строка(Данные.ПометкаУдаления));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Наименование");
	ЗаписьXML.ЗаписатьТекст(Данные.Наименование);
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Предопределенный");
	ЗаписьXML.ЗаписатьТекст(Строка(Данные.Предопределенный));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	Если Данные.Предопределенный Тогда
		ЗаписьXML.ЗаписатьНачалоЭлемента("ИмяПредопределенныхДанных");
		ЗаписьXML.ЗаписатьТекст(Данные.ИмяПредопределенныхДанных);
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЕсли;
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("ЕдиницаИзмерения");
	ЗаписьXML.ЗаписатьТекст(Строка(Данные.ЕдиницаИзмерения.УникальныйИдентификатор()));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	Если ЗначениеЗаполнено(Данные.ЕдиницаДляОтчетов) Тогда
		ЗаписьXML.ЗаписатьНачалоЭлемента("ЕдиницаДляОтчетов");
		ЗаписьXML.ЗаписатьТекст(Строка(Данные.ЕдиницаДляОтчетов.УникальныйИдентификатор()));
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Данные.КоэффициентЕдиницыДляОтчетов) Тогда
		ЗаписьXML.ЗаписатьНачалоЭлемента("КоэффициентЕдиницыДляОтчетов");
		ЗаписьXML.ЗаписатьТекст(Строка(Данные.КоэффициентЕдиницыДляОтчетов));
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЕсли;
	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
КонецПроцедуры

Процедура ПользователиВXML(ЗаписьXML, Данные)
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("CatalogObject.Пользователи");
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Ссылка");
	ЗаписьXML.ЗаписатьТекст(Строка(Данные.Ссылка.УникальныйИдентификатор()));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("ПометкаУдаления");
	ЗаписьXML.ЗаписатьТекст(Строка(Данные.ПометкаУдаления));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Наименование");
	ЗаписьXML.ЗаписатьТекст(Данные.Наименование);
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	Если ЗначениеЗаполнено(Данные.ИдентификаторПользователяИБ) Тогда
		ЗаписьXML.ЗаписатьНачалоЭлемента("ИдентификаторПользователяИБ");
		ЗаписьXML.ЗаписатьТекст(Строка(Данные.ИдентификаторПользователяИБ));
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЕсли;
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Служебный");
	ЗаписьXML.ЗаписатьТекст(Строка(Данные.Служебный));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
КонецПроцедуры

Процедура ПартнерыВXML(ЗаписьXML, Данные)
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("CatalogObject.Партнеры");
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Ссылка");
	ЗаписьXML.ЗаписатьТекст(Строка(Данные.Ссылка.УникальныйИдентификатор()));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("ПометкаУдаления");
	ЗаписьXML.ЗаписатьТекст(Строка(Данные.ПометкаУдаления));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Наименование");
	ЗаписьXML.ЗаписатьТекст(Данные.Наименование);
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Клиент");
	ЗаписьXML.ЗаписатьТекст(Строка(Данные.Клиент));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Поставщик");
	ЗаписьXML.ЗаписатьТекст(Строка(Данные.Поставщик));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("НаименованиеПолное");
	ЗаписьXML.ЗаписатьТекст(Строка(Данные.НаименованиеПолное));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
КонецПроцедуры

Процедура ИдентификаторыОбъектовМетаданныхВXML(ЗаписьXML, Данные)
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("CatalogObject.ИдентификаторыОбъектовМетаданных");
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Ссылка");
	ЗаписьXML.ЗаписатьТекст(Строка(Данные.Ссылка.УникальныйИдентификатор()));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("ПометкаУдаления");
	ЗаписьXML.ЗаписатьТекст(Строка(Данные.ПометкаУдаления));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Наименование");
	ЗаписьXML.ЗаписатьТекст(Данные.Наименование);
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	Если ЗначениеЗаполнено(Данные.ПолноеИмя) Тогда
		ЗаписьXML.ЗаписатьНачалоЭлемента("ПолноеИмя");
		ЗаписьXML.ЗаписатьТекст(Строка(Данные.ПолноеИмя));
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЕсли;
	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
КонецПроцедуры

Процедура СкладыВXML(ЗаписьXML, Данные)
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("CatalogObject.Склады");
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Ссылка");
	ЗаписьXML.ЗаписатьТекст(Строка(Данные.Ссылка.УникальныйИдентификатор()));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("ПометкаУдаления");
	ЗаписьXML.ЗаписатьТекст(Строка(Данные.ПометкаУдаления));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Наименование");
	ЗаписьXML.ЗаписатьТекст(Данные.Наименование);
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	Если ЗначениеЗаполнено(Данные.Родитель) Тогда
		ЗаписьXML.ЗаписатьНачалоЭлемента("Родитель");
		ЗаписьXML.ЗаписатьТекст(Строка(Данные.Родитель.УникальныйИдентификатор()));
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЕсли;
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("ЭтоГруппа");
	ЗаписьXML.ЗаписатьТекст(Строка(Данные.ЭтоГруппа));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	Если НЕ Данные.ЭтоГруппа Тогда
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("ИспользоватьАдресноеХранение");
		ЗаписьXML.ЗаписатьТекст(Строка(Данные.ИспользоватьАдресноеХранение));
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("ИспользоватьАдресноеХранениеСправочно");
		ЗаписьXML.ЗаписатьТекст(Строка(Данные.ИспользоватьАдресноеХранениеСправочно));
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("ИспользоватьОрдернуюСхемуПриОтгрузке");
		ЗаписьXML.ЗаписатьТекст(Строка(Данные.ИспользоватьОрдернуюСхемуПриОтгрузке));
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("ИспользоватьОрдернуюСхемуПриОтраженииИзлишковНедостач");
		ЗаписьXML.ЗаписатьТекст(Строка(Данные.ИспользоватьОрдернуюСхемуПриОтраженииИзлишковНедостач));
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("ИспользоватьОрдернуюСхемуПриПоступлении");
		ЗаписьXML.ЗаписатьТекст(Строка(Данные.ИспользоватьОрдернуюСхемуПриПоступлении));
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("ИспользоватьСерииНоменклатуры");
		ЗаписьXML.ЗаписатьТекст(Строка(Данные.ИспользоватьСерииНоменклатуры));
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("ИспользоватьСкладскиеПомещения");
		ЗаписьXML.ЗаписатьТекст(Строка(Данные.ИспользоватьСкладскиеПомещения));
		ЗаписьXML.ЗаписатьКонецЭлемента();  
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("ИспользоватьСтатусыПриходныхОрдеров");
		ЗаписьXML.ЗаписатьТекст(Строка(Данные.ИспользоватьСтатусыПриходныхОрдеров));
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("ИспользоватьСтатусыРасходныхОрдеров");
		ЗаписьXML.ЗаписатьТекст(Строка(Данные.ИспользоватьСтатусыРасходныхОрдеров));
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("УчитыватьСебестоимостьПоСериям");
		ЗаписьXML.ЗаписатьТекст(Строка(Данные.УчитыватьСебестоимостьПоСериям));
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		Если ЗначениеЗаполнено(Данные.ДатаНачалаИспользованияСкладскихПомещений) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("ДатаНачалаИспользованияСкладскихПомещений");
			ЗаписьXML.ЗаписатьТекст(Строка(Данные.ДатаНачалаИспользованияСкладскихПомещений));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕсли;
		
	КонецЕсли;
	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
КонецПроцедуры

Процедура СкладскиеПомещенияВXML(ЗаписьXML, Данные)
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("CatalogObject.СкладскиеПомещения");
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Ссылка");
	ЗаписьXML.ЗаписатьТекст(Строка(Данные.Ссылка.УникальныйИдентификатор()));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("ПометкаУдаления");
	ЗаписьXML.ЗаписатьТекст(Строка(Данные.ПометкаУдаления));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Наименование");
	ЗаписьXML.ЗаписатьТекст(Данные.Наименование);
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Владелец");
	ЗаписьXML.ЗаписатьТекст(Строка(Данные.Владелец.УникальныйИдентификатор()));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("ИспользоватьАдресноеХранение");
	ЗаписьXML.ЗаписатьТекст(Строка(Данные.ИспользоватьАдресноеХранение));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("ИспользоватьАдресноеХранениеСправочно");
	ЗаписьXML.ЗаписатьТекст(Строка(Данные.ИспользоватьАдресноеХранениеСправочно));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
КонецПроцедуры

Процедура НазначенияВXML(ЗаписьXML, Данные)
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("CatalogObject.Назначения");
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Ссылка");
	ЗаписьXML.ЗаписатьТекст(Строка(Данные.Ссылка.УникальныйИдентификатор()));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("ПометкаУдаления");
	ЗаписьXML.ЗаписатьТекст(Строка(Данные.ПометкаУдаления));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Наименование");
	ЗаписьXML.ЗаписатьТекст(Данные.Наименование);
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("КонтролироватьТолькоНаличие");
	ЗаписьXML.ЗаписатьТекст(Строка(Данные.КонтролироватьТолькоНаличие));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("УчитыватьСтавкиНДС");
	ЗаписьXML.ЗаписатьТекст(Строка(Данные.УчитыватьСтавкиНДС));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
КонецПроцедуры

Процедура СкладскиеЯчейкиВXML(ЗаписьXML, Данные)
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("CatalogObject.СкладскиеЯчейки");
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Ссылка");
	ЗаписьXML.ЗаписатьТекст(Строка(Данные.Ссылка.УникальныйИдентификатор()));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("ПометкаУдаления");
	ЗаписьXML.ЗаписатьТекст(Строка(Данные.ПометкаУдаления));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	Если ЗначениеЗаполнено(Данные.Наименование) Тогда 
		ЗаписьXML.ЗаписатьНачалоЭлемента("Наименование");
		ЗаписьXML.ЗаписатьТекст(Данные.Наименование);
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЕсли;
		
	ЗаписьXML.ЗаписатьНачалоЭлемента("Код");
	ЗаписьXML.ЗаписатьТекст(Данные.Код);
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	Если ЗначениеЗаполнено(Данные.Родитель) Тогда
		ЗаписьXML.ЗаписатьНачалоЭлемента("Родитель");
		ЗаписьXML.ЗаписатьТекст(Строка(Данные.Родитель.УникальныйИдентификатор()));
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЕсли;
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("ЭтоГруппа");
	ЗаписьXML.ЗаписатьТекст(Строка(Данные.ЭтоГруппа));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Владелец");
	ЗаписьXML.ЗаписатьТекст(Строка(Данные.Владелец.УникальныйИдентификатор()));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	Если НЕ Данные.ЭтоГруппа Тогда
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("ТипСкладскойЯчейки");
		ЗаписьXML.ЗаписатьТекст(XMLСтрока(Данные.ТипСкладскойЯчейки));
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("Помещение");
		ЗаписьXML.ЗаписатьТекст(Строка(Данные.Помещение.УникальныйИдентификатор()));
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
	КонецЕсли;
	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
КонецПроцедуры

Процедура ХарактеристикиНоменклатурыВXML(ЗаписьXML, Данные)
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("CatalogObject.ХарактеристикиНоменклатуры");
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Ссылка");
	ЗаписьXML.ЗаписатьТекст(Строка(Данные.Ссылка.УникальныйИдентификатор()));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("ПометкаУдаления");
	ЗаписьXML.ЗаписатьТекст(Строка(Данные.ПометкаУдаления));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Наименование");
	ЗаписьXML.ЗаписатьТекст(Данные.Наименование);
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	Если ЗначениеЗаполнено(Данные.НаименованиеПолное) Тогда
		ЗаписьXML.ЗаписатьНачалоЭлемента("НаименованиеПолное");
		ЗаписьXML.ЗаписатьТекст(Данные.НаименованиеПолное);
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Данные.Владелец) Тогда
		ЗаписьXML.ЗаписатьНачалоЭлемента("ТипВладелец");
		ЗаписьXML.ЗаписатьТекст(Данные.Владелец.Метаданные().ПолноеИмя());
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("Владелец");
		ЗаписьXML.ЗаписатьТекст(Строка(Данные.Владелец.УникальныйИдентификатор()));
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЕсли;
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Предопределенный");
	ЗаписьXML.ЗаписатьТекст(Строка(Данные.Предопределенный));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	Если Данные.Предопределенный Тогда
		ЗаписьXML.ЗаписатьНачалоЭлемента("ИмяПредопределенныхДанных");
		ЗаписьXML.ЗаписатьТекст(Данные.ИмяПредопределенныхДанных);
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Данные.Принципал) Тогда
		ЗаписьXML.ЗаписатьНачалоЭлемента("ТипПринципал");
		ЗаписьXML.ЗаписатьТекст(Данные.Принципал.Метаданные().ПолноеИмя());
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("Принципал");
		ЗаписьXML.ЗаписатьТекст(Строка(Данные.Принципал.УникальныйИдентификатор()));
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Данные.Контрагент) Тогда
		ЗаписьXML.ЗаписатьНачалоЭлемента("ТипКонтрагент");
		ЗаписьXML.ЗаписатьТекст(Данные.Контрагент.Метаданные().ПолноеИмя());
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("Контрагент");
		ЗаписьXML.ЗаписатьТекст(Строка(Данные.Контрагент.УникальныйИдентификатор()));
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЕсли;
	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
КонецПроцедуры

Процедура ВариантыКомплектацииНоменклатурыВXML(ЗаписьXML, Данные)
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("CatalogObject.ВариантыКомплектацииНоменклатуры");
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Ссылка");
	ЗаписьXML.ЗаписатьТекст(Строка(Данные.Ссылка.УникальныйИдентификатор()));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("ПометкаУдаления");
	ЗаписьXML.ЗаписатьТекст(Строка(Данные.ПометкаУдаления));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Наименование");
	ЗаписьXML.ЗаписатьТекст(Данные.Наименование);
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Владелец");
	ЗаписьXML.ЗаписатьТекст(Строка(Данные.Владелец.УникальныйИдентификатор()));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Характеристика");
	ЗаписьXML.ЗаписатьТекст(Строка(Данные.Характеристика.УникальныйИдентификатор()));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Основной");
	ЗаписьXML.ЗаписатьТекст(Строка(Данные.Основной));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	Если ЗначениеЗаполнено(Данные.ВариантРасчетаЦеныНабора) Тогда
		ЗаписьXML.ЗаписатьНачалоЭлемента("ВариантРасчетаЦеныНабора");
		ЗаписьXML.ЗаписатьТекст(XMLСтрока(Данные.ВариантРасчетаЦеныНабора));
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЕсли;
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("СодержитТовары");
	ЗаписьXML.ЗаписатьТекст(Строка(Данные.СодержитТовары));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("СодержитУслуги");
	ЗаписьXML.ЗаписатьТекст(Строка(Данные.СодержитУслуги));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
КонецПроцедуры

Процедура ВидыНоменклатурыВXML(ЗаписьXML, Данные)
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("CatalogObject.ВидыНоменклатуры");
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Ссылка");
	ЗаписьXML.ЗаписатьТекст(Строка(Данные.Ссылка.УникальныйИдентификатор()));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("ПометкаУдаления");
	ЗаписьXML.ЗаписатьТекст(Строка(Данные.ПометкаУдаления));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Наименование");
	ЗаписьXML.ЗаписатьТекст(Данные.Наименование);
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	Если ЗначениеЗаполнено(Данные.Родитель) Тогда
		ЗаписьXML.ЗаписатьНачалоЭлемента("Родитель");
		ЗаписьXML.ЗаписатьТекст(Строка(Данные.Родитель.УникальныйИдентификатор()));
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЕсли;
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("ЭтоГруппа");
	ЗаписьXML.ЗаписатьТекст(Строка(Данные.ЭтоГруппа));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	Если Не Данные.ЭтоГруппа Тогда
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("ИспользоватьНомерСерии");
		ЗаписьXML.ЗаписатьТекст(Строка(Данные.ИспользоватьНомерСерии));
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("ИспользоватьСрокГодностиСерии");
		ЗаписьXML.ЗаписатьТекст(Строка(Данные.ИспользоватьСрокГодностиСерии));
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("ИспользоватьRFIDМеткиСерии");
		ЗаписьXML.ЗаписатьТекст(Строка(Данные.ИспользоватьRFIDМеткиСерии));
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("ИспользоватьДатуПроизводстваСерии");
		ЗаписьXML.ЗаписатьТекст(Строка(Данные.ИспользоватьДатуПроизводстваСерии));
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("ИспользоватьНомерКИЗГИСМСерии");
		ЗаписьXML.ЗаписатьТекст(Строка(Данные.ИспользоватьНомерКИЗГИСМСерии));
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("ИспользоватьПроизводителяЕГАИССерии");
		ЗаписьXML.ЗаписатьТекст(Строка(Данные.ИспользоватьПроизводителяЕГАИССерии));
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("ИспользоватьСправку2ЕГАИССерии");
		ЗаписьXML.ЗаписатьТекст(Строка(Данные.ИспользоватьСправку2ЕГАИССерии));
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("ИспользоватьПроизводителяВЕТИССерии");
		ЗаписьXML.ЗаписатьТекст(Строка(Данные.ИспользоватьПроизводителяВЕТИССерии));
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("ИспользоватьЗаписьСкладскогоЖурналаВЕТИССерии");
		ЗаписьXML.ЗаписатьТекст(Строка(Данные.ИспользоватьЗаписьСкладскогоЖурналаВЕТИССерии));
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("ИспользоватьИдентификаторПартииВЕТИССерии");
		ЗаписьXML.ЗаписатьТекст(Строка(Данные.ИспользоватьИдентификаторПартииВЕТИССерии));
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("ИспользоватьМРЦМОТПСерии");
		ЗаписьXML.ЗаписатьТекст(Строка(Данные.ИспользоватьМРЦМОТПСерии));
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("ИспользоватьСерии");
		ЗаписьXML.ЗаписатьТекст(Строка(Данные.ИспользоватьСерии));
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		Если ЗначениеЗаполнено(Данные.ОсобенностьУчета) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("ОсобенностьУчета");
			ЗаписьXML.ЗаписатьТекст(XMLСтрока(Данные.ОсобенностьУчета));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕсли;
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("НастройкаИспользованияСерий");
		ЗаписьXML.ЗаписатьТекст(XMLСтрока(Данные.НастройкаИспользованияСерий));
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("АвтоматическиГенерироватьСерии");
		ЗаписьXML.ЗаписатьТекст(Строка(Данные.АвтоматическиГенерироватьСерии));
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("ВладелецСерий");
		ЗаписьXML.ЗаписатьТекст(Строка(Данные.ВладелецСерий.УникальныйИдентификатор()));
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		Если ЗначениеЗаполнено(Данные.ШаблонЭтикеткиСерии) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("ШаблонЭтикеткиСерии");
			ЗаписьXML.ЗаписатьТекст(Строка(Данные.ШаблонЭтикеткиСерии.УникальныйИдентификатор()));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕсли;
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("НастройкиСерийБерутсяИзДругогоВидаНоменклатуры");
		ЗаписьXML.ЗаписатьТекст(Строка(Данные.НастройкиСерийБерутсяИзДругогоВидаНоменклатуры));
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		Если ЗначениеЗаполнено(Данные.ШаблонРабочегоНаименованияСерии) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("ШаблонРабочегоНаименованияСерии");
			ЗаписьXML.ЗаписатьТекст(Строка(Данные.ШаблонРабочегоНаименованияСерии));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Данные.ЕдиницаИзмеренияСрокаГодности) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("ЕдиницаИзмеренияСрокаГодности");
			ЗаписьXML.ЗаписатьТекст(XMLСтрока(Данные.ЕдиницаИзмеренияСрокаГодности));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕсли;
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("ТочностьУказанияСрокаГодностиСерии");
		ЗаписьXML.ЗаписатьТекст(XMLСтрока(Данные.ТочностьУказанияСрокаГодностиСерии));
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("ИспользоватьКоличествоСерии");
		ЗаписьXML.ЗаписатьТекст(Строка(Данные.ИспользоватьКоличествоСерии));
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("ПолитикаУчетаСерий");
		ЗаписьXML.ЗаписатьТекст(Строка(Данные.ПолитикаУчетаСерий.УникальныйИдентификатор()));
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		Если ЗначениеЗаполнено(Данные.НастройкиКлючаЦенПоСерии) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("НастройкиКлючаЦенПоСерии");
			ЗаписьXML.ЗаписатьТекст(XMLСтрока(Данные.НастройкиКлючаЦенПоСерии));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕсли;
		
		Если Данные.ПолитикиУчетаСерий.Количество() Тогда
			
			ЗаписьXML.ЗаписатьНачалоЭлемента("ПолитикиУчетаСерий");
			Для Каждого СтрокаПолитикиУчета Из Данные.ПолитикиУчетаСерий Цикл
				ЗаписьXML.ЗаписатьНачалоЭлемента("ЭлементПолитикиУчетаСерий");
				
				Если ЗначениеЗаполнено(СтрокаПолитикиУчета.Склад) Тогда
					ЗаписьXML.ЗаписатьНачалоЭлемента("Склад");
					ЗаписьXML.ЗаписатьТекст(Строка(СтрокаПолитикиУчета.Склад.УникальныйИдентификатор()));
					ЗаписьXML.ЗаписатьКонецЭлемента();
					
					ЗаписьXML.ЗаписатьНачалоЭлемента("ТипСклад");
					ЗаписьXML.ЗаписатьТекст(СтрокаПолитикиУчета.Склад.Метаданные().ПолноеИмя());
					ЗаписьXML.ЗаписатьКонецЭлемента();
				КонецЕсли;
				
				ЗаписьXML.ЗаписатьНачалоЭлемента("ПолитикаУчетаСерий");
				ЗаписьXML.ЗаписатьТекст(Строка(СтрокаПолитикиУчета.ПолитикаУчетаСерий.УникальныйИдентификатор()));
				ЗаписьXML.ЗаписатьКонецЭлемента();
				
				ЗаписьXML.ЗаписатьКонецЭлемента();
			КонецЦикла;
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕсли;
		
		Если Данные.РеквизитыДляКонтроляСерий.Количество() Тогда
			
			ЗаписьXML.ЗаписатьНачалоЭлемента("РеквизитыДляКонтроляСерий");
			Для Каждого СтрокаРеквизиты Из Данные.РеквизитыДляКонтроляСерий Цикл
				ЗаписьXML.ЗаписатьНачалоЭлемента("ЭлементРеквизитыДляКонтроляСерий");

				ЗаписьXML.ЗаписатьНачалоЭлемента("ЭтоДопРеквизит");
				ЗаписьXML.ЗаписатьТекст(Строка(СтрокаРеквизиты.ЭтоДопРеквизит));
				ЗаписьXML.ЗаписатьКонецЭлемента();
				
				Если ЗначениеЗаполнено(СтрокаРеквизиты.Свойство) Тогда
					ЗаписьXML.ЗаписатьНачалоЭлемента("Свойство");
					ЗаписьXML.ЗаписатьТекст(Строка(СтрокаРеквизиты.Свойство.УникальныйИдентификатор()));
					ЗаписьXML.ЗаписатьКонецЭлемента();
				КонецЕсли;
				
				ЗаписьXML.ЗаписатьНачалоЭлемента("ЗаполнятьОбязательно");
				ЗаписьXML.ЗаписатьТекст(Строка(СтрокаРеквизиты.ЗаполнятьОбязательно));
				ЗаписьXML.ЗаписатьКонецЭлемента();
				
				ЗаписьXML.ЗаписатьКонецЭлемента();
			КонецЦикла;
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕсли;
		
	КонецЕсли;
	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
КонецПроцедуры

Процедура ПолитикиУчетаСерийВXML(ЗаписьXML, Данные)
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("CatalogObject.ПолитикиУчетаСерий");
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Ссылка");
	ЗаписьXML.ЗаписатьТекст(Строка(Данные.Ссылка.УникальныйИдентификатор()));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("ПометкаУдаления");
	ЗаписьXML.ЗаписатьТекст(Строка(Данные.ПометкаУдаления));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Наименование");
	ЗаписьXML.ЗаписатьТекст(Данные.Наименование);
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("ТипПолитики");
	ЗаписьXML.ЗаписатьТекст(XMLСтрока(Данные.ТипПолитики));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("УказыватьПриПроизводствеПродукции");
	ЗаписьXML.ЗаписатьТекст(Строка(Данные.УказыватьПриПроизводствеПродукции));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("УказыватьПриРасходеМатериалов");
	ЗаписьXML.ЗаписатьТекст(Строка(Данные.УказыватьПриРасходеМатериалов));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("УказыватьПоФактуОтбора");
	ЗаписьXML.ЗаписатьТекст(Строка(Данные.УказыватьПоФактуОтбора));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("УказыватьПриВозвратеНаСклад");
	ЗаписьXML.ЗаписатьТекст(Строка(Данные.УказыватьПриВозвратеНаСклад));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("УказыватьПриОтгрузке");
	ЗаписьXML.ЗаписатьТекст(Строка(Данные.УказыватьПриОтгрузке));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("УказыватьПриВыпускеВПодразделение");
	ЗаписьXML.ЗаписатьТекст(Строка(Данные.УказыватьПриВыпускеВПодразделение));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("УказыватьПриДвиженииМатериалов");
	ЗаписьXML.ЗаписатьТекст(Строка(Данные.УказыватьПриДвиженииМатериалов));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("УказыватьПриДвиженииПродукции");
	ЗаписьXML.ЗаписатьТекст(Строка(Данные.УказыватьПриДвиженииПродукции));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("УказыватьПриОтгрузкеВРозницу");
	ЗаписьXML.ЗаписатьТекст(Строка(Данные.УказыватьПриОтгрузкеВРозницу));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("УказыватьПриОтгрузкеКлиенту");
	ЗаписьXML.ЗаписатьТекст(Строка(Данные.УказыватьПриОтгрузкеКлиенту));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("УказыватьПриОтгрузкеКомплектовДляРазборки");
	ЗаписьXML.ЗаписатьТекст(Строка(Данные.УказыватьПриОтгрузкеКомплектовДляРазборки));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("УказыватьПриОтгрузкеКомплектующихДляСборки");
	ЗаписьXML.ЗаписатьТекст(Строка(Данные.УказыватьПриОтгрузкеКомплектующихДляСборки));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("УказыватьПриОтгрузкеНаВнутренниеНужды");
	ЗаписьXML.ЗаписатьТекст(Строка(Данные.УказыватьПриОтгрузкеНаВнутренниеНужды));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("УказыватьПриОтгрузкеПоВозвратуПоставщику");
	ЗаписьXML.ЗаписатьТекст(Строка(Данные.УказыватьПриОтгрузкеПоВозвратуПоставщику));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("УказыватьПриОтгрузкеПоПеремещению");
	ЗаписьXML.ЗаписатьТекст(Строка(Данные.УказыватьПриОтгрузкеПоПеремещению));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("УказыватьПриОтраженииИзлишков");
	ЗаписьXML.ЗаписатьТекст(Строка(Данные.УказыватьПриОтраженииИзлишков));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("УказыватьПриОтраженииЗатратНаПроизводство");
	ЗаписьXML.ЗаписатьТекст(Строка(Данные.УказыватьПриОтраженииЗатратНаПроизводство));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("УказыватьПриОтраженииНедостач");
	ЗаписьXML.ЗаписатьТекст(Строка(Данные.УказыватьПриОтраженииНедостач));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("УказыватьПриПеремещенииМеждуПомещениями");
	ЗаписьXML.ЗаписатьТекст(Строка(Данные.УказыватьПриПеремещенииМеждуПомещениями));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("УказыватьПриПересчетеТоваров");
	ЗаписьXML.ЗаписатьТекст(Строка(Данные.УказыватьПриПересчетеТоваров));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("УказыватьПриПланированииОтбора");
	ЗаписьXML.ЗаписатьТекст(Строка(Данные.УказыватьПриПланированииОтбора));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("УказыватьПриПланированииОтгрузки");
	ЗаписьXML.ЗаписатьТекст(Строка(Данные.УказыватьПриПланированииОтгрузки));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("УказыватьПриПриемке");
	ЗаписьXML.ЗаписатьТекст(Строка(Данные.УказыватьПриПриемке));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("УказыватьПриПолученииМатериалов");
	ЗаписьXML.ЗаписатьТекст(Строка(Данные.УказыватьПриПолученииМатериалов));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("УказыватьПриПриемкеКомплектующихПослеРазборки");
	ЗаписьXML.ЗаписатьТекст(Строка(Данные.УказыватьПриПриемкеКомплектующихПослеРазборки));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("УказыватьПриПриемкеОтПоставщика");
	ЗаписьXML.ЗаписатьТекст(Строка(Данные.УказыватьПриПриемкеОтПоставщика));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("УказыватьПриПриемкеПоВозвратуОтКлиента");
	ЗаписьXML.ЗаписатьТекст(Строка(Данные.УказыватьПриПриемкеПоВозвратуОтКлиента));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("УказыватьПриПриемкеПоПеремещению");
	ЗаписьXML.ЗаписатьТекст(Строка(Данные.УказыватьПриПриемкеПоПеремещению));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("УказыватьПриПриемкеПоПрочемуОприходованию");
	ЗаписьXML.ЗаписатьТекст(Строка(Данные.УказыватьПриПриемкеПоПрочемуОприходованию));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("УказыватьПриПриемкеПродукцииИзПроизводства");
	ЗаписьXML.ЗаписатьТекст(Строка(Данные.УказыватьПриПриемкеПродукцииИзПроизводства));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("УказыватьПриПриемкеСобранныхКомплектов");
	ЗаписьXML.ЗаписатьТекст(Строка(Данные.УказыватьПриПриемкеСобранныхКомплектов));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("УчетСерийПоFEFO");
	ЗаписьXML.ЗаписатьТекст(Строка(Данные.УчетСерийПоFEFO));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("УчитыватьОстаткиСерий");
	ЗаписьXML.ЗаписатьТекст(Строка(Данные.УчитыватьОстаткиСерий));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("УчитыватьСебестоимостьПоСериям");
	ЗаписьXML.ЗаписатьТекст(Строка(Данные.УчитыватьСебестоимостьПоСериям));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("УказыватьПриВозвратеНепринятыхПолучателемТоваров");
	ЗаписьXML.ЗаписатьТекст(Строка(Данные.УказыватьПриВозвратеНепринятыхПолучателемТоваров));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("ДляСклада");
	ЗаписьXML.ЗаписатьТекст(Строка(Данные.ДляСклада));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("ДляПроизводства");
	ЗаписьXML.ЗаписатьТекст(Строка(Данные.ДляПроизводства));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("УказыватьПриМаркировкеПродукцииДляГИСМ");
	ЗаписьXML.ЗаписатьТекст(Строка(Данные.УказыватьПриМаркировкеПродукцииДляГИСМ));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("УчетСерийВНеотфактурованныхПоставкахТоваров");
	ЗаписьXML.ЗаписатьТекст(Строка(Данные.УчетСерийВНеотфактурованныхПоставкахТоваров));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("УчетТоваровВПутиОтПоставщикаПоСериям");
	ЗаписьXML.ЗаписатьТекст(Строка(Данные.УчетТоваровВПутиОтПоставщикаПоСериям));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("УчетСерийВПереданныхНаХранениеТоварах");
	ЗаписьXML.ЗаписатьТекст(Строка(Данные.УчетСерийВПереданныхНаХранениеТоварах));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("УчетСерийПереданныхПереработчикуТоваров");
	ЗаписьXML.ЗаписатьТекст(Строка(Данные.УчетСерийПереданныхПереработчикуТоваров));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("УчитыватьСерииТМЦВЭксплуатации");
	ЗаписьXML.ЗаписатьТекст(Строка(Данные.УчитыватьСерииТМЦВЭксплуатации));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("УчетСерийВПереданныхНаКомиссиюТоваров");
	ЗаписьXML.ЗаписатьТекст(Строка(Данные.УчетСерийВПереданныхНаКомиссиюТоваров));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
КонецПроцедуры

Процедура СерииНоменклатурыВXML(ЗаписьXML, Данные)
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("CatalogObject.СерииНоменклатуры");
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Ссылка");
	ЗаписьXML.ЗаписатьТекст(Строка(Данные.Ссылка.УникальныйИдентификатор()));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	Если ЗначениеЗаполнено(Данные.Наименование) Тогда
		ЗаписьXML.ЗаписатьНачалоЭлемента("Наименование");
		ЗаписьXML.ЗаписатьТекст(Данные.Наименование);
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЕсли;
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("ПометкаУдаления");
	ЗаписьXML.ЗаписатьТекст(Строка(Данные.ПометкаУдаления));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("ГоденДо");
	ЗаписьXML.ЗаписатьТекст(Строка(Данные.ГоденДо));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("ВидНоменклатуры");
	ЗаписьXML.ЗаписатьТекст(Строка(Данные.ВидНоменклатуры.УникальныйИдентификатор()));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Номер");
	ЗаписьXML.ЗаписатьТекст(Строка(Данные.Номер));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	Если ЗначениеЗаполнено(Данные.RFIDTID) Тогда
		ЗаписьXML.ЗаписатьНачалоЭлемента("RFIDTID");
		ЗаписьXML.ЗаписатьТекст(Строка(Данные.RFIDTID));
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Данные.RFIDUser) Тогда
		ЗаписьXML.ЗаписатьНачалоЭлемента("RFIDUser");
		ЗаписьXML.ЗаписатьТекст(Строка(Данные.RFIDUser));
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Данные.RFIDEPC) Тогда
		ЗаписьXML.ЗаписатьНачалоЭлемента("RFIDEPC");
		ЗаписьXML.ЗаписатьТекст(Строка(Данные.RFIDEPC));
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Данные.EPCGTIN) Тогда
		ЗаписьXML.ЗаписатьНачалоЭлемента("EPCGTIN");
		ЗаписьXML.ЗаписатьТекст(Строка(Данные.EPCGTIN));
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЕсли;
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("RFIDМеткаНеЧитаемая");
	ЗаписьXML.ЗаписатьТекст(Строка(Данные.RFIDМеткаНеЧитаемая));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("ДатаПроизводства");
	ЗаписьXML.ЗаписатьТекст(Строка(Данные.ДатаПроизводства));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	Если ЗначениеЗаполнено(Данные.НомерКиЗГИСМ) Тогда
		ЗаписьXML.ЗаписатьНачалоЭлемента("НомерКиЗГИСМ");
		ЗаписьXML.ЗаписатьТекст(Строка(Данные.НомерКиЗГИСМ));
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Данные.ИдентификаторПартииВЕТИС) Тогда
		ЗаписьXML.ЗаписатьНачалоЭлемента("ИдентификаторПартииВЕТИС");
		ЗаписьXML.ЗаписатьТекст(Строка(Данные.ИдентификаторПартииВЕТИС));
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Данные.МаксимальнаяРозничнаяЦенаМОТП) Тогда
		ЗаписьXML.ЗаписатьНачалоЭлемента("МаксимальнаяРозничнаяЦенаМОТП");
		ЗаписьXML.ЗаписатьТекст(Строка(Данные.МаксимальнаяРозничнаяЦенаМОТП));
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЕсли;
	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
КонецПроцедуры

Процедура ВариантыОтчетовВXML(ЗаписьXML, Данные)
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("CatalogObject.ВариантыОтчетов");
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Ссылка");
	ЗаписьXML.ЗаписатьТекст(Строка(Данные.Ссылка.УникальныйИдентификатор()));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("ПометкаУдаления");
	ЗаписьXML.ЗаписатьТекст(Строка(Данные.ПометкаУдаления));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Наименование");
	ЗаписьXML.ЗаписатьТекст(Данные.Наименование);
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
КонецПроцедуры

Процедура ДашбордыМЦПВXML(ЗаписьXML, Данные)
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("CatalogObject.ДашбордыМЦП");
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Ссылка");
	ЗаписьXML.ЗаписатьТекст(Строка(Данные.Ссылка.УникальныйИдентификатор()));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("ПометкаУдаления");
	ЗаписьXML.ЗаписатьТекст(Строка(Данные.ПометкаУдаления));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Наименование");
	ЗаписьXML.ЗаписатьТекст(Данные.Наименование);
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	Если ЗначениеЗаполнено(Данные.Автор) Тогда
		ЗаписьXML.ЗаписатьНачалоЭлемента("Автор");
		ЗаписьXML.ЗаписатьТекст(Строка(Данные.Автор.УникальныйИдентификатор()));
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЕсли;
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("ТолькоДляАвтора");
	ЗаписьXML.ЗаписатьТекст(Строка(Данные.ТолькоДляАвтора));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	Если ЗначениеЗаполнено(Данные.Иконка) Тогда
		ЗаписьXML.ЗаписатьНачалоЭлемента("Иконка");
		Иконка = СериализаторXDTO.ЗаписатьXDTO(Данные.Иконка);
		ФабрикаXDTO.ЗаписатьXML(ЗаписьXML, Иконка, "ValueStorage", "http://v8.1c.ru/8.1/data/core", , НазначениеТипаXML.Явное);
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЕсли;
	
	Если Данные.ПользователиДашборда.Количество() Тогда
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("ПользователиДашборда");
		Для Каждого СтрокаПользователи Из Данные.ПользователиДашборда Цикл
			ЗаписьXML.ЗаписатьНачалоЭлемента("ЭлементПользователиДашборда");
			
			Если ЗначениеЗаполнено(СтрокаПользователи.Пользователь) Тогда
				ЗаписьXML.ЗаписатьНачалоЭлемента("Пользователь");
				ЗаписьXML.ЗаписатьТекст(Строка(СтрокаПользователи.Пользователь.УникальныйИдентификатор()));
				ЗаписьXML.ЗаписатьКонецЭлемента();
				
				ЗаписьXML.ЗаписатьНачалоЭлемента("ТипПользователь");
				ЗаписьXML.ЗаписатьТекст(СтрокаПользователи.Пользователь.Метаданные().ПолноеИмя());
				ЗаписьXML.ЗаписатьКонецЭлемента();
			КонецЕсли;
			
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЦикла;
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЕсли;
	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
КонецПроцедуры

#КонецОбласти

#Область РегистрыСведений

Процедура ШтрихкодыНоменклатурыВXML(ЗаписьXML, Данные)
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("InformationRegisterRecordSet.ШтрихкодыНоменклатуры");

	ЗаписьXML.ЗаписатьНачалоЭлемента("ОтборШтрихкод");
	ЗаписьXML.ЗаписатьТекст(Данные.Отбор.Штрихкод.Значение);
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("ОтборНоменклатура");
	ЗаписьXML.ЗаписатьТекст(Строка(Данные.Отбор.Номенклатура.Значение.УникальныйИдентификатор()));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("ОтборХарактеристика");
	ЗаписьXML.ЗаписатьТекст(Строка(Данные.Отбор.Характеристика.Значение.УникальныйИдентификатор()));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("ОтборСерия");
	ЗаписьXML.ЗаписатьТекст(Строка(Данные.Отбор.Серия.Значение.УникальныйИдентификатор()));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("ОтборУпаковка");
	ЗаписьXML.ЗаписатьТекст(Строка(Данные.Отбор.Упаковка.Значение.УникальныйИдентификатор()));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	Если Данные.Количество() Тогда
		ЗаписьXML.ЗаписатьНачалоЭлемента("ШтрихкодыСписок");
		
		Для Каждого Штрихкод Из Данные Цикл
			ЗаписьXML.ЗаписатьНачалоЭлемента("ЭлементШтрихкоды");
			
			ЗаписьXML.ЗаписатьНачалоЭлемента("Штрихкод");
			ЗаписьXML.ЗаписатьТекст(Штрихкод.Штрихкод);
			ЗаписьXML.ЗаписатьКонецЭлемента();
			
			ЗаписьXML.ЗаписатьНачалоЭлемента("Номенклатура");
			ЗаписьXML.ЗаписатьТекст(Строка(Штрихкод.Номенклатура.УникальныйИдентификатор()));
			ЗаписьXML.ЗаписатьКонецЭлемента();
			
			ЗаписьXML.ЗаписатьНачалоЭлемента("Характеристика");
			ЗаписьXML.ЗаписатьТекст(Строка(Штрихкод.Характеристика.УникальныйИдентификатор()));
			ЗаписьXML.ЗаписатьКонецЭлемента();
			
			ЗаписьXML.ЗаписатьНачалоЭлемента("Серия");
			ЗаписьXML.ЗаписатьТекст(Строка(Штрихкод.Серия.УникальныйИдентификатор()));
			ЗаписьXML.ЗаписатьКонецЭлемента();
			
			ЗаписьXML.ЗаписатьНачалоЭлемента("Упаковка");
			ЗаписьXML.ЗаписатьТекст(Строка(Штрихкод.Упаковка.УникальныйИдентификатор()));
			ЗаписьXML.ЗаписатьКонецЭлемента();
			
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЦикла;
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЕсли;
	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
КонецПроцедуры

Процедура СнимкиОтчетовВXML(ЗаписьXML, Данные)
	
	Если Данные.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("InformationRegisterRecordSet.СнимкиОтчетов");
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Пользователь");
	ЗаписьXML.ЗаписатьТекст(Строка(Данные[0].Пользователь.УникальныйИдентификатор()));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	Если Данные[0].Отчет <> Неопределено Тогда
		ЗаписьXML.ЗаписатьНачалоЭлемента("Отчет");
		ЗаписьXML.ЗаписатьТекст(Строка(Данные[0].Отчет.УникальныйИдентификатор()));
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("ТипОтчет");
		ЗаписьXML.ЗаписатьТекст(Данные[0].Отчет.Метаданные().ПолноеИмя());
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЕсли;
	
	Если Данные[0].Вариант <> Неопределено Тогда
		ЗаписьXML.ЗаписатьНачалоЭлемента("ВариантОтчета");
		ЗаписьXML.ЗаписатьТекст(Строка(Данные[0].Вариант.УникальныйИдентификатор()));
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("ТипВариант");
		ЗаписьXML.ЗаписатьТекст(Данные[0].Вариант.Метаданные().ПолноеИмя());
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЕсли;

	ЗаписьXML.ЗаписатьНачалоЭлемента("ХешПользовательскойНастройки");
	ЗаписьXML.ЗаписатьТекст(Данные[0].ХешПользовательскойНастройки);
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	Если ЗначениеЗаполнено(Данные[0].РезультатОтчета) Тогда
		ЗаписьXML.ЗаписатьНачалоЭлемента("РезультатОтчета");
		РезультатОтчета = СериализаторXDTO.ЗаписатьXDTO(Данные[0].РезультатОтчета);
		ФабрикаXDTO.ЗаписатьXML(ЗаписьXML, РезультатОтчета, "ValueStorage", "http://v8.1c.ru/8.1/data/core", , НазначениеТипаXML.Явное);
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Данные[0].ДатаАктуальности) Тогда
		ЗаписьXML.ЗаписатьНачалоЭлемента("ДатаАктуальности");
		ЗаписьXML.ЗаписатьТекст(Строка(Данные[0].ДатаАктуальности));
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Данные[0].ДатаПоследнегоПросмотра) Тогда
		ЗаписьXML.ЗаписатьНачалоЭлемента("ДатаПоследнегоПросмотра");
		ЗаписьXML.ЗаписатьТекст(Строка(Данные[0].ДатаПоследнегоПросмотра));
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЕсли;
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("ОшибкаОбновленияОтчета");
	ЗаписьXML.ЗаписатьТекст(Строка(Данные[0].ОшибкаОбновленияОтчета));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
КонецПроцедуры

Процедура БлокировкиСкладскихЯчеекВXML(ЗаписьXML, Данные)
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("InformationRegisterRecordSet.БлокировкиСкладскихЯчеек");
	
	Если Данные.Отбор.Регистратор <> Неопределено Тогда
		ЗаписьXML.ЗаписатьНачалоЭлемента("ТипРегистратор");
		ЗаписьXML.ЗаписатьТекст(Данные.Отбор.Регистратор.Значение.Метаданные().ПолноеИмя());
		ЗаписьXML.ЗаписатьКонецЭлемента();

		ЗаписьXML.ЗаписатьНачалоЭлемента("Регистратор");
		ЗаписьXML.ЗаписатьТекст(Строка(Данные.Отбор.Регистратор.Значение.УникальныйИдентификатор()));
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЕсли;
	
	Если Данные.Количество() Тогда
		ЗаписьXML.ЗаписатьНачалоЭлемента("Блокировки");
		
		Для Каждого Блокировка Из Данные Цикл
			ЗаписьXML.ЗаписатьНачалоЭлемента("ЭлементБлокировки");
			
			ЗаписьXML.ЗаписатьНачалоЭлемента("Активность");
			ЗаписьXML.ЗаписатьТекст(Строка(Блокировка.Активность));
			ЗаписьXML.ЗаписатьКонецЭлемента();
			
			Если ЗначениеЗаполнено(Блокировка.Ячейка) Тогда
				ЗаписьXML.ЗаписатьНачалоЭлемента("Ячейка");
				ЗаписьXML.ЗаписатьТекст(Строка(Блокировка.Ячейка.УникальныйИдентификатор()));
				ЗаписьXML.ЗаписатьКонецЭлемента();
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Блокировка.ТипБлокировки) Тогда
				ЗаписьXML.ЗаписатьНачалоЭлемента("ТипБлокировки");
				ЗаписьXML.ЗаписатьТекст(XMLСтрока(Блокировка.ТипБлокировки));
				ЗаписьXML.ЗаписатьКонецЭлемента();
			КонецЕсли;
			
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЦикла;
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЕсли;
	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
КонецПроцедуры

Процедура НастройкиАдресныхСкладовВXML(ЗаписьXML, Данные)
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("InformationRegisterRecordSet.НастройкиАдресныхСкладов");

	ЗаписьXML.ЗаписатьНачалоЭлемента("Склад");
	ЗаписьXML.ЗаписатьТекст(Строка(Данные.Отбор.Склад.Значение.УникальныйИдентификатор()));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Помещение");
	ЗаписьXML.ЗаписатьТекст(Строка(Данные.Отбор.Помещение.Значение.УникальныйИдентификатор()));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	Если Данные.Количество() Тогда
		ЗаписьXML.ЗаписатьНачалоЭлемента("НастройкиСкладов");
		
		Для Каждого Настройка Из Данные Цикл
			ЗаписьXML.ЗаписатьНачалоЭлемента("ЭлементНастройкиСкладов");
			
			ЗаписьXML.ЗаписатьНачалоЭлемента("ИспользоватьАдресноеХранение");
			ЗаписьXML.ЗаписатьТекст(Строка(Настройка.ИспользоватьАдресноеХранение));
			ЗаписьXML.ЗаписатьКонецЭлемента();
			
			Если ЗначениеЗаполнено(Настройка.ДатаНачалаАдресногоХраненияОстатков) Тогда
				ЗаписьXML.ЗаписатьНачалоЭлемента("ДатаНачалаАдресногоХраненияОстатков");
				ЗаписьXML.ЗаписатьТекст(Строка(Настройка.ДатаНачалаАдресногоХраненияОстатков));
				ЗаписьXML.ЗаписатьКонецЭлемента();
			КонецЕсли;
			
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЦикла;
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЕсли;
	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
КонецПроцедуры

Процедура РазмещениеНоменклатурыПоСкладскимЯчейкамВXML(ЗаписьXML, Данные)
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("InformationRegisterRecordSet.РазмещениеНоменклатурыПоСкладскимЯчейкам");

	ЗаписьXML.ЗаписатьНачалоЭлемента("Номенклатура");
	ЗаписьXML.ЗаписатьТекст(Строка(Данные.Отбор.Номенклатура.Значение.УникальныйИдентификатор()));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Ячейка");
	ЗаписьXML.ЗаписатьТекст(Строка(Данные.Отбор.Ячейка.Значение.УникальныйИдентификатор()));
	ЗаписьXML.ЗаписатьКонецЭлемента();

	ЗаписьXML.ЗаписатьНачалоЭлемента("Склад");
	ЗаписьXML.ЗаписатьТекст(Строка(Данные.Отбор.Склад.Значение.УникальныйИдентификатор()));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Помещение");
	ЗаписьXML.ЗаписатьТекст(Строка(Данные.Отбор.Помещение.Значение.УникальныйИдентификатор()));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	Если Данные.Количество() Тогда
		ЗаписьXML.ЗаписатьНачалоЭлемента("Размещение");
		
		Для Каждого Размещение Из Данные Цикл
			ЗаписьXML.ЗаписатьНачалоЭлемента("ЭлементРазмещение");
			
			ЗаписьXML.ЗаписатьНачалоЭлемента("ОсновнаяЯчейка");
			ЗаписьXML.ЗаписатьТекст(Строка(Размещение.ОсновнаяЯчейка));
			ЗаписьXML.ЗаписатьКонецЭлемента();
			
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЦикла;
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЕсли;
	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
КонецПроцедуры

#КонецОбласти

#Область Документы

Процедура УстановкаБлокировокЯчеекВXML(ЗаписьXML, Данные)
		
	ЗаписьXML.ЗаписатьНачалоЭлемента("DocumentObject.УстановкаБлокировокЯчеек");
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Ссылка");
	ЗаписьXML.ЗаписатьТекст(Строка(Данные.Ссылка.УникальныйИдентификатор()));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	Если ЗначениеЗаполнено(Данные.Номер) Тогда
		ЗаписьXML.ЗаписатьНачалоЭлемента("Номер");
		ЗаписьXML.ЗаписатьТекст(Данные.Номер);
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЕсли;
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Дата");
	ЗаписьXML.ЗаписатьТекст(Строка(Данные.Дата));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("ПометкаУдаления");
	ЗаписьXML.ЗаписатьТекст(Строка(Данные.ПометкаУдаления));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Проведен");
	ЗаписьXML.ЗаписатьТекст(Строка(Данные.Проведен));
	ЗаписьXML.ЗаписатьКонецЭлемента();  
	
	Если ЗначениеЗаполнено(Данные.Ответственный) Тогда
		ЗаписьXML.ЗаписатьНачалоЭлемента("Ответственный");
		ЗаписьXML.ЗаписатьТекст(Строка(Данные.Ответственный.УникальныйИдентификатор()));
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЕсли;

	Если ЗначениеЗаполнено(Данные.Комментарий) Тогда
		ЗаписьXML.ЗаписатьНачалоЭлемента("Комментарий");
		ЗаписьXML.ЗаписатьТекст(Данные.Комментарий);
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЕсли;
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Склад");
	ЗаписьXML.ЗаписатьТекст(Строка(Данные.Склад.УникальныйИдентификатор()));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Помещение");
	ЗаписьXML.ЗаписатьТекст(Строка(Данные.Помещение.УникальныйИдентификатор()));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
КонецПроцедуры

Процедура ПересчетТоваровВXML(ЗаписьXML, Данные)
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("DocumentObject.ПересчетТоваров");
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Ссылка");
	ЗаписьXML.ЗаписатьТекст(Строка(Данные.Ссылка.УникальныйИдентификатор()));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	Если ЗначениеЗаполнено(Данные.Номер) Тогда
		ЗаписьXML.ЗаписатьНачалоЭлемента("Номер");
		ЗаписьXML.ЗаписатьТекст(Данные.Номер);
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЕсли;
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Дата");
	ЗаписьXML.ЗаписатьТекст(Строка(Данные.Дата));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("ПометкаУдаления");
	ЗаписьXML.ЗаписатьТекст(Строка(Данные.ПометкаУдаления));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Проведен");
	ЗаписьXML.ЗаписатьТекст(Строка(Данные.Проведен));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("ПечататьКоличествоПоУчету");
	ЗаписьXML.ЗаписатьТекст(Строка(Данные.ПечататьКоличествоПоУчету));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	Если ЗначениеЗаполнено(Данные.Исполнитель) Тогда
		ЗаписьXML.ЗаписатьНачалоЭлемента("Исполнитель");
		ЗаписьXML.ЗаписатьТекст(Строка(Данные.Исполнитель.УникальныйИдентификатор()));
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Данные.Ответственный) Тогда
		ЗаписьXML.ЗаписатьНачалоЭлемента("Ответственный");
		ЗаписьXML.ЗаписатьТекст(Строка(Данные.Ответственный.УникальныйИдентификатор()));
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЕсли;

	Если ЗначениеЗаполнено(Данные.Комментарий) Тогда
		ЗаписьXML.ЗаписатьНачалоЭлемента("Комментарий");
		ЗаписьXML.ЗаписатьТекст(Данные.Комментарий);
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЕсли;
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Склад");
	ЗаписьXML.ЗаписатьТекст(Строка(Данные.Склад.УникальныйИдентификатор()));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Помещение");
	ЗаписьXML.ЗаписатьТекст(Строка(Данные.Помещение.УникальныйИдентификатор()));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Статус");
	ЗаписьXML.ЗаписатьТекст(XMLСтрока(Данные.Статус));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	Если Данные.Товары.Количество() Тогда
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("Товары");
		Для Каждого СтрокаТовары Из Данные.Товары Цикл
			ЗаписьXML.ЗаписатьНачалоЭлемента("ЭлементТовары");
			
			Если ЗначениеЗаполнено(СтрокаТовары.Количество) Тогда
				ЗаписьXML.ЗаписатьНачалоЭлемента("Количество");
				ЗаписьXML.ЗаписатьТекст(Строка(СтрокаТовары.Количество));
				ЗаписьXML.ЗаписатьКонецЭлемента();
			КонецЕсли;
			
			Если ЗначениеЗаполнено(СтрокаТовары.КоличествоУпаковок) Тогда
				ЗаписьXML.ЗаписатьНачалоЭлемента("КоличествоУпаковок");
				ЗаписьXML.ЗаписатьТекст(Строка(СтрокаТовары.КоличествоУпаковок));
				ЗаписьXML.ЗаписатьКонецЭлемента();
			КонецЕсли;
			
			Если ЗначениеЗаполнено(СтрокаТовары.КоличествоФакт) Тогда
				ЗаписьXML.ЗаписатьНачалоЭлемента("КоличествоФакт");
				ЗаписьXML.ЗаписатьТекст(Строка(СтрокаТовары.КоличествоФакт));
				ЗаписьXML.ЗаписатьКонецЭлемента();
			КонецЕсли;
			
			Если ЗначениеЗаполнено(СтрокаТовары.КоличествоУпаковокФакт) Тогда
				ЗаписьXML.ЗаписатьНачалоЭлемента("КоличествоУпаковокФакт");
				ЗаписьXML.ЗаписатьТекст(Строка(СтрокаТовары.КоличествоУпаковокФакт));
				ЗаписьXML.ЗаписатьКонецЭлемента();
			КонецЕсли;
			
			ЗаписьXML.ЗаписатьНачалоЭлемента("Номенклатура");
			ЗаписьXML.ЗаписатьТекст(Строка(СтрокаТовары.Номенклатура.УникальныйИдентификатор()));
			ЗаписьXML.ЗаписатьКонецЭлемента();
			
			ЗаписьXML.ЗаписатьНачалоЭлемента("Упаковка");
			ЗаписьXML.ЗаписатьТекст(Строка(СтрокаТовары.Упаковка.УникальныйИдентификатор()));
			ЗаписьXML.ЗаписатьКонецЭлемента();
			
			Если ЗначениеЗаполнено(СтрокаТовары.Характеристика) Тогда
				ЗаписьXML.ЗаписатьНачалоЭлемента("Характеристика");
				ЗаписьXML.ЗаписатьТекст(Строка(СтрокаТовары.Характеристика.УникальныйИдентификатор()));
				ЗаписьXML.ЗаписатьКонецЭлемента();
			КонецЕсли;
			
			Если ЗначениеЗаполнено(СтрокаТовары.Назначение) Тогда
				ЗаписьXML.ЗаписатьНачалоЭлемента("Назначение");
				ЗаписьXML.ЗаписатьТекст(Строка(СтрокаТовары.Назначение.УникальныйИдентификатор()));
				ЗаписьXML.ЗаписатьКонецЭлемента();
			КонецЕсли;
			
			ЗаписьXML.ЗаписатьНачалоЭлемента("Ячейка");
			ЗаписьXML.ЗаписатьТекст(Строка(СтрокаТовары.Ячейка.УникальныйИдентификатор()));
			ЗаписьXML.ЗаписатьКонецЭлемента();
			
			ЗаписьXML.ЗаписатьНачалоЭлемента("ИзлишекПорча");
			ЗаписьXML.ЗаписатьТекст(Строка(СтрокаТовары.ИзлишекПорча));
			ЗаписьXML.ЗаписатьКонецЭлемента();
			
			ЗаписьXML.ЗаписатьНачалоЭлемента("Серия");
			ЗаписьXML.ЗаписатьТекст(Строка(СтрокаТовары.Серия.УникальныйИдентификатор()));
			ЗаписьXML.ЗаписатьКонецЭлемента();
			
			Если ЗначениеЗаполнено(СтрокаТовары.СтатусУказанияСерий) Тогда
				ЗаписьXML.ЗаписатьНачалоЭлемента("СтатусУказанияСерий");
				ЗаписьXML.ЗаписатьТекст(Строка(СтрокаТовары.СтатусУказанияСерий));
				ЗаписьXML.ЗаписатьКонецЭлемента();
			КонецЕсли;
			
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЦикла;
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЕсли;
	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
КонецПроцедуры

Процедура ПриходныйОрдерВXML(ЗаписьXML, Данные)
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("DocumentObject.ПриходныйОрдерНаТовары");
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Ссылка");
	ЗаписьXML.ЗаписатьТекст(Строка(Данные.Ссылка.УникальныйИдентификатор()));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	Если ЗначениеЗаполнено(Данные.Номер) Тогда
		ЗаписьXML.ЗаписатьНачалоЭлемента("Номер");
		ЗаписьXML.ЗаписатьТекст(Данные.Номер);
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЕсли;
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Дата");
	ЗаписьXML.ЗаписатьТекст(Строка(Данные.Дата));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("ПометкаУдаления");
	ЗаписьXML.ЗаписатьТекст(Строка(Данные.ПометкаУдаления));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Проведен");
	ЗаписьXML.ЗаписатьТекст(Строка(Данные.Проведен));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Склад");
	ЗаписьXML.ЗаписатьТекст(Строка(Данные.Склад.УникальныйИдентификатор()));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	Если ЗначениеЗаполнено(Данные.Исполнитель) Тогда
		ЗаписьXML.ЗаписатьНачалоЭлемента("Исполнитель");
		ЗаписьXML.ЗаписатьТекст(Строка(Данные.Исполнитель.УникальныйИдентификатор()));
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Данные.Отправитель) Тогда
		ЗаписьXML.ЗаписатьНачалоЭлемента("Отправитель");
		ЗаписьXML.ЗаписатьТекст(Строка(Данные.Отправитель.УникальныйИдентификатор()));
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("ТипОтправитель");
		ЗаписьXML.ЗаписатьТекст(Данные.Отправитель.Метаданные().ПолноеИмя());
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Данные.Распоряжение) Тогда
		ЗаписьXML.ЗаписатьНачалоЭлемента("Распоряжение");
		ЗаписьXML.ЗаписатьТекст(Строка(Данные.Распоряжение.УникальныйИдентификатор()));
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("ТипРаспоряжение");
		ЗаписьXML.ЗаписатьТекст(Данные.Распоряжение.Метаданные().ПолноеИмя());
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Данные.Комментарий) Тогда
		ЗаписьXML.ЗаписатьНачалоЭлемента("Комментарий");
		ЗаписьXML.ЗаписатьТекст(Данные.Комментарий);
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЕсли;
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Статус");
	ЗаписьXML.ЗаписатьТекст(XMLСтрока(Данные.Статус));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Помещение");
	ЗаписьXML.ЗаписатьТекст(Строка(Данные.Помещение.УникальныйИдентификатор()));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("ЗонаПриемки");
	ЗаписьXML.ЗаписатьТекст(Строка(Данные.ЗонаПриемки.УникальныйИдентификатор()));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	Если ЗначениеЗаполнено(Данные.ДатаВходящегоДокумента) Тогда
		ЗаписьXML.ЗаписатьНачалоЭлемента("ДатаВходящегоДокумента");
		ЗаписьXML.ЗаписатьТекст(Строка(Данные.ДатаВходящегоДокумента));
		ЗаписьXML.ЗаписатьКонецЭлемента(); 
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Данные.НомерВходящегоДокумента) Тогда 
		ЗаписьXML.ЗаписатьНачалоЭлемента("НомерВходящегоДокумента");
		ЗаписьXML.ЗаписатьТекст(Данные.НомерВходящегоДокумента);
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЕсли;
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("ХозяйственнаяОперация");
	ЗаписьXML.ЗаписатьТекст(XMLСтрока(Данные.ХозяйственнаяОперация));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("СкладскаяОперация");
	ЗаписьXML.ЗаписатьТекст(XMLСтрока(Данные.СкладскаяОперация));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	Если Данные.Товары.Количество() Тогда
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("Товары");
		Для Каждого СтрокаТовары Из Данные.Товары Цикл
			ЗаписьXML.ЗаписатьНачалоЭлемента("ЭлементТовары");

			ЗаписьXML.ЗаписатьНачалоЭлемента("Количество");
			ЗаписьXML.ЗаписатьТекст(Строка(СтрокаТовары.Количество));
			ЗаписьXML.ЗаписатьКонецЭлемента();
				
			ЗаписьXML.ЗаписатьНачалоЭлемента("КоличествоУпаковок");
			ЗаписьXML.ЗаписатьТекст(Строка(СтрокаТовары.КоличествоУпаковок));
			ЗаписьXML.ЗаписатьКонецЭлемента();
			
			ЗаписьXML.ЗаписатьНачалоЭлемента("Номенклатура");
			ЗаписьXML.ЗаписатьТекст(Строка(СтрокаТовары.Номенклатура.УникальныйИдентификатор()));
			ЗаписьXML.ЗаписатьКонецЭлемента();
			
			ЗаписьXML.ЗаписатьНачалоЭлемента("Упаковка");
			ЗаписьXML.ЗаписатьТекст(Строка(СтрокаТовары.Упаковка.УникальныйИдентификатор()));
			ЗаписьXML.ЗаписатьКонецЭлемента();
			
			ЗаписьXML.ЗаписатьНачалоЭлемента("Характеристика");
			ЗаписьXML.ЗаписатьТекст(Строка(СтрокаТовары.Характеристика.УникальныйИдентификатор()));
			ЗаписьXML.ЗаписатьКонецЭлемента();
			
			Если ЗначениеЗаполнено(СтрокаТовары.СтатусУказанияСерий) Тогда
				ЗаписьXML.ЗаписатьНачалоЭлемента("СтатусУказанияСерий");
				ЗаписьXML.ЗаписатьТекст(Строка(СтрокаТовары.СтатусУказанияСерий));
				ЗаписьXML.ЗаписатьКонецЭлемента();
			КонецЕсли;
			
			Если ЗначениеЗаполнено(СтрокаТовары.ДокументОтгрузки) Тогда
				ЗаписьXML.ЗаписатьНачалоЭлемента("ДокументОтгрузки");
				ЗаписьXML.ЗаписатьТекст(Строка(СтрокаТовары.ДокументОтгрузки.УникальныйИдентификатор()));
				ЗаписьXML.ЗаписатьКонецЭлемента();
				
				ЗаписьXML.ЗаписатьНачалоЭлемента("ТипДокументОтгрузки");
				ЗаписьXML.ЗаписатьТекст(СтрокаТовары.ДокументОтгрузки.Метаданные().ПолноеИмя());
				ЗаписьXML.ЗаписатьКонецЭлемента();
			КонецЕсли;
			
			Если ЗначениеЗаполнено(СтрокаТовары.Штрихкод) Тогда
				ЗаписьXML.ЗаписатьНачалоЭлемента("Штрихкод");
				ЗаписьXML.ЗаписатьТекст(Строка(СтрокаТовары.Штрихкод));
				ЗаписьXML.ЗаписатьКонецЭлемента();
			КонецЕсли;
			
			ЗаписьXML.ЗаписатьНачалоЭлемента("Серия");
			ЗаписьXML.ЗаписатьТекст(Строка(СтрокаТовары.Серия.УникальныйИдентификатор()));
			ЗаписьXML.ЗаписатьКонецЭлемента();
			
			Если ЗначениеЗаполнено(СтрокаТовары.УпаковочныйЛист) Тогда
				ЗаписьXML.ЗаписатьНачалоЭлемента("УпаковочныйЛист");
				ЗаписьXML.ЗаписатьТекст(Строка(СтрокаТовары.УпаковочныйЛист.УникальныйИдентификатор()));
				ЗаписьXML.ЗаписатьКонецЭлемента();
			КонецЕсли;
			
			Если ЗначениеЗаполнено(СтрокаТовары.УпаковочныйЛистРодитель) Тогда
				ЗаписьXML.ЗаписатьНачалоЭлемента("УпаковочныйЛистРодитель");
				ЗаписьXML.ЗаписатьТекст(Строка(СтрокаТовары.УпаковочныйЛистРодитель.УникальныйИдентификатор()));
				ЗаписьXML.ЗаписатьКонецЭлемента();
			КонецЕсли;
			
			Если ЗначениеЗаполнено(СтрокаТовары.Назначение) Тогда
				ЗаписьXML.ЗаписатьНачалоЭлемента("Назначение");
				ЗаписьXML.ЗаписатьТекст(Строка(СтрокаТовары.Назначение.УникальныйИдентификатор()));
				ЗаписьXML.ЗаписатьКонецЭлемента();
			КонецЕсли;
			
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЦикла;
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЕсли;
	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
КонецПроцедуры

Процедура РасходныйОрдерВXML(ЗаписьXML, Данные)
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("DocumentObject.РасходныйОрдерНаТовары");
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Ссылка");
	ЗаписьXML.ЗаписатьТекст(Строка(Данные.Ссылка.УникальныйИдентификатор()));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	Если ЗначениеЗаполнено(Данные.Номер) Тогда
		ЗаписьXML.ЗаписатьНачалоЭлемента("Номер");
		ЗаписьXML.ЗаписатьТекст(Данные.Номер);
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЕсли;
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Дата");
	ЗаписьXML.ЗаписатьТекст(Строка(Данные.Дата));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("ДатаОтгрузки");
	ЗаписьXML.ЗаписатьТекст(Строка(Данные.ДатаОтгрузки));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("ПометкаУдаления");
	ЗаписьXML.ЗаписатьТекст(Строка(Данные.ПометкаУдаления));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Проведен");
	ЗаписьXML.ЗаписатьТекст(Строка(Данные.Проведен));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("ЗонаОтгрузки");
	ЗаписьXML.ЗаписатьТекст(Строка(Данные.ЗонаОтгрузки.УникальныйИдентификатор()));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	Если ЗначениеЗаполнено(Данные.Комментарий) Тогда
		ЗаписьXML.ЗаписатьНачалоЭлемента("Комментарий");
		ЗаписьXML.ЗаписатьТекст(Данные.Комментарий);
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Данные.Ответственный) Тогда
		ЗаписьXML.ЗаписатьНачалоЭлемента("Ответственный");
		ЗаписьXML.ЗаписатьТекст(Строка(Данные.Ответственный.УникальныйИдентификатор()));
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Данные.Контролер) Тогда
		ЗаписьXML.ЗаписатьНачалоЭлемента("Контролер");
		ЗаписьXML.ЗаписатьТекст(Строка(Данные.Контролер.УникальныйИдентификатор()));
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Данные.Отгрузил) Тогда
		ЗаписьXML.ЗаписатьНачалоЭлемента("Отгрузил");
		ЗаписьXML.ЗаписатьТекст(Строка(Данные.Отгрузил.УникальныйИдентификатор()));
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЕсли;
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Помещение");
	ЗаписьXML.ЗаписатьТекст(Строка(Данные.Помещение.УникальныйИдентификатор()));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Склад");
	ЗаписьXML.ЗаписатьТекст(Строка(Данные.Склад.УникальныйИдентификатор()));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	Если ЗначениеЗаполнено(Данные.Получатель) Тогда
		ЗаписьXML.ЗаписатьНачалоЭлемента("Получатель");
		ЗаписьXML.ЗаписатьТекст(Строка(Данные.Получатель.УникальныйИдентификатор()));
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("ТипПолучатель");
		ЗаписьXML.ЗаписатьТекст(Данные.Получатель.Метаданные().ПолноеИмя());
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЕсли;
		
	ЗаписьXML.ЗаписатьНачалоЭлемента("Статус");
	ЗаписьXML.ЗаписатьТекст(XMLСтрока(Данные.Статус));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	Если Данные.ТоварыПоРаспоряжениям.Количество() Тогда
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("ТоварыПоРаспоряжениям");
		Для Каждого СтрокаТовары Из Данные.ТоварыПоРаспоряжениям Цикл
			ЗаписьXML.ЗаписатьНачалоЭлемента("ЭлементТоварыПоРаспоряжениям");

			ЗаписьXML.ЗаписатьНачалоЭлемента("Номенклатура");
			ЗаписьXML.ЗаписатьТекст(Строка(СтрокаТовары.Номенклатура.УникальныйИдентификатор()));
			ЗаписьXML.ЗаписатьКонецЭлемента();
			
			ЗаписьXML.ЗаписатьНачалоЭлемента("Характеристика");
			ЗаписьXML.ЗаписатьТекст(Строка(СтрокаТовары.Характеристика.УникальныйИдентификатор()));
			ЗаписьXML.ЗаписатьКонецЭлемента();
			
			Если ЗначениеЗаполнено(СтрокаТовары.Назначение) Тогда
				ЗаписьXML.ЗаписатьНачалоЭлемента("Назначение");
				ЗаписьXML.ЗаписатьТекст(Строка(СтрокаТовары.Назначение.УникальныйИдентификатор()));
				ЗаписьXML.ЗаписатьКонецЭлемента();
			КонецЕсли;
			
			ЗаписьXML.ЗаписатьНачалоЭлемента("Серия");
			ЗаписьXML.ЗаписатьТекст(Строка(СтрокаТовары.Серия.УникальныйИдентификатор()));
			ЗаписьXML.ЗаписатьКонецЭлемента();
			
			Если ЗначениеЗаполнено(СтрокаТовары.СтатусУказанияСерий) Тогда
				ЗаписьXML.ЗаписатьНачалоЭлемента("СтатусУказанияСерий");
				ЗаписьXML.ЗаписатьТекст(Строка(СтрокаТовары.СтатусУказанияСерий));
				ЗаписьXML.ЗаписатьКонецЭлемента();
			КонецЕсли;
			
			Если ЗначениеЗаполнено(СтрокаТовары.Распоряжение) Тогда
				ЗаписьXML.ЗаписатьНачалоЭлемента("ТипРаспоряжение");
				ЗаписьXML.ЗаписатьТекст(СтрокаТовары.Распоряжение.Метаданные().ПолноеИмя());
				ЗаписьXML.ЗаписатьКонецЭлемента();
				
				ЗаписьXML.ЗаписатьНачалоЭлемента("Распоряжение");
				ЗаписьXML.ЗаписатьТекст(Строка(СтрокаТовары.Распоряжение.УникальныйИдентификатор()));
				ЗаписьXML.ЗаписатьКонецЭлемента();
			КонецЕсли;
			
			ЗаписьXML.ЗаписатьНачалоЭлемента("Количество");
			ЗаписьXML.ЗаписатьТекст(Строка(СтрокаТовары.Количество));
			ЗаписьXML.ЗаписатьКонецЭлемента();
			
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЦикла;
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЕсли;
	
	Если Данные.ОтгружаемыеТовары.Количество() Тогда
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("ОтгружаемыеТовары");
		Для Каждого СтрокаТовары Из Данные.ОтгружаемыеТовары Цикл
			ЗаписьXML.ЗаписатьНачалоЭлемента("ЭлементОтгружаемыеТовары");

			ЗаписьXML.ЗаписатьНачалоЭлемента("Номенклатура");
			ЗаписьXML.ЗаписатьТекст(Строка(СтрокаТовары.Номенклатура.УникальныйИдентификатор()));
			ЗаписьXML.ЗаписатьКонецЭлемента();
			
			ЗаписьXML.ЗаписатьНачалоЭлемента("Характеристика");
			ЗаписьXML.ЗаписатьТекст(Строка(СтрокаТовары.Характеристика.УникальныйИдентификатор()));
			ЗаписьXML.ЗаписатьКонецЭлемента();
			
			Если ЗначениеЗаполнено(СтрокаТовары.Назначение) Тогда
				ЗаписьXML.ЗаписатьНачалоЭлемента("Назначение");
				ЗаписьXML.ЗаписатьТекст(Строка(СтрокаТовары.Назначение.УникальныйИдентификатор()));
				ЗаписьXML.ЗаписатьКонецЭлемента();
			КонецЕсли;
			
			ЗаписьXML.ЗаписатьНачалоЭлемента("Серия");
			ЗаписьXML.ЗаписатьТекст(Строка(СтрокаТовары.Серия.УникальныйИдентификатор()));
			ЗаписьXML.ЗаписатьКонецЭлемента();
			
			Если ЗначениеЗаполнено(СтрокаТовары.СтатусУказанияСерий) Тогда
				ЗаписьXML.ЗаписатьНачалоЭлемента("СтатусУказанияСерий");
				ЗаписьXML.ЗаписатьТекст(Строка(СтрокаТовары.СтатусУказанияСерий));
				ЗаписьXML.ЗаписатьКонецЭлемента();
			КонецЕсли;
			
			ЗаписьXML.ЗаписатьНачалоЭлемента("ЭтоУпаковочныйЛист");
			ЗаписьXML.ЗаписатьТекст(Строка(СтрокаТовары.ЭтоУпаковочныйЛист));
			ЗаписьXML.ЗаписатьКонецЭлемента();
			
			Если ЗначениеЗаполнено(СтрокаТовары.ЭтоСлужебнаяСтрокаПустогоУпаковочногоЛиста) Тогда
				ЗаписьXML.ЗаписатьНачалоЭлемента("ЭтоСлужебнаяСтрокаПустогоУпаковочногоЛиста");
				ЗаписьXML.ЗаписатьТекст(Строка(СтрокаТовары.ЭтоСлужебнаяСтрокаПустогоУпаковочногоЛиста));
				ЗаписьXML.ЗаписатьКонецЭлемента();
			КонецЕсли;
			
			Если ЗначениеЗаполнено(СтрокаТовары.УпаковочныйЛистРодитель) Тогда
				ЗаписьXML.ЗаписатьНачалоЭлемента("УпаковочныйЛистРодитель");
				ЗаписьXML.ЗаписатьТекст(Строка(СтрокаТовары.УпаковочныйЛистРодитель.УникальныйИдентификатор()));
				ЗаписьXML.ЗаписатьКонецЭлемента();
			КонецЕсли;
			
			Если ЗначениеЗаполнено(СтрокаТовары.УпаковочныйЛист) Тогда
				ЗаписьXML.ЗаписатьНачалоЭлемента("УпаковочныйЛист");
				ЗаписьXML.ЗаписатьТекст(Строка(СтрокаТовары.УпаковочныйЛист.УникальныйИдентификатор()));
				ЗаписьXML.ЗаписатьКонецЭлемента();
			КонецЕсли;
			
			ЗаписьXML.ЗаписатьНачалоЭлемента("Упаковка");
			ЗаписьXML.ЗаписатьТекст(Строка(СтрокаТовары.Упаковка.УникальныйИдентификатор()));
			ЗаписьXML.ЗаписатьКонецЭлемента();
			
			ЗаписьXML.ЗаписатьНачалоЭлемента("Количество");
			ЗаписьXML.ЗаписатьТекст(Строка(СтрокаТовары.Количество));
			ЗаписьXML.ЗаписатьКонецЭлемента();
			
			ЗаписьXML.ЗаписатьНачалоЭлемента("КоличествоУпаковок");
			ЗаписьXML.ЗаписатьТекст(Строка(СтрокаТовары.КоличествоУпаковок));
			ЗаписьXML.ЗаписатьКонецЭлемента();
			
			ЗаписьXML.ЗаписатьНачалоЭлемента("Действие");
			ЗаписьXML.ЗаписатьТекст(XMLСтрока(СтрокаТовары.Действие));
			ЗаписьXML.ЗаписатьКонецЭлемента();
			
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЦикла;
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЕсли;
	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
КонецПроцедуры

Процедура ОтборРазмещениеТоваровВXML(ЗаписьXML, Данные)
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("DocumentObject.ОтборРазмещениеТоваров");
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Ссылка");
	ЗаписьXML.ЗаписатьТекст(Строка(Данные.Ссылка.УникальныйИдентификатор()));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	Если ЗначениеЗаполнено(Данные.Номер) Тогда
		ЗаписьXML.ЗаписатьНачалоЭлемента("Номер");
		ЗаписьXML.ЗаписатьТекст(Данные.Номер);
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЕсли;
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Дата");
	ЗаписьXML.ЗаписатьТекст(Строка(Данные.Дата));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("ПометкаУдаления");
	ЗаписьXML.ЗаписатьТекст(Строка(Данные.ПометкаУдаления));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Проведен");
	ЗаписьXML.ЗаписатьТекст(Строка(Данные.Проведен));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("ВидОперации");
	ЗаписьXML.ЗаписатьТекст(XMLСтрока(Данные.ВидОперации));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("ЗонаОтгрузки");
	ЗаписьXML.ЗаписатьТекст(Строка(Данные.ЗонаОтгрузки.УникальныйИдентификатор()));
	ЗаписьXML.ЗаписатьКонецЭлемента();

	ЗаписьXML.ЗаписатьНачалоЭлемента("ЗонаПриемки");
	ЗаписьXML.ЗаписатьТекст(Строка(Данные.ЗонаПриемки.УникальныйИдентификатор()));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	Если ЗначениеЗаполнено(Данные.Исполнитель) Тогда
		ЗаписьXML.ЗаписатьНачалоЭлемента("Исполнитель");
		ЗаписьXML.ЗаписатьТекст(Строка(Данные.Исполнитель.УникальныйИдентификатор()));
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Данные.Распоряжение) Тогда
		ЗаписьXML.ЗаписатьНачалоЭлемента("Распоряжение");
		ЗаписьXML.ЗаписатьТекст(Строка(Данные.Распоряжение.УникальныйИдентификатор()));
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("ТипРаспоряжение");
		ЗаписьXML.ЗаписатьТекст(Данные.Распоряжение.Метаданные().ПолноеИмя());
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Данные.Комментарий) Тогда
		ЗаписьXML.ЗаписатьНачалоЭлемента("Комментарий");
		ЗаписьXML.ЗаписатьТекст(Данные.Комментарий);
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЕсли;
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Склад");
	ЗаписьXML.ЗаписатьТекст(Строка(Данные.Склад.УникальныйИдентификатор()));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Помещение");
	ЗаписьXML.ЗаписатьТекст(Строка(Данные.Помещение.УникальныйИдентификатор()));
	ЗаписьXML.ЗаписатьКонецЭлемента();

	ЗаписьXML.ЗаписатьНачалоЭлемента("Статус");
	ЗаписьXML.ЗаписатьТекст(XMLСтрока(Данные.Статус));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	Если ЗначениеЗаполнено(Данные.ОбъемРазмещение) Тогда
		ЗаписьXML.ЗаписатьНачалоЭлемента("ОбъемРазмещение");
		ЗаписьXML.ЗаписатьТекст(Строка(Данные.ОбъемРазмещение));
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(Данные.ВесРазмещение) Тогда
		ЗаписьXML.ЗаписатьНачалоЭлемента("ВесРазмещение");
		ЗаписьXML.ЗаписатьТекст(Строка(Данные.ВесРазмещение));
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЕсли;
	
	Если Данные.ТоварыОтбор.Количество() Тогда
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("ТоварыОтбор");
		Для Каждого СтрокаТоварыОтбор Из Данные.ТоварыОтбор Цикл
			ЗаписьXML.ЗаписатьНачалоЭлемента("ЭлементТоварыОтбор");

			ЗаписьXML.ЗаписатьНачалоЭлемента("Количество");
			ЗаписьXML.ЗаписатьТекст(Строка(СтрокаТоварыОтбор.Количество));
			ЗаписьXML.ЗаписатьКонецЭлемента();
			
			Если ЗначениеЗаполнено(СтрокаТоварыОтбор.КоличествоОтобрано) Тогда
				ЗаписьXML.ЗаписатьНачалоЭлемента("КоличествоОтобрано");
				ЗаписьXML.ЗаписатьТекст(Строка(СтрокаТоварыОтбор.КоличествоОтобрано));
				ЗаписьXML.ЗаписатьКонецЭлемента();
			КонецЕсли;
				
			ЗаписьXML.ЗаписатьНачалоЭлемента("КоличествоУпаковок");
			ЗаписьXML.ЗаписатьТекст(Строка(СтрокаТоварыОтбор.КоличествоУпаковок));
			ЗаписьXML.ЗаписатьКонецЭлемента();
			
			Если ЗначениеЗаполнено(СтрокаТоварыОтбор.КоличествоУпаковокОтобрано) Тогда
				ЗаписьXML.ЗаписатьНачалоЭлемента("КоличествоУпаковокОтобрано");
				ЗаписьXML.ЗаписатьТекст(Строка(СтрокаТоварыОтбор.КоличествоУпаковокОтобрано));
				ЗаписьXML.ЗаписатьКонецЭлемента();
			КонецЕсли;
			
			ЗаписьXML.ЗаписатьНачалоЭлемента("Номенклатура");
			ЗаписьXML.ЗаписатьТекст(Строка(СтрокаТоварыОтбор.Номенклатура.УникальныйИдентификатор()));
			ЗаписьXML.ЗаписатьКонецЭлемента();
			
			ЗаписьXML.ЗаписатьНачалоЭлемента("Упаковка");
			ЗаписьXML.ЗаписатьТекст(Строка(СтрокаТоварыОтбор.Упаковка.УникальныйИдентификатор()));
			ЗаписьXML.ЗаписатьКонецЭлемента();
			
			ЗаписьXML.ЗаписатьНачалоЭлемента("Характеристика");
			ЗаписьXML.ЗаписатьТекст(Строка(СтрокаТоварыОтбор.Характеристика.УникальныйИдентификатор()));
			ЗаписьXML.ЗаписатьКонецЭлемента();
			
			ЗаписьXML.ЗаписатьНачалоЭлемента("Ячейка");
			ЗаписьXML.ЗаписатьТекст(Строка(СтрокаТоварыОтбор.Ячейка.УникальныйИдентификатор()));
			ЗаписьXML.ЗаписатьКонецЭлемента();
			
			Если ЗначениеЗаполнено(СтрокаТоварыОтбор.Назначение) Тогда
				ЗаписьXML.ЗаписатьНачалоЭлемента("Назначение");
				ЗаписьXML.ЗаписатьТекст(Строка(СтрокаТоварыОтбор.Назначение.УникальныйИдентификатор()));
				ЗаписьXML.ЗаписатьКонецЭлемента();
			КонецЕсли;
			
			ЗаписьXML.ЗаписатьНачалоЭлемента("Серия");
			ЗаписьXML.ЗаписатьТекст(Строка(СтрокаТоварыОтбор.Серия.УникальныйИдентификатор()));
			ЗаписьXML.ЗаписатьКонецЭлемента();
			
			Если ЗначениеЗаполнено(СтрокаТоварыОтбор.СтатусУказанияСерий) Тогда
				ЗаписьXML.ЗаписатьНачалоЭлемента("СтатусУказанияСерий");
				ЗаписьXML.ЗаписатьТекст(Строка(СтрокаТоварыОтбор.СтатусУказанияСерий));
				ЗаписьXML.ЗаписатьКонецЭлемента();
			КонецЕсли;
			
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЦикла;
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЕсли;
	
	Если Данные.ТоварыРазмещение.Количество() Тогда
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("ТоварыРазмещение");
		Для Каждого СтрокаТоварыРазмещение Из Данные.ТоварыРазмещение Цикл
			ЗаписьXML.ЗаписатьНачалоЭлемента("ЭлементТоварыРазмещение");

			ЗаписьXML.ЗаписатьНачалоЭлемента("Количество");
			ЗаписьXML.ЗаписатьТекст(Строка(СтрокаТоварыРазмещение.Количество));
			ЗаписьXML.ЗаписатьКонецЭлемента();
			
			Если ЗначениеЗаполнено(СтрокаТоварыРазмещение.КоличествоРазмещено) Тогда
				ЗаписьXML.ЗаписатьНачалоЭлемента("КоличествоРазмещено");
				ЗаписьXML.ЗаписатьТекст(Строка(СтрокаТоварыРазмещение.КоличествоРазмещено));
				ЗаписьXML.ЗаписатьКонецЭлемента();
			КонецЕсли;
			
			ЗаписьXML.ЗаписатьНачалоЭлемента("КоличествоУпаковок");
			ЗаписьXML.ЗаписатьТекст(Строка(СтрокаТоварыРазмещение.КоличествоУпаковок));
			ЗаписьXML.ЗаписатьКонецЭлемента();
			
			Если ЗначениеЗаполнено(СтрокаТоварыРазмещение.КоличествоУпаковокРазмещено) Тогда
				ЗаписьXML.ЗаписатьНачалоЭлемента("КоличествоУпаковокРазмещено");
				ЗаписьXML.ЗаписатьТекст(Строка(СтрокаТоварыРазмещение.КоличествоУпаковокРазмещено));
				ЗаписьXML.ЗаписатьКонецЭлемента();
			КонецЕсли;
			
			ЗаписьXML.ЗаписатьНачалоЭлемента("Номенклатура");
			ЗаписьXML.ЗаписатьТекст(Строка(СтрокаТоварыРазмещение.Номенклатура.УникальныйИдентификатор()));
			ЗаписьXML.ЗаписатьКонецЭлемента();
			
			ЗаписьXML.ЗаписатьНачалоЭлемента("Упаковка");
			ЗаписьXML.ЗаписатьТекст(Строка(СтрокаТоварыРазмещение.Упаковка.УникальныйИдентификатор()));
			ЗаписьXML.ЗаписатьКонецЭлемента();
			
			ЗаписьXML.ЗаписатьНачалоЭлемента("Характеристика");
			ЗаписьXML.ЗаписатьТекст(Строка(СтрокаТоварыРазмещение.Характеристика.УникальныйИдентификатор()));
			ЗаписьXML.ЗаписатьКонецЭлемента();
			
			ЗаписьXML.ЗаписатьНачалоЭлемента("Ячейка");
			ЗаписьXML.ЗаписатьТекст(Строка(СтрокаТоварыРазмещение.Ячейка.УникальныйИдентификатор()));
			ЗаписьXML.ЗаписатьКонецЭлемента();
			
			Если ЗначениеЗаполнено(СтрокаТоварыРазмещение.Назначение) Тогда
				ЗаписьXML.ЗаписатьНачалоЭлемента("Назначение");
				ЗаписьXML.ЗаписатьТекст(Строка(СтрокаТоварыРазмещение.Назначение.УникальныйИдентификатор()));
				ЗаписьXML.ЗаписатьКонецЭлемента();
			КонецЕсли;
			
			ЗаписьXML.ЗаписатьНачалоЭлемента("Серия");
			ЗаписьXML.ЗаписатьТекст(Строка(СтрокаТоварыРазмещение.Серия.УникальныйИдентификатор()));
			ЗаписьXML.ЗаписатьКонецЭлемента();
			
			Если ЗначениеЗаполнено(СтрокаТоварыРазмещение.СтатусУказанияСерий) Тогда
				ЗаписьXML.ЗаписатьНачалоЭлемента("СтатусУказанияСерий");
				ЗаписьXML.ЗаписатьТекст(Строка(СтрокаТоварыРазмещение.СтатусУказанияСерий));
				ЗаписьXML.ЗаписатьКонецЭлемента();
			КонецЕсли;
			
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЦикла;
		ЗаписьXML.ЗаписатьКонецЭлемента(); 
	КонецЕсли;
	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
КонецПроцедуры

Процедура ЗаказПоставщикуВXML(ЗаписьXML, Данные)
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("DocumentObject.ЗаказПоставщику");
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Ссылка");
	ЗаписьXML.ЗаписатьТекст(Строка(Данные.Ссылка.УникальныйИдентификатор()));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	Если ЗначениеЗаполнено(Данные.Номер) Тогда
		ЗаписьXML.ЗаписатьНачалоЭлемента("Номер");
		ЗаписьXML.ЗаписатьТекст(Данные.Номер);
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЕсли;
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Дата");
	ЗаписьXML.ЗаписатьТекст(Строка(Данные.Дата));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("ПометкаУдаления");
	ЗаписьXML.ЗаписатьТекст(Строка(Данные.ПометкаУдаления));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Проведен");
	ЗаписьXML.ЗаписатьТекст(Строка(Данные.Проведен));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Организация");
	ЗаписьXML.ЗаписатьТекст(Строка(Данные.Организация.УникальныйИдентификатор()));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	Если ЗначениеЗаполнено(Данные.Менеджер) Тогда
		ЗаписьXML.ЗаписатьНачалоЭлемента("Менеджер");
		ЗаписьXML.ЗаписатьТекст(Строка(Данные.Менеджер.УникальныйИдентификатор()));
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЕсли;
	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
КонецПроцедуры

Процедура КорректировкаПоОрдеруВXML(ЗаписьXML, Данные)
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("DocumentObject.КорректировкаПоОрдеруНаТовары");
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Ссылка");
	ЗаписьXML.ЗаписатьТекст(Строка(Данные.Ссылка.УникальныйИдентификатор()));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	Если ЗначениеЗаполнено(Данные.Номер) Тогда
		ЗаписьXML.ЗаписатьНачалоЭлемента("Номер");
		ЗаписьXML.ЗаписатьТекст(Данные.Номер);
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЕсли;
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Дата");
	ЗаписьXML.ЗаписатьТекст(Строка(Данные.Дата));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("ПометкаУдаления");
	ЗаписьXML.ЗаписатьТекст(Строка(Данные.ПометкаУдаления));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Проведен");
	ЗаписьXML.ЗаписатьТекст(Строка(Данные.Проведен));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("ЗонаОтгрузки");
	ЗаписьXML.ЗаписатьТекст(Строка(Данные.ЗонаОтгрузки.УникальныйИдентификатор()));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	Если ЗначениеЗаполнено(Данные.Ответственный) Тогда
		ЗаписьXML.ЗаписатьНачалоЭлемента("Ответственный");
		ЗаписьXML.ЗаписатьТекст(Строка(Данные.Ответственный.УникальныйИдентификатор()));
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЕсли;
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Помещение");
	ЗаписьXML.ЗаписатьТекст(Строка(Данные.Помещение.УникальныйИдентификатор()));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Склад");
	ЗаписьXML.ЗаписатьТекст(Строка(Данные.Склад.УникальныйИдентификатор()));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	Если ЗначениеЗаполнено(Данные.Ордер) Тогда
		ЗаписьXML.ЗаписатьНачалоЭлемента("Ордер");
		ЗаписьXML.ЗаписатьТекст(Строка(Данные.Ордер.УникальныйИдентификатор()));
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("ТипОрдер");
		ЗаписьXML.ЗаписатьТекст(Данные.Ордер.Метаданные().ПолноеИмя());
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Данные.ОрдерПолучатель) Тогда
		ЗаписьXML.ЗаписатьНачалоЭлемента("ОрдерПолучатель");
		ЗаписьXML.ЗаписатьТекст(Строка(Данные.ОрдерПолучатель.УникальныйИдентификатор()));
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("ТипОрдерПолучатель");
		ЗаписьXML.ЗаписатьТекст(Данные.ОрдерПолучатель.Метаданные().ПолноеИмя());
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЕсли;
	
	Если Данные.Товары.Количество() Тогда
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("Товары");
		Для Каждого СтрокаТовары Из Данные.Товары Цикл
			ЗаписьXML.ЗаписатьНачалоЭлемента("ЭлементТовары");

			ЗаписьXML.ЗаписатьНачалоЭлемента("Количество");
			ЗаписьXML.ЗаписатьТекст(Строка(СтрокаТовары.Количество));
			ЗаписьXML.ЗаписатьКонецЭлемента();
			
			ЗаписьXML.ЗаписатьНачалоЭлемента("Номенклатура");
			ЗаписьXML.ЗаписатьТекст(Строка(СтрокаТовары.Номенклатура.УникальныйИдентификатор()));
			ЗаписьXML.ЗаписатьКонецЭлемента();
			
			ЗаписьXML.ЗаписатьНачалоЭлемента("Характеристика");
			ЗаписьXML.ЗаписатьТекст(Строка(СтрокаТовары.Характеристика.УникальныйИдентификатор()));
			ЗаписьXML.ЗаписатьКонецЭлемента();
			
			ЗаписьXML.ЗаписатьНачалоЭлемента("Серия");
			ЗаписьXML.ЗаписатьТекст(Строка(СтрокаТовары.Серия.УникальныйИдентификатор()));
			ЗаписьXML.ЗаписатьКонецЭлемента();
			
			Если ЗначениеЗаполнено(СтрокаТовары.Назначение) Тогда
				ЗаписьXML.ЗаписатьНачалоЭлемента("Назначение");
				ЗаписьXML.ЗаписатьТекст(Строка(СтрокаТовары.Назначение.УникальныйИдентификатор()));
				ЗаписьXML.ЗаписатьКонецЭлемента();
			КонецЕсли;
			
			ЗаписьXML.ЗаписатьНачалоЭлемента("Упаковка");
			ЗаписьXML.ЗаписатьТекст(Строка(СтрокаТовары.Упаковка.УникальныйИдентификатор()));
			ЗаписьXML.ЗаписатьКонецЭлемента();
				
			ЗаписьXML.ЗаписатьНачалоЭлемента("КоличествоУпаковок");
			ЗаписьXML.ЗаписатьТекст(Строка(СтрокаТовары.КоличествоУпаковок));
			ЗаписьXML.ЗаписатьКонецЭлемента();
			
			ЗаписьXML.ЗаписатьНачалоЭлемента("ВидОперации");
			ЗаписьXML.ЗаписатьТекст(XMLСтрока(СтрокаТовары.ВидОперации));
			ЗаписьXML.ЗаписатьКонецЭлемента();
			
			Если ЗначениеЗаполнено(СтрокаТовары.СтатусУказанияСерий) Тогда
				ЗаписьXML.ЗаписатьНачалоЭлемента("СтатусУказанияСерий");
				ЗаписьXML.ЗаписатьТекст(Строка(СтрокаТовары.СтатусУказанияСерий));
				ЗаписьXML.ЗаписатьКонецЭлемента();
			КонецЕсли;
			
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЦикла;
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЕсли;
	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
КонецПроцедуры

Процедура ПрочиеДокументыВXML(ЗаписьXML, Данные)
	
	ИмяОбъекта = СтрРазделить(Данные.Ссылка.Метаданные().ПолноеИмя(), ".");
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("DocumentObject." + ИмяОбъекта[1]);
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Ссылка");
	ЗаписьXML.ЗаписатьТекст(Строка(Данные.Ссылка.УникальныйИдентификатор()));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	Если ЗначениеЗаполнено(Данные.Номер) Тогда
		ЗаписьXML.ЗаписатьНачалоЭлемента("Номер");
		ЗаписьXML.ЗаписатьТекст(Данные.Номер);
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЕсли;
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Дата");
	ЗаписьXML.ЗаписатьТекст(Строка(Данные.Дата));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("ПометкаУдаления");
	ЗаписьXML.ЗаписатьТекст(Строка(Данные.ПометкаУдаления));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Проведен");
	ЗаписьXML.ЗаписатьТекст(Строка(Данные.Проведен));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ЗагрузкаДанных

Функция КонстантыИзXML(ЧтениеXML)
	
	ИмяОбъекта = СтрРазделить(ЧтениеXML.Имя, ".");
	
	ОбъектXDTO = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML);
	
	Тип = МобильноеРабочееМестоКладовщика.МенеджерОбъектаПоПолномуИмени("Константа." + ИмяОбъекта[1]);
	ТипЗначения = ОбъектXDTO.ТипЗначения;
	Если ТипЗначения = "Число" Тогда
		Тип.Установить(Число(ОбъектXDTO.ЗначениеКонстанты));
	ИначеЕсли ТипЗначения = "Дата" Тогда
		Тип.Установить(Дата(ОбъектXDTO.ЗначениеКонстанты));
	ИначеЕсли ТипЗначения = "Булево" Тогда
		Тип.Установить(Булево(ОбъектXDTO.ЗначениеКонстанты));
	ИначеЕсли ТипЗначения = "Строка" Тогда
		Если ТипЗнч(ОбъектXDTO.ЗначениеКонстанты) = Тип("ОбъектXDTO") Тогда
			Тип.Установить("");
		Иначе
			Тип.Установить(Строка(ОбъектXDTO.ЗначениеКонстанты));
		КонецЕсли;
	ИначеЕсли СтрРазделить(ТипЗначения, ".")[0] = "Перечисление" Тогда
		Если ТипЗнч(ОбъектXDTO.ЗначениеКонстанты) = Тип("Строка") Тогда
			ТипЗначения = МобильноеРабочееМестоКладовщика.МенеджерОбъектаПоПолномуИмени(ТипЗначения);
			Тип.Установить(ТипЗначения[ОбъектXDTO.ЗначениеКонстанты]);
		КонецЕсли;
	Иначе
		ТипЗначения = МобильноеРабочееМестоКладовщика.МенеджерОбъектаПоПолномуИмени(ТипЗначения);
		Тип.Установить(ТипЗначения.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.ЗначениеКонстанты)));
	КонецЕсли;
	
	Возврат НеОпределено;
	
КонецФункции

#Область Справочники

Функция ПрочиеСправочникиИзXML(ЧтениеXML)
	
	ИмяОбъекта = СтрРазделить(ЧтениеXML.Имя, ".");
	ОбъектXDTO = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML); // ОбъектXDTO
	
	Тип = МобильноеРабочееМестоКладовщика.МенеджерОбъектаПоПолномуИмени("Справочник." + ИмяОбъекта[1]);
	ДанныеСсылка = Тип.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.Ссылка));
	Данные = ДанныеСсылка.ПолучитьОбъект();
	
	Если Данные = Неопределено Тогда
		Данные = Тип.СоздатьЭлемент();
		Данные.УстановитьСсылкуНового(ДанныеСсылка);
	Иначе
		Данные = ДанныеСсылка.ПолучитьОбъект();
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(Данные, ОбъектXDTO);
	
	Если ОбъектXDTO.Свойства().Получить("Организация") <> Неопределено Тогда
		Данные.Организация = Справочники.Организации.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.Организация));
	КонецЕсли;
	
	Возврат Данные;
	
КонецФункции

Функция УпаковкиЕдиницыИзмеренияИзXML(ЧтениеXML)
	
	ОбъектXDTO = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML);
	
	ДанныеСсылка = Справочники.УпаковкиЕдиницыИзмерения.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.Ссылка));
	Данные = ДанныеСсылка.ПолучитьОбъект();
	
	Если Данные = Неопределено Тогда
		Данные = Справочники.УпаковкиЕдиницыИзмерения.СоздатьЭлемент();
		Данные.УстановитьСсылкуНового(ДанныеСсылка);
	Иначе
		Данные = ДанныеСсылка.ПолучитьОбъект();
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(Данные, ОбъектXDTO);
	
	Если ОбъектXDTO.Свойства().Получить("Владелец") <> Неопределено Тогда
		ТипВладелец = ОбъектXDTO.ТипВладелец;
		Тип = МобильноеРабочееМестоКладовщика.МенеджерОбъектаПоПолномуИмени(ТипВладелец);
		Данные.Владелец = Тип.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.Владелец));
	КонецЕсли;
	
	Данные.Родитель = Справочники.УпаковкиЕдиницыИзмерения.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.Родитель));
	
	Данные.Безразмерная = Булево(ОбъектXDTO.Безразмерная);
	Если ОбъектXDTO.Свойства().Получить("Вес") <> Неопределено Тогда
		Данные.Вес = Число(ОбъектXDTO.Вес);
	КонецЕсли;
	Если ОбъектXDTO.Свойства().Получить("ВесЕдиницаИзмерения") <> Неопределено Тогда
		Данные.ВесЕдиницаИзмерения = Справочники.УпаковкиЕдиницыИзмерения.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.ВесЕдиницаИзмерения));
	КонецЕсли;
	Если ОбъектXDTO.Свойства().Получить("Высота") <> Неопределено Тогда
		Данные.Высота = Число(ОбъектXDTO.Высота);
	КонецЕсли;
	Если ОбъектXDTO.Свойства().Получить("ВысотаЕдиницаИзмерения") <> Неопределено Тогда
		Данные.ВысотаЕдиницаИзмерения = Справочники.УпаковкиЕдиницыИзмерения.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.ВысотаЕдиницаИзмерения));
	КонецЕсли;
	Если ОбъектXDTO.Свойства().Получить("Глубина") <> Неопределено Тогда
		Данные.Глубина = Число(ОбъектXDTO.Глубина);
	КонецЕсли;
	Если ОбъектXDTO.Свойства().Получить("ГлубинаЕдиницаИзмерения") <> Неопределено Тогда
		Данные.ГлубинаЕдиницаИзмерения = Справочники.УпаковкиЕдиницыИзмерения.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.ГлубинаЕдиницаИзмерения));
	КонецЕсли;
	Данные.ЕдиницаИзмерения = Справочники.УпаковкиЕдиницыИзмерения.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.ЕдиницаИзмерения));
	Данные.Числитель = Число(ОбъектXDTO.Числитель);
	Данные.Знаменатель = Число(ОбъектXDTO.Знаменатель);
	
	Если ОбъектXDTO.Свойства().Получить("ЛинейныеРазмерыПредставление") <> Неопределено Тогда
		Если ТипЗнч(ОбъектXDTO.ЛинейныеРазмерыПредставление) = Тип("ОбъектXDTO") Тогда
			Данные.ЛинейныеРазмерыПредставление = "";
		Иначе
			Данные.ЛинейныеРазмерыПредставление = Строка(ОбъектXDTO.ЛинейныеРазмерыПредставление);
		КонецЕсли;
	КонецЕсли;
	
	Если ОбъектXDTO.Свойства().Получить("Объем") <> Неопределено Тогда
		Данные.Объем = Число(ОбъектXDTO.Объем);
	КонецЕсли;
	Если ОбъектXDTO.Свойства().Получить("ОбъемЕдиницаИзмерения") <> Неопределено Тогда
		Данные.ОбъемЕдиницаИзмерения = Справочники.УпаковкиЕдиницыИзмерения.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.ОбъемЕдиницаИзмерения));
	КонецЕсли;
	Если ОбъектXDTO.Свойства().Получить("СкладскаяГруппа") <> Неопределено Тогда
		Данные.СкладскаяГруппа = Справочники.СкладскиеГруппыУпаковок.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.СкладскаяГруппа));
	КонецЕсли;
	Если ОбъектXDTO.Свойства().Получить("Типоразмер") <> Неопределено Тогда
		Данные.Типоразмер = Справочники.ТипоразмерыУпаковок.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.Типоразмер));
	КонецЕсли;
	Если ОбъектXDTO.Свойства().Получить("Ширина") <> Неопределено Тогда
		Данные.Ширина = Число(ОбъектXDTO.Ширина);
	КонецЕсли;
	Если ОбъектXDTO.Свойства().Получить("ШиринаЕдиницаИзмерения") <> Неопределено Тогда
		Данные.ШиринаЕдиницаИзмерения = Справочники.УпаковкиЕдиницыИзмерения.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.ШиринаЕдиницаИзмерения));
	КонецЕсли;
	Данные.КоличествоУпаковок = Число(ОбъектXDTO.КоличествоУпаковок);
	Данные.ПоставляетсяВМногооборотнойТаре = Булево(ОбъектXDTO.ПоставляетсяВМногооборотнойТаре);
	Данные.НоменклатураМногооборотнаяТара = Справочники.Номенклатура.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.НоменклатураМногооборотнаяТара));
	Данные.ХарактеристикаМногооборотнаяТара = Справочники.ХарактеристикиНоменклатуры.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.ХарактеристикаМногооборотнаяТара));
	Если ОбъектXDTO.Свойства().Получить("МинимальноеКоличествоУпаковокМногооборотнойТары") <> Неопределено Тогда
		Данные.МинимальноеКоличествоУпаковокМногооборотнойТары = Число(ОбъектXDTO.МинимальноеКоличествоУпаковокМногооборотнойТары);
	КонецЕсли;
	
	Если ОбъектXDTO.Свойства().Получить("ТипИзмеряемойВеличины") <> Неопределено Тогда
		Если ТипЗнч(ОбъектXDTO.ТипИзмеряемойВеличины) = Тип("Строка") Тогда
			Данные.ТипИзмеряемойВеличины = Перечисления.ТипыИзмеряемыхВеличин[ОбъектXDTO.ТипИзмеряемойВеличины];
		КонецЕсли;
	КонецЕсли;
	
	Если ОбъектXDTO.Свойства().Получить("НаименованиеПолное") <> Неопределено Тогда
		Если ТипЗнч(ОбъектXDTO.НаименованиеПолное) = Тип("ОбъектXDTO") Тогда
			Данные.НаименованиеПолное = "";
		Иначе
			Данные.НаименованиеПолное = Строка(ОбъектXDTO.НаименованиеПолное);
		КонецЕсли;
	КонецЕсли;
	
	Если ОбъектXDTO.Свойства().Получить("МеждународноеСокращение") <> Неопределено Тогда
		Если ТипЗнч(ОбъектXDTO.МеждународноеСокращение) = Тип("ОбъектXDTO") Тогда
			Данные.МеждународноеСокращение = "";
		Иначе
			Данные.МеждународноеСокращение = Строка(ОбъектXDTO.МеждународноеСокращение);
		КонецЕсли;
	КонецЕсли;
	
	Если ТипЗнч(ОбъектXDTO.ТипУпаковки) = Тип("Строка") Тогда
		Данные.ТипУпаковки = Перечисления.ТипыУпаковокНоменклатуры[ОбъектXDTO.ТипУпаковки];
	КонецЕсли;
	
	Если ОбъектXDTO.Свойства().Получить("НаименованиеЯзык1") <> Неопределено Тогда
		Если ТипЗнч(ОбъектXDTO.НаименованиеЯзык1) = Тип("ОбъектXDTO") Тогда
			Данные.НаименованиеЯзык1 = "";
		Иначе
			Данные.НаименованиеЯзык1 = Строка(ОбъектXDTO.НаименованиеЯзык1);
		КонецЕсли;
	КонецЕсли;
	
	Если ОбъектXDTO.Свойства().Получить("НаименованиеЯзык2") <> Неопределено Тогда
		Если ТипЗнч(ОбъектXDTO.НаименованиеЯзык2) = Тип("ОбъектXDTO") Тогда
			Данные.НаименованиеЯзык2 = "";
		Иначе
			Данные.НаименованиеЯзык2 = Строка(ОбъектXDTO.НаименованиеЯзык2);
		КонецЕсли;
	КонецЕсли;
	
	Возврат Данные;
	
КонецФункции

Функция НаборыУпаковокИзXML(ЧтениеXML)
	
	ОбъектXDTO = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML); // ОбъектXDTO
	
	ДанныеСсылка = Справочники.НаборыУпаковок.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.Ссылка));
	Данные = ДанныеСсылка.ПолучитьОбъект();
	
	Если Данные = Неопределено Тогда
		Данные = Справочники.НаборыУпаковок.СоздатьЭлемент();
		Данные.УстановитьСсылкуНового(ДанныеСсылка);
	Иначе
		Данные = ДанныеСсылка.ПолучитьОбъект();
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(Данные, ОбъектXDTO);
	
	Данные.ЕдиницаИзмерения = Справочники.УпаковкиЕдиницыИзмерения.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.ЕдиницаИзмерения));
	Если ОбъектXDTO.Свойства().Получить("ЕдиницаДляОтчетов") <> Неопределено Тогда
		Данные.ЕдиницаДляОтчетов = Справочники.УпаковкиЕдиницыИзмерения.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.ЕдиницаДляОтчетов));
	КонецЕсли;
	Если ОбъектXDTO.Свойства().Получить("КоэффициентЕдиницыДляОтчетов") <> Неопределено Тогда
		Данные.КоэффициентЕдиницыДляОтчетов = Число(ОбъектXDTO.КоэффициентЕдиницыДляОтчетов);
	КонецЕсли;
	
	Возврат Данные;
	
КонецФункции

Функция НоменклатураИзXML(ЧтениеXML)
	
	ОбъектXDTO = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML);
	ЭтоГруппа = Булево(ОбъектXDTO.ЭтоГруппа);
	
	ДанныеСсылка = Справочники.Номенклатура.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.Ссылка));
	Данные = ДанныеСсылка.ПолучитьОбъект();
	
	Если Данные = Неопределено И ЭтоГруппа Тогда
		Данные = Справочники.Номенклатура.СоздатьГруппу();
		Данные.УстановитьСсылкуНового(ДанныеСсылка);
	ИначеЕсли Данные = Неопределено И НЕ ЭтоГруппа Тогда
		Данные = Справочники.Номенклатура.СоздатьЭлемент();
		Данные.УстановитьСсылкуНового(ДанныеСсылка);
	Иначе
		Данные = ДанныеСсылка.ПолучитьОбъект();
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(Данные, ОбъектXDTO);
	
	Если ОбъектXDTO.Свойства().Получить("Родитель") <> Неопределено Тогда
		Данные.Родитель = Справочники.Номенклатура.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.Родитель));
	КонецЕсли;
	
	Если ЭтоГруппа Тогда
		Возврат Данные;
	КонецЕсли;
	
	Данные.ЕдиницаИзмерения = Справочники.УпаковкиЕдиницыИзмерения.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.ЕдиницаИзмерения));
	Данные.ВидНоменклатуры = Справочники.ВидыНоменклатуры.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.ВидНоменклатуры));
	Данные.НаборУпаковок = Справочники.НаборыУпаковок.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.НаборУпаковок));
	Если ОбъектXDTO.Свойства().Получить("ОсобенностьУчета") <> Неопределено Тогда
		Если ТипЗнч(ОбъектXDTO.ОсобенностьУчета) = Тип("Строка") Тогда
			Данные.ОсобенностьУчета = Перечисления.ОсобенностиУчетаНоменклатуры[ОбъектXDTO.ОсобенностьУчета];
		КонецЕсли;
	КонецЕсли;
	Если ТипЗнч(ОбъектXDTO.ТипНоменклатуры) = Тип("Строка") Тогда
		Данные.ТипНоменклатуры = Перечисления.ТипыНоменклатуры[ОбъектXDTO.ТипНоменклатуры];
	КонецЕсли;
	Если ТипЗнч(ОбъектXDTO.ИспользованиеХарактеристик) = Тип("Строка") Тогда
		Данные.ИспользованиеХарактеристик = Перечисления.ВариантыИспользованияХарактеристикНоменклатуры[ОбъектXDTO.ИспользованиеХарактеристик];
	КонецЕсли;
	
	Данные.ВесИспользовать = Булево(ОбъектXDTO.ВесИспользовать);
	Данные.ВесМожноУказыватьВДокументах = Булево(ОбъектXDTO.ВесМожноУказыватьВДокументах);
	Если ОбъектXDTO.Свойства().Получить("ВесЕдиницаИзмерения") <> Неопределено Тогда
		Данные.ВесЕдиницаИзмерения = Справочники.УпаковкиЕдиницыИзмерения.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.ВесЕдиницаИзмерения));
	КонецЕсли;
	Данные.ВесЧислитель = Число(ОбъектXDTO.ВесЧислитель);
	Данные.ВесЗнаменатель = Число(ОбъектXDTO.ВесЗнаменатель);
	
	Данные.ПлощадьИспользовать = Булево(ОбъектXDTO.ПлощадьИспользовать);
	Данные.ПлощадьМожноУказыватьВДокументах = Булево(ОбъектXDTO.ПлощадьМожноУказыватьВДокументах);
	Если ОбъектXDTO.Свойства().Получить("ПлощадьЕдиницаИзмерения") <> Неопределено Тогда
		Данные.ПлощадьЕдиницаИзмерения = Справочники.УпаковкиЕдиницыИзмерения.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.ПлощадьЕдиницаИзмерения));
	КонецЕсли;
	Данные.ПлощадьЧислитель = Число(ОбъектXDTO.ПлощадьЧислитель);
	Данные.ПлощадьЗнаменатель = Число(ОбъектXDTO.ПлощадьЗнаменатель);
	
	Данные.ОбъемИспользовать = Булево(ОбъектXDTO.ОбъемИспользовать);
	Данные.ОбъемМожноУказыватьВДокументах = Булево(ОбъектXDTO.ОбъемМожноУказыватьВДокументах);
	Если ОбъектXDTO.Свойства().Получить("ОбъемЕдиницаИзмерения") <> Неопределено Тогда
		Данные.ОбъемЕдиницаИзмерения = Справочники.УпаковкиЕдиницыИзмерения.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.ОбъемЕдиницаИзмерения));
	КонецЕсли;
	Данные.ОбъемЧислитель = Число(ОбъектXDTO.ОбъемЧислитель);
	Данные.ОбъемЗнаменатель = Число(ОбъектXDTO.ОбъемЗнаменатель);
	
	Данные.ДлинаИспользовать = Булево(ОбъектXDTO.ДлинаИспользовать);
	Данные.ДлинаМожноУказыватьВДокументах = Булево(ОбъектXDTO.ДлинаМожноУказыватьВДокументах);
	Если ОбъектXDTO.Свойства().Получить("ДлинаЕдиницаИзмерения") <> Неопределено Тогда
		Данные.ДлинаЕдиницаИзмерения = Справочники.УпаковкиЕдиницыИзмерения.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.ДлинаЕдиницаИзмерения));
	КонецЕсли;
	Данные.ДлинаЧислитель = Число(ОбъектXDTO.ДлинаЧислитель);
	Данные.ДлинаЗнаменатель = Число(ОбъектXDTO.ДлинаЗнаменатель);
	
	Данные.ИспользоватьУпаковки = Булево(ОбъектXDTO.ИспользоватьУпаковки);
	
	Если ОбъектXDTO.Свойства().Получить("Артикул") <> Неопределено Тогда
		Если ТипЗнч(ОбъектXDTO.Артикул) = Тип("ОбъектXDTO") Тогда
			Данные.Артикул = "";
		Иначе
			Данные.Артикул = Строка(ОбъектXDTO.Артикул);
		КонецЕсли;
	КонецЕсли;
	
	Если ОбъектXDTO.Свойства().Получить("КодДляПоиска") <> Неопределено Тогда
		Если ТипЗнч(ОбъектXDTO.КодДляПоиска) = Тип("ОбъектXDTO") Тогда
			Данные.КодДляПоиска = "";
		Иначе
			Данные.КодДляПоиска = Строка(ОбъектXDTO.КодДляПоиска);
		КонецЕсли;
	КонецЕсли;
	
	Если ОбъектXDTO.Свойства().Получить("КодПоКВПД") <> Неопределено Тогда
		Если ТипЗнч(ОбъектXDTO.КодПоКВПД) = Тип("ОбъектXDTO") Тогда
			Данные.КодПоКВПД = "";
		Иначе
			Данные.КодПоКВПД = Строка(ОбъектXDTO.КодПоКВПД);
		КонецЕсли;
	КонецЕсли;
	
	Если ОбъектXDTO.Свойства().Получить("НаименованиеПолное") <> Неопределено Тогда
		Если ТипЗнч(ОбъектXDTO.НаименованиеПолное) = Тип("ОбъектXDTO") Тогда
			Данные.НаименованиеПолное = "";
		Иначе
			Данные.НаименованиеПолное = Строка(ОбъектXDTO.НаименованиеПолное);
		КонецЕсли;
	КонецЕсли;
	
	Если ТипЗнч(ОбъектXDTO.ЕдиницаИзмеренияСрокаГодности) = Тип("Строка") Тогда
		Данные.ЕдиницаИзмеренияСрокаГодности = Перечисления.ЕдиницыИзмеренияВремени[ОбъектXDTO.ЕдиницаИзмеренияСрокаГодности];
	КонецЕсли;
	
	Если ОбъектXDTO.Свойства().Получить("СрокГодности") <> Неопределено Тогда
		Данные.СрокГодности = Число(ОбъектXDTO.СрокГодности);
	КонецЕсли;
	Если ОбъектXDTO.Свойства().Получить("ВладелецХарактеристик") <> Неопределено Тогда
		Данные.ВладелецХарактеристик = Справочники.ВидыНоменклатуры.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.ВладелецХарактеристик));
	КонецЕсли;
	
	Возврат Данные;
	
КонецФункции

Функция ПользователиИзXML(ЧтениеXML)
	
	ОбъектXDTO = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML); // ОбъектXDTO
	
	ДанныеСсылка = Справочники.Пользователи.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.Ссылка));
	Данные = ДанныеСсылка.ПолучитьОбъект();
	
	Если Данные = Неопределено Тогда
		Данные = Справочники.Пользователи.СоздатьЭлемент();
		Данные.УстановитьСсылкуНового(ДанныеСсылка);
	Иначе
		Данные = ДанныеСсылка.ПолучитьОбъект();
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(Данные, ОбъектXDTO);
	Данные.Служебный = Булево(ОбъектXDTO.Служебный);
	Если ОбъектXDTO.Свойства().Получить("ИдентификаторПользователяИБ") <> Неопределено Тогда
		Данные.ИдентификаторПользователяИБ = Новый УникальныйИдентификатор(ОбъектXDTO.ИдентификаторПользователяИБ);
	КонецЕсли;
	
	Возврат Данные;
	
КонецФункции

Функция ПартнерыИзXML(ЧтениеXML)
	
	ОбъектXDTO = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML); // ОбъектXDTO
	
	ДанныеСсылка = Справочники.Партнеры.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.Ссылка));
	Данные = ДанныеСсылка.ПолучитьОбъект();
	
	Если Данные = Неопределено Тогда
		Данные = Справочники.Партнеры.СоздатьЭлемент();
		Данные.УстановитьСсылкуНового(ДанныеСсылка);
	Иначе
		Данные = ДанныеСсылка.ПолучитьОбъект();
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(Данные, ОбъектXDTO);
	
	Данные.Клиент = Булево(ОбъектXDTO.Клиент);
	Данные.Поставщик = Булево(ОбъектXDTO.Поставщик);
	Если ТипЗнч(ОбъектXDTO.НаименованиеПолное) = Тип("ОбъектXDTO") Тогда
		Данные.НаименованиеПолное = "";
	Иначе
		Данные.НаименованиеПолное = Строка(ОбъектXDTO.НаименованиеПолное);
	КонецЕсли;
	
	Возврат Данные;
	
КонецФункции

Функция ИдентификаторыОбъектовМетаданныхИзXML(ЧтениеXML)
	
	ОбъектXDTO = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML); // ОбъектXDTO
	
	ДанныеСсылка = Справочники.ИдентификаторыОбъектовМетаданных.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.Ссылка));
	Данные = ДанныеСсылка.ПолучитьОбъект();
	
	Если Данные = Неопределено Тогда
		Данные = Справочники.ИдентификаторыОбъектовМетаданных.СоздатьЭлемент();
		Данные.УстановитьСсылкуНового(ДанныеСсылка);
	Иначе
		Данные = ДанныеСсылка.ПолучитьОбъект();
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(Данные, ОбъектXDTO);
	
	Если ОбъектXDTO.Свойства().Получить("ПолноеИмя") <> Неопределено Тогда
		Если ТипЗнч(ОбъектXDTO.ПолноеИмя) = Тип("ОбъектXDTO") Тогда
			Данные.ПолноеИмя = "";
		Иначе
			Данные.ПолноеИмя = Строка(ОбъектXDTO.ПолноеИмя);
		КонецЕсли;
	КонецЕсли;
	
	Возврат Данные;
	
КонецФункции

Функция СкладыИзXML(ЧтениеXML)
	
	ОбъектXDTO = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML);
	ЭтоГруппа = Булево(ОбъектXDTO.ЭтоГруппа);
	
	ДанныеСсылка = Справочники.Склады.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.Ссылка));
	Данные = ДанныеСсылка.ПолучитьОбъект();
	
	Если Данные = Неопределено И ЭтоГруппа Тогда
		Данные = Справочники.Склады.СоздатьГруппу();
		Данные.УстановитьСсылкуНового(ДанныеСсылка);
	ИначеЕсли Данные = Неопределено И НЕ ЭтоГруппа Тогда
		Данные = Справочники.Склады.СоздатьЭлемент();
		Данные.УстановитьСсылкуНового(ДанныеСсылка);
	Иначе
		Данные = ДанныеСсылка.ПолучитьОбъект();
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(Данные, ОбъектXDTO);
	
	Если ОбъектXDTO.Свойства().Получить("Родитель") <> Неопределено Тогда
		Данные.Родитель = Справочники.Склады.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.Родитель));
	КонецЕсли;
	
	Если ЭтоГруппа Тогда
		Возврат Данные;
	КонецЕсли;
	
	Данные.ИспользоватьАдресноеХранение                          = Булево(ОбъектXDTO.ИспользоватьАдресноеХранение);
	Данные.ИспользоватьАдресноеХранениеСправочно                 = Булево(ОбъектXDTO.ИспользоватьАдресноеХранениеСправочно);
	Данные.ИспользоватьОрдернуюСхемуПриОтгрузке                  = Булево(ОбъектXDTO.ИспользоватьОрдернуюСхемуПриОтгрузке);
	Данные.ИспользоватьОрдернуюСхемуПриОтраженииИзлишковНедостач = Булево(ОбъектXDTO.ИспользоватьОрдернуюСхемуПриОтраженииИзлишковНедостач);
	Данные.ИспользоватьОрдернуюСхемуПриПоступлении               = Булево(ОбъектXDTO.ИспользоватьОрдернуюСхемуПриПоступлении);
	Данные.ИспользоватьСерииНоменклатуры                         = Булево(ОбъектXDTO.ИспользоватьСерииНоменклатуры);
	Данные.ИспользоватьСкладскиеПомещения                        = Булево(ОбъектXDTO.ИспользоватьСкладскиеПомещения);
	Данные.ИспользоватьСтатусыПриходныхОрдеров                   = Булево(ОбъектXDTO.ИспользоватьСтатусыПриходныхОрдеров);
	Данные.ИспользоватьСтатусыРасходныхОрдеров                   = Булево(ОбъектXDTO.ИспользоватьСтатусыРасходныхОрдеров);
	Данные.УчитыватьСебестоимостьПоСериям                        = Булево(ОбъектXDTO.УчитыватьСебестоимостьПоСериям);
	
	Если ОбъектXDTO.Свойства().Получить("ДатаНачалаИспользованияСкладскихПомещений") <> Неопределено Тогда
		Данные.ДатаНачалаИспользованияСкладскихПомещений = Дата(ОбъектXDTO.ДатаНачалаИспользованияСкладскихПомещений);
	КонецЕсли;

	Возврат Данные;
	
КонецФункции

Функция СкладскиеПомещенияИзXML(ЧтениеXML)
	
	ОбъектXDTO = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML);
	
	ДанныеСсылка = Справочники.СкладскиеПомещения.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.Ссылка));
	Данные = ДанныеСсылка.ПолучитьОбъект();
	
	Если Данные = Неопределено Тогда
		Данные = Справочники.СкладскиеПомещения.СоздатьЭлемент();
		Данные.УстановитьСсылкуНового(ДанныеСсылка);
	Иначе
		Данные = ДанныеСсылка.ПолучитьОбъект();
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(Данные, ОбъектXDTO);
	
	Данные.ИспользоватьАдресноеХранение = Булево(ОбъектXDTO.ИспользоватьАдресноеХранение);
	Данные.ИспользоватьАдресноеХранениеСправочно = Булево(ОбъектXDTO.ИспользоватьАдресноеХранениеСправочно);
	
	Данные.Владелец = Справочники.Склады.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.Владелец));
	
	Возврат Данные;
	
КонецФункции

Функция НазначенияИзXML(ЧтениеXML)
	
	ОбъектXDTO = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML); // ОбъектXDTO
	
	ДанныеСсылка = Справочники.Назначения.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.Ссылка));
	Данные = ДанныеСсылка.ПолучитьОбъект();
	
	Если Данные = Неопределено Тогда
		Данные = Справочники.Назначения.СоздатьЭлемент();
		Данные.УстановитьСсылкуНового(ДанныеСсылка);
	Иначе
		Данные = ДанныеСсылка.ПолучитьОбъект();
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(Данные, ОбъектXDTO);
	
	Данные.КонтролироватьТолькоНаличие = Булево(ОбъектXDTO.КонтролироватьТолькоНаличие);
	Данные.УчитыватьСтавкиНДС = Булево(ОбъектXDTO.УчитыватьСтавкиНДС);
	
	Возврат Данные;
	
КонецФункции

Функция СкладскиеЯчейкиИзXML(ЧтениеXML)
	
	ОбъектXDTO = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML);
	ЭтоГруппа = Булево(ОбъектXDTO.ЭтоГруппа);
	
	ДанныеСсылка = Справочники.СкладскиеЯчейки.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.Ссылка));
	Данные = ДанныеСсылка.ПолучитьОбъект();
	
	Если Данные = Неопределено И ЭтоГруппа Тогда
		Данные = Справочники.СкладскиеЯчейки.СоздатьГруппу();
		Данные.УстановитьСсылкуНового(ДанныеСсылка);
	ИначеЕсли Данные = Неопределено И НЕ ЭтоГруппа Тогда
		Данные = Справочники.СкладскиеЯчейки.СоздатьЭлемент();
		Данные.УстановитьСсылкуНового(ДанныеСсылка);
	Иначе
		Данные = ДанныеСсылка.ПолучитьОбъект();
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(Данные, ОбъектXDTO);
	
	Если ОбъектXDTO.Свойства().Получить("Родитель") <> Неопределено Тогда
		Данные.Родитель = Справочники.СкладскиеЯчейки.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.Родитель));
	КонецЕсли;
	Данные.Владелец = Справочники.Склады.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.Владелец));
	
	Если ЭтоГруппа Тогда
		Возврат Данные;
	КонецЕсли;
	
	Данные.Помещение = Справочники.СкладскиеПомещения.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.Помещение));
	Если ТипЗнч(ОбъектXDTO.ТипСкладскойЯчейки) = Тип("Строка") Тогда
		Данные.ТипСкладскойЯчейки = Перечисления.ТипыСкладскихЯчеек[ОбъектXDTO.ТипСкладскойЯчейки];
	КонецЕсли;
	
	Возврат Данные;
	
КонецФункции

Функция ХарактеристикиНоменклатурыИзXML(ЧтениеXML)
	
	ОбъектXDTO = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML);
	
	ДанныеСсылка = Справочники.ХарактеристикиНоменклатуры.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.Ссылка));
	Данные = ДанныеСсылка.ПолучитьОбъект();
	
	Если Данные = Неопределено Тогда
		Данные = Справочники.ХарактеристикиНоменклатуры.СоздатьЭлемент();
		Данные.УстановитьСсылкуНового(ДанныеСсылка);
	Иначе
		Данные = ДанныеСсылка.ПолучитьОбъект();
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(Данные, ОбъектXDTO);
	
	Если ОбъектXDTO.Свойства().Получить("Принципал") <> Неопределено Тогда
		ТипПринципал = ОбъектXDTO.ТипПринципал;
		Тип = МобильноеРабочееМестоКладовщика.МенеджерОбъектаПоПолномуИмени(ТипПринципал);
		Данные.Принципал = Тип.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.Принципал));
	КонецЕсли;
	
	Если ОбъектXDTO.Свойства().Получить("Контрагент") <> Неопределено Тогда
		ТипКонтрагент = ОбъектXDTO.ТипКонтрагент;
		Тип = МобильноеРабочееМестоКладовщика.МенеджерОбъектаПоПолномуИмени(ТипКонтрагент);
		Данные.Контрагент = Тип.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.Контрагент));
	КонецЕсли;
	
	Если ОбъектXDTO.Свойства().Получить("Владелец") <> Неопределено Тогда
		ТипВладелец = ОбъектXDTO.ТипВладелец;
		Тип = МобильноеРабочееМестоКладовщика.МенеджерОбъектаПоПолномуИмени(ТипВладелец);
		Данные.Владелец = Тип.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.Владелец));
	КонецЕсли;
	
	Если ОбъектXDTO.Свойства().Получить("НаименованиеПолное") <> Неопределено Тогда
		Если ТипЗнч(ОбъектXDTO.НаименованиеПолное) = Тип("ОбъектXDTO") Тогда
			Данные.НаименованиеПолное = "";
		Иначе
			Данные.НаименованиеПолное = Строка(ОбъектXDTO.НаименованиеПолное);
		КонецЕсли;
	КонецЕсли;
	
	Данные.ПометкаУдаления = Булево(ОбъектXDTO.ПометкаУдаления);
	
	Возврат Данные;
	
КонецФункции

Функция ВариантыКомплектацииНоменклатурыИзXML(ЧтениеXML)
	
	ОбъектXDTO = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML);
	
	ДанныеСсылка = Справочники.ВариантыКомплектацииНоменклатуры.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.Ссылка));
	Данные = ДанныеСсылка.ПолучитьОбъект();
	
	Если Данные = Неопределено Тогда
		Данные = Справочники.ВариантыКомплектацииНоменклатуры.СоздатьЭлемент();
		Данные.УстановитьСсылкуНового(ДанныеСсылка);
	Иначе
		Данные = ДанныеСсылка.ПолучитьОбъект();
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(Данные, ОбъектXDTO);
	
	Данные.Владелец = Справочники.Номенклатура.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.Владелец));
	
	Если ОбъектXDTO.Свойства().Получить("Характеристика") <> Неопределено Тогда
		Данные.Характеристика = Справочники.ХарактеристикиНоменклатуры.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.Характеристика));
	КонецЕсли;
	
	Данные.Основной = Булево(ОбъектXDTO.Основной);
	Данные.СодержитТовары = Булево(ОбъектXDTO.СодержитТовары);
	Данные.СодержитУслуги = Булево(ОбъектXDTO.СодержитУслуги);
	
	Если ОбъектXDTO.Свойства().Получить("ВариантРасчетаЦеныНабора") <> Неопределено Тогда
		Если ТипЗнч(ОбъектXDTO.ВариантРасчетаЦеныНабора) = Тип("Строка") Тогда
			Данные.ВариантРасчетаЦеныНабора = Перечисления.ВариантыРасчетаЦенНаборов[ОбъектXDTO.ВариантРасчетаЦеныНабора];
		КонецЕсли;
	КонецЕсли;
	
	Возврат Данные;
	
КонецФункции

Функция ВидыНоменклатурыИзXML(ЧтениеXML)
	
	ОбъектXDTO = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML);
	ЭтоГруппа = Булево(ОбъектXDTO.ЭтоГруппа);
	
	ДанныеСсылка = Справочники.ВидыНоменклатуры.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.Ссылка));
	Данные = ДанныеСсылка.ПолучитьОбъект();
	
	Если Данные = Неопределено И ЭтоГруппа Тогда
		Данные = Справочники.ВидыНоменклатуры.СоздатьГруппу();
		Данные.УстановитьСсылкуНового(ДанныеСсылка);
	ИначеЕсли Данные = Неопределено И НЕ ЭтоГруппа Тогда
		Данные = Справочники.ВидыНоменклатуры.СоздатьЭлемент();
		Данные.УстановитьСсылкуНового(ДанныеСсылка);
	Иначе
		Данные = ДанныеСсылка.ПолучитьОбъект();
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(Данные, ОбъектXDTO);
	
	Если ОбъектXDTO.Свойства().Получить("Родитель") <> Неопределено Тогда
		Данные.Родитель = Справочники.ВидыНоменклатуры.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.Родитель));
	КонецЕсли;
	
	Если ЭтоГруппа Тогда
		Возврат Данные;
	КонецЕсли;
	
	Данные.ИспользоватьНомерСерии = Булево(ОбъектXDTO.ИспользоватьНомерСерии);
	Данные.ИспользоватьСрокГодностиСерии = Булево(ОбъектXDTO.ИспользоватьСрокГодностиСерии);
	Данные.ИспользоватьRFIDМеткиСерии = Булево(ОбъектXDTO.ИспользоватьRFIDМеткиСерии);
	Данные.ИспользоватьДатуПроизводстваСерии = Булево(ОбъектXDTO.ИспользоватьДатуПроизводстваСерии);
	Данные.ИспользоватьНомерКИЗГИСМСерии = Булево(ОбъектXDTO.ИспользоватьНомерКИЗГИСМСерии);
	Данные.ИспользоватьПроизводителяЕГАИССерии = Булево(ОбъектXDTO.ИспользоватьПроизводителяЕГАИССерии);
	Данные.ИспользоватьСправку2ЕГАИССерии = Булево(ОбъектXDTO.ИспользоватьСправку2ЕГАИССерии);
	Данные.ИспользоватьПроизводителяВЕТИССерии = Булево(ОбъектXDTO.ИспользоватьПроизводителяВЕТИССерии);
	Данные.ИспользоватьЗаписьСкладскогоЖурналаВЕТИССерии = Булево(ОбъектXDTO.ИспользоватьЗаписьСкладскогоЖурналаВЕТИССерии);
	Данные.ИспользоватьИдентификаторПартииВЕТИССерии = Булево(ОбъектXDTO.ИспользоватьИдентификаторПартииВЕТИССерии);
	Данные.ИспользоватьМРЦМОТПСерии = Булево(ОбъектXDTO.ИспользоватьМРЦМОТПСерии);
	Данные.ИспользоватьСерии = Булево(ОбъектXDTO.ИспользоватьСерии);
	
	Если ОбъектXDTO.Свойства().Получить("ОсобенностьУчета") <> Неопределено Тогда
		Если ТипЗнч(ОбъектXDTO.ОсобенностьУчета) = Тип("Строка") Тогда
			Данные.ОсобенностьУчета = Перечисления.ОсобенностиУчетаНоменклатуры[ОбъектXDTO.ОсобенностьУчета];
		КонецЕсли;
	КонецЕсли;
	
	Если ТипЗнч(ОбъектXDTO.НастройкаИспользованияСерий) = Тип("Строка") Тогда
		Данные.НастройкаИспользованияСерий = Перечисления.НастройкиИспользованияСерийНоменклатуры[ОбъектXDTO.НастройкаИспользованияСерий];
	КонецЕсли;
	
	Данные.АвтоматическиГенерироватьСерии = Булево(ОбъектXDTO.АвтоматическиГенерироватьСерии);
	Данные.ВладелецСерий = Справочники.ВидыНоменклатуры.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.ВладелецСерий));
	Данные.НастройкиСерийБерутсяИзДругогоВидаНоменклатуры = Булево(ОбъектXDTO.НастройкиСерийБерутсяИзДругогоВидаНоменклатуры);
	
	Если ОбъектXDTO.Свойства().Получить("ШаблонЭтикеткиСерии") <> Неопределено Тогда
		Данные.ШаблонЭтикеткиСерии = Справочники.ШаблоныЭтикетокИЦенников.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.ШаблонЭтикеткиСерии));
	КонецЕсли;
	
	Если ОбъектXDTO.Свойства().Получить("ШаблонРабочегоНаименованияСерии") <> Неопределено Тогда
		Если ТипЗнч(ОбъектXDTO.ШаблонРабочегоНаименованияСерии) = Тип("ОбъектXDTO") Тогда
			Данные.ШаблонРабочегоНаименованияСерии = "";
		Иначе
			Данные.ШаблонРабочегоНаименованияСерии = Строка(ОбъектXDTO.ШаблонРабочегоНаименованияСерии);
		КонецЕсли;
	КонецЕсли;
	
	Если ОбъектXDTO.Свойства().Получить("ЕдиницаИзмеренияСрокаГодности") <> Неопределено Тогда
		Если ТипЗнч(ОбъектXDTO.ЕдиницаИзмеренияСрокаГодности) = Тип("Строка") Тогда
			Данные.ЕдиницаИзмеренияСрокаГодности = Перечисления.ЕдиницыИзмеренияВремени[ОбъектXDTO.ЕдиницаИзмеренияСрокаГодности];
		КонецЕсли;
	КонецЕсли;
	
	Если ТипЗнч(ОбъектXDTO.ТочностьУказанияСрокаГодностиСерии) = Тип("Строка") Тогда
		Данные.ТочностьУказанияСрокаГодностиСерии = Перечисления.ТочностиУказанияСрокаГодности[ОбъектXDTO.ТочностьУказанияСрокаГодностиСерии];
	КонецЕсли;
	Данные.ИспользоватьКоличествоСерии = Булево(ОбъектXDTO.ИспользоватьКоличествоСерии);
	Данные.ПолитикаУчетаСерий = Справочники.ПолитикиУчетаСерий.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.ПолитикаУчетаСерий));
	
	Если ОбъектXDTO.Свойства().Получить("НастройкиКлючаЦенПосерии") <> Неопределено Тогда
		Если ТипЗнч(ОбъектXDTO.НастройкиКлючаЦенПоСерии) = Тип("Строка") Тогда
			Данные.НастройкиКлючаЦенПоСерии = Перечисления.ВариантОтбораДляКлючаЦен[ОбъектXDTO.НастройкиКлючаЦенПоСерии];
		КонецЕсли;
	КонецЕсли;
	
	Данные.ПолитикиУчетаСерий.Очистить(); 
	
	Если ОбъектXDTO.Свойства().Получить("ПолитикиУчетаСерий") <> Неопределено Тогда   
		
		Если ТипЗнч(ОбъектXDTO.ПолитикиУчетаСерий.ЭлементПолитикиУчетаСерий) <> Тип("СписокXDTO") Тогда
			СписокXDTOСтрокаПолитикиУчета	= Новый Массив;
			СписокXDTOСтрокаПолитикиУчета.Добавить(ОбъектXDTO.ПолитикиУчетаСерий.ЭлементПолитикиУчетаСерий);
		Иначе
			СписокXDTOСтрокаПолитикиУчета = ОбъектXDTO.ПолитикиУчетаСерий.ЭлементПолитикиУчетаСерий;
		КонецЕсли;
			
		Для Каждого СтрокаПолитикиУчета Из СписокXDTOСтрокаПолитикиУчета Цикл
			НоваяСтрока = Данные.ПолитикиУчетаСерий.Добавить();
			Если СтрокаПолитикиУчета.Свойства().Получить("Склад") <> Неопределено Тогда
				ТипСклад = СтрокаПолитикиУчета.ТипСклад;
				Тип = МобильноеРабочееМестоКладовщика.МенеджерОбъектаПоПолномуИмени(ТипСклад);
				НоваяСтрока.Склад = Тип.ПолучитьСсылку(Новый УникальныйИдентификатор(СтрокаПолитикиУчета.Склад));
			КонецЕсли;
			НоваяСтрока.ПолитикаУчетаСерий = Справочники.ПолитикиУчетаСерий.ПолучитьСсылку(Новый УникальныйИдентификатор(СтрокаПолитикиУчета.ПолитикаУчетаСерий)); 
		КонецЦикла;
	КонецЕсли;
	
	Данные.РеквизитыДляКонтроляСерий.Очистить(); 
	
	Если ОбъектXDTO.Свойства().Получить("РеквизитыДляКонтроляСерий") <> Неопределено Тогда   
		
		Если ТипЗнч(ОбъектXDTO.РеквизитыДляКонтроляСерий.ЭлементРеквизитыДляКонтроляСерий) <> Тип("СписокXDTO") Тогда
			СписокXDTOСтрокаРеквизиты	= Новый Массив;
			СписокXDTOСтрокаРеквизиты.Добавить(ОбъектXDTO.РеквизитыДляКонтроляСерий.ЭлементРеквизитыДляКонтроляСерий);
		Иначе
			СписокXDTOСтрокаРеквизиты = ОбъектXDTO.РеквизитыДляКонтроляСерий.ЭлементРеквизитыДляКонтроляСерий;
		КонецЕсли;
			
		Для Каждого СтрокаРеквизиты Из СписокXDTOСтрокаРеквизиты Цикл
			НоваяСтрока = Данные.РеквизитыДляКонтроляСерий.Добавить();
			НоваяСтрока.ЭтоДопРеквизит = Булево(СтрокаРеквизиты.ЭтоДопРеквизит);
			Если СтрокаРеквизиты.Свойства().Получить("Свойство") <> Неопределено Тогда
				НоваяСтрока.Свойство = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.ПолучитьСсылку(Новый УникальныйИдентификатор(СтрокаРеквизиты.Свойство));
			КонецЕсли;
			НоваяСтрока.ЗаполнятьОбязательно = Булево(СтрокаРеквизиты.ЗаполнятьОбязательно); 
		КонецЦикла;
	КонецЕсли;
	
	Возврат Данные;
	
КонецФункции

Функция ПолитикиУчетаСерийИзXML(ЧтениеXML)
	
	ОбъектXDTO = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML); // ОбъектXDTO
	
	ДанныеСсылка = Справочники.ПолитикиУчетаСерий.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.Ссылка));
	Данные = ДанныеСсылка.ПолучитьОбъект();
	
	Если Данные = Неопределено Тогда
		Данные = Справочники.ПолитикиУчетаСерий.СоздатьЭлемент();
		Данные.УстановитьСсылкуНового(ДанныеСсылка);
	Иначе
		Данные = ДанныеСсылка.ПолучитьОбъект();
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(Данные, ОбъектXDTO);
	
	Если ТипЗнч(ОбъектXDTO.ТипПолитики) = Тип("Строка") Тогда
		Данные.ТипПолитики = Перечисления.ТипыПолитикУказанияСерий[ОбъектXDTO.ТипПолитики];
	КонецЕсли;
	Данные.УказыватьПриПроизводствеПродукции = Булево(ОбъектXDTO.УказыватьПриПроизводствеПродукции);
	Данные.УказыватьПриРасходеМатериалов = Булево(ОбъектXDTO.УказыватьПриРасходеМатериалов);
	Данные.УказыватьПоФактуОтбора = Булево(ОбъектXDTO.УказыватьПоФактуОтбора);
	Данные.УказыватьПриВозвратеНаСклад = Булево(ОбъектXDTO.УказыватьПриВозвратеНаСклад);
	Данные.УказыватьПриОтгрузке = Булево(ОбъектXDTO.УказыватьПриОтгрузке);
	Данные.УказыватьПриВыпускеВПодразделение = Булево(ОбъектXDTO.УказыватьПриВыпускеВПодразделение);
	Данные.УказыватьПриДвиженииМатериалов = Булево(ОбъектXDTO.УказыватьПриДвиженииМатериалов);
	Данные.УказыватьПриДвиженииПродукции = Булево(ОбъектXDTO.УказыватьПриДвиженииПродукции);
	Данные.УказыватьПриОтгрузкеВРозницу = Булево(ОбъектXDTO.УказыватьПриОтгрузкеВРозницу);
	Данные.УказыватьПриОтгрузкеКлиенту = Булево(ОбъектXDTO.УказыватьПриОтгрузкеКлиенту);
	Данные.УказыватьПриОтгрузкеКомплектовДляРазборки = Булево(ОбъектXDTO.УказыватьПриОтгрузкеКомплектовДляРазборки);
	Данные.УказыватьПриОтгрузкеКомплектующихДляСборки = Булево(ОбъектXDTO.УказыватьПриОтгрузкеКомплектующихДляСборки);
	Данные.УказыватьПриОтгрузкеНаВнутренниеНужды = Булево(ОбъектXDTO.УказыватьПриОтгрузкеНаВнутренниеНужды);
	Данные.УказыватьПриОтгрузкеПоВозвратуПоставщику = Булево(ОбъектXDTO.УказыватьПриОтгрузкеПоВозвратуПоставщику);
	Данные.УказыватьПриОтгрузкеПоПеремещению = Булево(ОбъектXDTO.УказыватьПриОтгрузкеПоПеремещению);
	Данные.УказыватьПриОтраженииИзлишков = Булево(ОбъектXDTO.УказыватьПриОтраженииИзлишков);
	Данные.УказыватьПриОтраженииЗатратНаПроизводство = Булево(ОбъектXDTO.УказыватьПриОтраженииЗатратНаПроизводство);
	Данные.УказыватьПриОтраженииНедостач = Булево(ОбъектXDTO.УказыватьПриОтраженииНедостач);
	Данные.УказыватьПриПеремещенииМеждуПомещениями = Булево(ОбъектXDTO.УказыватьПриПеремещенииМеждуПомещениями);
	Данные.УказыватьПриПересчетеТоваров = Булево(ОбъектXDTO.УказыватьПриПересчетеТоваров);
	Данные.УказыватьПриПланированииОтбора = Булево(ОбъектXDTO.УказыватьПриПланированииОтбора);
	Данные.УказыватьПриПланированииОтгрузки = Булево(ОбъектXDTO.УказыватьПриПланированииОтгрузки);
	Данные.УказыватьПриПриемке = Булево(ОбъектXDTO.УказыватьПриПриемке);
	Данные.УказыватьПриПолученииМатериалов = Булево(ОбъектXDTO.УказыватьПриПолученииМатериалов);
	Данные.УказыватьПриПриемкеКомплектующихПослеРазборки = Булево(ОбъектXDTO.УказыватьПриПриемкеКомплектующихПослеРазборки);
	Данные.УказыватьПриПриемкеОтПоставщика = Булево(ОбъектXDTO.УказыватьПриПриемкеОтПоставщика);
	Данные.УказыватьПриПриемкеПоВозвратуОтКлиента = Булево(ОбъектXDTO.УказыватьПриПриемкеПоВозвратуОтКлиента);
	Данные.УказыватьПриПриемкеПоПеремещению = Булево(ОбъектXDTO.УказыватьПриПриемкеПоПеремещению);
	Данные.УказыватьПриПриемкеПоПрочемуОприходованию = Булево(ОбъектXDTO.УказыватьПриПриемкеПоПрочемуОприходованию);
	Данные.УказыватьПриПриемкеПродукцииИзПроизводства = Булево(ОбъектXDTO.УказыватьПриПриемкеПродукцииИзПроизводства);
	Данные.УказыватьПриПриемкеСобранныхКомплектов = Булево(ОбъектXDTO.УказыватьПриПриемкеСобранныхКомплектов);
	Данные.УчетСерийПоFEFO = Булево(ОбъектXDTO.УчетСерийПоFEFO);
	Данные.УчитыватьОстаткиСерий = Булево(ОбъектXDTO.УчитыватьОстаткиСерий);
	Данные.УчитыватьСебестоимостьПоСериям = Булево(ОбъектXDTO.УчитыватьСебестоимостьПоСериям);
	Данные.УказыватьПриВозвратеНепринятыхПолучателемТоваров = Булево(ОбъектXDTO.УказыватьПриВозвратеНепринятыхПолучателемТоваров);
	Данные.ДляСклада = Булево(ОбъектXDTO.ДляСклада);
	Данные.ДляПроизводства = Булево(ОбъектXDTO.ДляПроизводства);
	Данные.УказыватьПриМаркировкеПродукцииДляГИСМ = Булево(ОбъектXDTO.УказыватьПриМаркировкеПродукцииДляГИСМ);
	Данные.УчетСерийВНеотфактурованныхПоставкахТоваров = Булево(ОбъектXDTO.УчетСерийВНеотфактурованныхПоставкахТоваров);
	Данные.УчетТоваровВПутиОтПоставщикаПоСериям = Булево(ОбъектXDTO.УчетТоваровВПутиОтПоставщикаПоСериям);
	Данные.УчетСерийВПереданныхНаХранениеТоварах = Булево(ОбъектXDTO.УчетСерийВПереданныхНаХранениеТоварах);
	Данные.УчетСерийПереданныхПереработчикуТоваров = Булево(ОбъектXDTO.УчетСерийПереданныхПереработчикуТоваров);
	Данные.УчитыватьСерииТМЦВЭксплуатации = Булево(ОбъектXDTO.УчитыватьСерииТМЦВЭксплуатации);
	Данные.УчетСерийВПереданныхНаКомиссиюТоваров = Булево(ОбъектXDTO.УчетСерийВПереданныхНаКомиссиюТоваров);
	
	Возврат Данные;
	
КонецФункции

Функция СерииНоменклатурыИзXML(ЧтениеXML)
	
	ОбъектXDTO = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML);
	
	ДанныеСсылка = Справочники.СерииНоменклатуры.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.Ссылка));
	Данные = ДанныеСсылка.ПолучитьОбъект();
	
	Если Данные = Неопределено Тогда
		Данные = Справочники.СерииНоменклатуры.СоздатьЭлемент();
		Данные.УстановитьСсылкуНового(ДанныеСсылка);
	Иначе
		Данные = ДанныеСсылка.ПолучитьОбъект();
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(Данные, ОбъектXDTO);
	
	Данные.ВидНоменклатуры = Справочники.ВидыНоменклатуры.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.ВидНоменклатуры));
	Данные.ПометкаУдаления = Булево(ОбъектXDTO.ПометкаУдаления);
	
	Данные.ГоденДо = Дата(ОбъектXDTO.ГоденДо);
	Данные.ДатаПроизводства = Дата(ОбъектXDTO.ДатаПроизводства);
	
	Если ТипЗнч(ОбъектXDTO.Номер) = Тип("ОбъектXDTO") Тогда
		Данные.Номер = "";
	Иначе
		Данные.Номер = Строка(ОбъектXDTO.Номер);
	КонецЕсли;
	
	Если ОбъектXDTO.Свойства().Получить("RFIDTID") <> Неопределено Тогда
		Если ТипЗнч(ОбъектXDTO.RFIDTID) = Тип("ОбъектXDTO") Тогда
			Данные.RFIDTID = "";
		Иначе
			Данные.RFIDTID = Строка(ОбъектXDTO.RFIDTID);
		КонецЕсли;
	КонецЕсли;
	
	Если ОбъектXDTO.Свойства().Получить("RFIDUser") <> Неопределено Тогда
		Если ТипЗнч(ОбъектXDTO.RFIDUser) = Тип("ОбъектXDTO") Тогда
			Данные.RFIDUser = "";
		Иначе
			Данные.RFIDUser = Строка(ОбъектXDTO.RFIDUser);
		КонецЕсли;
	КонецЕсли;
	
	Если ОбъектXDTO.Свойства().Получить("RFIDEPC") <> Неопределено Тогда
		Если ТипЗнч(ОбъектXDTO.RFIDEPC) = Тип("ОбъектXDTO") Тогда
			Данные.RFIDEPC = "";
		Иначе
			Данные.RFIDEPC = Строка(ОбъектXDTO.RFIDEPC);
		КонецЕсли;
	КонецЕсли;
	
	Если ОбъектXDTO.Свойства().Получить("EPCGTIN") <> Неопределено Тогда
		Если ТипЗнч(ОбъектXDTO.EPCGTIN) = Тип("ОбъектXDTO") Тогда
			Данные.EPCGTIN = "";
		Иначе
			Данные.EPCGTIN = Строка(ОбъектXDTO.EPCGTIN);
		КонецЕсли;
	КонецЕсли;
	
	Данные.RFIDМеткаНеЧитаемая = Булево(ОбъектXDTO.RFIDМеткаНеЧитаемая);
	
	Если ОбъектXDTO.Свойства().Получить("НомерКиЗГИСМ") <> Неопределено Тогда
		Если ТипЗнч(ОбъектXDTO.НомерКиЗГИСМ) = Тип("ОбъектXDTO") Тогда
			Данные.НомерКиЗГИСМ = "";
		Иначе
			Данные.НомерКиЗГИСМ = Строка(ОбъектXDTO.НомерКиЗГИСМ);
		КонецЕсли;
	КонецЕсли;
	
	Если ОбъектXDTO.Свойства().Получить("ИдентификаторПартииВЕТИС") <> Неопределено Тогда
		Если ТипЗнч(ОбъектXDTO.ИдентификаторПартииВЕТИС) = Тип("ОбъектXDTO") Тогда
			Данные.ИдентификаторПартииВЕТИС = "";
		Иначе
			Данные.ИдентификаторПартииВЕТИС = Строка(ОбъектXDTO.ИдентификаторПартииВЕТИС);
		КонецЕсли;
	КонецЕсли;
	
	Если ОбъектXDTO.Свойства().Получить("МаксимальнаяРозничнаяЦенаМОТП") <> Неопределено Тогда
		Данные.МаксимальнаяРозничнаяЦенаМОТП = Число(ОбъектXDTO.МаксимальнаяРозничнаяЦенаМОТП);
	КонецЕсли;
	
	Возврат Данные;
	
КонецФункции

Функция ВариантыОтчетовИзXML(ЧтениеXML)
	
	ОбъектXDTO = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML); // ОбъектXDTO
	
	ДанныеСсылка = Справочники.ВариантыОтчетов.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.Ссылка));
	Данные = ДанныеСсылка.ПолучитьОбъект();
	
	Если Данные = Неопределено Тогда
		Данные = Справочники.ВариантыОтчетов.СоздатьЭлемент();
		Данные.УстановитьСсылкуНового(ДанныеСсылка);
	Иначе
		Данные = ДанныеСсылка.ПолучитьОбъект();
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(Данные, ОбъектXDTO);
	
	Возврат Данные;
	
КонецФункции

Функция ДашбордыМЦПИзXML(ЧтениеXML)
	
	ОбъектXDTO = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML); // ОбъектXDTO
	
	ДанныеСсылка = Справочники.ДашбордыМЦП.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.Ссылка));
	Данные = ДанныеСсылка.ПолучитьОбъект();
	
	Если Данные = Неопределено Тогда
		Данные = Справочники.ДашбордыМЦП.СоздатьЭлемент();
		Данные.УстановитьСсылкуНового(ДанныеСсылка);
	Иначе
		Данные = ДанныеСсылка.ПолучитьОбъект();
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(Данные, ОбъектXDTO);
	
	Если ОбъектXDTO.Свойства().Получить("Автор") <> Неопределено Тогда
		Данные.Автор = Справочники.Пользователи.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.Автор));
	КонецЕсли;
	
	Если ОбъектXDTO.Свойства().Получить("Иконка") <> Неопределено Тогда
		Данные.Иконка = ОбъектXDTO.Иконка.ValueStorage;
	КонецЕсли;
	
	Данные.ТолькоДляАвтора = Булево(ОбъектXDTO.ТолькоДляАвтора);
	
	Данные.ПользователиДашборда.Очистить();
	
	Если ОбъектXDTO.Свойства().Получить("ПользователиДашборда") <> Неопределено Тогда
		
		Если ТипЗнч(ОбъектXDTO.ПользователиДашборда.ЭлементПользователиДашборда) <> Тип("СписокXDTO") Тогда
			СписокXDTOСтрокаПользователи = Новый Массив;
			СписокXDTOСтрокаПользователи.Добавить(ОбъектXDTO.ПользователиДашборда.ЭлементПользователиДашборда);
		Иначе
			СписокXDTOСтрокаПользователи = ОбъектXDTO.ПользователиДашборда.ЭлементПользователиДашборда;
		КонецЕсли;
			
		Для Каждого СтрокаПользователи Из СписокXDTOСтрокаПользователи Цикл
			НоваяСтрока = Данные.ПользователиДашборда.Добавить();
			Если СтрокаПользователи.Свойства().Получить("Пользователь") <> Неопределено Тогда
				ТипПользователь = СтрокаПользователи.ТипПользователь;
				Тип = МобильноеРабочееМестоКладовщика.МенеджерОбъектаПоПолномуИмени(ТипПользователь);
				НоваяСтрока.Пользователь = Тип.ПолучитьСсылку(Новый УникальныйИдентификатор(СтрокаПользователи.Пользователь));
			КонецЕсли; 
		КонецЦикла;
	КонецЕсли;
	
	Возврат Данные;
	
КонецФункции

#КонецОбласти

#Область РегистрыСведений

Функция ШтрихкодыНоменклатурыИзXML(ЧтениеXML)
	
	ОбъектXDTO = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML);
	
	НаборЗаписей = РегистрыСведений.ШтрихкодыНоменклатуры.СоздатьНаборЗаписей();

	НаборЗаписей.Отбор.Штрихкод.Установить(ОбъектXDTO.ОтборШтрихкод);
	НаборЗаписей.Отбор.Номенклатура.Установить(Справочники.Номенклатура.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.ОтборНоменклатура)));
	НаборЗаписей.Отбор.Характеристика.Установить(Справочники.ХарактеристикиНоменклатуры.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.ОтборХарактеристика)));
	НаборЗаписей.Отбор.Серия.Установить(Справочники.СерииНоменклатуры.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.ОтборСерия)));
	НаборЗаписей.Отбор.Упаковка.Установить(Справочники.УпаковкиЕдиницыИзмерения.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.ОтборУпаковка)));
	
	Если ОбъектXDTO.Свойства().Получить("ШтрихкодыСписок") <> Неопределено Тогда   
		
		Если ТипЗнч(ОбъектXDTO.ШтрихкодыСписок.ЭлементШтрихкоды) <> Тип("СписокXDTO") Тогда
			СписокXDTOСтрокаШтрихкоды = Новый Массив;
			СписокXDTOСтрокаШтрихкоды.Добавить(ОбъектXDTO.ШтрихкодыСписок.ЭлементШтрихкоды);
		Иначе
			СписокXDTOСтрокаШтрихкоды = ОбъектXDTO.ШтрихкодыСписок.ЭлементШтрихкоды;
		КонецЕсли;
			
		Для Каждого СтрокаШтрихкоды Из СписокXDTOСтрокаШтрихкоды Цикл
			НоваяЗапись = НаборЗаписей.Добавить();
	
			НоваяЗапись.Штрихкод = СтрокаШтрихкоды.Штрихкод;
			НоваяЗапись.Номенклатура = Справочники.Номенклатура.ПолучитьСсылку(Новый УникальныйИдентификатор(СтрокаШтрихкоды.Номенклатура));
			НоваяЗапись.Характеристика = Справочники.ХарактеристикиНоменклатуры.ПолучитьСсылку(Новый УникальныйИдентификатор(СтрокаШтрихкоды.Характеристика));
			НоваяЗапись.Серия = Справочники.СерииНоменклатуры.ПолучитьСсылку(Новый УникальныйИдентификатор(СтрокаШтрихкоды.Серия));
			НоваяЗапись.Упаковка = Справочники.УпаковкиЕдиницыИзмерения.ПолучитьСсылку(Новый УникальныйИдентификатор(СтрокаШтрихкоды.Упаковка));
		КонецЦикла;
	КонецЕсли;
	
	Попытка
		НаборЗаписей.Записать();
	Исключение
	КонецПопытки;
	
	Возврат Неопределено;
	
КонецФункции

Функция СнимкиОтчетовИзXML(ЧтениеXML)
	
	ОбъектXDTO = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML);
	
	МенеджерЗаписи = РегистрыСведений.СнимкиОтчетов.СоздатьМенеджерЗаписи();
	
	МенеджерЗаписи.Пользователь = Справочники.Пользователи.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.Пользователь));
	
	Если ОбъектXDTO.Свойства().Получить("Отчет") <> Неопределено Тогда
		ТипОтчет = ОбъектXDTO.ТипОтчет;
		Тип = МобильноеРабочееМестоКладовщика.МенеджерОбъектаПоПолномуИмени(ТипОтчет);
		МенеджерЗаписи.Отчет = Тип.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.Отчет));
	КонецЕсли;
	
	Если ОбъектXDTO.Свойства().Получить("ВариантОтчета") <> Неопределено Тогда
		ТипВариант = ОбъектXDTO.ТипВариант;
		Тип = МобильноеРабочееМестоКладовщика.МенеджерОбъектаПоПолномуИмени(ТипВариант);
		МенеджерЗаписи.Вариант = Тип.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.ВариантОтчета));
	КонецЕсли;
	
	МенеджерЗаписи.ХешПользовательскойНастройки = ОбъектXDTO.ХешПользовательскойНастройки;
	
	Если ОбъектXDTO.Свойства().Получить("РезультатОтчета") <> Неопределено Тогда
		МенеджерЗаписи.РезультатОтчета = ОбъектXDTO.РезультатОтчета.ValueStorage;
	КонецЕсли;
	Если ОбъектXDTO.Свойства().Получить("ДатаАктуальности") <> Неопределено Тогда
		МенеджерЗаписи.ДатаАктуальности = Дата(ОбъектXDTO.ДатаАктуальности);
	КонецЕсли;
	Если ОбъектXDTO.Свойства().Получить("ДатаПоследнегоПросмотра") <> Неопределено Тогда
		МенеджерЗаписи.ДатаПоследнегоПросмотра = Дата(ОбъектXDTO.ДатаПоследнегоПросмотра);
	КонецЕсли;
	
	МенеджерЗаписи.ОшибкаОбновленияОтчета = Булево(ОбъектXDTO.ОшибкаОбновленияОтчета);
	
	Попытка
		МенеджерЗаписи.Записать();
	Исключение
	КонецПопытки;
	
	Возврат Неопределено;
	
КонецФункции

Функция БлокировкиСкладскихЯчеекИзXML(ЧтениеXML)
	
	ОбъектXDTO = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML);
	
	НаборЗаписей = РегистрыСведений.БлокировкиСкладскихЯчеек.СоздатьНаборЗаписей();
	
	Регистратор = Неопределено;
	
	Если ОбъектXDTO.Свойства().Получить("Регистратор") <> Неопределено Тогда
		ТипРегистратор = ОбъектXDTO.ТипРегистратор;
		Тип = МобильноеРабочееМестоКладовщика.МенеджерОбъектаПоПолномуИмени(ТипРегистратор);
		Регистратор = Тип.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.Регистратор));
	КонецЕсли;
	
	НаборЗаписей.Отбор.Регистратор.Установить(Регистратор);
	
	Если ОбъектXDTO.Свойства().Получить("Блокировки") <> Неопределено Тогда
		
		Если ТипЗнч(ОбъектXDTO.Блокировки.ЭлементБлокировки) <> Тип("СписокXDTO") Тогда
			СписокXDTOСтрокаБлокировки = Новый Массив;
			СписокXDTOСтрокаБлокировки.Добавить(ОбъектXDTO.Блокировки.ЭлементБлокировки);
		Иначе
			СписокXDTOСтрокаБлокировки = ОбъектXDTO.Блокировки.ЭлементБлокировки;
		КонецЕсли;
			
		Для Каждого СтрокаБлокировки Из СписокXDTOСтрокаБлокировки Цикл
			НоваяЗапись = НаборЗаписей.Добавить();
	
			НоваяЗапись.Регистратор = Регистратор;
			НоваяЗапись.Активность = Булево(СтрокаБлокировки.Активность);
			Если СтрокаБлокировки.Свойства().Получить("Ячейка") <> Неопределено Тогда
				НоваяЗапись.Ячейка = Справочники.СкладскиеЯчейки.ПолучитьСсылку(Новый УникальныйИдентификатор(СтрокаБлокировки.Ячейка));
			КонецЕсли;
			Если СтрокаБлокировки.Свойства().Получить("ТипБлокировки") <> Неопределено Тогда
				Если ТипЗнч(СтрокаБлокировки.ТипБлокировки) = Тип("Строка") Тогда
					НоваяЗапись.ТипБлокировки = Перечисления.ТипыБлокировокСкладскихЯчеек[СтрокаБлокировки.ТипБлокировки];
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Попытка
		НаборЗаписей.Записать();
	Исключение
	КонецПопытки;
	
	Возврат Неопределено;
	
КонецФункции

Функция НастройкиАдресныхСкладовИзXML(ЧтениеXML)
	
	ОбъектXDTO = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML);
	
	НаборЗаписей = РегистрыСведений.НастройкиАдресныхСкладов.СоздатьНаборЗаписей();
	Склад = Справочники.Склады.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.Склад));
	Помещение = Справочники.СкладскиеПомещения.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.Помещение));
	НаборЗаписей.Отбор.Склад.Установить(Склад);
	НаборЗаписей.Отбор.Помещение.Установить(Помещение);
	
	Если ОбъектXDTO.Свойства().Получить("НастройкиСкладов") <> Неопределено Тогда
		
		Если ТипЗнч(ОбъектXDTO.НастройкиСкладов.ЭлементНастройкиСкладов) <> Тип("СписокXDTO") Тогда
			СписокXDTOСтрокаНастройкиСкладов = Новый Массив;
			СписокXDTOСтрокаНастройкиСкладов.Добавить(ОбъектXDTO.НастройкиСкладов.ЭлементНастройкиСкладов);
		Иначе
			СписокXDTOСтрокаНастройкиСкладов = ОбъектXDTO.НастройкиСкладов.ЭлементНастройкиСкладов;
		КонецЕсли;
			
		Для Каждого СтрокаНастройкиСкладов Из СписокXDTOСтрокаНастройкиСкладов Цикл
			НоваяЗапись = НаборЗаписей.Добавить();
	
			НоваяЗапись.Склад = Склад;
			НоваяЗапись.Помещение = Помещение;
			НоваяЗапись.ИспользоватьАдресноеХранение = Булево(СтрокаНастройкиСкладов.ИспользоватьАдресноеХранение);
			Если СтрокаНастройкиСкладов.Свойства().Получить("ДатаНачалаАдресногоХраненияОстатков") <> Неопределено Тогда
				НоваяЗапись.ДатаНачалаАдресногоХраненияОстатков = Дата(СтрокаНастройкиСкладов.ДатаНачалаАдресногоХраненияОстатков);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Попытка
		НаборЗаписей.Записать();
	Исключение
	КонецПопытки;
	
	Возврат Неопределено;
	
КонецФункции

Функция РазмещениеНоменклатурыПоСкладскимЯчейкамИзXML(ЧтениеXML)
	
	ОбъектXDTO = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML);
	
	НаборЗаписей = РегистрыСведений.РазмещениеНоменклатурыПоСкладскимЯчейкам.СоздатьНаборЗаписей();   
	Номенклатура = Справочники.Номенклатура.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.Номенклатура));
	Ячейка = Справочники.СкладскиеЯчейки.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.Ячейка));
	Склад = Справочники.Склады.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.Склад));
	Помещение = Справочники.СкладскиеПомещения.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.Помещение));
	
	НаборЗаписей.Отбор.Номенклатура.Установить(Номенклатура);
	НаборЗаписей.Отбор.Ячейка.Установить(Ячейка);
	НаборЗаписей.Отбор.Склад.Установить(Склад);
	НаборЗаписей.Отбор.Помещение.Установить(Помещение);
	
	Если ОбъектXDTO.Свойства().Получить("Размещение") <> Неопределено Тогда   
		
		Если ТипЗнч(ОбъектXDTO.Размещение.ЭлементРазмещение) <> Тип("СписокXDTO") Тогда
			СписокXDTOСтрокаРазмещение = Новый Массив;
			СписокXDTOСтрокаРазмещение.Добавить(ОбъектXDTO.Размещение.ЭлементРазмещение);
		Иначе
			СписокXDTOСтрокаРазмещение = ОбъектXDTO.Размещение.ЭлементРазмещение;
		КонецЕсли;
			
		Для Каждого СтрокаРазмещение Из СписокXDTOСтрокаРазмещение Цикл
			НоваяЗапись = НаборЗаписей.Добавить();
			
			НоваяЗапись.Номенклатура = Номенклатура;
			НоваяЗапись.Ячейка = Ячейка;
			НоваяЗапись.Склад = Склад;
			НоваяЗапись.Помещение = Помещение;
			НоваяЗапись.ОсновнаяЯчейка = Булево(СтрокаРазмещение.ОсновнаяЯчейка);
		КонецЦикла;
	КонецЕсли;
	
	Попытка
		НаборЗаписей.Записать();
	Исключение
	КонецПопытки;
	
	Возврат Неопределено;
	
КонецФункции

#КонецОбласти

#Область Документы

Функция УстановкаБлокировокЯчеекИзXML(ЧтениеXML)
	
	ОбъектXDTO = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML);
	
	ДанныеСсылка = Документы.УстановкаБлокировокЯчеек.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.Ссылка));
	Данные = ДанныеСсылка.ПолучитьОбъект();
	
	Если Данные = Неопределено Тогда
		Данные = Документы.УстановкаБлокировокЯчеек.СоздатьДокумент();
		Данные.УстановитьСсылкуНового(ДанныеСсылка);
	Иначе
		Данные = ДанныеСсылка.ПолучитьОбъект();
	КонецЕсли;
			
	ЗаполнитьЗначенияСвойств(Данные, ОбъектXDTO);
	
	Данные.Дата = Дата(ОбъектXDTO.Дата);
	Данные.ПометкаУдаления = Булево(ОбъектXDTO.ПометкаУдаления);
	Данные.Проведен = Булево(ОбъектXDTO.Проведен);
	
	Если ОбъектXDTO.Свойства().Получить("Ответственный") <> Неопределено Тогда
		Данные.Ответственный = Справочники.Пользователи.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.Ответственный));
	КонецЕсли;
	
	Если ОбъектXDTO.Свойства().Получить("Комментарий") <> Неопределено Тогда
		Если ТипЗнч(ОбъектXDTO.Комментарий) = Тип("ОбъектXDTO") Тогда
			Данные.Комментарий = "";
		Иначе
			Данные.Комментарий = Строка(ОбъектXDTO.Комментарий);
		КонецЕсли;
	КонецЕсли;
	
	Данные.Склад = Справочники.Склады.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.Склад));
	Данные.Помещение = Справочники.СкладскиеПомещения.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.Помещение));

	Возврат Данные;
	
КонецФункции

Функция ПересчетТоваровИзXML(ЧтениеXML)
	
	ОбъектXDTO = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML);
	
	ДанныеСсылка = Документы.ПересчетТоваров.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.Ссылка));
	Данные = ДанныеСсылка.ПолучитьОбъект();
	
	Если Данные = Неопределено Тогда
		Данные = Документы.ПересчетТоваров.СоздатьДокумент();
		Данные.УстановитьСсылкуНового(ДанныеСсылка);
	Иначе
		Данные = ДанныеСсылка.ПолучитьОбъект();
	КонецЕсли;
			
	ЗаполнитьЗначенияСвойств(Данные, ОбъектXDTO);
	
	Данные.Дата = Дата(ОбъектXDTO.Дата);
	Данные.ПометкаУдаления = Булево(ОбъектXDTO.ПометкаУдаления);
	Данные.Проведен = Булево(ОбъектXDTO.Проведен);
	Данные.ПечататьКоличествоПоУчету = Булево(ОбъектXDTO.ПечататьКоличествоПоУчету);
	
	Если ОбъектXDTO.Свойства().Получить("Исполнитель") <> Неопределено Тогда
		Данные.Исполнитель = Справочники.Пользователи.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.Исполнитель));
	КонецЕсли;
	
	Если ОбъектXDTO.Свойства().Получить("Ответственный") <> Неопределено Тогда
		Данные.Ответственный = Справочники.Пользователи.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.Ответственный));
	КонецЕсли;
	
	Если ОбъектXDTO.Свойства().Получить("Комментарий") <> Неопределено Тогда
		Если ТипЗнч(ОбъектXDTO.Комментарий) = Тип("ОбъектXDTO") Тогда
			Данные.Комментарий = "";
		Иначе
			Данные.Комментарий = Строка(ОбъектXDTO.Комментарий);
		КонецЕсли;
	КонецЕсли;
	
	Данные.Склад = Справочники.Склады.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.Склад));
	Данные.Помещение = Справочники.СкладскиеПомещения.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.Помещение));
	Если ТипЗнч(ОбъектXDTO.Статус) = Тип("Строка") Тогда
		Данные.Статус = Перечисления.СтатусыПересчетовТоваров[ОбъектXDTO.Статус];
	КонецЕсли;
	
	Данные.Товары.Очистить();
	
	Если ОбъектXDTO.Свойства().Получить("Товары") <> Неопределено Тогда
		
		Если ТипЗнч(ОбъектXDTO.Товары.ЭлементТовары) <> Тип("СписокXDTO") Тогда
			СписокXDTOСтрокаТовары	= Новый Массив;
			СписокXDTOСтрокаТовары.Добавить(ОбъектXDTO.Товары.ЭлементТовары);
		Иначе
			СписокXDTOСтрокаТовары = ОбъектXDTO.Товары.ЭлементТовары;
		КонецЕсли;
			
		Для Каждого СтрокаТовары Из СписокXDTOСтрокаТовары Цикл
			НоваяСтрока = Данные.Товары.Добавить();
			Если СтрокаТовары.Свойства().Получить("Количество") <> Неопределено Тогда
				НоваяСтрока.Количество = Число(СтрокаТовары.Количество);
			КонецЕсли;
			Если СтрокаТовары.Свойства().Получить("КоличествоУпаковок") <> Неопределено Тогда
				НоваяСтрока.КоличествоУпаковок = Число(СтрокаТовары.КоличествоУпаковок);
			КонецЕсли;
			Если СтрокаТовары.Свойства().Получить("КоличествоФакт") <> Неопределено Тогда
				НоваяСтрока.КоличествоФакт = Число(СтрокаТовары.КоличествоФакт);
			КонецЕсли;
			Если СтрокаТовары.Свойства().Получить("КоличествоУпаковокФакт") <> Неопределено Тогда
				НоваяСтрока.КоличествоУпаковокФакт = Число(СтрокаТовары.КоличествоУпаковокФакт);
			КонецЕсли;
			НоваяСтрока.Номенклатура = Справочники.Номенклатура.ПолучитьСсылку(Новый УникальныйИдентификатор(СтрокаТовары.Номенклатура));
			НоваяСтрока.Упаковка = Справочники.УпаковкиЕдиницыИзмерения.ПолучитьСсылку(Новый УникальныйИдентификатор(СтрокаТовары.Упаковка));
			Если СтрокаТовары.Свойства().Получить("Характеристика") <> Неопределено Тогда
				НоваяСтрока.Характеристика = Справочники.ХарактеристикиНоменклатуры.ПолучитьСсылку(Новый УникальныйИдентификатор(СтрокаТовары.Характеристика));
			КонецЕсли;
			Если СтрокаТовары.Свойства().Получить("Назначение") <> Неопределено Тогда
				НоваяСтрока.Назначение = Справочники.Назначения.ПолучитьСсылку(Новый УникальныйИдентификатор(СтрокаТовары.Назначение));
			КонецЕсли;
			НоваяСтрока.Ячейка = Справочники.СкладскиеЯчейки.ПолучитьСсылку(Новый УникальныйИдентификатор(СтрокаТовары.Ячейка));
			НоваяСтрока.ИзлишекПорча = Булево(СтрокаТовары.ИзлишекПорча);
			НоваяСтрока.Серия = Справочники.СерииНоменклатуры.ПолучитьСсылку(Новый УникальныйИдентификатор(СтрокаТовары.Серия));
			Если СтрокаТовары.Свойства().Получить("СтатусУказанияСерий") <> Неопределено Тогда
				НоваяСтрока.СтатусУказанияСерий = Число(СтрокаТовары.СтатусУказанияСерий);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат Данные;
	
КонецФункции 

Функция ПриходныйОрдерИзXML(ЧтениеXML)
	
	ОбъектXDTO = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML); // ОбъектXDTO
	
	ДанныеСсылка = Документы.ПриходныйОрдерНаТовары.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.Ссылка));
	Данные = ДанныеСсылка.ПолучитьОбъект();
	
	Если Данные = Неопределено Тогда
		Данные = Документы.ПриходныйОрдерНаТовары.СоздатьДокумент();
		Данные.УстановитьСсылкуНового(ДанныеСсылка);
	Иначе
		Данные = ДанныеСсылка.ПолучитьОбъект();
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(Данные, ОбъектXDTO); 
	
	Данные.Дата = Дата(ОбъектXDTO.Дата);
	Данные.ПометкаУдаления = Булево(ОбъектXDTO.ПометкаУдаления);
	Данные.Проведен = Булево(ОбъектXDTO.Проведен);
	Данные.Склад = Справочники.Склады.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.Склад));
	
	Если ОбъектXDTO.Свойства().Получить("Исполнитель") <> Неопределено Тогда
		Данные.Исполнитель = Справочники.Пользователи.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.Исполнитель));
	КонецЕсли;
	
	Если ОбъектXDTO.Свойства().Получить("Отправитель") <> Неопределено Тогда
		ТипОтправитель = ОбъектXDTO.ТипОтправитель;
		Тип = МобильноеРабочееМестоКладовщика.МенеджерОбъектаПоПолномуИмени(ТипОтправитель);
		Данные.Отправитель = Тип.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.Отправитель));
	КонецЕсли;
	
	Если ОбъектXDTO.Свойства().Получить("Распоряжение") <> Неопределено Тогда
		ТипРаспоряжение = ОбъектXDTO.ТипРаспоряжение;
		Тип = МобильноеРабочееМестоКладовщика.МенеджерОбъектаПоПолномуИмени(ТипРаспоряжение);
		Данные.Распоряжение = Тип.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.Распоряжение));
	КонецЕсли;
	
	Если ОбъектXDTO.Свойства().Получить("Комментарий") <> Неопределено Тогда
		Если ТипЗнч(ОбъектXDTO.Комментарий) = Тип("ОбъектXDTO") Тогда
			Данные.Комментарий = "";
		Иначе
			Данные.Комментарий = Строка(ОбъектXDTO.Комментарий);
		КонецЕсли;
	КонецЕсли;
	
	Если ТипЗнч(ОбъектXDTO.Статус) = Тип("Строка") Тогда
		Данные.Статус = Перечисления.СтатусыПриходныхОрдеров[ОбъектXDTO.Статус];
	КонецЕсли;
	Данные.Помещение = Справочники.СкладскиеПомещения.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.Помещение));
	Данные.ЗонаПриемки = Справочники.СкладскиеЯчейки.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.ЗонаПриемки));
	
	Если ОбъектXDTO.Свойства().Получить("ДатаВходящегоДокумента") <> Неопределено Тогда
		Данные.ДатаВходящегоДокумента = Дата(ОбъектXDTO.ДатаВходящегоДокумента);
	КонецЕсли;
	
	Если ОбъектXDTO.Свойства().Получить("НомерВходящегоДокумента") <> Неопределено Тогда
		Если ТипЗнч(ОбъектXDTO.НомерВходящегоДокумента) = Тип("ОбъектXDTO") Тогда
			Данные.НомерВходящегоДокумента = "";
		Иначе
			Данные.НомерВходящегоДокумента = Строка(ОбъектXDTO.НомерВходящегоДокумента);
		КонецЕсли;
	КонецЕсли;
	
	Если ТипЗнч(ОбъектXDTO.ХозяйственнаяОперация) = Тип("Строка") Тогда
		Данные.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации[ОбъектXDTO.ХозяйственнаяОперация];
	КонецЕсли;
	Если ТипЗнч(ОбъектXDTO.СкладскаяОперация) = Тип("Строка") Тогда
		Данные.СкладскаяОперация = Перечисления.СкладскиеОперации[ОбъектXDTO.СкладскаяОперация];
	КонецЕсли;
	
	Данные.Товары.Очистить();
	
	Если ОбъектXDTO.Свойства().Получить("Товары") <> Неопределено Тогда
		
		Если ТипЗнч(ОбъектXDTO.Товары.ЭлементТовары) <> Тип("СписокXDTO") Тогда
			СписокXDTOСтрокаТовары	= Новый Массив;
			СписокXDTOСтрокаТовары.Добавить(ОбъектXDTO.Товары.ЭлементТовары);
		Иначе
			СписокXDTOСтрокаТовары = ОбъектXDTO.Товары.ЭлементТовары;
		КонецЕсли;
			
		Для Каждого СтрокаТовары Из СписокXDTOСтрокаТовары Цикл
			НоваяСтрока = Данные.Товары.Добавить();
			НоваяСтрока.Количество = Число(СтрокаТовары.Количество);
			НоваяСтрока.КоличествоУпаковок = Число(СтрокаТовары.КоличествоУпаковок);
			НоваяСтрока.Номенклатура = Справочники.Номенклатура.ПолучитьСсылку(Новый УникальныйИдентификатор(СтрокаТовары.Номенклатура));
			НоваяСтрока.Упаковка = Справочники.УпаковкиЕдиницыИзмерения.ПолучитьСсылку(Новый УникальныйИдентификатор(СтрокаТовары.Упаковка));
			НоваяСтрока.Характеристика = Справочники.ХарактеристикиНоменклатуры.ПолучитьСсылку(Новый УникальныйИдентификатор(СтрокаТовары.Характеристика));
			НоваяСтрока.Серия = Справочники.СерииНоменклатуры.ПолучитьСсылку(Новый УникальныйИдентификатор(СтрокаТовары.Серия));
			
			Если СтрокаТовары.Свойства().Получить("СтатусУказанияСерий") <> Неопределено Тогда
				НоваяСтрока.СтатусУказанияСерий = Число(СтрокаТовары.СтатусУказанияСерий);
			КонецЕсли;
			
			Если СтрокаТовары.Свойства().Получить("ДокументОтгрузки") <> Неопределено Тогда
				ТипДокументОтгрузки = СтрокаТовары.ТипДокументОтгрузки;
				Тип = МобильноеРабочееМестоКладовщика.МенеджерОбъектаПоПолномуИмени(ТипДокументОтгрузки);
				НоваяСтрока.ДокументОтгрузки = Тип.ПолучитьСсылку(Новый УникальныйИдентификатор(СтрокаТовары.ДокументОтгрузки));
			КонецЕсли;
			
			Если СтрокаТовары.Свойства().Получить("Штрихкод") <> Неопределено Тогда
				Если ТипЗнч(СтрокаТовары.Штрихкод) = Тип("ОбъектXDTO") Тогда
					НоваяСтрока.Штрихкод = "";
				Иначе
					НоваяСтрока.Штрихкод = Строка(СтрокаТовары.Штрихкод);
				КонецЕсли;
			КонецЕсли;
			
			Если СтрокаТовары.Свойства().Получить("УпаковочныйЛист") <> Неопределено Тогда
				НоваяСтрока.УпаковочныйЛист = Документы.УпаковочныйЛист.ПолучитьСсылку(Новый УникальныйИдентификатор(СтрокаТовары.УпаковочныйЛист));
			КонецЕсли;
			Если СтрокаТовары.Свойства().Получить("УпаковочныйЛистРодитель") <> Неопределено Тогда
				НоваяСтрока.УпаковочныйЛистРодитель = Документы.УпаковочныйЛист.ПолучитьСсылку(Новый УникальныйИдентификатор(СтрокаТовары.УпаковочныйЛистРодитель));
			КонецЕсли;
			Если СтрокаТовары.Свойства().Получить("Назначение") <> Неопределено Тогда
				НоваяСтрока.Назначение = Справочники.Назначения.ПолучитьСсылку(Новый УникальныйИдентификатор(СтрокаТовары.Назначение));
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат Данные;
	
КонецФункции

Функция РасходныйОрдерИзXML(ЧтениеXML)
	
	ОбъектXDTO = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML);
	
	ДанныеСсылка = Документы.РасходныйОрдерНаТовары.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.Ссылка));
	Данные = ДанныеСсылка.ПолучитьОбъект();
	
	Если Данные = Неопределено Тогда
		Данные = Документы.РасходныйОрдерНаТовары.СоздатьДокумент();
		Данные.УстановитьСсылкуНового(ДанныеСсылка);
	Иначе
		Данные = ДанныеСсылка.ПолучитьОбъект();
	КонецЕсли;
			
	ЗаполнитьЗначенияСвойств(Данные, ОбъектXDTO); 
	
	Данные.Дата = Дата(ОбъектXDTO.Дата);
	Данные.ДатаОтгрузки = Дата(ОбъектXDTO.ДатаОтгрузки);
	Данные.ПометкаУдаления = Булево(ОбъектXDTO.ПометкаУдаления);
	Данные.Проведен = Булево(ОбъектXDTO.Проведен);
	Данные.ЗонаОтгрузки = Справочники.СкладскиеЯчейки.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.ЗонаОтгрузки));
	
	Если ОбъектXDTO.Свойства().Получить("Комментарий") <> Неопределено Тогда
		Если ТипЗнч(ОбъектXDTO.Комментарий) = Тип("ОбъектXDTO") Тогда
			Данные.Комментарий = "";
		Иначе
			Данные.Комментарий = Строка(ОбъектXDTO.Комментарий);
		КонецЕсли;
	КонецЕсли;
	
	Если ОбъектXDTO.Свойства().Получить("Ответственный") <> Неопределено Тогда
		Данные.Ответственный = Справочники.Пользователи.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.Ответственный));
	КонецЕсли;
	
	Если ОбъектXDTO.Свойства().Получить("Контролер") <> Неопределено Тогда
		Данные.Контролер = Справочники.Пользователи.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.Контролер));
	КонецЕсли;
	
	Если ОбъектXDTO.Свойства().Получить("Отгрузил") <> Неопределено Тогда
		Данные.Отгрузил = Справочники.Пользователи.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.Отгрузил));
	КонецЕсли;
	
	Данные.Помещение = Справочники.СкладскиеПомещения.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.Помещение));
	Данные.Склад = Справочники.Склады.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.Склад));
	
	Если ОбъектXDTO.Свойства().Получить("Получатель") <> Неопределено Тогда
		ТипПолучатель = ОбъектXDTO.ТипПолучатель;
		Тип = МобильноеРабочееМестоКладовщика.МенеджерОбъектаПоПолномуИмени(ТипПолучатель);
		Данные.Получатель = Тип.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.Получатель));
	КонецЕсли;
	
	Если ТипЗнч(ОбъектXDTO.Статус) = Тип("Строка") Тогда
		Данные.Статус = Перечисления.СтатусыРасходныхОрдеров[ОбъектXDTO.Статус];
	КонецЕсли;
	
	Данные.ТоварыПоРаспоряжениям.Очистить();
	
	Если ОбъектXDTO.Свойства().Получить("ТоварыПоРаспоряжениям") <> Неопределено Тогда
		
		Если ТипЗнч(ОбъектXDTO.ТоварыПоРаспоряжениям.ЭлементТоварыПоРаспоряжениям) <> Тип("СписокXDTO") Тогда
			СписокXDTOСтрокаТовары	= Новый Массив;
			СписокXDTOСтрокаТовары.Добавить(ОбъектXDTO.ТоварыПоРаспоряжениям.ЭлементТоварыПоРаспоряжениям);
		Иначе
			СписокXDTOСтрокаТовары = ОбъектXDTO.ТоварыПоРаспоряжениям.ЭлементТоварыПоРаспоряжениям;
		КонецЕсли;
			
		Для Каждого СтрокаТовары Из СписокXDTOСтрокаТовары Цикл
			НоваяСтрока = Данные.ТоварыПоРаспоряжениям.Добавить();
			НоваяСтрока.Номенклатура = Справочники.Номенклатура.ПолучитьСсылку(Новый УникальныйИдентификатор(СтрокаТовары.Номенклатура));
			НоваяСтрока.Характеристика = Справочники.ХарактеристикиНоменклатуры.ПолучитьСсылку(Новый УникальныйИдентификатор(СтрокаТовары.Характеристика));
			НоваяСтрока.Серия = Справочники.СерииНоменклатуры.ПолучитьСсылку(Новый УникальныйИдентификатор(СтрокаТовары.Серия));
			НоваяСтрока.Количество = Число(СтрокаТовары.Количество);
			Если СтрокаТовары.Свойства().Получить("Назначение") <> Неопределено Тогда
				НоваяСтрока.Назначение = Справочники.Назначения.ПолучитьСсылку(Новый УникальныйИдентификатор(СтрокаТовары.Назначение));
			КонецЕсли;
			Если СтрокаТовары.Свойства().Получить("СтатусУказанияСерий") <> Неопределено Тогда
				НоваяСтрока.СтатусУказанияСерий = Число(СтрокаТовары.СтатусУказанияСерий);
			КонецЕсли;
			Если СтрокаТовары.Свойства().Получить("Распоряжение") <> Неопределено Тогда
				ТипРаспоряжение = СтрокаТовары.ТипРаспоряжение;
				Тип = МобильноеРабочееМестоКладовщика.МенеджерОбъектаПоПолномуИмени(ТипРаспоряжение);
				НоваяСтрока.Распоряжение = Тип.ПолучитьСсылку(Новый УникальныйИдентификатор(СтрокаТовары.Распоряжение));
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Данные.ОтгружаемыеТовары.Очистить();
	
	Если ОбъектXDTO.Свойства().Получить("ОтгружаемыеТовары") <> Неопределено Тогда
		
		Если ТипЗнч(ОбъектXDTO.ОтгружаемыеТовары.ЭлементОтгружаемыеТовары) <> Тип("СписокXDTO") Тогда
			СписокXDTOСтрокаТовары	= Новый Массив;
			СписокXDTOСтрокаТовары.Добавить(ОбъектXDTO.ОтгружаемыеТовары.ЭлементОтгружаемыеТовары);
		Иначе
			СписокXDTOСтрокаТовары = ОбъектXDTO.ОтгружаемыеТовары.ЭлементОтгружаемыеТовары;
		КонецЕсли;
			
		Для Каждого СтрокаТовары Из СписокXDTOСтрокаТовары Цикл
			НоваяСтрока = Данные.ОтгружаемыеТовары.Добавить();
			НоваяСтрока.Номенклатура = Справочники.Номенклатура.ПолучитьСсылку(Новый УникальныйИдентификатор(СтрокаТовары.Номенклатура));
			НоваяСтрока.Характеристика = Справочники.ХарактеристикиНоменклатуры.ПолучитьСсылку(Новый УникальныйИдентификатор(СтрокаТовары.Характеристика));
			НоваяСтрока.Серия = Справочники.СерииНоменклатуры.ПолучитьСсылку(Новый УникальныйИдентификатор(СтрокаТовары.Серия));
			НоваяСтрока.ЭтоУпаковочныйЛист = Булево(СтрокаТовары.ЭтоУпаковочныйЛист);
			НоваяСтрока.Упаковка = Справочники.УпаковкиЕдиницыИзмерения.ПолучитьСсылку(Новый УникальныйИдентификатор(СтрокаТовары.Упаковка));
			НоваяСтрока.Количество = Число(СтрокаТовары.Количество);
			НоваяСтрока.КоличествоУпаковок = Число(СтрокаТовары.КоличествоУпаковок);
			
			Если СтрокаТовары.Свойства().Получить("Назначение") <> Неопределено Тогда
				НоваяСтрока.Назначение = Справочники.Назначения.ПолучитьСсылку(Новый УникальныйИдентификатор(СтрокаТовары.Назначение));
			КонецЕсли;
			
			Если СтрокаТовары.Свойства().Получить("СтатусУказанияСерий") <> Неопределено Тогда
				НоваяСтрока.СтатусУказанияСерий = Число(СтрокаТовары.СтатусУказанияСерий);
			КонецЕсли;
			
			Если СтрокаТовары.Свойства().Получить("ЭтоСлужебнаяСтрокаПустогоУпаковочногоЛиста") <> Неопределено Тогда
				НоваяСтрока.ЭтоСлужебнаяСтрокаПустогоУпаковочногоЛиста = Число(СтрокаТовары.ЭтоСлужебнаяСтрокаПустогоУпаковочногоЛиста);
			КонецЕсли;
			
			Если СтрокаТовары.Свойства().Получить("УпаковочныйЛистРодитель") <> Неопределено Тогда
				НоваяСтрока.УпаковочныйЛистРодитель = Документы.УпаковочныйЛист.ПолучитьСсылку(Новый УникальныйИдентификатор(СтрокаТовары.УпаковочныйЛистРодитель));
			КонецЕсли;
			
			Если СтрокаТовары.Свойства().Получить("УпаковочныйЛист") <> Неопределено Тогда
				НоваяСтрока.УпаковочныйЛист = Документы.УпаковочныйЛист.ПолучитьСсылку(Новый УникальныйИдентификатор(СтрокаТовары.УпаковочныйЛист));
			КонецЕсли;
			
			Если ТипЗнч(СтрокаТовары.Действие) = Тип("Строка") Тогда
				НоваяСтрока.Действие = Перечисления.ДействияСоСтрокамиОрдеровНаОтгрузку[СтрокаТовары.Действие];
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат Данные;
	
КонецФункции

Функция ОтборРазмещениеТоваровИзXML(ЧтениеXML)
	
	ОбъектXDTO = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML);
	
	ДанныеСсылка = Документы.ОтборРазмещениеТоваров.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.Ссылка));
	Данные = ДанныеСсылка.ПолучитьОбъект();
	
	Если Данные = Неопределено Тогда
		Данные = Документы.ОтборРазмещениеТоваров.СоздатьДокумент();
		Данные.УстановитьСсылкуНового(ДанныеСсылка);
	Иначе
		Данные = ДанныеСсылка.ПолучитьОбъект();
	КонецЕсли;
			
	ЗаполнитьЗначенияСвойств(Данные, ОбъектXDTO); 
	
	Данные.Дата = Дата(ОбъектXDTO.Дата);
	Данные.ПометкаУдаления = Булево(ОбъектXDTO.ПометкаУдаления);
	Данные.Проведен = Булево(ОбъектXDTO.Проведен);	
	Если ТипЗнч(ОбъектXDTO.ВидОперации) = Тип("Строка") Тогда
		Данные.ВидОперации = Перечисления.ВидыОперацийОтбораРазмещенияТоваров[ОбъектXDTO.ВидОперации];
	КонецЕсли;	
	Данные.ЗонаОтгрузки = Справочники.СкладскиеЯчейки.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.ЗонаОтгрузки));
	Данные.ЗонаПриемки = Справочники.СкладскиеЯчейки.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.ЗонаПриемки));
	
	Если ОбъектXDTO.Свойства().Получить("Исполнитель") <> Неопределено Тогда
		Данные.Исполнитель = Справочники.Пользователи.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.Исполнитель));
	КонецЕсли;
	
	Если ОбъектXDTO.Свойства().Получить("Распоряжение") <> Неопределено Тогда
		ТипРаспоряжение = ОбъектXDTO.ТипРаспоряжение;
		Тип = МобильноеРабочееМестоКладовщика.МенеджерОбъектаПоПолномуИмени(ТипРаспоряжение);
		Данные.Распоряжение = Тип.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.Распоряжение));
	КонецЕсли;
	
	Если ОбъектXDTO.Свойства().Получить("Комментарий") <> Неопределено Тогда
		Если ТипЗнч(ОбъектXDTO.Комментарий) = Тип("ОбъектXDTO") Тогда
			Данные.Комментарий = "";
		Иначе
			Данные.Комментарий = Строка(ОбъектXDTO.Комментарий);
		КонецЕсли;
	КонецЕсли;
	
	Данные.Склад = Справочники.Склады.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.Склад));
	Данные.Помещение = Справочники.СкладскиеПомещения.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.Помещение));
 	Если ТипЗнч(ОбъектXDTO.Статус) = Тип("Строка") Тогда
		Данные.Статус = Перечисления.СтатусыОтборовРазмещенийТоваров[ОбъектXDTO.Статус];
	КонецЕсли;
	Если ОбъектXDTO.Свойства().Получить("ОбъемРазмещение") <> Неопределено Тогда
		Данные.ОбъемРазмещение = Число(ОбъектXDTO.ОбъемРазмещение);
	КонецЕсли;
	Если ОбъектXDTO.Свойства().Получить("ВесРазмещение") <> Неопределено Тогда
		Данные.ВесРазмещение = Число(ОбъектXDTO.ВесРазмещение);
	КонецЕсли;
	
	Данные.ТоварыОтбор.Очистить();
	
	Если ОбъектXDTO.Свойства().Получить("ТоварыОтбор") <> Неопределено Тогда
		
		Если ТипЗнч(ОбъектXDTO.ТоварыОтбор.ЭлементТоварыОтбор) <> Тип("СписокXDTO") Тогда
			СписокXDTOСтрокаТоварыОтбор	= Новый Массив;
			СписокXDTOСтрокаТоварыОтбор.Добавить(ОбъектXDTO.ТоварыОтбор.ЭлементТоварыОтбор);
		Иначе
			СписокXDTOСтрокаТоварыОтбор = ОбъектXDTO.ТоварыОтбор.ЭлементТоварыОтбор;
		КонецЕсли;
			
		Для Каждого СтрокаТоварыОтбор Из СписокXDTOСтрокаТоварыОтбор Цикл
			НоваяСтрока = Данные.ТоварыОтбор.Добавить();
			НоваяСтрока.Номенклатура = Справочники.Номенклатура.ПолучитьСсылку(Новый УникальныйИдентификатор(СтрокаТоварыОтбор.Номенклатура));
			НоваяСтрока.Упаковка = Справочники.УпаковкиЕдиницыИзмерения.ПолучитьСсылку(Новый УникальныйИдентификатор(СтрокаТоварыОтбор.Упаковка));
			НоваяСтрока.Характеристика = Справочники.ХарактеристикиНоменклатуры.ПолучитьСсылку(Новый УникальныйИдентификатор(СтрокаТоварыОтбор.Характеристика));
			НоваяСтрока.Ячейка = Справочники.СкладскиеЯчейки.ПолучитьСсылку(Новый УникальныйИдентификатор(СтрокаТоварыОтбор.Ячейка));
			НоваяСтрока.Серия = Справочники.СерииНоменклатуры.ПолучитьСсылку(Новый УникальныйИдентификатор(СтрокаТоварыОтбор.Серия));
			НоваяСтрока.Количество = Число(СтрокаТоварыОтбор.Количество);
			НоваяСтрока.КоличествоУпаковок = Число(СтрокаТоварыОтбор.КоличествоУпаковок);
			
			Если СтрокаТоварыОтбор.Свойства().Получить("КоличествоОтобрано") <> Неопределено Тогда
				НоваяСтрока.КоличествоОтобрано = Число(СтрокаТоварыОтбор.КоличествоОтобрано);
			КонецЕсли;
			
			Если СтрокаТоварыОтбор.Свойства().Получить("КоличествоУпаковокОтобрано") <> Неопределено Тогда
				НоваяСтрока.КоличествоУпаковокОтобрано = Число(СтрокаТоварыОтбор.КоличествоУпаковокОтобрано);
			КонецЕсли;
			
			Если СтрокаТоварыОтбор.Свойства().Получить("Назначение") <> Неопределено Тогда
				НоваяСтрока.Назначение = Справочники.Назначения.ПолучитьСсылку(Новый УникальныйИдентификатор(СтрокаТоварыОтбор.Назначение));
			КонецЕсли;
			
			Если СтрокаТоварыОтбор.Свойства().Получить("СтатусУказанияСерий") <> Неопределено Тогда
				НоваяСтрока.СтатусУказанияСерий = Число(СтрокаТоварыОтбор.СтатусУказанияСерий);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

	Данные.ТоварыРазмещение.Очистить();
	
	Если ОбъектXDTO.Свойства().Получить("ТоварыРазмещение") <> Неопределено Тогда
		
		Если ТипЗнч(ОбъектXDTO.ТоварыРазмещение.ЭлементТоварыРазмещение) <> Тип("СписокXDTO") Тогда
			СписокXDTOСтрокаТоварыРазмещение	= Новый Массив;
			СписокXDTOСтрокаТоварыРазмещение.Добавить(ОбъектXDTO.ТоварыРазмещение.ЭлементТоварыРазмещение);
		Иначе
			СписокXDTOСтрокаТоварыРазмещение = ОбъектXDTO.ТоварыРазмещение.ЭлементТоварыРазмещение;
		КонецЕсли;
	
		Для Каждого СтрокаТоварыРазмещение Из СписокXDTOСтрокаТоварыРазмещение Цикл
			НоваяСтрока = Данные.ТоварыРазмещение.Добавить();
			НоваяСтрока.Номенклатура = Справочники.Номенклатура.ПолучитьСсылку(Новый УникальныйИдентификатор(СтрокаТоварыРазмещение.Номенклатура));
			НоваяСтрока.Упаковка = Справочники.УпаковкиЕдиницыИзмерения.ПолучитьСсылку(Новый УникальныйИдентификатор(СтрокаТоварыРазмещение.Упаковка));
			НоваяСтрока.Характеристика = Справочники.ХарактеристикиНоменклатуры.ПолучитьСсылку(Новый УникальныйИдентификатор(СтрокаТоварыРазмещение.Характеристика));
			НоваяСтрока.Ячейка = Справочники.СкладскиеЯчейки.ПолучитьСсылку(Новый УникальныйИдентификатор(СтрокаТоварыРазмещение.Ячейка));
			НоваяСтрока.Серия = Справочники.СерииНоменклатуры.ПолучитьСсылку(Новый УникальныйИдентификатор(СтрокаТоварыРазмещение.Серия));
			НоваяСтрока.Количество = Число(СтрокаТоварыРазмещение.Количество);
			НоваяСтрока.КоличествоУпаковок = Число(СтрокаТоварыРазмещение.КоличествоУпаковок);
			
			Если СтрокаТоварыРазмещение.Свойства().Получить("КоличествоРазмещено") <> Неопределено Тогда
				НоваяСтрока.КоличествоРазмещено = Число(СтрокаТоварыРазмещение.КоличествоРазмещено);
			КонецЕсли;
			
			Если СтрокаТоварыРазмещение.Свойства().Получить("КоличествоУпаковокРазмещено") <> Неопределено Тогда
				НоваяСтрока.КоличествоУпаковокРазмещено = Число(СтрокаТоварыРазмещение.КоличествоУпаковокРазмещено);
			КонецЕсли;
			
			Если СтрокаТоварыРазмещение.Свойства().Получить("Назначение") <> Неопределено Тогда
				НоваяСтрока.Назначение = Справочники.Назначения.ПолучитьСсылку(Новый УникальныйИдентификатор(СтрокаТоварыРазмещение.Назначение));
			КонецЕсли;
			
			Если СтрокаТоварыРазмещение.Свойства().Получить("СтатусУказанияСерий") <> Неопределено Тогда
				НоваяСтрока.СтатусУказанияСерий = Число(СтрокаТоварыРазмещение.СтатусУказанияСерий);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

	Возврат Данные;
	
КонецФункции

Функция ЗаказПоставщикуИзXML(ЧтениеXML)
	
	ОбъектXDTO = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML);
	
	ДанныеСсылка = Документы.ЗаказПоставщику.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.Ссылка));
	Данные = ДанныеСсылка.ПолучитьОбъект();
	
	Если Данные = Неопределено Тогда
		Данные = Документы.ЗаказПоставщику.СоздатьДокумент();
		Данные.УстановитьСсылкуНового(ДанныеСсылка);
	Иначе
		Данные = ДанныеСсылка.ПолучитьОбъект();
	КонецЕсли;
			
	ЗаполнитьЗначенияСвойств(Данные, ОбъектXDTO); 
	
	Данные.Дата = Дата(ОбъектXDTO.Дата);
	Данные.ПометкаУдаления = Булево(ОбъектXDTO.ПометкаУдаления);
	Данные.Проведен = Булево(ОбъектXDTO.Проведен);
	Данные.Организация = Справочники.Организации.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.Организация));
	
	Если ОбъектXDTO.Свойства().Получить("Менеджер") <> Неопределено Тогда
		Данные.Менеджер = Справочники.Пользователи.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.Менеджер));
	КонецЕсли;
		
	Возврат Данные;
	
КонецФункции

Функция КорректировкаПоОрдеруИзXML(ЧтениеXML)
	
	ОбъектXDTO = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML);
	
	ДанныеСсылка = Документы.КорректировкаПоОрдеруНаТовары.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.Ссылка));
	Данные = ДанныеСсылка.ПолучитьОбъект();
	
	Если Данные = Неопределено Тогда
		Данные = Документы.КорректировкаПоОрдеруНаТовары.СоздатьДокумент();
		Данные.УстановитьСсылкуНового(ДанныеСсылка);
	Иначе
		Данные = ДанныеСсылка.ПолучитьОбъект();
	КонецЕсли;
			
	ЗаполнитьЗначенияСвойств(Данные, ОбъектXDTO); 
	
	Данные.Дата = Дата(ОбъектXDTO.Дата);
	Данные.ПометкаУдаления = Булево(ОбъектXDTO.ПометкаУдаления);
	Данные.Проведен = Булево(ОбъектXDTO.Проведен);
	
	Данные.ЗонаОтгрузки = Справочники.СкладскиеЯчейки.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.ЗонаОтгрузки));
	
	Если ОбъектXDTO.Свойства().Получить("Ответственный") <> Неопределено Тогда
		Данные.Ответственный = Справочники.Пользователи.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.Ответственный));
	КонецЕсли;
	
	Данные.Помещение = Справочники.СкладскиеПомещения.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.Помещение));
	Данные.Склад = Справочники.Склады.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.Склад));
	
	Если ОбъектXDTO.Свойства().Получить("Ордер") <> Неопределено Тогда
		ТипОрдер = ОбъектXDTO.ТипОрдер;
		Тип = МобильноеРабочееМестоКладовщика.МенеджерОбъектаПоПолномуИмени(ТипОрдер);
		Данные.Ордер = Тип.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.Ордер));
	КонецЕсли;
	
	Если ОбъектXDTO.Свойства().Получить("ОрдерПолучатель") <> Неопределено Тогда
		ТипОрдерПолучатель = ОбъектXDTO.ТипОрдерПолучатель;
		Тип = МобильноеРабочееМестоКладовщика.МенеджерОбъектаПоПолномуИмени(ТипОрдерПолучатель);
		Данные.ОрдерПолучатель = Тип.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.ОрдерПолучатель));
	КонецЕсли;
	
	Данные.Товары.Очистить();
	
	Если ОбъектXDTO.Свойства().Получить("Товары") <> Неопределено Тогда
		
		Если ТипЗнч(ОбъектXDTO.Товары.ЭлементТовары) <> Тип("СписокXDTO") Тогда
			СписокXDTOСтрокаТовары	= Новый Массив;
			СписокXDTOСтрокаТовары.Добавить(ОбъектXDTO.Товары.ЭлементТовары);
		Иначе
			СписокXDTOСтрокаТовары = ОбъектXDTO.Товары.ЭлементТовары;
		КонецЕсли;
			
		Для Каждого СтрокаТовары Из СписокXDTOСтрокаТовары Цикл
			НоваяСтрока = Данные.Товары.Добавить();
			НоваяСтрока.Количество = Число(СтрокаТовары.Количество);
			НоваяСтрока.Номенклатура = Справочники.Номенклатура.ПолучитьСсылку(Новый УникальныйИдентификатор(СтрокаТовары.Номенклатура));
			НоваяСтрока.Характеристика = Справочники.ХарактеристикиНоменклатуры.ПолучитьСсылку(Новый УникальныйИдентификатор(СтрокаТовары.Характеристика));
			НоваяСтрока.Серия = Справочники.СерииНоменклатуры.ПолучитьСсылку(Новый УникальныйИдентификатор(СтрокаТовары.Серия));
			НоваяСтрока.Упаковка = Справочники.УпаковкиЕдиницыИзмерения.ПолучитьСсылку(Новый УникальныйИдентификатор(СтрокаТовары.Упаковка));
			НоваяСтрока.КоличествоУпаковок = Число(СтрокаТовары.КоличествоУпаковок);
			
			Если СтрокаТовары.Свойства().Получить("Назначение") <> Неопределено Тогда
				НоваяСтрока.Назначение = Справочники.Назначения.ПолучитьСсылку(Новый УникальныйИдентификатор(СтрокаТовары.Назначение));
			КонецЕсли;
			
			Если СтрокаТовары.Свойства().Получить("СтатусУказанияСерий") <> Неопределено Тогда
				НоваяСтрока.СтатусУказанияСерий = Число(СтрокаТовары.СтатусУказанияСерий);
			КонецЕсли;
			
			Если ТипЗнч(СтрокаТовары.ВидОперации) = Тип("Строка") Тогда
				НоваяСтрока.ВидОперации = Перечисления.ВидыОперацийКорректировокОстатковТоваров[СтрокаТовары.ВидОперации];
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат Данные;
	
КонецФункции

Функция ПрочиеДокументыИзXML(ЧтениеXML)
	
	ИмяОбъекта = СтрРазделить(ЧтениеXML.Имя, ".");
	ОбъектXDTO = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML); // ОбъектXDTO
	
	Тип = МобильноеРабочееМестоКладовщика.МенеджерОбъектаПоПолномуИмени("Документ." + ИмяОбъекта[1]);
	ДанныеСсылка = Тип.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.Ссылка));
	Данные = ДанныеСсылка.ПолучитьОбъект();
	
	Если Данные = Неопределено Тогда
		Данные = Тип.СоздатьДокумент();
		Данные.УстановитьСсылкуНового(ДанныеСсылка);
	Иначе
		Данные = ДанныеСсылка.ПолучитьОбъект();
	КонецЕсли;
			
	ЗаполнитьЗначенияСвойств(Данные, ОбъектXDTO);
	
	Возврат Данные;
	
КонецФункции

#КонецОбласти

// Возвращает массив узлов плана обмена с учетом исключаемых.
//
// Возвращаемое значение:
//  Массив из ПланОбменаСсылка - Массив узлов для регистрации изменений.
//
Функция УзлыДляРегистрации()
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	Мобильные.Ссылка
	|ИЗ
	|	ПланОбмена.Мобильные КАК Мобильные
	|ГДЕ
	|	НЕ Мобильные.ПометкаУдаления
	|	И НЕ Мобильные.ЭтотУзел");
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
КонецФункции

#КонецОбласти

#КонецОбласти