&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	                                                           
	ОбменСГИСЭПД.ПриСозданииНаСервереПодчиненнойФормы(ЭтотОбъект, Отказ, СтандартнаяОбработка); 
	
	Если Параметры.Свойство("ФормаБезОбработки") = Ложь
		И Параметры.Свойство("ЗапретитьИзменение") 
		И Параметры.ЗапретитьИзменение = Ложь Тогда
		Элементы.СсылкаСтрана.ОграничениеТипа = Новый ОписаниеТипов(ОбменСГИСЭПДПереопределяемый.ИмяТипаСтраны());	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Сохранить(Команда)
		
	ОбменСГИСЭПДКлиент.СохранитьПараметрыПодчиненнойФормы(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбменСГИСЭПДКлиент.ПриОткрытииПодчиненнойФормы(ЭтотОбъект);
																		
КонецПроцедуры
			
&НаКлиенте
Функция ОписаниеРеквизитовФормы() Экспорт
	
	Возврат ОписаниеРеквизитовФормыСервер();
	
КонецФункции

&НаСервере
Функция ОписаниеРеквизитовФормыСервер()
	
	Возврат ОбменСГИСЭПД.ОписаниеРеквизитовФормы(ЭтаФорма);
		
КонецФункции


&НаКлиенте
Процедура ТитулЗаказчикаОписаниеГрузаСвСтрПроисхПередУдалением(Элемент, Отказ)
	ТекущиеДанные = Элемент.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		ОбменСГИСЭПДКлиент.ОчиститьПодчиненныеТаблицы(ЭтотОбъект, Элемент.Имя, ТекущиеДанные.ИдентификаторСтроки, Отказ);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТитулЗаказчикаОписаниеГрузаСвСтрПроисхПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	ОбменСГИСЭПДКлиент.ТаблицаПриНачалеРедактирования(Элемент, ЭтотОбъект, НоваяСтрока, Копирование);
КонецПроцедуры


&НаКлиенте
Процедура ТитулЗаказчикаОписаниеГрузаСвСтрПроисхСсылкаСтранаПриИзменении(Элемент)
	
	ОбменСГИСЭПДКлиентСервер.ЗаполнитьРеквизитыПоСсылке(Элемент, ЭтотОбъект, 
		Элементы.ТитулЗаказчикаОписаниеГрузаСвСтрПроисх.ТекущиеДанные);


КонецПроцедуры

