///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2026, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// Подсистема "ИнтернетПоддержкаПользователей.НастройкиПлатежныхСистем".
// ОбщийМодуль.НастройкиПлатежныхСистем.
// 
// Серверные процедуры работы с различными платежными системами:
//  - получение статуса операции;
//  - формирование QR-кода.
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Выполняет загрузку статусов операций, по которым было отложено получение результата.
//
// Параметры:
//  Подсистемы - Строка - идентификаторы подсистем, которые должны быть обработаны, перечисленные
//    через запятую. Допустимые значения: "Все", "СБП", "ИнтернетЭквайринг", "ПлатежныеСистемы".
//    Если не заполнено, то обрабатываются все подсистемы.
// 
// Возвращаемое значение:
//  Соответствие Из КлючИЗначение - данные обработанных документов по типам платежных систем:
//    * Ключ - Строка - платежная система, по которой была выполнена загрузка. Доступные значения: "СБП",
//        "ИнтернетЭквайринг", "ПлатежныеСистемы".
//    * Значение - Неопределено - указанная подсистема не используется в конфигурации, либо она не указана
//                 в параметре Подсистемы.
//               - Массив Из ОпределяемыйТип.ДокументОперацииСБП - данные обработанных
//                   документов, если Ключ = "СБП".
//               - Массив Из ОпределяемыйТип.ДокументОперацииИнтернетЭквайринга - данные обработанных
//                   документов, если Ключ = "ИнтернетЭквайринг".
//               - Массив из ОпределяемыйТип.ДокументОперацииПлатежнойСистемы - данные обработанных
//                   документов, если Ключ = "ПлатежныеСистемы".
//               
Функция СтатусыОпераций(Знач Подсистемы = "") Экспорт
	
	// Проверка входных параметров
	ОбщегоНазначенияКлиентСервер.ПроверитьПараметр(
		"НастройкиПлатежныхСистем.СтатусыОпераций",
		"Подсистемы",
		Подсистемы,
		Тип("Строка"));
	
	ОбработанныеОперации = Новый Соответствие;
	ОбработанныеОперации.Вставить("СБП", Неопределено);
	ОбработанныеОперации.Вставить("ИнтернетЭквайринг", Неопределено);
	ОбработанныеОперации.Вставить("ПлатежныеСистемы", Неопределено);
	
	ВсеПодсистемы = Ложь;
	ВыбранныеПодсистемы = СтрРазделить(СокрЛП(Подсистемы), ", ", Ложь);
	Если ВыбранныеПодсистемы.Количество() = 0
		Или ВыбранныеПодсистемы.Найти("Все") <> Неопределено Тогда
		ВсеПодсистемы = Истина;
	КонецЕсли;
	
	Если (ВсеПодсистемы Или ВыбранныеПодсистемы.Найти("СБП") <> Неопределено)
		И ОбщегоНазначения.ПодсистемаСуществует("ИнтернетПоддержкаПользователей.СистемаБыстрыхПлатежей.БазоваяФункциональностьСБП") Тогда
		
		МодульСистемаБыстрыхПлатежейСлужебный = ОбщегоНазначения.ОбщийМодуль("СистемаБыстрыхПлатежейСлужебный");
		ОбработанныеОперации.Вставить(
			"СБП",
			МодульСистемаБыстрыхПлатежейСлужебный.СтатусыОпераций());
			
	КонецЕсли;
	
	Если (ВсеПодсистемы Или ВыбранныеПодсистемы.Найти("ИнтернетЭквайринг") <> Неопределено)
		И ОбщегоНазначения.ПодсистемаСуществует("ИнтернетПоддержкаПользователей.ИнтернетЭквайринг") Тогда
		
		МодульИнтернетЭквайрингСлужебный = ОбщегоНазначения.ОбщийМодуль("ИнтернетЭквайрингСлужебный");
		ОбработанныеОперации.Вставить(
			"ИнтернетЭквайринг",
			МодульИнтернетЭквайрингСлужебный.СтатусыОпераций());
		
	КонецЕсли;
	
	Если (ВсеПодсистемы Или ВыбранныеПодсистемы.Найти("ПлатежныеСистемы") <> Неопределено)
		И ОбщегоНазначения.ПодсистемаСуществует("ИнтернетПоддержкаПользователей.ПлатежныеСистемы.БазоваяФункциональностьПлатежныхСистем") Тогда
		
		МодульПлатежныеСистемыСлужебный = ОбщегоНазначения.ОбщийМодуль("ПлатежныеСистемыСлужебный");
		
		ОбработанныеОперации.Вставить(
			"ПлатежныеСистемы",
			МодульПлатежныеСистемыСлужебный.СтатусыОпераций());
		
	КонецЕсли;
	
	Возврат ОбработанныеОперации;
	
КонецФункции

// Формирует параметры печати кассовых ссылок по подсистемам.
//
// Параметры:
//  Подсистемы - Массив Из Строка - идентификаторы подсистем, по которым необходимо вернуть параметры печати.
//    Допустимые значения: "СБП". В случае если передано Неопределено вернутся параметры печати по всем подсистемам.
// 
// Возвращаемое значение:
//  Соответствие Из КлючИЗначение - параметры печати кассовых ссылок по типам платежных систем:
//    * Ключ - Строка - платежная система, к которой относятся печатные формы. Доступные значения: "СБП".
//    * Значение - Соответствие Из КлючИЗначение - содержит параметры печати кассовых ссылок:
//      ** Ключ - Строка - Идентификатор макета печатной формы
//      ** Значение - Структура - содержит параметры печатной формы:
//        *** Представление - Строка - представление печатной формы для пользователя
//
Функция ПараметрыПечатиКассовыхСсылок(Знач Подсистемы) Экспорт
	
	ПараметрыПечати = Новый Соответствие;
	
	ВсеПодсистемы = Ложь;
	ВыбранныеПодсистемы = СтрРазделить(СокрЛП(Подсистемы), ", ", Ложь);
	Если ВыбранныеПодсистемы.Количество() = 0
		Или ВыбранныеПодсистемы.Найти("Все") <> Неопределено Тогда
		ВсеПодсистемы = Истина;
	КонецЕсли;
	
	Если (Подсистемы = Неопределено Или Подсистемы.Найти("СБП") <> Неопределено)
		И ОбщегоНазначения.ПодсистемаСуществует("ИнтернетПоддержкаПользователей.СистемаБыстрыхПлатежей.БазоваяФункциональностьСБП") Тогда
		
		МодульСистемаБыстрыхПлатежейСлужебный = ОбщегоНазначения.ОбщийМодуль("СистемаБыстрыхПлатежейСлужебный");
		ПараметрыПечати.Вставить(
			"СБП",
			МодульСистемаБыстрыхПлатежейСлужебный.ПараметрыПечатиКассовыхСсылок());
			
	КонецЕсли;
	
	Возврат ПараметрыПечати;
	
КонецФункции

// Формирует табличный документ с данными кассовой ссылки.
//
// Параметры:
//  КассоваяСсылка - Строка - ссылка, по которой будет выполнятся оплата;
//  ПараметрыПечати - Структура - настройки печати:
//    * Подсистема - Строка - идентификатор подсистемы, может принимать значения: "СБП".
//    * ИдентификаторМакета - Строка - идентификатор печатной формы, полученный в методе НастройкиПлатежныхСистем.ПараметрыПечатиКассовыхСсылок.
//
// Возвращаемое значение:
//  ТабличныйДокумент - подготовленный для печати документ.
//
Функция КарточкаКассовойСсылки(
		КассоваяСсылка,
		ПараметрыПечати) Экспорт
	
	// Проверка входных параметров
	ИмяФункции = "НастройкиПлатежныхСистем.КарточкаКассовойСсылки";
	ОбщегоНазначенияКлиентСервер.ПроверитьПараметр(
		ИмяФункции,
		"КассоваяСсылка",
		КассоваяСсылка,
		Тип("Строка"));
	ОбщегоНазначенияКлиентСервер.ПроверитьПараметр(
		ИмяФункции,
		"ПараметрыПечати",
		ПараметрыПечати,
		Тип("Структура"));
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	Если ПустаяСтрока(КассоваяСсылка) Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Не заполнены данные кассовой ссылки.'"));
		Возврат ТабличныйДокумент;
	КонецЕсли;
	
	Если ПараметрыПечати.Подсистема = "СБП"
		И ОбщегоНазначения.ПодсистемаСуществует("ИнтернетПоддержкаПользователей.СистемаБыстрыхПлатежей.БазоваяФункциональностьСБП") Тогда
		
		МодульСистемаБыстрыхПлатежейСлужебный = ОбщегоНазначения.ОбщийМодуль("СистемаБыстрыхПлатежейСлужебный");
		
		Возврат СистемаБыстрыхПлатежейСлужебный.КарточкаКассовойСсылки(
			КассоваяСсылка,
			ПараметрыПечати.ИдентификаторМакета);
		
	КонецЕсли;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

// Формирование изображения идентификатора оплаты (QR-кода).
//
// Параметры: 
//  ФункциональнаяСсылка - Строка - идентификатор оплаты.
//  Размер - Число - размер QR-кода в пикселях.
//  ПлатежнаяСистема - Строка - платежная система, логотип которой должен быть использован.
//    Допустимые значения: "СистемаБыстрыхПлатежей", "ЯндексПэй".
//    При указании любого другого значения QR-код будет выведен без логотипа.
//  ТипПечати - Число - вариант печати QR-кода. В зависимости от выбранного варианта
//    печати подбирается картинка с логотипом платежной системы.
//    Возможные варианты:
//      0 - цветной логотип.
//      1 - монохромный логотип (оттенки серого).
//      2 - черно-белый логотип.
//      3 - без логотипа.
//    Особенности вывода изображений для разных платежных систем:
//      для Яндекс Пэй используется одинаковая картинка для типа печати 1 и 2.
//
// Возвращаемое значение:
//  ДвоичныеДанные - данные изображения QR-кода.
//
Функция ИзображениеQRКода(ФункциональнаяСсылка, Размер, ПлатежнаяСистема, Знач ТипПечати = 0) Экспорт
	
	// Проверка входных параметров
	ИмяФункции = "НастройкиПлатежныхСистем.ИзображениеQRКода";
	ОбщегоНазначенияКлиентСервер.ПроверитьПараметр(
		ИмяФункции,
		"ФункциональнаяСсылка",
		ФункциональнаяСсылка,
		Тип("Строка"));
	ОбщегоНазначенияКлиентСервер.ПроверитьПараметр(
		ИмяФункции,
		"Размер",
		Размер,
		Тип("Число"));
	ОбщегоНазначенияКлиентСервер.ПроверитьПараметр(
		ИмяФункции,
		"ПлатежнаяСистема",
		ПлатежнаяСистема,
		Тип("Строка"));
	ОбщегоНазначенияКлиентСервер.ПроверитьПараметр(
		ИмяФункции,
		"ТипПечати",
		ТипПечати,
		Тип("Число"));
	
	Возврат НастройкиПлатежныхСистемСлужебный.ИзображениеQRКода(
		ФункциональнаяСсылка,
		Размер,
		ПлатежнаяСистема,
		ТипПечати);
	
КонецФункции

#КонецОбласти