#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	НастройкиУчета = ПланыВидовХарактеристик.СтатьиАктивовПассивов.НастройкиФинансовогоУчета();
	НастройкиОтбора = ПланыВидовХарактеристик.СтатьиАктивовПассивов.НастройкиОтбораСтатейАктивовПассивов();
	
	Если ТипЗнч(Параметры.НастройкиФинансовогоУчета) = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(НастройкиУчета, Параметры.НастройкиФинансовогоУчета);
	Иначе
		
		
	КонецЕсли;
	
	Если ТипЗнч(Параметры.ЕстьИсточникДанных) = Тип("Булево") Тогда
		НастройкиОтбора.ЕстьИсточникДанных = Параметры.ЕстьИсточникДанных;
	КонецЕсли;
	
	ВидыСтатей = Неопределено;
	ТипыДанныхУчета = Неопределено;
	СчетаУчетаВНастройкахПроводок = Ложь;
	НесобственныеПодконтрольныеЦенности = Ложь;
	
	Если Параметры.Свойство("Отбор") Тогда
		Если Параметры.Отбор.Свойство("Вид", ВидыСтатей) И ЗначениеЗаполнено(ВидыСтатей) Тогда
			НастройкиОтбора.Вид = ОбщегоНазначенияУТКлиентСервер.Массив(ВидыСтатей);
		КонецЕсли;
		Если Параметры.Отбор.Свойство("ТипДанныхУчета", ТипыДанныхУчета) И ЗначениеЗаполнено(ТипыДанныхУчета) Тогда
			НастройкиОтбора.ТипДанныхУчета = ОбщегоНазначенияУТКлиентСервер.Массив(ТипыДанныхУчета);
		КонецЕсли;
		Если Параметры.Отбор.Свойство("СчетаУчетаВНастройкахПроводок", СчетаУчетаВНастройкахПроводок) Тогда
			НастройкиОтбора.СчетаУчетаВНастройкахПроводок = СчетаУчетаВНастройкахПроводок;
		КонецЕсли;
		Если Параметры.Отбор.Свойство("НесобственныеПодконтрольныеЦенности", НесобственныеПодконтрольныеЦенности) Тогда
			НастройкиУчета.УчетНесобственныхЦенностей = НесобственныеПодконтрольныеЦенности;
		КонецЕсли;
	КонецЕсли;
	
	ОбщегоНазначения.ЗаполнитьКоллекциюЭлементовДереваДанныхФормы(
		ДеревоОбъектовУчета.ПолучитьЭлементы(),
		ПланыВидовХарактеристик.СтатьиАктивовПассивов.ДеревоОбъектовФинансовогоУчета(НастройкиУчета, НастройкиОтбора));
	
	РегистрыНакопленияМетаданные = Метаданные.РегистрыНакопления;
	
	Для каждого Группа Из ДеревоОбъектовУчета.ПолучитьЭлементы() Цикл
		Для каждого СтрокаОбъектУчета Из Группа.ПолучитьЭлементы() Цикл
			Если СтрокаОбъектУчета.ОбъектУчета = Параметры.ТекущаяСтрока Тогда
				Элементы.ДеревоОбъектовУчета.ТекущаяСтрока = СтрокаОбъектУчета.ПолучитьИдентификатор();
			КонецЕсли;
			
			МетаданныеРегистра = РегистрыНакопленияМетаданные.Найти(СтрокаОбъектУчета.ИсточникДанных);
			Если МетаданныеРегистра <> Неопределено Тогда
				СтрокаОбъектУчета.ИсточникДанныхПредставление = МетаданныеРегистра.Синоним;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДеревоОбъектовУчета

&НаКлиенте
Процедура ДеревоОбъектовУчетаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = ДеревоОбъектовУчета.НайтиПоИдентификатору(ВыбраннаяСтрока);
	Если ТекущиеДанные.ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	ОповеститьОВыборе(ТекущиеДанные.ОбъектУчета);
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоОбъектовУчетаВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	
	ТекущиеДанные = ДеревоОбъектовУчета.НайтиПоИдентификатору(Значение);
	Если ТекущиеДанные.ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	ОповеститьОВыборе(ТекущиеДанные.ОбъектУчета);

КонецПроцедуры

#КонецОбласти