///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2026, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Параметры.ПлатежнаяСсылка) Тогда
		
		ПлатежнаяСсылка = Параметры.ПлатежнаяСсылка;
		QRКод = НастройкиПлатежныхСистем.ИзображениеQRКода(
			Параметры.ПлатежнаяСсылка,
			360,
			НастройкиПлатежныхСистемКлиентСервер.ИмяПодсистемыСБП(),
			0);
		
		QRКодКартинкой = ПоместитьВоВременноеХранилище(QRКод, ЭтотОбъект);
		
	Иначе
		Отказ = Истина;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Параметры.ОснованиеПлатежа) Тогда
		Отказ = Истина;
	КонецЕсли;
	
	Если Отказ Тогда
		ВызватьИсключение НСтр("ru = 'Не корректные параметры формы.'");
	КонецЕсли;
	
	СистемаБыстрыхПлатежейСобытия.ПриОпределенииДанныхПлатежнойСсылки(
		Параметры.ВариантНастройки,
		Параметры.ОснованиеПлатежа,
		ДанныеСсылки);
	
	Если Не ЗначениеЗаполнено(ДанныеСсылки)Тогда
		ВызватьИсключение НСтр("ru = 'Не корректные параметры формы.'");
	КонецЕсли;
	
	ДанныеНастройкиПодключения = Справочники.НастройкиПодключенияКСистемеБыстрыхПлатежей.ДанныеНастройкиПодключения(
		ДанныеСсылки.НастройкаПодключения);
		
	Если Не ЗначениеЗаполнено(ДанныеНастройкиПодключения.ИдентификаторУчастника)Тогда
		ВызватьИсключение НСтр("ru = 'Не корректные параметры формы.'");
	КонецЕсли;
	
	ДанныеСсылки.Вставить(
		"ИдентификаторУчастника",
		ДанныеНастройкиПодключения.ИдентификаторУчастника);
		
	ДанныеПлатежнойСсылки = Новый Структура;
	ДанныеПлатежнойСсылки.Вставить("ПлатежнаяСсылка", ПлатежнаяСсылка);
	ДанныеПлатежнойСсылки.Вставить("QRКод", QRКод);
	ДанныеПлатежнойСсылки.Вставить("ОснованиеПлатежа", Параметры.ОснованиеПлатежа);
	ДанныеПлатежнойСсылки.Вставить("ВариантНастройки", Параметры.ВариантНастройки);
	
	НастройкиФормы = Новый Структура;
	НастройкиФормы.Вставить("Группа", Элементы.ГруппаКнопок);
	
	ИнтеграцияПодсистемБИП.ПриСозданииНаСервереФормыQRКода(
		ЭтотОбъект,
		НастройкиФормы,
		ДанныеПлатежнойСсылки);
	СистемаБыстрыхПлатежейПереопределяемый.ПриСозданииНаСервереФормыQRКода(
		ЭтотОбъект,
		НастройкиФормы,
		ДанныеПлатежнойСсылки);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОповещениеПослеЗавершенияНастройкиФормы = Новый ОписаниеОповещения(
		"Подключаемый_ПослеЗавершенияНастройкиФормы",
		ЭтотОбъект,
		Новый Структура);
	
	ИнтеграцияПодсистемБИПКлиент.ПриОткрытииФормыQRКода(
		ЭтотОбъект,
		ДанныеПлатежнойСсылки,
		ОповещениеПослеЗавершенияНастройкиФормы);
	СистемаБыстрыхПлатежейКлиентПереопределяемый.ПриОткрытииФормыQRКода(
		ЭтотОбъект,
		ДанныеПлатежнойСсылки,
		ОповещениеПослеЗавершенияНастройкиФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	ИнтеграцияПодсистемБИПКлиент.ПриЗакрытииФормыQRКода(
		ЭтотОбъект);
	СистемаБыстрыхПлатежейКлиентПереопределяемый.ПриЗакрытииФормыQRКода(
		ЭтотОбъект);
	
	ОтменитьЗаданиеОпределенияНаличияСтатусаОплаты(ИдентификаторЗаданияОпределенияНаличияСтатуса);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

//@skip-warning
&НаКлиенте
Процедура Подключаемый_ПриОбработкеНажатияКоманды(Команда)
	
	ИнтеграцияПодсистемБИПКлиент.ПриОбработкеНажатияКоманды(
		ЭтотОбъект,
		Команда,
		ДанныеПлатежнойСсылки);
	СистемаБыстрыхПлатежейКлиентПереопределяемый.ПриОбработкеНажатияКоманды(
		ЭтотОбъект,
		Команда,
		ДанныеПлатежнойСсылки);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//@skip-warning
&НаКлиенте
Процедура Подключаемый_ПослеЗавершенияНастройкиФормы(РезультатВыполнения, Параметры) Экспорт
	
	ИнтеграцияПодсистемБИПКлиент.ПриОтображенииQRКода(
		ДанныеПлатежнойСсылки,
		РезультатВыполнения);
	СистемаБыстрыхПлатежейКлиентПереопределяемый.ПриОтображенииQRКода(
		ДанныеПлатежнойСсылки,
		РезультатВыполнения);
	
	Если ДанныеПлатежнойСсылки.ВариантНастройки <> ПредопределенноеЗначение("Перечисление.ВариантыНастройкиСБП.c2g") Тогда
		ПодключитьОбработчикОжидания("ОпределитьНаличиеСтатусаОплаты", 0.1, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОпределитьНаличиеСтатусаОплаты()
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
	ПараметрыОжидания.Интервал = 1;
	
	РезультатВыполнения = ОпределитьНаличиеСтатусаОплатыНаСервере(
		ДанныеСсылки,
		УникальныйИдентификатор);
	
	ИдентификаторЗаданияПроверкиСтатуса = РезультатВыполнения.ИдентификаторЗадания;
	ОповещениеОЗавершении = Новый ОписаниеОповещения(
		"ОпределитьНаличиеСтатусаОплатыЗавершение",
		ЭтотОбъект);
	
	Если РезультатВыполнения.Статус <> "Выполняется" Тогда
		ОпределитьНаличиеСтатусаОплатыЗавершение(РезультатВыполнения, Неопределено);
		Возврат;
	КонецЕсли;
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(
		РезультатВыполнения,
		ОповещениеОЗавершении,
		ПараметрыОжидания);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ОпределитьНаличиеСтатусаОплатыНаСервере(
		Знач ДанныеСсылки,
		Знач УникальныйИдентификатор)
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Проверка наличия статуса оплаты.'");
	
	РезультатВыполнения = ДлительныеОперации.ВыполнитьФункцию(
		ПараметрыВыполнения,
		"СистемаБыстрыхПлатежейСлужебный.ОжидатьТерминальныйСтатусОплаты",
		ДанныеСсылки.ИдентификаторОплаты,
		ДанныеСсылки.ИдентификаторУчастника,
		СистемаБыстрыхПлатежейСлужебный.ИдентификаторОперацииПроверкиОплаты());
	
	ИдентификаторЗаданияОпределенияНаличияСтатуса = РезультатВыполнения.ИдентификаторЗадания;
	
	Возврат РезультатВыполнения;
	
КонецФункции

&НаКлиенте
Процедура ОпределитьНаличиеСтатусаОплатыЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СообщениеОбОшибке = "";
	Если Результат.Статус = "Выполнено" Тогда
		РезультатОперации = ПолучитьИзВременногоХранилища(Результат.АдресРезультата); 
		Если РезультатОперации.ТерминальныйСтатусПолучен Тогда
			Закрыть();
		КонецЕсли;
	ИначеЕсли Результат.Статус = "Ошибка" Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Операция проверки наличия статуса оплаты завершилось с ошибкой: %1'"),
				ОбработкаОшибок.ПредставлениеОшибкиДляПользователя(Результат.ИнформацияОбОшибке)));
	КонецЕсли;
	
	ИдентификаторЗаданияОпределенияНаличияСтатуса = Неопределено;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОтменитьЗаданиеОпределенияНаличияСтатусаОплаты(Знач ИдентификаторЗаданияОпределенияНаличияСтатуса)
	
	ДлительныеОперации.ОтменитьВыполнениеЗадания(ИдентификаторЗаданияОпределенияНаличияСтатуса);
	
КонецПроцедуры

#КонецОбласти
