///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2026, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Открытие формы списка событий эксплуатации ТС ПИоТ
//
// Параметры:
//  ПодключаемоеОборудование - СправочникСсылка.ПодключаемоеОборудование
//
Процедура ОткрытьСобытияЭксплуатацииТСПИоТ(ПодключаемоеОборудование) Экспорт
	
	Если ОбщегоНазначенияБПОКлиент.ИспользуетсяТСПИоТ() Тогда
		ПараметрыФормы = Новый Структура();
		ПараметрыФормы.Вставить("Отбор", Новый Структура("ПодключаемоеОборудование", ПодключаемоеОборудование));
		ОткрытьФорму("РегистрСведений.СобытияЭксплуатацииТСПИоТ.ФормаСписка", ПараметрыФормы, ,ПодключаемоеОборудование);
	КонецЕсли;
	
КонецПроцедуры

// Сохранить cобытия эксплуатации ТС ПИоТ
// 
// Параметры:
//  ПодключаемоеОборудование - СправочникСсылка.ПодключаемоеОборудование
// 
Процедура ЗаписатьСобытиеЭксплуатацииТСПИоТ(ПодключаемоеОборудование, ВременнаяМетка, СобытиеЭксплуатации) Экспорт
	
	МенеджерОборудованияТСПИоТВызовСервера.ЗаписатьСобытиеЭксплуатацииТСПИоТ(ПодключаемоеОборудование, ВременнаяМетка, СобытиеЭксплуатации);
	
КонецПроцедуры

// Очищает cобытия эксплуатации ТС ПИоТ для указанного подключаемого оборудования.
//
// Параметры:
//   ПодключаемоеОборудование - СправочникСсылка.ПодключаемоеОборудование - 
//     ссылка на подключаемое оборудование, для которого необходимо очистить архив логов
//
Процедура ОчиститьСобытияЭксплуатацииТСПИоТ(ПодключаемоеОборудование) Экспорт
	
	МенеджерОборудованияТСПИоТВызовСервера.ОчиститьСобытияЭксплуатацииТСПИоТ(ПодключаемоеОборудование);
	
КонецПроцедуры   

// Открытие формы списка аутентификаций пользователя ТС ПИоТ
//
// Параметры:
//  ПодключаемоеОборудование - СправочникСсылка.ПодключаемоеОборудование
//
Процедура ОткрытьАутентификацииПользователяПИоТ(ПодключаемоеОборудование) Экспорт
	
	Если ОбщегоНазначенияБПОКлиент.ИспользуетсяТСПИоТ() Тогда
		ПараметрыФормы = Новый Структура();
		ПараметрыФормы.Вставить("Отбор", Новый Структура("ПодключаемоеОборудование", ПодключаемоеОборудование));
		ОткрытьФорму("РегистрСведений.АутентификацияПользователяПИоТ.ФормаСписка", ПараметрыФормы, ,ПодключаемоеОборудование);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
