// @strict-types

#Область СлужебныйПрограммныйИнтерфейс

// Параметры:
//  ИдентификаторЭДО - Строка
//
// Возвращаемое значение:
//  См. ДлительныеОперации.ВыполнитьФункцию
Функция ОбновитьДанныеАбонентаПоИдентификатору(ИдентификаторЭДО) Экспорт
	
	ПараметрыВыполненияВФоне = ДлительныеОперации.ПараметрыВыполненияФункции(Новый УникальныйИдентификатор);
	
	Возврат ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполненияВФоне,
		"РаботаСАбонентамиЭДО.ОбновитьДанныеАбонентаИзСервисаНастроекПоИдентификатору", // См. РаботаСАбонентамиЭДО.ОбновитьДанныеАбонентаИзСервисаНастроекПоИдентификатору
		ИдентификаторЭДО);
		
КонецФункции

// Возвращает признак того, что абонент не требует приглашения для начала ЭДО
//
// Параметры:
//  ИдентификаторУчетнойЗаписи - Строка
//
// Возвращаемое значение:
//  Булево
Функция АбонентНеТребуетПриглашений(ИдентификаторУчетнойЗаписи) Экспорт
	
	Возврат РаботаСАбонентамиЭДО.АбонентНеТребуетПриглашений(ИдентификаторУчетнойЗаписи);
	
КонецФункции

#КонецОбласти
