
&НаСервере
Процедура ОчиститьАутентификацииПользователяПИоТНаСервере(Данные)
	
	Если Данные <> Неопределено Тогда
		МенеджерОборудованияТСПИоТ. ОчиститьАутентификацииПользователяПИоТ(Данные.ПодключаемоеОборудование);
	КонецЕсли;
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьАутентификацииПользователяПИоТ(Команда)
	
	ОчиститьАутентификацииПользователяПИоТНаСервере(Элементы.Список.ТекущаяСтрока);  
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СписокПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	
	Для Каждого СтрокаСписка Из Строки Цикл
		ДатаЗаписи = Формат(ОбщегоНазначенияБПО.ВременнаяМеткаВДату(СтрокаСписка.Значение.Данные.ВременнаяМетка), "ДФ='dd.MM.yyyy HH:mm:ss'");
		СтрокаСписка.Значение.Данные.ДатаВремя = ДатаЗаписи;
	КонецЦикла;                 
	
КонецПроцедуры
