#Область ПрограммныйИнтерфейс

// Конструктор настройки экземляра ТС ПИоТ.
// 
// Возвращаемое значение:
//  Структура:
// * НомерФискальногоНакопителя      - Строка - номер фискального накопителя, к которому подключен экземпляр ТС ПИоТ
// * ИдентификаторТСПИоТ             - Строка - идентификатор экземпляра ТС ПИоТ
// * ЗаводскойНомерККТ               - Строка - заводской номер ККТ
// * ИНН                             - Строка - ИНН владельца кассы
// * ТаймаутПроверкиКодаМаркировки   - Число - Таймаут проверки кода маркировки в ТС ПИоТ в милисекундах
// * ДанныеНастройкиЛокальногоМодуля - см. КонструкторНастройкиЛокальногоМодуляПоДаннымТСПИоТ
Функция КонструкторНастройкиЭкземпляраТСПИоТ() Экспорт
	
	СтруктураВозврата = Новый Структура();
	
	СтруктураВозврата.Вставить("НомерФискальногоНакопителя",      "");
	СтруктураВозврата.Вставить("ИдентификаторТСПИоТ",             "");
	СтруктураВозврата.Вставить("ЗаводскойНомерККТ",               "");
	СтруктураВозврата.Вставить("ИНН",                             "");
	СтруктураВозврата.Вставить("ТаймаутПроверкиКодаМаркировки",   0);
	СтруктураВозврата.Вставить("ДанныеНастройкиЛокальногоМодуля", КонструкторНастройкиЛокальногоМодуляПоДаннымТСПИоТ());
	
	Возврат СтруктураВозврата;
	
КонецФункции

// Конструктор настройки Локального модуля по данным ТС ПИоТ.
// 
// Возвращаемое значение:
//  Структура:
// * Подключено                         - Булево - Истина, если ТС ПИоТ возвратил данные подключения Локального модуля "Честный знак"
// * Версия                             - Строка - версия СПО «Локальный модуль «Честный ЗНАК»
// * Статус                             - Строка - статус СПО «Локальный модуль» «Честный ЗНАК»
// * ДатаВремяПоследнейСинхронизации    - Дата - дата и время последней синхронизации по всем базам данных
// * ТокенПМСР                          - Строка - токен ЛМ ЧЗ
// * ДатаДействияТокенаПМСР             - Дата - дата и время истечения срока действия токена в формате ISO 8601 (например, 2025-03-22T10:30:00Z). В
// * IPАдресУстановки                   - Строка - IP-адрес установки ЛМ ЧЗ
// * ПортУстановки                      - Число - порт ЛМ ЧЗ
// * Логин                              - Строка - логин для авторизации в ЛМ ЧЗ
// * Пароль                             - Строка - пароль для авторизации в ЛМ ЧЗ
// * ТаймаутОжиданияОтветаДоПереходаВЛМ - Число - количество миллисекунд на ожидание ответа от ТС ПИоТ
// * СреднееВремяОтветаТСПИоТ           - Число - количество миллисекунд, затраченное на вызов обращения к ТС ПИоТ.
Функция КонструкторНастройкиЛокальногоМодуляПоДаннымТСПИоТ() Экспорт
	
	СтруктураВозврата = Новый Структура();
	
	СтруктураВозврата.Вставить("Подключено",                         Ложь);
	СтруктураВозврата.Вставить("Версия",                             "");
	СтруктураВозврата.Вставить("Статус",                             "");
	СтруктураВозврата.Вставить("ДатаВремяПоследнейСинхронизации",    Дата(1, 1, 1));
	СтруктураВозврата.Вставить("ТокенПМСР",                          "");
	СтруктураВозврата.Вставить("ДатаДействияТокенаПМСР",             Дата(1, 1, 1));
	СтруктураВозврата.Вставить("IPАдресУстановки",                   "");
	СтруктураВозврата.Вставить("ПортУстановки",                      0);
	СтруктураВозврата.Вставить("Логин",                              "");
	СтруктураВозврата.Вставить("Пароль",                             "");
	СтруктураВозврата.Вставить("ТаймаутОжиданияОтветаДоПереходаВЛМ", 0);
	СтруктураВозврата.Вставить("СреднееВремяОтветаТСПИоТ",           0);
	
	Возврат СтруктураВозврата;
	
КонецФункции

// Данные настроенного подключения Локального модуля для обновления токенов по данным 1С:ПИоТ
// 
// Возвращаемое значение:
//  Структура - Данные настроенного локального модуля по ТС ПИоТ:
// * КлючЗаписиНастроек - Неопределено - ключ записи
// * ТокенЛМЧЗ - Строка - токен для ПМСР
// * ДатаДействияТокена - Дата - срок действия токена для ПМСР
Функция ДанныеНастроенногоЛокальногоМодуляПоТСПИоТ() Экспорт
	
	СтруктураВозврата = Новый Структура();
	
	СтруктураВозврата.Вставить("КлючЗаписиНастроек", Неопределено);
	СтруктураВозврата.Вставить("ТокенЛМЧЗ",          "");
	СтруктураВозврата.Вставить("ДатаДействияТокена", Дата(1, 1, 1));
	
	Возврат СтруктураВозврата;
	
КонецФункции

// Функция проверяет статус готовности ТС ПИоТ к проверке марок.
// 
// Параметры:
//  ДанныеСтатусаТСПИоТ - см. ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыСтатусСостоянияПИоТ
// 
// Возвращаемое значение:
//  Булево - Истина, если ТС ПИоТ готов к проверке марок
Функция ПроверкаГотовностиТСПИоТаКПроверкеКМ(ДанныеСтатусаТСПИоТ) Экспорт
	
	Возврат ДанныеСтатусаТСПИоТ.ГотовКПроверкеКМ И (ДанныеСтатусаТСПИоТ.ГотовКПроверкеКМOnline
		Или ДанныеСтатусаТСПИоТ.ГотовКПроверкеКМOffline);
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Возвращает строковое представление версии API ТС ПИоТ для подстановки в URL.
//
// Параметры:
//  ВерсияAPI - ПеречислениеСсылка.ВерсииAPIТСПИоТ - версия API
//
// Возвращаемое значение:
//  Строка - строковое представление версии ("v1", "v2" или "v3")
Функция ВерсияAPIСтрокой(ВерсияAPI) Экспорт
	
	Если ВерсияAPI = ПредопределенноеЗначение("Перечисление.ВерсииAPIТСПИоТ.V3") Тогда
		Возврат "v3";
	ИначеЕсли ВерсияAPI = ПредопределенноеЗначение("Перечисление.ВерсииAPIТСПИоТ.V2") Тогда
		Возврат "v2";
	Иначе
		Возврат "v1";
	КонецЕсли;
	
КонецФункции

// Функция преобразовывает данные Локального модуля, полученные от 1С:ПИоТ в настройки для сохранения в базу.
//
// Параметры:
//  ДанныеТСПИоТ - Структура - данные от 1С:ПИоТ 
// 
// Возвращаемое значение:
//   - см. КонструкторНастройкиЛокальногоМодуляПоДаннымТСПИоТ
//
Функция НастройкиЛокальногоМодуляПоДаннымВнутреннегоТСПИоТ(ДанныеТСПИоТ) Экспорт
	
	ДанныеНастройкиЛокальногоМодуля = КонструкторНастройкиЛокальногоМодуляПоДаннымТСПИоТ();
	
	Если Не ДанныеТСПИоТ.Свойство("Информация")
		Или Не ДанныеТСПИоТ.Информация.Свойство("LM")
		Или ДанныеТСПИоТ.Информация.LM = Неопределено Тогда
		Возврат ДанныеНастройкиЛокальногоМодуля;
	КонецЕсли;
	
	ДанныеЛокальногоМодуляИзТСПИоТ = ДанныеТСПИоТ.Информация.LM;
	
	ДанныеЛокальногоМодуляИзТСПИоТ.Свойство("ip",         ДанныеНастройкиЛокальногоМодуля.IPАдресУстановки);
	ДанныеЛокальногоМодуляИзТСПИоТ.Свойство("version",    ДанныеНастройкиЛокальногоМодуля.Версия);
	ДанныеЛокальногоМодуляИзТСПИоТ.Свойство("login",      ДанныеНастройкиЛокальногоМодуля.Логин);
	ДанныеЛокальногоМодуляИзТСПИоТ.Свойство("pass",       ДанныеНастройкиЛокальногоМодуля.Пароль);
	ДанныеЛокальногоМодуляИзТСПИоТ.Свойство("port",       ДанныеНастройкиЛокальногоМодуля.ПортУстановки);
	ДанныеЛокальногоМодуляИзТСПИоТ.Свойство("token",      ДанныеНастройкиЛокальногоМодуля.ТокенПМСР);
	ДанныеТСПИоТ.Информация.Свойство("codesCheckTimeout", ДанныеНастройкиЛокальногоМодуля.ТаймаутОжиданияОтветаДоПереходаВЛМ);
	
	ДанныеНастройкиЛокальногоМодуля.Подключено = ЗначениеЗаполнено(ДанныеНастройкиЛокальногоМодуля.IPАдресУстановки);
	
	Если ДанныеЛокальногоМодуляИзТСПИоТ.Свойство("lastSync") И ДанныеЛокальногоМодуляИзТСПИоТ.lastSync <> Неопределено Тогда
		ДанныеНастройкиЛокальногоМодуля.ДатаВремяПоследнейСинхронизации    = ОбщегоНазначенияИСКлиентСервер.ДатаИзСтрокиUNIX(ДанныеЛокальногоМодуляИзТСПИоТ.lastSync);
	КонецЕсли;
	Если ДанныеЛокальногоМодуляИзТСПИоТ.Свойство("expDate") И ДанныеЛокальногоМодуляИзТСПИоТ.expDate <> Неопределено Тогда
		ДанныеНастройкиЛокальногоМодуля.ДатаДействияТокенаПМСР             = ДатаИзСтроки(ДанныеЛокальногоМодуляИзТСПИоТ.expDate);
	КонецЕсли;
	
	Возврат ДанныеНастройкиЛокальногоМодуля;
	
КонецФункции

Функция НастройкиЛокальногоМодуляДляВнутреннегоТСПИоТ() Экспорт
	
	СтруктураВозврата = Новый Структура();
	
	СтруктураВозврата.Вставить("КлючНастроекЛокальногоМодуля",   Неопределено);
	СтруктураВозврата.Вставить("ТекущийТокенПМСР",               ""); 
	СтруктураВозврата.Вставить("ТекущаяДатаИстеченияТокенаПМСР", Дата(1, 1, 1));
	
	Возврат СтруктураВозврата;
	
КонецФункции

#Область ЗапросыВТСПИоТ

// Запрос данных о подключенной ККТ к экземпляру ТС ПИоТ по адресу подключения.
// 
// Параметры:
//  ПараметрыПодключения - см. ОбщегоНазначенияИСМПКлиентСервер.ПараметрыПодключенияТСПИоТ
// 
// Возвращаемое значение:
//  Структура - Настройки экземпляра ТС ПИоТ:
// * РезультатОтправкиЗапроса - (См. ОбменДаннымиИСМПКлиентСервер.ОбработатьРезультатОтправкиHTTPЗапросаКакJSON).
// * ТекстОшибки - Строка - текст ошибки, полученной от ТС ПИоТ
// * НастройкиЭкземпляраТСПИоТ - см. ИнтеграцияТСПиоТКлиентСервер.КонструкторНастройкиЭкземляраТСПИоТ
Функция ПолучитьНастройкиЭкземпляраТСПИоТ(ПараметрыПодключения) Экспорт
	
	ВозвращаемоеЗначение = Новый Структура;
	ВозвращаемоеЗначение.Вставить("РезультатОтправкиЗапроса",  Неопределено);
	ВозвращаемоеЗначение.Вставить("ТекстОшибки",                "");
	ВозвращаемоеЗначение.Вставить("НастройкиЭкземпляраТСПИоТ", Неопределено);
	
	ЗаголовокHTTP = Новый Соответствие();
	ЗаголовокHTTP.Вставить("Accept",         "application/json");
	ЗаголовокHTTP.Вставить("Accept-Charset", "utf-8");
	ЗаголовокHTTP.Вставить("Content-Type",   "application/json");
	
	URLЗапроса = СтрШаблон("api/%1/info", ВерсияAPIСтрокой(ПараметрыПодключения.ВерсияAPI));
	
	ПараметрыОтправкиHTTPЗапросов = Новый Структура;
	ПараметрыОтправкиHTTPЗапросов.Вставить("ПредставлениеСервиса",                  НСтр("ru = 'ТС ПИоТ'"));
	ПараметрыОтправкиHTTPЗапросов.Вставить("Сервер",                                ПараметрыПодключения.Сервер);
	ПараметрыОтправкиHTTPЗапросов.Вставить("Порт",                                  ПараметрыПодключения.Порт);
	ПараметрыОтправкиHTTPЗапросов.Вставить("Таймаут",                               60);
	ПараметрыОтправкиHTTPЗапросов.Вставить("ИспользоватьЗащищенноеСоединение",      ПараметрыПодключения.ЗащищенноеСоединение);
	ПараметрыОтправкиHTTPЗапросов.Вставить("ИсключитьПроверкуКорневыхСертификатов", ПараметрыПодключения.ИсключитьПроверкуКорневыхСертификатов);
	
	ВремяНачалаЗапроса = ТекущаяУниверсальнаяДатаВМиллисекундах();
	
	РезультатЗапроса = ОбменДаннымиИСМПКлиентСервер.ОтправитьДанныеВСервис(
		URLЗапроса,
		,,
		"GET",
		ПараметрыОтправкиHTTPЗапросов,
		ЗаголовокHTTP);
		
	ВремяОкончанияЗапроса = ТекущаяУниверсальнаяДатаВМиллисекундах();
	
	РезультатОтправкиЗапроса = ОбменДаннымиИСМПКлиентСервер.ОбработатьРезультатОтправкиHTTPЗапросаКакJSON(РезультатЗапроса, Истина);
	
	ВозвращаемоеЗначение.РезультатОтправкиЗапроса = РезультатОтправкиЗапроса;
	
	Если РезультатОтправкиЗапроса.ОтветПолучен Тогда
		
		Если Не РезультатОтправкиЗапроса.КодСостояния = 200 Тогда
			
			ВозвращаемоеЗначение.ТекстОшибки = ОбщегоНазначенияИСКлиентСервер.ТекстОшибкиПоРезультатуОтправкиЗапроса(
				URLЗапроса,
				РезультатОтправкиЗапроса);
				
		Иначе
			
			ДанныеОбработки = ОбменДаннымиИСМПКлиентСервер.ТекстJSONВОбъект(РезультатОтправкиЗапроса.ТекстВходящегоСообщенияJSON, Истина);
			
			НастройкиЭкземпляраТСПИоТ = КонструкторНастройкиЭкземпляраТСПИоТ();
			
			НастройкиЭкземпляраТСПИоТ.НомерФискальногоНакопителя    = ДанныеОбработки.Получить("fnSerial");
			НастройкиЭкземпляраТСПИоТ.ИдентификаторТСПИоТ           = ДанныеОбработки.Получить("tspiotId");
			НастройкиЭкземпляраТСПИоТ.ЗаводскойНомерККТ             = ДанныеОбработки.Получить("kktSerial");
			НастройкиЭкземпляраТСПИоТ.ИНН                           = ДанныеОбработки.Получить("kktInn");
			НастройкиЭкземпляраТСПИоТ.ТаймаутПроверкиКодаМаркировки = ДанныеОбработки.Получить("codesCheckTimeout");
			
			ДанныеПодключенияЛМЧЗ = ДанныеОбработки.Получить("lm");
			
			Если ДанныеПодключенияЛМЧЗ <> Неопределено Тогда
				
				НастройкиЛокальногоМодуля = НастройкиЭкземпляраТСПИоТ.ДанныеНастройкиЛокальногоМодуля;
				
				ДатаПоследнейСинхронизации = ДанныеПодключенияЛМЧЗ.Получить("lastSync");
				СрокДействияТокена         = ДанныеПодключенияЛМЧЗ.Получить("expDate");
				
				НастройкиЛокальногоМодуля.Подключено                         = Истина;
				НастройкиЛокальногоМодуля.Версия                             = ДанныеПодключенияЛМЧЗ.Получить("version");
				НастройкиЛокальногоМодуля.Статус                             = ДанныеПодключенияЛМЧЗ.Получить("status");
				НастройкиЛокальногоМодуля.ТокенПМСР                          = ДанныеПодключенияЛМЧЗ.Получить("token");
				НастройкиЛокальногоМодуля.IPАдресУстановки                   = ДанныеПодключенияЛМЧЗ.Получить("ip");
				НастройкиЛокальногоМодуля.ПортУстановки                      = ДанныеПодключенияЛМЧЗ.Получить("port");
				НастройкиЛокальногоМодуля.Логин                              = ДанныеПодключенияЛМЧЗ.Получить("login");
				НастройкиЛокальногоМодуля.Пароль                             = ДанныеПодключенияЛМЧЗ.Получить("pass");
				НастройкиЛокальногоМодуля.ТаймаутОжиданияОтветаДоПереходаВЛМ = ДанныеОбработки.Получить("codesCheckTimeout");
				НастройкиЛокальногоМодуля.СреднееВремяОтветаТСПИоТ           = ВремяОкончанияЗапроса - ВремяНачалаЗапроса;
				
				Если ЗначениеЗаполнено(ДатаПоследнейСинхронизации) Тогда
					НастройкиЛокальногоМодуля.ДатаВремяПоследнейСинхронизации = ОбщегоНазначенияИСКлиентСервер.ДатаИзСтрокиUNIX(ДатаПоследнейСинхронизации);
				КонецЕсли;
				
				Если ЗначениеЗаполнено(СрокДействияТокена) Тогда
					НастройкиЛокальногоМодуля.ДатаДействияТокенаПМСР = ДатаИзСтроки(ДанныеПодключенияЛМЧЗ.Получить("expDate"));
				КонецЕсли;
				
			КонецЕсли;
			
			ВозвращаемоеЗначение.НастройкиЭкземпляраТСПИоТ = НастройкиЭкземпляраТСПИоТ;
			
		КонецЕсли;
		
	Иначе
		
		// не получен ответ при инициализации, таймаут или иные проблемы
		ВозвращаемоеЗначение.ТекстОшибки = ОбщегоНазначенияИСКлиентСервер.ТекстОшибкиПоРезультатуОтправкиЗапроса(
			URLЗапроса,
			РезультатОтправкиЗапроса);
		
	КонецЕсли;
	
	//@skip-check constructor-function-return-section
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

// Запрос данных на проверку марки разрешительным режимом к экземпляру ТС ПИоТ по адресу подключения.
// 
// Параметры:
//  ПараметрыПодключения           - см. ОбщегоНазначенияИСМПКлиентСервер.ПараметрыПодключенияТСПИоТ
//  ДанныеПроверки                 - Массив Из СтрокаТабличнойЧасти: см. ШтрихкодированиеОбщегоНазначенияИС.ИнициализацияТаблицыДанныхКодовМаркировки - Коллекция строк таблицы
//  ПараметрыСканирования          - см. ШтрихкодированиеОбщегоНазначенияИС.ПараметрыСканирования
//  ДополнительныеПараметрыЗапроса - см. ИнтеграцияТСПИоТ.ДополнительныеДанныеЗапросаТСПИоТ
// 
// Возвращаемое значение:
//  Структура - Получить информацию по КМ от ККТ:
// * РезультатОтправкиЗапроса - Массив из (См. ОбменДаннымиИСМПКлиентСервер.ОбработатьРезультатОтправкиHTTPЗапросаКакJSON).
// * ТекстОшибки - Строка - текст ошибки, полученной от ТС ПИоТ
// * АварийныйРежим - Булево - Истина, если действует аварийный режим или в ходе проверки он был объявлен
// * СтатусыКодовМаркировкиГИСМТ - Соответствие Из КлючИЗначение - Статусы кодов маркировки:
//		** Ключ - СтрокаТабличнойЧасти: см. ШтрихкодированиеОбщегоНазначенияИС.ИнициализацияТаблицыДанныхКодовМаркировки - Код маркировки.
//		** Значение - см. ПараметрыКодаМаркировкиПоДаннымЛокальногоМодуля
// * ЗапросыДляЛогирования - Массив из см. ШтрихкодированиеОбщегоНазначенияИСМПКлиентСервер.ЗаписатьВЛогОтветРазрешительногоРежимаГИСМТ
// * ТребуетсяОбработкаМарокНаЛокальномМодуле - Соответствие Из КлючИЗначение:
//		** Ключ - СтрокаТабличнойЧасти: см. ШтрихкодированиеОбщегоНазначенияИС.ИнициализацияТаблицыДанныхКодовМаркировки - Код маркировки.
//		** Значение - Булево - Истина, если требуется проверка марки на ЛМ ЧЗ.
Функция ДанныеПоКодуМаркировкиПриРозничнойПродаже(ПараметрыПодключения, ДанныеПроверки, ПараметрыСканирования, ДополнительныеПараметрыЗапроса) Экспорт
	
	ВозвращаемоеЗначение = Новый Структура;
	ВозвращаемоеЗначение.Вставить("РезультатОтправкиЗапроса",                 Новый Массив);
	ВозвращаемоеЗначение.Вставить("ТекстОшибки",                              "");
	ВозвращаемоеЗначение.Вставить("СтатусыКодовМаркировкиГИСМТ",              Новый Соответствие());
	ВозвращаемоеЗначение.Вставить("АварийныйРежим",                           Ложь);
	ВозвращаемоеЗначение.Вставить("ЗапросыДляЛогирования",                    Новый Массив);
	ВозвращаемоеЗначение.Вставить("ТребуетсяОбработкаМарокНаЛокальномМодуле", Новый Соответствие);
	
	ЗаголовокHTTP = Новый Соответствие();
	ЗаголовокHTTP.Вставить("Accept",         "application/json");
	ЗаголовокHTTP.Вставить("Accept-Charset", "utf-8");
	ЗаголовокHTTP.Вставить("Content-Type",   "application/json");
	
	URLЗапроса = СтрШаблон("api/%1/codes/check", ВерсияAPIСтрокой(ПараметрыПодключения.ВерсияAPI));
	
	ПараметрыОтправкиHTTPЗапросов = Новый Структура;
	ПараметрыОтправкиHTTPЗапросов.Вставить("ПредставлениеСервиса",                  НСтр("ru = 'ТС ПИоТ'"));
	ПараметрыОтправкиHTTPЗапросов.Вставить("Сервер",                                ПараметрыПодключения.Сервер);
	ПараметрыОтправкиHTTPЗапросов.Вставить("Порт",                                  ПараметрыПодключения.Порт);
	ПараметрыОтправкиHTTPЗапросов.Вставить("Таймаут",                               ПараметрыПодключения.Таймаут);
	ПараметрыОтправкиHTTPЗапросов.Вставить("ИспользоватьЗащищенноеСоединение",      ПараметрыПодключения.ЗащищенноеСоединение);
	ПараметрыОтправкиHTTPЗапросов.Вставить("ИсключитьПроверкуКорневыхСертификатов", ПараметрыПодключения.ИсключитьПроверкуКорневыхСертификатов);
	
	ДанныеОКлиенте = Новый Структура();
	ДанныеОКлиенте.Вставить("name",            ДополнительныеПараметрыЗапроса.ДанныеКлиента.НаименованиеКассовогоПО);
	ДанныеОКлиенте.Вставить("version",         ДополнительныеПараметрыЗапроса.ДанныеКлиента.ВерсияКассовогоПО);
	ДанныеОКлиенте.Вставить("token",           ДополнительныеПараметрыЗапроса.ДанныеКлиента.КонтрольнаяСумма);
	ДанныеОКлиенте.Вставить("user_name",       ДополнительныеПараметрыЗапроса.ДанныеКлиента.ИмяПользователя);
	
	Если ЗначениеЗаполнено(ДополнительныеПараметрыЗапроса.ДанныеКлиента.ИдентификаторПрикладногоРешения) Тогда
		ДанныеОКлиенте.Вставить("id",              ДополнительныеПараметрыЗапроса.ДанныеКлиента.ИдентификаторПрикладногоРешения);
		ДанныеОКлиенте.Вставить("lastkey",         ДополнительныеПараметрыЗапроса.ДанныеКлиента.ИдентификаторБГосИС);
	Иначе
		ДанныеОКлиенте.Вставить("id",              ДополнительныеПараметрыЗапроса.ДанныеКлиента.ИдентификаторБГосИС);
	КонецЕсли;
	
	Если ПараметрыПодключения.ВерсияAPI = ПредопределенноеЗначение("Перечисление.ВерсииAPIТСПИоТ.V3") Тогда
		ДанныеОКлиенте.Вставить("tz", ДополнительныеПараметрыЗапроса.ДанныеКлиента.ЧасоваяЗона);
	КонецЕсли;
	
	Для Каждого СтрокаДанныхПроверки Из ДанныеПроверки Цикл
		
		Если ПараметрыПодключения.ВерсияAPI = ПредопределенноеЗначение("Перечисление.ВерсииAPIТСПИоТ.V3") Тогда
			СтруктураКода = Новый Структура;
			СтруктураКода.Вставить("cis", СтрокаДанныхПроверки.ПолныйКодМаркировки);
			Если ЗначениеЗаполнено(СтрокаДанныхПроверки.ВидПродукции) Тогда
				СтруктураКода.Вставить("pg", ИнтерфейсИСМПОбщегоНазначенияКлиентСервер.ТоварнаяГруппаЧислом(СтрокаДанныхПроверки.ВидПродукции));
			КонецЕсли;
			МассивКодовИдентификацииДляОтправки = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(СтруктураКода);
		Иначе
			МассивКодовИдентификацииДляОтправки = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(СтрокаДанныхПроверки.ПолныйКодМаркировки);
		КонецЕсли;
	
		ПараметрыЗапроса = Новый Структура;
		ПараметрыЗапроса.Вставить("codes",       МассивКодовИдентификацииДляОтправки);
		ПараметрыЗапроса.Вставить("client_info", ДанныеОКлиенте);
		
		ТелоЗапросаJSON = ОбменДаннымиИСМПКлиентСервер.ОбъектВТекстJSON(ПараметрыЗапроса, Истина);
		
		РезультатЗапроса = ОбменДаннымиИСМПКлиентСервер.ОтправитьДанныеВСервис(
			URLЗапроса,
			ТелоЗапросаJSON,,
			"POST",
			ПараметрыОтправкиHTTPЗапросов,
			ЗаголовокHTTP);
		
		РезультатОтправкиЗапроса = ОбменДаннымиИСМПКлиентСервер.ОбработатьРезультатОтправкиHTTPЗапросаКакJSON(РезультатЗапроса, Истина);
		
		ВозвращаемоеЗначение.РезультатОтправкиЗапроса.Добавить(РезультатОтправкиЗапроса);
		
		Если РезультатОтправкиЗапроса.ОтветПолучен Тогда
			
			Если РезультатОтправкиЗапроса.КодСостояния = ОбщегоНазначенияИСМПКлиентСерверПовтИсп.АварийныйРежимКодОтветаСервисаГИСМТ() Тогда
				
				ПараметрыЛогирования = ШтрихкодированиеОбщегоНазначенияИСМПКлиентСервер.ЗаписатьВЛогОтветРазрешительногоРежимаГИСМТ(
					ПараметрыПодключения.АдресПодключения, 
					Формат(РезультатЗапроса.HTTPОтвет.КодСостояния, "ЧГ=0;"),
					СтрокаДанныхПроверки,
					РезультатОтправкиЗапроса.ТекстВходящегоСообщенияJSON,
					РезультатЗапроса.HTTPЗапрос.ПолучитьТелоКакСтроку());
						
				ВозвращаемоеЗначение.ЗапросыДляЛогирования.Добавить(ПараметрыЛогирования);
				// если аварийный режим, остальные коды можно не проверять
				ВозвращаемоеЗначение.АварийныйРежим = Истина;
				
			ИначеЕсли РезультатОтправкиЗапроса.КодСостояния >= 514 И РезультатОтправкиЗапроса.КодСостояния <= 520 Тогда
				
				ПараметрыЛогирования = ШтрихкодированиеОбщегоНазначенияИСМПКлиентСервер.ЗаписатьВЛогОтветРазрешительногоРежимаГИСМТ(
					ПараметрыПодключения.АдресПодключения, 
					Формат(РезультатЗапроса.HTTPОтвет.КодСостояния, "ЧГ=0;"),
					СтрокаДанныхПроверки,
					РезультатОтправкиЗапроса.ТекстВходящегоСообщенияJSON,
					РезультатЗапроса.HTTPЗапрос.ПолучитьТелоКакСтроку());
					
				ВозвращаемоеЗначение.ЗапросыДляЛогирования.Добавить(ПараметрыЛогирования);
				ВозвращаемоеЗначение.ТребуетсяОбработкаМарокНаЛокальномМодуле.Вставить(СтрокаДанныхПроверки, Истина);
				
			ИначеЕсли Не РезультатОтправкиЗапроса.КодСостояния = 200 Тогда
				
				ПараметрыЛогирования = ШтрихкодированиеОбщегоНазначенияИСМПКлиентСервер.ЗаписатьВЛогОтветРазрешительногоРежимаГИСМТ(
					ПараметрыПодключения.АдресПодключения, 
					Формат(РезультатЗапроса.HTTPОтвет.КодСостояния, "ЧГ=0;"),
					СтрокаДанныхПроверки,
					РезультатОтправкиЗапроса.ТекстВходящегоСообщенияJSON,
					РезультатЗапроса.HTTPЗапрос.ПолучитьТелоКакСтроку());
					
				ВозвращаемоеЗначение.ЗапросыДляЛогирования.Добавить(ПараметрыЛогирования);
				ВозвращаемоеЗначение.ТекстОшибки = ВозвращаемоеЗначение.ТекстОшибки
					+ ?(ЗначениеЗаполнено(ВозвращаемоеЗначение.ТекстОшибки), Символы.ПС, "")
					+ ОбщегоНазначенияИСКлиентСервер.ТекстОшибкиПоРезультатуОтправкиЗапроса(
						URLЗапроса,
						РезультатОтправкиЗапроса);
					
			Иначе
				
				СтруктураПолучательДляЛогирования = ИнициализироватьСтруктуруДанныхПолучателяДляЛогирования();
				
				СтруктураПолучательДляЛогирования.URLЗапроса       = URLЗапроса;
				СтруктураПолучательДляЛогирования.АдресПодключения = ПараметрыПодключения.АдресПодключения;
				
				РезультатРазбораОтвета = РазобратьДанныеОтветаОтТСПИоТ(ДанныеПроверки, РезультатОтправкиЗапроса.ТекстВходящегоСообщенияJSON,
					СтруктураПолучательДляЛогирования, ДополнительныеПараметрыЗапроса, РезультатЗапроса.HTTPОтвет.КодСостояния);
					
				Если РезультатРазбораОтвета.ФорматОтветаНекорректен Тогда
					
					РезультатРазбораОтвета.ТекстОшибки = ОбщегоНазначенияИСКлиентСервер.ТекстОшибкиПоРезультатуОтправкиЗапроса(
						URLЗапроса,
						РезультатОтправкиЗапроса);
					
				КонецЕсли;
				
				ВозвращаемоеЗначение.ТекстОшибки = ВозвращаемоеЗначение.ТекстОшибки
					+ ?(ЗначениеЗаполнено(ВозвращаемоеЗначение.ТекстОшибки), Символы.ПС, "")
					+ РезультатРазбораОтвета.ТекстОшибки;
				
				ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ВозвращаемоеЗначение.ЗапросыДляЛогирования, РезультатРазбораОтвета.ЗапросыДляЛогирования);
				
				Для Каждого ДанныеСтатусаКодаМаркировки Из РезультатРазбораОтвета.СтатусыКодовМаркировкиГИСМТ Цикл
					ВозвращаемоеЗначение.СтатусыКодовМаркировкиГИСМТ.Вставить(ДанныеСтатусаКодаМаркировки.Ключ, ДанныеСтатусаКодаМаркировки.Значение);
				КонецЦикла;
				
			КонецЕсли;
			
		Иначе
			
			// не получен ответ при инициализации, таймаут или иные проблемы
			ПараметрыЛогирования = ШтрихкодированиеОбщегоНазначенияИСМПКлиентСервер.ЗаписатьВЛогОтветРазрешительногоРежимаГИСМТ(
				ПараметрыПодключения.АдресПодключения, 
				"Таймаут",
				СтрокаДанныхПроверки,
				РезультатОтправкиЗапроса.ТекстОшибки,
				РезультатЗапроса.HTTPЗапрос.ПолучитьТелоКакСтроку());
				
			ВозвращаемоеЗначение.ЗапросыДляЛогирования.Добавить(ПараметрыЛогирования);
			ВозвращаемоеЗначение.ТребуетсяОбработкаМарокНаЛокальномМодуле.Вставить(СтрокаДанныхПроверки, Истина);
			
		КонецЕсли;
		
	КонецЦикла;
	
	//@skip-check constructor-function-return-section
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

Функция РазобратьДанныеОтветаОтТСПИоТ(ДанныеПроверки, ТекстВходящегоСообщенияJSON, СтруктураПолучательДляЛогирования, ДополнительныеПараметрыЗапроса = Неопределено, КодСостояния = 200) Экспорт
	
	ВозвращаемоеЗначение = Новый Структура();
	ВозвращаемоеЗначение.Вставить("ТекстОшибки",                 "");
	ВозвращаемоеЗначение.Вставить("СтатусыКодовМаркировкиГИСМТ", Новый Соответствие());
	ВозвращаемоеЗначение.Вставить("ФорматОтветаНекорректен",     Ложь);
	ВозвращаемоеЗначение.Вставить("ЗапросыДляЛогирования",       Новый Массив);
	
	ДанныеОбработки = ОбменДаннымиИСМПКлиентСервер.ТекстJSONВОбъект(ТекстВходящегоСообщенияJSON, Истина);
	ДанныеОКодах    = ДанныеОбработки.Получить("codesResponse");
	
	СоответствиеКИЗСтрокам              = Новый Соответствие;
	
	Для Каждого СтрокаДанныхПроверки Из ДанныеПроверки Цикл
		
		СоответствиеКИЗСтрокам.Вставить(ШтрихкодированиеОбщегоНазначенияИСКлиентСервер.Base64ВШтрихкод(СтрокаДанныхПроверки.ПолныйКодМаркировки), СтрокаДанныхПроверки);
		СоответствиеКИЗСтрокам.Вставить(СтрокаДанныхПроверки.КодИдентификацииДляОтправкиВЛокальныйМодуль, СтрокаДанныхПроверки);
		
	КонецЦикла;
	
	Если ДанныеОКодах <> Неопределено Тогда
		
		Если ТипЗнч(ДанныеОКодах) = Тип("Соответствие") Тогда
			// v1: двойная вложенность codesResponse
			ДанныеОКодах = ДанныеОКодах.Получить("codesResponse");
		КонецЕсли;
		
		Если ДанныеОКодах <> Неопределено И ТипЗнч(ДанныеОКодах) = Тип("Массив") Тогда
			
			Для Каждого СтрокаДанныхОКодах Из ДанныеОКодах Цикл
			
				КодОшибки                                    = СтрокаДанныхОКодах.Получить("code");
				СообщениеОбОшибке                            = СтрокаДанныхОКодах.Получить("description");
				РезультатПроверки                            = СтрокаДанныхОКодах.Получить("codes");
				
				РазрешительныйРежимДатаЗапросаГИСМТ          = СтрокаДанныхОКодах.Получить("reqTimestamp");
				РазрешительныйРежимИдентификаторЗапросаГИСМТ = СтрокаДанныхОКодах.Получить("reqId");
				РазрешительныйРежимИдентификаторЭкземпляраПО = СтрокаДанныхОКодах.Получить("inst");
				РазрешительныйРежимВерсияБазы                = СтрокаДанныхОКодах.Получить("version");
				
				ПродажаПоДаннымОффлайнРежима                 = СтрокаДанныхОКодах.Получить("isCheckedOffline");
				
				Если ЗначениеЗаполнено(КодОшибки) И Не КодОшибки = ОбщегоНазначенияИСМПКлиентСерверПовтИсп.ПоставарийныйРежимКодОтветаСервисаГИСМТ() Тогда
					
					ТекстОшибки = ТекстОшибкиРазрешительногоРежимаПоКодуОшибкиТСПИоТ(КодОшибки, СообщениеОбОшибке);
					
					Если ЗначениеЗаполнено(ТекстОшибки) Тогда
						
						Для Каждого ДанныеШтрихкода Из ДанныеПроверки Цикл
							
							ДанныеШтрихкода.ТекстОшибки               = ТекстОшибки;
							ДанныеШтрихкода.КонтролиРазрешительногоРежима.Добавить(ТекстОшибки);
							
						КонецЦикла;
						
					КонецЕсли;
					
				Иначе
					
					Если РезультатПроверки = Неопределено Тогда
						РезультатПроверки = СтрокаДанныхОКодах.Получить("detials");
					КонецЕсли;
					
					Если РезультатПроверки = Неопределено Тогда
						
						// неклассифицированный формат ответа ТС ПИоТ
						ВозвращаемоеЗначение.ФорматОтветаНекорректен = Истина;
						Продолжить;
						
					КонецЕсли;
					
					Для Каждого СтрокаРезультатаПроверкиПоКодам Из РезультатПроверки Цикл
						
						КодОшибки                                    = СтрокаРезультатаПроверкиПоКодам.Получить("code");
						СообщениеОбОшибке                            = СтрокаРезультатаПроверкиПоКодам.Получить("description");
						
						Если ЗначениеЗаполнено(КодОшибки) Тогда
							
							ТекстОшибки = ТекстОшибкиРазрешительногоРежимаПоКодуОшибкиТСПИоТ(КодОшибки, СообщениеОбОшибке);
							
							Если ЗначениеЗаполнено(ТекстОшибки) Тогда
								
								Для Каждого ДанныеШтрихкода Из ДанныеПроверки Цикл
									
									ДанныеШтрихкода.ТекстОшибки               = ТекстОшибки;
									ДанныеШтрихкода.КонтролиРазрешительногоРежима.Добавить(ТекстОшибки);
									
								КонецЦикла;
								
								Продолжить;
								
							КонецЕсли;
							
						КонецЕсли;
						
						КИЗСтроки       = СтрокаРезультатаПроверкиПоКодам.Получить("cis");
						ДанныеШтрихкода = Неопределено;
						
						Если Не КИЗСтроки = Неопределено Тогда
							ДанныеШтрихкода = СоответствиеКИЗСтрокам.Получить(КИЗСтроки);
						КонецЕсли;
						
						Если ДанныеШтрихкода = Неопределено Тогда
							Продолжить;
						КонецЕсли;
						
						КодОшибки = СтрокаРезультатаПроверкиПоКодам.Получить("errorCode");
						
						Если ЗначениеЗаполнено(КодОшибки) Тогда
							
							ТекстОшибки = ИнтерфейсИСМПОбщегоНазначенияКлиентСервер.ТекстОшибкиРазрешительногоРежимаПоКодуОшибкиГИСМТ(КодОшибки, СообщениеОбОшибке);
							
							Если ЗначениеЗаполнено(ТекстОшибки) Тогда
								
								ДанныеШтрихкода.ТекстОшибки               = ТекстОшибки;
								ДанныеШтрихкода.КонтролиРазрешительногоРежима.Добавить(ТекстОшибки);
								
							КонецЕсли;
							
							Продолжить;
							
						КонецЕсли;
						
						ПараметрыКодаМаркировки = ИнтерфейсИСМПОбщегоНазначенияКлиентСервер.ПараметрыКодаМаркировкиПоДаннымРазрешительногоРежима(СтрокаРезультатаПроверкиПоКодам, ДанныеШтрихкода.ВидПродукции, ДополнительныеПараметрыЗапроса);
						
						ПараметрыКодаМаркировки.РазрешительныйРежимИдентификаторЗапросаГИСМТ = РазрешительныйРежимИдентификаторЗапросаГИСМТ;
						ПараметрыКодаМаркировки.РазрешительныйРежимДатаЗапросаГИСМТ          = Формат(РазрешительныйРежимДатаЗапросаГИСМТ, "ЧГ=;");
						ПараметрыКодаМаркировки.РазрешительныйРежимИдентификаторЭкземпляраПО = РазрешительныйРежимИдентификаторЭкземпляраПО;
						ПараметрыКодаМаркировки.РазрешительныйРежимВерсияБазы                = РазрешительныйРежимВерсияБазы;
						
						ПараметрыКодаМаркировки.РазрешительныйРежимАдресСервера              = СтруктураПолучательДляЛогирования.АдресПодключения;
						ПараметрыКодаМаркировки.РазрешительныйРежимТелоЗапросаJSON           = СтруктураПолучательДляЛогирования.URLЗапроса;
						ПараметрыКодаМаркировки.РазрешительныйРежимТелоОтветаJSON            = ТекстВходящегоСообщенияJSON;
						ПараметрыКодаМаркировки.РазрешительныйРежимКодОтвета                 = Формат(КодСостояния, "ЧГ=0;");
						
						ПараметрыКодаМаркировки.ПродажаПоДаннымОффлайнРежима                 = ПродажаПоДаннымОффлайнРежима;
						
						Если Не ЗначениеЗаполнено(ДанныеШтрихкода.ВидПродукции)
							И ЗначениеЗаполнено(ПараметрыКодаМаркировки.ВидПродукции) Тогда
							ДанныеШтрихкода.ВидПродукции = ПараметрыКодаМаркировки.ВидПродукции;
						КонецЕсли;
						
						ВозвращаемоеЗначение.СтатусыКодовМаркировкиГИСМТ.Вставить(ДанныеШтрихкода, ПараметрыКодаМаркировки);
						
					КонецЦикла;
					
				КонецЕсли;
				
				Если ДополнительныеПараметрыЗапроса <> Неопределено И ДополнительныеПараметрыЗапроса.ЛогироватьУспешныеПроверки Тогда
					
					ПараметрыЗаписиВЛог = ШтрихкодированиеОбщегоНазначенияИСМПКлиентСервер.ЗаписатьВЛогОтветРазрешительногоРежимаГИСМТ(СтруктураПолучательДляЛогирования.АдресПодключения,
						КодСостояния, ДанныеШтрихкода, ТекстВходящегоСообщенияJSON, 
						СтруктураПолучательДляЛогирования.URLЗапроса, Формат(РазрешительныйРежимДатаЗапросаГИСМТ, "ЧГ=;"),
						РазрешительныйРежимИдентификаторЗапросаГИСМТ);
						
					ВозвращаемоеЗначение.ЗапросыДляЛогирования.Добавить(ПараметрыЗаписиВЛог);
					
				КонецЕсли;
				
			КонецЦикла;
			
		Иначе
			
			// неклассифицированный формат ответа ТС ПИоТ
			ВозвращаемоеЗначение.ФорматОтветаНекорректен = Истина;
			
		КонецЕсли;
		
	Иначе
		
		// неклассифицированный формат ответа ТС ПИоТ
		ВозвращаемоеЗначение.ФорматОтветаНекорректен = Истина;
		
	КонецЕсли;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

Функция ИнициализироватьСтруктуруДанныхПолучателяДляЛогирования() Экспорт
	
	СтруктураВозврата = Новый Структура;
	
	СтруктураВозврата.Вставить("URLЗапроса",       "");
	СтруктураВозврата.Вставить("АдресПодключения", "");
	
	Возврат СтруктураВозврата;
	
КонецФункции

#КонецОбласти

#Область ТекстыОшибокТСПИоТ

Функция ТекстОшибкиРазрешительногоРежимаПоКодуОшибкиТСПИоТ(КодОшибки, ОписаниеОшибкиТСПИоТ = Неопределено) Экспорт
	
	ТекстОшибки = "";
	
	Если КодОшибки = 13 Тогда
		ТекстОшибки = НСтр("ru = 'Отсутствует связь с ЛМ ЧЗ. Проверьте состояние ТС ПИоТ.'");
	Иначе
		
		ШаблонПодсказки   = НСтр("ru = 'Неклассифицированная ошибка отправки запроса по КМ в ТС ПИоТ.
			|Описание из сервиса: %1.'");
			
		Если ОписаниеОшибкиТСПИоТ <> Неопределено Тогда
			ТекстИзГИСМТ = СтрЗаменить(ОписаниеОшибкиТСПИоТ, Символ(29), "");
		Иначе
			ТекстИзГИСМТ = "отсутствует";
		КонецЕсли;
		
		ТекстОшибки = СтрШаблон(ШаблонПодсказки, ТекстИзГИСМТ);
		
	КонецЕсли;
	
	Возврат ТекстОшибки;
	
КонецФункции

#КонецОбласти

#Область КонвертацияДанных

// Преобразует исходную строку в дату. 
// Если дату не удалось распознать, то возвращается пустая дата (01.01.01 00:00:00).
//
// Параметры:
//  Значение - Строка - строка, которую необходимо привести к дате.
// 
// Возвращаемое значение:
//  Дата
//
Функция ДатаИзСтроки(Значение) Экспорт
	
	Если СтрНайти(Значение, "T") > 0 Тогда
		#Если ВебКлиент Тогда
			Возврат ДатаИзСтрокиJSONФорматаISO(Значение);
		#Иначе
			Возврат ПрочитатьДатуJSON(Значение, ФорматДатыJSON.ISO);
		#КонецЕсли
	Иначе
		Возврат СтроковыеФункцииКлиентСервер.СтрокаВДату(Значение, ЧастиДаты.ДатаВремя);
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ДатаИзСтрокиJSONФорматаISO(Значение)
	
	МассивПодчастейСтроки = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Значение, ".", Истина, Истина);
	
	Если МассивПодчастейСтроки.Количество() = 2 Тогда
		
		ЧастьДата = МассивПодчастейСтроки[0];
		
		Если СтрНайти(ЧастьДата, "T") > 0 Тогда
			ЧастьДата = СтрЗаменить(ЧастьДата, "T", " ");
		КонецЕсли;
		
		Возврат СтроковыеФункцииКлиентСервер.СтрокаВДату(ЧастьДата, ЧастиДаты.ДатаВремя);
		
	Иначе
		Возврат Дата(1, 1, 1);
	КонецЕсли;
	
КонецФункции

#КонецОбласти
