
&НаСервере
Процедура ОчиститьСобытияЭксплуатацииТСПИоТНаСервере(Данные)
	
	Если Данные <> Неопределено Тогда
		МенеджерОборудованияТСПИоТ.ОчиститьСобытияЭксплуатацииТСПИоТ(Данные.ПодключаемоеОборудование);
	КонецЕсли;
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьСобытияЭксплуатацииТСПИоТ(Команда)
	
	ОчиститьСобытияЭксплуатацииТСПИоТНаСервере(Элементы.Список.ТекущаяСтрока);  
	
КонецПроцедуры

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ВыделенныеЗаписи()
	
	ТаблицаКлючей = Новый ТаблицаЗначений();
	ТаблицаКлючей.Колонки.Добавить("ИдентификаторСобытия", Новый ОписаниеТипов("УникальныйИдентификатор"));
	Для Каждого КлючЗаписи Из Элементы.Список.ВыделенныеСтроки Цикл
		СтрокаТаблицы = ТаблицаКлючей.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТаблицы, КлючЗаписи);
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СобытияЭксплуатацииТСПИоТ.ИдентификаторСобытия КАК ИдентификаторСобытия,
		|	СобытияЭксплуатацииТСПИоТ.КодСобытия КАК КодСобытия,
		|	СобытияЭксплуатацииТСПИоТ.Событие КАК Событие,
		|	СобытияЭксплуатацииТСПИоТ.ВременнаяМетка КАК ВременнаяМетка
		|ИЗ
		|	РегистрСведений.СобытияЭксплуатацииТСПИоТ КАК СобытияЭксплуатацииТСПИоТ
		|ГДЕ
		|	(СобытияЭксплуатацииТСПИоТ.ИдентификаторСобытия) В (&ТаблицаКлючей)
		|УПОРЯДОЧИТЬ ПО
		|	ВременнаяМетка";
	
	Запрос.УстановитьПараметр("ТаблицаКлючей", ТаблицаКлючей);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Возврат Выборка;
	
КонецФункции

&НаСервере
Функция СтрокаЗаписи(Запись)
	
	Возврат РегистрыСведений.СобытияЭксплуатацииТСПИоТ.СтрокаЗаписиСобытия(Запись);
	
КонецФункции

&НаКлиенте
Процедура ВыгрузитьВФайл(Команда)  
	
	ТекстовыйДокумет = ВыгрузитьВФайлВсеСтрокиНаСервере();
	ТекстовыйДокумет.Показать(); 
	
КонецПроцедуры

&НаСервере
Функция ЗаписиПоСписку()
	
	Схема = Элементы.Список.ПолучитьИсполняемуюСхемуКомпоновкиДанных();
	Настройки = Элементы.Список.ПолучитьИсполняемыеНастройкиКомпоновкиДанных();
	
	Поле = Настройки.Структура[0].Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
	Поле.Использование = Истина;
	Поле.Заголовок = "ВременнаяМетка";
	Поле.Поле = Новый ПолеКомпоновкиДанных("ВременнаяМетка");
	
	Поле = Настройки.Структура[0].Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
	Поле.Использование = Истина;
	Поле.Заголовок = "КодСобытия";
	Поле.Поле = Новый ПолеКомпоновкиДанных("КодСобытия");
	
	Поле = Настройки.Структура[0].Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
	Поле.Использование = Истина;
	Поле.Заголовок = "Событие";
	Поле.Поле = Новый ПолеКомпоновкиДанных("Событие");
	
	Настройки.Структура[0].Порядок.Элементы.Очистить();
	
	Поле = Настройки.Структура[0].Порядок.Элементы.Добавить(Тип("ЭлементПорядкаКомпоновкиДанных"));
	Поле.Использование = Истина;
	Поле.Поле = Новый ПолеКомпоновкиДанных("ВременнаяМетка");
	Поле.ТипУпорядочивания = НаправлениеСортировкиКомпоновкиДанных.Убыв;
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных();
	МакетКомпоновки = КомпоновщикМакета.Выполнить(Схема, Настройки, , , Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	
	Возврат ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
КонецФункции

&НаСервере
Функция ВыгрузитьВФайлВсеСтрокиНаСервере()

	#Если Не МобильноеПриложениеСервер Тогда
	Записи = ЗаписиПоСписку();
	ТекстовыйДокумент = Новый ТекстовыйДокумент();
	Для каждого Запись Из Записи Цикл
		ТекстовыйДокумент.ДобавитьСтроку(СтрокаЗаписи(Запись));
	КонецЦикла;
	
	Возврат ТекстовыйДокумент;
	#КонецЕсли
	
КонецФункции

&НаСервере
Функция ВыгрузитьВФайлВыделенныеСтрокиНаСервере()

	#Если Не МобильноеПриложениеСервер Тогда
	Выборка = ВыделенныеЗаписи();
	ТекстовыйДокумент = Новый ТекстовыйДокумент();
	Пока Выборка.Следующий() Цикл
		ТекстовыйДокумент.ДобавитьСтроку(СтрокаЗаписи(Выборка));
	КонецЦикла;
	
	Возврат ТекстовыйДокумент;
	#КонецЕсли
	
КонецФункции

&НаКлиенте
Процедура ВыгрузитьВФайлВыделенные(Команда)
	
	ТекстовыйДокумет = ВыгрузитьВФайлВыделенныеСтрокиНаСервере();
	ТекстовыйДокумет.Показать(); 
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СписокПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	
	Для Каждого СтрокаСписка Из Строки Цикл
		СтрокаСписка.Значение.Данные.ДатаВремя = ОбщегоНазначенияБПО.ВременнаяМеткаВДату(СтрокаСписка.Значение.Данные.ВременнаяМетка);
	КонецЦикла;                 
	
КонецПроцедуры

#КонецОбласти
