&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	                                                           
	ОбменСГИСЭПД.ПриСозданииНаСервереПодчиненнойФормы(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	
	Если Параметры.Свойство("ФормаБезОбработки") = Ложь Тогда
		
		Если ЭтотОбъект.ЗапретитьИзменение = Ложь Тогда
			Элементы.СсылкаОбъявлСтГрузВалюта.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.Валюты");    
			Элементы.СсылкаДейстСтГрузВалюта.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.Валюты");
		КонецЕсли;
		
		Элементы.ЗаполнитьТитулЗаказчикаОписаниеГрузаНомКонтейн.Видимость = ПрзПрвз <> "0";
		
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура Сохранить(Команда)
	
	
	ОбменСГИСЭПДКлиент.СохранитьПараметрыПодчиненнойФормы(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбменСГИСЭПДКлиент.ПриОткрытииПодчиненнойФормы(ЭтотОбъект);
																		
КонецПроцедуры
			
&НаКлиенте
Функция ОписаниеРеквизитовФормы() Экспорт
	
	Возврат ОписаниеРеквизитовФормыСервер();
	
КонецФункции

&НаСервере
Функция ОписаниеРеквизитовФормыСервер()
	
	Возврат ОбменСГИСЭПД.ОписаниеРеквизитовФормы(ЭтаФорма);
		
КонецФункции

&НаКлиенте
Процедура ОчиститьДейстСтГрузСтоимость()
	
	ТекущиеДанные = Элементы.ТитулЗаказчикаОписаниеГруза.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда	
		ТекущиеДанные.ДейстСтГрузСтоимость = 0;		
		ТекущиеДанные.ДейстСтГрузКодВалюты = Неопределено;
		ТекущиеДанные.ДейстСтГрузНаименованиеВалюты = Неопределено;
		ТекущиеДанные.СсылкаДейстСтГрузВалюта = Неопределено;
	КонецЕсли;
	
КонецПроцедуры       

&НаКлиенте
Процедура ОчиститьОбъявлСтГрузСтоимость()
	
	ТекущиеДанные = Элементы.ТитулЗаказчикаОписаниеГруза.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда	
		ТекущиеДанные.ОбъявлСтГрузСтоимость = 0;		
		ТекущиеДанные.ОбъявлСтГрузКодВалюты = Неопределено;
		ТекущиеДанные.ОбъявлСтГрузНаименованиеВалюты = Неопределено;
		ТекущиеДанные.СсылкаОбъявлСтГрузВалюта = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТитулЗаказчикаОписаниеГрузаОбъявлСтГрузСтГрПриИзменении(Элемент)
	ОчиститьДейстСтГрузСтоимость();
КонецПроцедуры

&НаКлиенте
Процедура ТитулЗаказчикаОписаниеГрузаДейстСтГрузСтГрПриИзменении(Элемент)
	ОчиститьОбъявлСтГрузСтоимость();
КонецПроцедуры  

&НаКлиенте
Процедура СсылкаОбъявлСтГрузВалютаПриИзменении(Элемент) 
	ОчиститьДейстСтГрузСтоимость();
	ОбменСГИСЭПДКлиентСервер.ЗаполнитьРеквизитыПоСсылке(Элемент, ЭтотОбъект, Элементы.ТитулЗаказчикаОписаниеГруза.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура СсылкаДейстСтГрузВалютаПриИзменении(Элемент)
	ОчиститьОбъявлСтГрузСтоимость();
	ОбменСГИСЭПДКлиентСервер.ЗаполнитьРеквизитыПоСсылке(Элемент, ЭтотОбъект, Элементы.ТитулЗаказчикаОписаниеГруза.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ТитулЗаказчикаОписаниеГрузаОбъемПриИзменении(Элемент)
	ТекущиеДанные = Элементы.ТитулЗаказчикаОписаниеГруза.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда	
		ТекущиеДанные.УказОбъем = ТекущиеДанные.Объем <> 0;	
	КонецЕсли;
КонецПроцедуры 

&НаКлиенте
Процедура ТитулЗаказчикаОписаниеГрузаКодТовНомПриИзменении(Элемент)
	ТекущиеДанные = Элементы.ТитулЗаказчикаОписаниеГруза.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		КодТовНомСтрДлина = СтрДлина(ТекущиеДанные.КодТовНом);
		Если КодТовНомСтрДлина < 4 Или КодТовНомСтрДлина > 10 Тогда
			ТекущиеДанные.КодТовНом = "";	
		КонецЕсли;
		ТекущиеДанные.НалКодТовНом = ЗначениеЗаполнено(ТекущиеДанные.КодТовНом);	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТитулЗаказчикаОписаниеГрузаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ИменаПолей = Новый Массив;
	ИменаПолей.Добавить("ЗаполнитьТитулЗаказчикаОписаниеГрузаКодТовОКПД2");
	ИменаПолей.Добавить("ЗаполнитьТитулЗаказчикаОписаниеГрузаКодГрузГНГ");
	ИменаПолей.Добавить("ЗаполнитьТитулЗаказчикаОписаниеГрузаКодГрузЕТСНГ");
	ИменаПолей.Добавить("ЗаполнитьТитулЗаказчикаОписаниеГрузаМарк");
	ИменаПолей.Добавить("ЗаполнитьТитулЗаказчикаОписаниеГрузаНомКонтейн");
	ИменаПолей.Добавить("ЗаполнитьТитулЗаказчикаОписаниеГрузаСвСтрПроисх");
	ИменаПолей.Добавить("ЗаполнитьТитулЗаказчикаОписаниеГрузаИнфУпГруз");
	ИменаПолей.Добавить("ЗаполнитьТитулЗаказчикаОписаниеГрузаСвОпаснГруз");
	ИменаПолей.Добавить("ЗаполнитьТитулЗаказчикаОписаниеГрузаСвГосСист");
	
	Если ИменаПолей.Найти(Поле.Имя) <> Неопределено Тогда
		ОбменСГИСЭПДКлиент.ВывестиФормуВводаДанных(ЭтотОбъект, Поле.Имя, Элемент.ТекущиеДанные);
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура ТитулЗаказчикаОписаниеГрузаПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ОбменСГИСЭПДКлиент.ТаблицаПриНачалеРедактирования(Элемент, ЭтотОбъект, НоваяСтрока, Копирование); 
	
	Если НоваяСтрока И Не Копирование Тогда
		
		ТекущиеДанные = Элемент.ТекущиеДанные;
		
		ТекущиеДанные.ПрзОпаснГруз = Ложь;
		ТекущиеДанные.ПрзИзъятВещ = Ложь; 
		ТекущиеДанные.УказОбъем = Ложь; 
		ТекущиеДанные.НалКодТовНом = Ложь;		
		ТекущиеДанные.УчГосСист = Ложь; 
		ТекущиеДанные.НалУпак = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТитулЗаказчикаОписаниеГрузаПередУдалением(Элемент, Отказ)
	ТекущиеДанные = Элемент.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		ОбменСГИСЭПДКлиент.ОчиститьПодчиненныеТаблицы(ЭтотОбъект, Элемент.Имя, ТекущиеДанные.ИдентификаторСтроки, Отказ);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ОтметитьОбязательныеНеЗаполненныеЭлементыФормы" Тогда
		Если УникальныйИдентификатор <> Параметр Тогда
			Возврат;
		КонецЕсли;
		ОтметитьОбязательныеНеЗаполненныеЭлементыФормы(Параметр);
	ИначеЕсли ИмяСобытия = "ИзменитьОформлениеКнопокФормы" Тогда
		Если УникальныйИдентификатор <> Параметр.УникальныйИдентификаторОбновляемойФормы Тогда
			Возврат;
		КонецЕсли;
		ИзменитьОформлениеКнопок(Параметр);	 
	ИначеЕсли СтрНачинаетсяС(ИмяСобытия, "Запись_") Тогда
		Если ТипЗнч(Источник) = Тип("СправочникСсылка.ХранимыеДанныеЭПД") Тогда	
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#Область ОбъектыОбязательныеДляЗаполнения

&НаКлиенте
Процедура ИзменитьОформлениеКнопок(Параметр) Экспорт

	Если Не ЭтотОбъект.НачальноеОформлениеВыполнено Тогда
		ЭтотОбъект.ТребуетсяДополнительноеОформлениеКнопок = Истина;
		Если ЭтотОбъект.СтруктураДополнительногоОформленияКнопок <> Неопределено Тогда
			ЭтотОбъект.СтруктураДополнительногоОформленияКнопок = 
				Новый ФиксированнаяСтруктура("ИмяКнопки, ИдентификаторСтроки");
		Иначе
			ЭтотОбъект.СтруктураДополнительногоОформленияКнопок = Параметр;
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	СтруктураСТекущимиДаннымиРеквизитов = ОбменСГИСЭПДКлиентСервер.ПолучитьСтруктуруПоТитулуИВерсии(ЭтотОбъект);
	СтруктураДанныхОбъекта = ОбменСГИСЭПДКлиентСервер.ПолучитьСериализуемыйОбъектСДаннымиДокумента(ЭтотОбъект);
	СтруктураСДаннымиФормыДляОформленияКнопок = 
		ОбменСГИСЭПДКлиентСервер.СтруктураСДаннымиФормыДляОформленияКнопок(ЭтотОбъект);
	
	Результат = ИзменитьОформлениеКнопокНаСервере(СтруктураСТекущимиДаннымиРеквизитов,
		Параметр.ИмяКнопки,
		Параметр.ИдентификаторСтроки,
		СтруктураДанныхОбъекта,
		СтруктураСДаннымиФормыДляОформленияКнопок);
		
	Если Результат.Успешно Тогда
		ЭтотОбъект.АдресДереваСоответствийИтаблицыКнопок = Результат.НовыйАдресВХранилище;	
		МассивОформления = Результат.МассивОформления;
		ОбменСГИСЭПДКлиентСервер.ОформлениеКнопокНаФорме(ЭтотОбъект,
			СтруктураСТекущимиДаннымиРеквизитов, МассивОформления);	
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ИзменитьОформлениеКнопокНаСервере(Знач СтруктураСТекущимиДаннымиРеквизитов,
	ИмяКнопки = Неопределено,
	ИдентификаторСтроки = Неопределено,
	Знач СтруктураДанныхОбъекта,
	Знач СтруктураСДаннымиФормыДляОформленияКнопок)
	
	НовыйАдресВХранилище = ОбменСГИСЭПД.ЗапуститьИзменениеОформленияКнопок(СтруктураСДаннымиФормыДляОформленияКнопок,
		СтруктураСТекущимиДаннымиРеквизитов, ИмяКнопки, ИдентификаторСтроки, СтруктураДанныхОбъекта);

	Результат = ОбменСГИСЭПД.ОбработатьРезультатИзмененияОформленияКнопок(НовыйАдресВХранилище);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ОтметитьОбязательныеНеЗаполненныеЭлементыФормы(Параметр)
	
	СтруктураСТекущимиДаннымиРеквизитов = ОбменСГИСЭПДКлиентСервер.ПолучитьСтруктуруПоТитулуИВерсии(ЭтотОбъект);
	ОтметитьОбязательныеНеЗаполненныеЭлементыФормыНаСервере(СтруктураСТекущимиДаннымиРеквизитов);
	
КонецПроцедуры

&НаСервере
Процедура ОтметитьОбязательныеНеЗаполненныеЭлементыФормыНаСервере(Знач СтруктураСТекущимиДанными)
	
	ОбменСГИСЭПД.ОтметитьОбязательныеНеЗаполненныеЭлементыФормы(ЭтотОбъект, СтруктураСТекущимиДанными);
	
КонецПроцедуры



#КонецОбласти