

#Область ОписаниеПеременных

&НаКлиенте
Перем ПараметрыОбработчикаОжидания,
	ПаролиСертификатов,
	КонтекстДиагностики,
	ОбработчикРезультатаДанные,
	ПрограммаКриптографии,
	СвойстваПароля,
	НеобходимПоискИдентификаторов,
	РучноеОбновлениеСертификатов;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ОткрытиеФормыНедоступно(Отказ) Тогда
		Возврат;
	КонецЕсли;
	
	ЗапуститьОбновлениеКешОператоровИФорматов();
	УстановитьЗначенияПоУмолчанию(Параметры);
	
	Если ПоддержанаРаботаСФизическимиЛицами
			И Не СозданиеУчетнойЗаписиИзСуществующейОрганизации Тогда
		ПереключитьТекущуюСтраницуНаЭтапВыбораВидаОрганизации(ЭтотОбъект);
	Иначе
		ПереключитьТекущуюСтраницуНаЭтапВводаДанных(ЭтотОбъект);
	КонецЕсли;
	
	УстановитьВидимостьЭлементовФормы(ЭтотОбъект);
	УстановитьВидимостьВидаПодключения(ЭтотОбъект);
	УстановитьОтображениеЗарегистрироватьЭДОТекст(ЭтотОбъект);
	СкрытьЗаголовкиУРасширеннойПодсказки(ЭтотОбъект);
	
	ЗначениеВРеквизитФормы(РегистрыСведений.ОператорыЭДО.КодыПоддерживаемыхТиповДокументов(), "КодыТиповДокументов");
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	#Если ВебКлиент Тогда
		ПодключитьОбработчикОжидания("ПроверкаКриптографии", 0.1, Истина);
	#Иначе
		ПроверкаКриптографии();
	#КонецЕсли
	
	ЗаполнитьПредставлениеПоддерживаемыхТиповДокументов();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаНавигационнойСсылки(НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	Если НавигационнаяСсылкаФорматированнойСтроки = "ИнструкцияПоНастройкеКриптопровайдера" Тогда
		Если УстановленVipNet Тогда
			СсылкаНаИнструкцию = "https://edo.1c.ru/handbook/22/3994/";
		Иначе
			СсылкаНаИнструкцию = "https://edo.1c.ru/handbook/22/4182/";
		КонецЕсли;
		НавигационнаяСсылкаФорматированнойСтроки = СсылкаНаИнструкцию;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если ВыполняетсяРегистрация Тогда
		Отказ = Истина;
		ОбработчикВопроса = Новый ОписаниеОповещения("ПередЗакрытиемЗавершение", ЭтотОбъект);
		ТекстВопроса = НСтр("ru = 'Подключение к ЭДО еще не завершено.
							|Прервать подключение?'");
		ПоказатьВопрос(ОбработчикВопроса, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	ОбработатьЗаписьПользователяЦентраЭДО(ИмяСобытия, Параметр);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидОрганизацииДляПодключенияПриИзменении(Элемент)
	
	ОчиститьСведения();
	ОчиститьСертификат();
	ЗаполнитьПодключенныхОператоровЭДО();
	
	ВидОрганизацииВыбран = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ИдентификаторНовыйСуществующийЭДОПриИзменении(Элемент)
	
	ВыполнитьПоискИдентификаторовОрганизации();
	ПолучитьСпособОбменаПоИдентификатору();
	ОбновитьТребованиеПриглашенияПоДаннымАбонента();
	УстановитьВидимостьВидаПодключения(ЭтотОбъект);
	УстановитьВидимостьЭлементовФормы(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОператорЭДОПриИзменении(Элемент)
	
	ПроверитьНеобходимостьДоверенности();
	УстановитьСпособОбменаПоОператору(СпособОбменаЭД, ОператорыЭДО, ИдентификаторОператораЭДО);
	УстановитьВидимостьВидаПодключения(ЭтотОбъект);
	УстановитьВидимостьЭлементовФормы(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура СертификатПриИзменении(Элемент)
	
	Если Не СозданиеУчетнойЗаписиИзСуществующейОрганизации Тогда
		ОчиститьСведения();
	КонецЕсли;
	ПослеВыбораОтпечаткаСертификата();
	
КонецПроцедуры

&НаКлиенте
Процедура СертификатОчистка(Элемент, СтандартнаяОбработка)
	
	Если Не СозданиеУчетнойЗаписиИзСуществующейОрганизации Тогда
		ОчиститьСведения();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПарольПриИзменении(Элемент)
	
	СкрытьКоличествоСимволовУПароля();
	
КонецПроцедуры

&НаКлиенте
Процедура ПарольИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	
	СкрытыйПароль = СкрытыйПароль();
	Если Пароль = СкрытыйПароль Тогда
		НачалоСкрытогоПароля = СтрНайти(Текст, СкрытыйПароль);
		Если НачалоСкрытогоПароля > 0 Тогда
			КонецСкрытогоПароля = НачалоСкрытогоПароля + СтрДлина(СкрытыйПароль);
			Текст = Лев(Текст, НачалоСкрытогоПароля - 1) + Сред(Текст, КонецСкрытогоПароля);
		Иначе
			Текст = "";
		КонецЕсли;
		Пароль = Текст;
	КонецЕсли;
	
	СвойстваПароля.ПарольВерен = Ложь;
	СвойстваПароля.ПарольПроверен = Ложь;
	СвойстваПароля.Пароль = Текст;
	
КонецПроцедуры

&НаКлиенте
Процедура ПарольНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОбработатьПолеПароля();
	
КонецПроцедуры

&НаКлиенте
Процедура ОператорЭДООчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппаОтправкаЗаявленияНаРегистрациюРасширеннаяПодсказкаОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	НажатиеНаГиперссылкуДиагностики();
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппаОжиданиеОтветаОтОператораРасширеннаяПодсказкаОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	НажатиеНаГиперссылкуДиагностики();
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппаСозданиеУчетнойЗаписиЭДОРасширеннаяПодсказкаОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	НажатиеНаГиперссылкуДиагностики();
	
КонецПроцедуры

&НаКлиенте
Процедура ПарольРасширеннаяПодсказкаОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	НажатиеНаГиперссылкуДиагностики();
	
КонецПроцедуры

&НаКлиенте
Процедура СертификатАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	ОбщегоНазначенияБЭДКлиент.АвтоПодборНайтиИВыделитьОформлением(Элемент.СписокВыбора, Текст, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ИдентификаторЭДОПриИзменении(Элемент)
	
	ПолучитьСпособОбменаПоИдентификатору();
	ПроверитьНеобходимостьДоверенности();
	ОбновитьТребованиеПриглашенияПоДаннымАбонента();
	УстановитьВидимостьЭлементовФормы(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ДоверенностьПриИзменении(Элемент)
	
	Если Не СозданиеУчетнойЗаписиИзСуществующейОрганизации Тогда
		ОчиститьСведения();
		ЗаполнитьОрганизациюПоДоверенности();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УчетнаяЗаписьЦентраЭДОСоздание(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Оповещение = Новый ОписаниеОповещения("УчетнаяЗаписьЦентраЭДОСозданиеЗавершение", ЭтотОбъект);
	МодульИнтеграцияЦентраЭДОКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль(
		"ИнтеграцияЦентраЭДОКлиент");
	МодульИнтеграцияЦентраЭДОКлиент.ПодключитьЦентрЭДО(Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ИННПриИзменении(Элемент)
	
	Если Не ЗначениеЗаполнено(ИНН) Тогда
		СформироватьТекстПодвала(ЭтотОбъект);
		Возврат;
	КонецЕсли;
	
	НайтиОрганизацию();
	
	Если ВидПодключения = ВидыПодключения().Существующий Тогда
		НеобходимПоискИдентификаторов = Истина;
		ВыполнитьПоискИдентификаторовОрганизации();
	КонецЕсли;
	
	СформироватьТекстПодвала(ЭтотОбъект);
	ЗапуститьПоискПоИНН();
	
КонецПроцедуры

&НаКлиенте
Процедура КПППриИзменении(Элемент)
	
	Если Не ЗначениеЗаполнено(КПП) Тогда
		СформироватьТекстПодвала(ЭтотОбъект);
		Возврат;
	КонецЕсли;
	
	НайтиОрганизацию();
	
	Если ВидПодключения = ВидыПодключения().Существующий Тогда
		НеобходимПоискИдентификаторов = Истина;
		ВыполнитьПоискИдентификаторовОрганизации();
	КонецЕсли;
	
	СформироватьТекстПодвала(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ДоверенностьНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Не ЗначениеЗаполнено(ОтпечатокСертификата) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='Не заполнен сертификат'"), , , "ОтпечатокСертификата");
		Возврат;
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВыбораДоверенности", ЭтотОбъект);
	
	Отбор = Новый Структура("СертификатКриптографии, Доверитель, ИННДоверителя", Сертификат);
	Если СозданиеУчетнойЗаписиИзСуществующейОрганизации Тогда
		Отбор.Доверитель = Организация;
		Отбор.ИННДоверителя = ИНН;
	КонецЕсли;
	
	МашиночитаемыеДоверенностиКлиент.ВыбратьМЧД(ОписаниеОповещения, Отбор);
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияУсловияОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	СинхронизацияЭДОКлиент.ПоказатьУсловияИспользованияСервиса1СЭДО();
	
КонецПроцедуры

&НаКлиенте
Процедура АдресОрганизацииНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	ТипыКонтактнойИнформацииАдрес = ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.Адрес");
		
	ВидКонтактнойИнформации = ПараметрыВидаКонтактнойИнформации(ТипыКонтактнойИнформацииАдрес);
	ВидКонтактнойИнформации.ВидРедактирования = "ПолеВводаИДиалог";
	ВидКонтактнойИнформации.Наименование = НСтр("ru='Юридический адрес'");
	
	ПараметрыОткрытия = УправлениеКонтактнойИнформациейКлиент.ПараметрыФормыКонтактнойИнформации(
		ВидКонтактнойИнформации, ЗначениеПолейАдреса, АдресОрганизации, , ТипыКонтактнойИнформацииАдрес);
	
	Оповещение = Новый ОписаниеОповещения("ОткрытьФормуКонтактнойИнформацииЗавершение", ЭтотОбъект);
	
	УправлениеКонтактнойИнформациейКлиент.ОткрытьФормуКонтактнойИнформации(ПараметрыОткрытия, , Оповещение);

КонецПроцедуры

&НаКлиенте
Процедура АдресОрганизацииОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	АдресОрганизации = ВыбранноеЗначение.Представление;
	ЗначениеПолейАдреса = ВыбранноеЗначение.Адрес;
	
КонецПроцедуры

&НаКлиенте
Процедура АдресОрганизацииАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)

	УправлениеКонтактнойИнформациейКлиент.АвтоПодборАдреса(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных,
		Ожидание, СтандартнаяОбработка);

КонецПроцедуры

&НаКлиенте
Процедура АдресОрганизацииПриИзменении(Элемент)
	
	АдресОрганизацииПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ДоверенностьАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ОГРНПриИзменении(Элемент)
	
	СформироватьТекстПодвала(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеОрганизацииПриИзменении(Элемент)
	
	СформироватьТекстПодвала(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ИННОчистка(Элемент, СтандартнаяОбработка)
	
	СформироватьТекстПодвала(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура КППОчистка(Элемент, СтандартнаяОбработка)
	
	СформироватьТекстПодвала(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОГРНОчистка(Элемент, СтандартнаяОбработка)
	
	СформироватьТекстПодвала(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеОрганизацииОчистка(Элемент, СтандартнаяОбработка)
	
	СформироватьТекстПодвала(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеТиповДокументовНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	СписокТипов = Новый СписокЗначений;
	
	Для Каждого СтрокаКода Из КодыТиповДокументов Цикл		
		СписокТипов.Добавить(СтрокаКода.Код, СтрокаКода.Наименование, СтрокаКода.Используется);
	КонецЦикла;
	
	Обработчик = Новый ОписаниеОповещения("ОбработатьВыборТиповДокументов", ЭтотОбъект);
	
	СписокТипов.ПоказатьОтметкуЭлементов(Обработчик, НСтр("ru = 'Выберите документы'"));
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Далее(Команда)
	
	Если Не ВидОрганизацииВыбран Тогда
		ЗаполнитьСписокСертификатовДляВыбора();
	КонецЕсли;
	
	ПереключитьТекущуюСтраницуНаЭтапВводаДанных(ЭтотОбъект);
	УстановитьВидимостьЭлементовФормы(ЭтотОбъект);
	
	ВидОрганизацииВыбран = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗарегистрироватьЭДО(Команда)
	
	ОчиститьСообщения();
	УстановитьТекущийЭлементПоВидимостиГрупп(ЭтотОбъект, Элементы.ГруппаКоманды, Элементы.СтраницаВводДанных);
	
	УстановитьОтображениеЗарегистрироватьЭДОКартинкаИТекст(ЭтотОбъект);
	
	Если Не КлючевыеПоляДляРегистрацииЗаполнены() Тогда
		УстановитьОтображениеЗарегистрироватьЭДОТекст(ЭтотОбъект);
		УстановитьВидимостьЭлементовФормы(ЭтотОбъект);
		Возврат;
	КонецЕсли;
	
	Если ВидПодключения = ВидыПодключения().Существующий
			И ЕстьУчетныеЗаписиПоИдентификаторуЭДО(ИдентификаторЭДО) Тогда
		УстановитьОтображениеЗарегистрироватьЭДОТекст(ЭтотОбъект);
		ШаблонТекста = НСтр("ru = 'Учетная запись с идентификатором ""%1"" уже подключена'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(СтрШаблон(ШаблонТекста, ИдентификаторЭДО), , , "ИдентификаторЭДО");
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Организация)
			И ЗначениеЗаполнено(НачальнаяОрганизацияДляПросмотраФункционалаБизКуб)
		Или ЗначениеЗаполнено(НачальнаяОрганизацияДляПросмотраФункционалаБизКуб)
			И НачальнаяОрганизацияДляПросмотраФункционалаБизКуб = Организация Тогда
		Организация = НачальнаяОрганизацияДляПросмотраФункционалаБизКуб;
		ОтказаноВОбновленииОрганизации = Ложь;
		ОбновитьДанныеОрганизации();
		Если ОтказаноВОбновленииОрганизации Тогда
			УстановитьОтображениеЗарегистрироватьЭДОТекст(ЭтотОбъект);
			Возврат;
		КонецЕсли;
	ИначеЕсли Не ЗначениеЗаполнено(Организация) Тогда
		ОтказаноВСозданииОрганизации = Ложь;
		СоздатьОрганизацию(ПрограммаКриптографии, ОтказаноВСозданииОрганизации);
		Если ОтказаноВСозданииОрганизации Тогда
			УстановитьОтображениеЗарегистрироватьЭДОТекст(ЭтотОбъект);
			Возврат;
		КонецЕсли;
	КонецЕсли;
	ОбщегоНазначенияКлиент.ОповеститьОбИзмененииОбъекта(Организация);
	
	Если Не СвойстваПароля.ПарольПроверен Тогда
		ПроверитьПароль();
	Иначе
		НачатьРегистрациюВСервисе();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура Назад(Команда)
	
	Если Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаРезультатПодключения Тогда
		ПереключитьТекущуюСтраницуНаЭтапВводаДанных(ЭтотОбъект);
	Иначе
		ПереключитьТекущуюСтраницуНаЭтапВыбораВидаОрганизации(ЭтотОбъект);
	КонецЕсли;
	УстановитьВидимостьЭлементовФормы(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьКриптопровайдер(Команда)
	
	ПараметрыПроверки = Новый Структура;
	ПараметрыПроверки.Вставить("ПредлагатьУстановитьПрограмму", Истина);
	
	ЭлектроннаяПодписьКлиент.ПроверитьУстановкуПрограммКриптографии(
		ЭтотОбъект, ПараметрыПроверки, Новый ОписаниеОповещения("ПослеПроверкиПрограммКриптографии", ЭтотОбъект));
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСертификаты(Команда)
	
	РучноеОбновлениеСертификатов = Истина;
	НачатьПроверкуКриптографии();
	
КонецПроцедуры

&НаКлиенте
Процедура ПовторитьДиагностику(Команда)
	
	ПроверитьУстановкуРасширенияКриптографии();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ПроверкаКриптографии

&НаКлиенте
Процедура ПроверитьУстановкуРасширенияКриптографии()
	
	ВыполняетсяПроверкаНаличияРасширенияКриптографии = Истина;
	
	УстановитьВидимостьЭлементовДиагностики(ЭтотОбъект);
	
	Оповещение = Новый ОписаниеОповещения("ПроверитьУстановкуРасширенияКриптографииПродолжение", ЭтотОбъект);
	НачатьПодключениеРасширенияРаботыСКриптографией(Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьУстановкуРасширенияКриптографииПродолжение(Подключено, ДополнительныеПараметры) Экспорт
	
	ВыполняетсяПроверкаНаличияРасширенияКриптографии = Ложь;
	ТребуетсяУстановкаРасширенияКриптографии = НЕ Подключено;
	
	НачатьПроверкуКриптографии();
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьПроверкуКриптографии()
	
	ПараметрыОжиданияБЭД = ОжиданиеОперацийБЭДКлиент.НовыеПараметры();
	ПараметрыОжиданияБЭД.ТекстСообщения = НСтр("ru = 'Идет проверка наличия программ криптографии и сертификатов.
	|Пожалуйста, подождите…'");
	
	КонтекстОжиданияОперации = ОжиданиеОперацийБЭДКлиент.НовыйКонтекст(ПараметрыОжиданияБЭД);
	КонтекстОжиданияОперации.ОбработчикПрерывания = Новый ОписаниеОповещения("ОбработчикПрерыванияПроверкиКриптографии", ЭтотОбъект);
	ОжиданиеОперацийБЭДКлиент.ОткрытьФормуОжидания(ЭтотОбъект, КонтекстОжиданияОперации);
	
	ВыполняетсяПроверкаКриптографии = Истина;
	ПроверкаНаличияСертификатовПровалена = Ложь;
	ПроверкаКриптографииПровалена = Ложь;
	
	УстановитьВидимостьЭлементовДиагностики(ЭтотОбъект);
	
	ПараметрыПроверки = Новый Структура;
	ПараметрыПроверки.Вставить("УстанавливатьРасширение", УстанавливатьРасширение);
	ПараметрыПроверки.Вставить("УстанавливатьКомпоненту", Истина);
	ПараметрыПроверки.Вставить("ПредлагатьУстановитьПрограмму", Ложь);
	ПараметрыПроверки.Вставить("ПроверяемыеПрограммы", Истина);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеПроверкиПрограммКриптографии", ЭтотОбъект, КонтекстОжиданияОперации);
	ЭлектроннаяПодписьКлиент.ПроверитьУстановкуПрограммКриптографии(ЭтотОбъект, ПараметрыПроверки, ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикПрерыванияПроверкиКриптографии(Результат, ДополнительныеПараметры) Экспорт
	
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеПроверкиПрограммКриптографии(Результат, КонтекстОжиданияОперации) Экспорт
	
	ПозволяетсяИспользоватьКриптографиюНаСервере = Результат.ПрограммыНаСервере.Количество() > 0
		И СоздаватьЭлектронныеПодписиНаСервере;
	
	Если Результат.Программы.Количество() = 0
			И Не ПозволяетсяИспользоватьКриптографиюНаСервере Тогда
		ВыполняетсяПроверкаКриптографии = Ложь;
		ПроверкаКриптографииПровалена = Истина;
		РучноеОбновлениеСертификатов = Ложь;
		ПереключитьТекущуюСтраницуНаЭтапДиагностики(ЭтотОбъект);
		ОжиданиеОперацийБЭДКлиент.ЗакрытьФормуОжидания(КонтекстОжиданияОперации);
		Возврат;
	КонецЕсли;
	
	ПутьКСвойствуПрограммы = "Программы";
	Если Результат.Программы.Количество() = 0 Тогда
		ПутьКСвойствуПрограммы = "ПрограммыНаСервере";
	КонецЕсли;
	
	ПрограммаКриптографии = Результат[ПутьКСвойствуПрограммы][0].Ссылка;
	УстановленVipNet = СтрНайти(Результат[ПутьКСвойствуПрограммы][0].Программа, "VipNet");
	
	Если Результат.Программы.Количество() > 0 Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения(
			"ПолучитьСвойстваСертификатовНаКлиентеПослеСозданияМенеджераКриптографии",
			ЭтотОбъект, КонтекстОжиданияОперации);
		ЭлектроннаяПодписьКлиент.СоздатьМенеджерКриптографии(ОписаниеОповещения, "");
	Иначе
		ПолучитьСвойстваСертификатовНаСервере(РучноеОбновлениеСертификатов);
		Если ПроверкаКриптографииПровалена Тогда
			РучноеОбновлениеСертификатов = Ложь;
			ПереключитьТекущуюСтраницуНаЭтапДиагностики(ЭтотОбъект);
			ОжиданиеОперацийБЭДКлиент.ЗакрытьФормуОжидания(КонтекстОжиданияОперации);
		КонецЕсли;
		ЗавершитьОбновлениеСпискаСертификатов(КонтекстОжиданияОперации);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПолучениеСертификатов

&НаСервере
Процедура ПолучитьСвойстваСертификатовНаСервере(РучноеОбновлениеСертификатов)
	
	ВыполняетсяПроверкаКриптографии = Ложь;
	
	Если Не СоздаватьЭлектронныеПодписиНаСервере Тогда
		Возврат;
	КонецЕсли;
	
	МенеджерКриптографии = ЭлектроннаяПодпись.МенеджерКриптографии("ПолучениеСертификатов", Ложь);
	Если МенеджерКриптографии = Неопределено Тогда
		ПроверкаКриптографииПровалена = Истина;
		РучноеОбновлениеСертификатов = Ложь;
		ПереключитьТекущуюСтраницуНаЭтапДиагностики(ЭтотОбъект);
		Возврат;
	КонецЕсли;
	
	Хранилище = МенеджерКриптографии.ПолучитьХранилищеСертификатов(ТипХранилищаСертификатовКриптографии.ПерсональныеСертификаты);
	Сертификаты = Хранилище.ПолучитьВсе();
	
	ОбновитьСписокСертификатовНаСервере(Сертификаты);
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура ПолучитьСвойстваСертификатовНаКлиентеПослеСозданияМенеджераКриптографии(
	МенеджерКриптографии, КонтекстОжиданияОперации) Экспорт
	
	ВыполняетсяПроверкаКриптографии = Ложь;
	
	Если ТипЗнч(МенеджерКриптографии) <> Тип("МенеджерКриптографии") Тогда
		ПроверкаКриптографииПровалена = Истина;
		РучноеОбновлениеСертификатов = Ложь;
		ПереключитьТекущуюСтраницуНаЭтапДиагностики(ЭтотОбъект);
		ОжиданиеОперацийБЭДКлиент.ЗакрытьФормуОжидания(КонтекстОжиданияОперации);
		Возврат;
	КонецЕсли;
	
	ВыполняетсяПроверкаНаличияСертификатов = Истина;
	
	Контекст = Новый Структура;
	Контекст.Вставить("МенеджерКриптографии", МенеджерКриптографии);
	
	ПолучениеХранилища = Контекст.МенеджерКриптографии.ПолучитьХранилищеСертификатовАсинх(ТипХранилищаСертификатовКриптографии.ПерсональныеСертификаты);
	Хранилище = Ждать ПолучениеХранилища;
	
	ПолучениеСертификатов = Хранилище.ПолучитьВсеАсинх();
	Сертификаты = Ждать ПолучениеСертификатов;
	
	ВыполняетсяПроверкаНаличияСертификатов = Ложь;
	
	ОбновитьСписокСертификатовНаКлиенте(Сертификаты, КонтекстОжиданияОперации);
	ОбновитьСписокСертификатовНаСервере();
	
	Если СоздаватьЭлектронныеПодписиНаСервере Тогда
		ЗавершитьОбновлениеСпискаСертификатов(КонтекстОжиданияОперации);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура ОбновитьСписокСертификатовНаКлиенте(СвойстваСертификатовНаКлиенте, КонтекстОжиданияОперации)
	
	ОбработанныеСтроки = Новый Соответствие;
	Индекс = 0;
	Отбор = Новый Структура("Отпечаток", "");
	
	РазницаСУниверсальнымВременем = ОбщегоНазначенияКлиент.ДатаСеанса() - ОбщегоНазначенияКлиент.ДатаУниверсальная();
	ТекущаяДатаСеанса = ОбщегоНазначенияКлиент.ДатаСеанса();
	
	ОтпечаткиУжеДобавленныхСертификатов = Новый Соответствие; // Для пропуска дублей.
	
	Для Каждого СвойствоСертификата Из СвойстваСертификатовНаКлиенте Цикл
		
		Отпечаток = Base64Строка(СвойствоСертификата.Отпечаток);
		ДатыСертификата = ДатыСертификата(СвойствоСертификата, РазницаСУниверсальнымВременем);
		
		Если ДатыСертификата.ДатаОкончания <= ТекущаяДатаСеанса Тогда
			Продолжить; // Пропуск просроченных сертификатов.
		КонецЕсли;
		
		Если ОтпечаткиУжеДобавленныхСертификатов.Получить(Отпечаток) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		СвойстваСубъекта = ЭлектроннаяПодписьКлиент.СвойстваСубъектаСертификата(СвойствоСертификата);
		Если СвойстваСубъекта.ИННЮЛ = Неопределено
			И СвойстваСубъекта.ОГРНИП = Неопределено
			И Не ЭтоСертификатФизЛица(СвойстваСубъекта) Тогда
			Продолжить;
		КонецЕсли;
		
		ОтпечаткиУжеДобавленныхСертификатов.Вставить(Отпечаток, Истина);
		
		#Если ВебКлиент Тогда
		ДвоичныеДанныеСертификата = Ждать СвойствоСертификата.ВыгрузитьАсинх();
		#Иначе
		ДвоичныеДанныеСертификата = СвойствоСертификата.Выгрузить();
		#КонецЕсли
		
		ДатаОкончанияЗакрытогоКлюча = КриптографияБЭДКлиентСервер.ДатаОкончанияЗакрытогоКлюча(
			СвойствоСертификата, ДвоичныеДанныеСертификата);
		
		Если ДатаОкончанияЗакрытогоКлюча = Дата(1, 1, 1) Тогда
			ДатаОкончанияЗакрытогоКлюча = ДатыСертификата.ДатаОкончания;
		КонецЕсли;
		
		Если Мин(ДатыСертификата.ДатаОкончания, ДатаОкончанияЗакрытогоКлюча) <= ТекущаяДатаСеанса Тогда
			Продолжить; // Пропуск просроченных сертификатов.
		КонецЕсли;
		
		Отбор.Отпечаток = СвойствоСертификата.Отпечаток;
		Строки = СписокСертификатов.НайтиСтроки(Отбор);
		Если Строки.Количество() = 0 Тогда
			Строка = СписокСертификатов.Добавить();
		Иначе
			Строка = Строки[0];
			ИндексСтроки = СписокСертификатов.Индекс(Строка);
			Если ИндексСтроки <> Индекс Тогда
				СписокСертификатов.Сдвинуть(ИндексСтроки, Индекс - ИндексСтроки);
			КонецЕсли;
		КонецЕсли;
		
		СвойстваСертификата = ЭлектроннаяПодписьКлиент.СвойстваСертификата(СвойствоСертификата);
		
		ОбновитьЗначение(Строка.Отпечаток, СвойстваСертификата.Отпечаток);
		ОбновитьЗначение(Строка.Представление, СвойстваСертификата.Представление);
		ОбновитьЗначение(Строка.КемВыдан, СвойстваСертификата.КемВыдан);
		ОбновитьЗначение(Строка.ИНН, ?(ЗначениеЗаполнено(СвойстваСубъекта.ИННЮЛ), СвойстваСубъекта.ИННЮЛ, СвойстваСубъекта.ИНН));
		
		Если ЭтоСертификатФизЛица(СвойстваСубъекта) Тогда
			ОбновитьЗначение(Строка.ВидСертификата, ФизическоеЛицо());
		Иначе
			ОбновитьЗначение(Строка.ВидСертификата, ?(ЗначениеЗаполнено(СвойстваСубъекта.ИННЮЛ), ЮридическоеЛицо(), ИндивидуальныйПредприниматель()));
		КонецЕсли;
		
		ОбработанныеСтроки.Вставить(Строка, Истина);
		Индекс = Индекс + 1;
	КонецЦикла;
	
	Если Не СоздаватьЭлектронныеПодписиНаСервере Тогда
		ЗавершитьОбновлениеСпискаСертификатов(КонтекстОжиданияОперации);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСписокСертификатовНаСервере(СвойстваСертификатов = Неопределено)
	
	Если Не СоздаватьЭлектронныеПодписиНаСервере Тогда
		Возврат;
	КонецЕсли;
	
	Если СвойстваСертификатов = Неопределено Тогда
		
		МенеджерКриптографии = ЭлектроннаяПодпись.МенеджерКриптографии("", Ложь);
		Если МенеджерКриптографии = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		Хранилище = МенеджерКриптографии.ПолучитьХранилищеСертификатов(
			ТипХранилищаСертификатовКриптографии.ПерсональныеСертификаты);
		СвойстваСертификатов = Хранилище.ПолучитьВсе();
		
	КонецЕсли;

	ОбработанныеСтроки = Новый Соответствие;
	Индекс = 0;
	Отбор = Новый Структура("Отпечаток", "");
	
	ТекущаяДатаСеанса = ТекущаяДатаСеанса();
	
	ОтпечаткиУжеДобавленныхСертификатов = Новый Соответствие; // Для пропуска дублей.
	
	Для Каждого СвойствоСертификата Из СвойстваСертификатов Цикл
		
		Отпечаток = Base64Строка(СвойствоСертификата.Отпечаток);
		ДатыСертификата = ДатыСертификата(СвойствоСертификата);
		
		Если ДатыСертификата.ДатаОкончания <= ТекущаяДатаСеанса Тогда
			Продолжить; // Пропуск просроченных сертификатов.
		КонецЕсли;
		
		Если ОтпечаткиУжеДобавленныхСертификатов.Получить(Отпечаток) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		СвойстваСубъекта = ЭлектроннаяПодпись.СвойстваСубъектаСертификата(СвойствоСертификата);
		Если СвойстваСубъекта.ИННЮЛ = Неопределено
			И СвойстваСубъекта.ОГРНИП = Неопределено
			И Не ЭтоСертификатФизЛица(СвойстваСубъекта) Тогда
			Продолжить;
		КонецЕсли;
		
		ОтпечаткиУжеДобавленныхСертификатов.Вставить(Отпечаток, Истина);
		
		ДвоичныеДанныеСертификата = СвойствоСертификата.Выгрузить();
		
		ДатаОкончанияЗакрытогоКлюча = КриптографияБЭДКлиентСервер.ДатаОкончанияЗакрытогоКлюча(
			СвойствоСертификата, ДвоичныеДанныеСертификата);
		
		Если ДатаОкончанияЗакрытогоКлюча = Дата(1, 1, 1) Тогда
			ДатаОкончанияЗакрытогоКлюча = ДатыСертификата.ДатаОкончания;
		КонецЕсли;
		
		Если Мин(ДатыСертификата.ДатаОкончания, ДатаОкончанияЗакрытогоКлюча) <= ТекущаяДатаСеанса Тогда
			Продолжить; // Пропуск просроченных сертификатов.
		КонецЕсли;
		
		Отбор.Отпечаток = СвойствоСертификата.Отпечаток;
		Строки = СписокСертификатов.НайтиСтроки(Отбор);
		Если Строки.Количество() = 0 Тогда
			Строка = СписокСертификатов.Добавить();
			Строка.НаСервере = Истина;
		Иначе
			Строка = Строки[0];
			ИндексСтроки = СписокСертификатов.Индекс(Строка);
			Если ИндексСтроки <> Индекс Тогда
				СписокСертификатов.Сдвинуть(ИндексСтроки, Индекс - ИндексСтроки);
			КонецЕсли;
		КонецЕсли;
		
		СвойстваСертификата = ЭлектроннаяПодпись.СвойстваСертификата(СвойствоСертификата);
		
		ОбновитьЗначение(Строка.Отпечаток, СвойстваСертификата.Отпечаток);
		ОбновитьЗначение(Строка.Представление, СвойстваСертификата.Представление);
		ОбновитьЗначение(Строка.КемВыдан, СвойстваСертификата.КемВыдан);
		ОбновитьЗначение(Строка.ИНН, ?(ЗначениеЗаполнено(СвойстваСубъекта.ИННЮЛ), СвойстваСубъекта.ИННЮЛ, СвойстваСубъекта.ИНН));
		
		Если ЭтоСертификатФизЛица(СвойстваСубъекта) Тогда
			ОбновитьЗначение(Строка.ВидСертификата, ФизическоеЛицо());
		Иначе
			ОбновитьЗначение(Строка.ВидСертификата, ?(ЗначениеЗаполнено(СвойстваСубъекта.ИННЮЛ), ЮридическоеЛицо(), ИндивидуальныйПредприниматель()));
		КонецЕсли;
		
		ОбработанныеСтроки.Вставить(Строка, Истина);
		Индекс = Индекс + 1;
	КонецЦикла;
	
	СвойстваСертификатов = Неопределено; // Очистка контекста
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьОбновлениеСпискаСертификатов(КонтекстОжиданияОперации)
	
	Если СписокСертификатов.Количество() = 0 Тогда
		ПроверкаНаличияСертификатовПровалена = Истина;
		ПереключитьТекущуюСтраницуНаЭтапДиагностики(ЭтотОбъект);
	Иначе
		Если СозданиеУчетнойЗаписиИзСуществующейОрганизации
				Или РучноеОбновлениеСертификатов Тогда
			РучноеОбновлениеСертификатов = Ложь;
			ПереключитьТекущуюСтраницуНаЭтапВводаДанных(ЭтотОбъект);
		Иначе
			ПереключитьТекущуюСтраницуНаЭтапВыбораВидаОрганизации(ЭтотОбъект);
		КонецЕсли;
	КонецЕсли;
	Если СозданиеУчетнойЗаписиИзСуществующейОрганизации
			И Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаВводДанных Тогда
		ЗаполнитьСписокСертификатовДляВыбора();
	КонецЕсли;
	
	ОжиданиеОперацийБЭДКлиент.ЗакрытьФормуОжидания(КонтекстОжиданияОперации);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСписокСертификатовДляВыбора()
	
	Элементы.Сертификат.СписокВыбора.Очистить();
	
	СписокСертификатов.Сортировать("Представление Возр");
	Для Каждого Строка Из СписокСертификатов Цикл
		Если ВидОрганизацииДляПодключения = ФизическоеЛицо() И Строка.ВидСертификата <> ФизическоеЛицо() Тогда
			Продолжить;
		КонецЕсли;
		Если СозданиеУчетнойЗаписиИзСуществующейОрганизации
				И ВидОрганизацииДляПодключения = ФизическоеЛицо()
				И Не Строка.ИНН = ИНН Тогда
			Продолжить;
		КонецЕсли;
		Элементы.Сертификат.СписокВыбора.Добавить(Строка.Отпечаток, Строка.Представление);
	КонецЦикла;
	
	Если Элементы.Сертификат.СписокВыбора.Количество() > 0
		И ЗначениеЗаполнено(ИНН) Тогда
		
		НайденныйСертификатПоИНН = СписокСертификатов.НайтиСтроки(Новый Структура("ИНН", ИНН));
		
		Если НайденныйСертификатПоИНН.Количество() = 1 Тогда
			ОтпечатокСертификата = НайденныйСертификатПоИНН[0].Отпечаток;
			ПослеВыбораОтпечаткаСертификата();
		КонецЕсли;
		
	ИначеЕсли Элементы.Сертификат.СписокВыбора.Количество() = 1 Тогда
		ОтпечатокСертификата = СписокСертификатов[0].Отпечаток;
		ПослеВыбораОтпечаткаСертификата();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ЭтоСертификатФизЛица(СвойстваСубъекта)
	
	Возврат Не ЗначениеЗаполнено(СвойстваСубъекта.Организация)
		И СтрДлина(СвойстваСубъекта.ИНН) = 12
		И СвойстваСубъекта.ОГРНИП = Неопределено;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьЗначение(СтароеЗначение, НовоеЗначение, ПропускатьНеопределенныеЗначения = Ложь)
	
	Если НовоеЗначение = Неопределено И ПропускатьНеопределенныеЗначения Тогда
		Возврат;
	КонецЕсли;
	
	Если СтароеЗначение <> НовоеЗначение Тогда
		СтароеЗначение = НовоеЗначение;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ДатыСертификата(Сертификат, ДобавкаВремени = 0)
	
	ДатыСертификата = Новый Структура;
	ДатыСертификата.Вставить("ДатаНачала", Сертификат.ДатаНачала + ДобавкаВремени);
	ДатыСертификата.Вставить("ДатаОкончания", Сертификат.ДатаОкончания + ДобавкаВремени);
	
	Возврат ДатыСертификата;
	
КонецФункции

#КонецОбласти

#Область ЗаполнениеПоИНН

&НаСервере
Процедура ЗапуститьПоискПоИНН()
	
	Если Не ОбщегоНазначения.ПодсистемаСуществует("ИнтернетПоддержкаПользователей.РаботаСКонтрагентами") Тогда
		Возврат;
	КонецЕсли;

	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Получение сведений организации по ИНН в сервисе 1С:Контрагент'");
	
	Если ВидОрганизацииДляПодключения = ЮридическоеЛицо() Тогда
		ДлительнаяОперацияПолученияСведенийПоИНН = ДлительныеОперации.ВыполнитьФункцию(
			ПараметрыВыполнения, "РаботаСКонтрагентами.СведенияОЮридическомЛицеПоИНН", ИНН);
	ИначеЕсли ВидОрганизацииДляПодключения = ИндивидуальныйПредприниматель() Тогда
		ДлительнаяОперацияПолученияСведенийПоИНН = ДлительныеОперации.ВыполнитьФункцию(
			ПараметрыВыполнения, "РаботаСКонтрагентами.РеквизитыПредпринимателяПоИНН", ИНН);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапуститьОжиданиеПолученияСведенийОрганизацииПоИНН(ТекстСообщенияОжидания)
	
	Если Не ЗначениеЗаполнено(ИНН)
			Или ДлительнаяОперацияПолученияСведенийПоИНН = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Описание = ОткрытьФормуОжидания(ТекстСообщенияОжидания, "ЗаполнитьОрганизациюПослеПолученияДанных");
	ЗапуститьОжиданиеВыполненияДлительнойОперации(Описание, ДлительнаяОперацияПолученияСведенийПоИНН, ТекстСообщенияОжидания);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьОрганизациюПослеПолученияДанных(Результат, КонтекстОжиданияОперации) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОжиданиеОперацийБЭДКлиент.ЗакрытьФормуОжидания(КонтекстОжиданияОперации);
	ДлительнаяОперацияПолученияСведенийПоИНН = Неопределено;
	
	Если Результат.Статус = СостоянияПодключения().Выполнено Тогда
		АдресРеквизитовОрганизации = Результат.АдресРезультата;
		ЗаполнитьСведенияДляРегистрацииПоАдресуРезультата(Результат.АдресРезультата);
	ИначеЕсли Результат.Статус = СостоянияПодключения().Ошибка Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(Результат.КраткоеПредставлениеОшибки);
	КонецЕсли;
	
	СформироватьТекстПодвала(ЭтотОбъект);
	ВыполнитьПоискИдентификаторовОрганизации();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСведенияДляРегистрацииПоАдресуРезультата(АдресРезультата)
	
	РеквизитыОрганизации = ПолучитьИзВременногоХранилища(АдресРеквизитовОрганизации); // см. РаботаСКонтрагентами.РеквизитыПредпринимателяПоИНН
	НайденыСведенияПоОрганизации = РеквизитыОрганизации <> Неопределено
		И Не ЗначениеЗаполнено(РеквизитыОрганизации.ОписаниеОшибки);
		
	Если ВидОрганизацииДляПодключения = ЮридическоеЛицо() Тогда
		НайденыСведенияПоОрганизации = НайденыСведенияПоОрганизации И РеквизитыОрганизации.ЕГРЮЛ <> Неопределено;
		Если РеквизитыОрганизации.ЕГРЮЛ <> Неопределено Тогда
			РеквизитыОрганизации = РеквизитыОрганизации.ЕГРЮЛ; // см. РаботаСКонтрагентами.СведенияОЮридическомЛицеПоИНН.ЕГРЮЛ
		КонецЕсли;
	КонецЕсли;
	
	Если Не НайденыСведенияПоОрганизации Тогда
		Возврат;
	КонецЕсли;
	
	Если РеквизитыОрганизации.РегистрацияВНалоговомОргане <> Неопределено Тогда
		КодНалоговогоОргана = РеквизитыОрганизации.РегистрацияВНалоговомОргане.Код;
	КонецЕсли;
	Если ВидОрганизацииДляПодключения = ЮридическоеЛицо() Тогда
		КПП = РеквизитыОрганизации.КПП;
	КонецЕсли;
	
	НайтиОрганизацию();
	СформироватьТекстПодвала(ЭтотОбъект);
	
	Если РеквизитыОрганизации.Свойство("ЮридическийАдрес") Тогда
		АдресОрганизации = РеквизитыОрганизации.ЮридическийАдрес.Представление;
		ЗначениеПолейАдреса = РеквизитыОрганизации.ЮридическийАдрес.КонтактнаяИнформация;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ИзвлечьКодНалоговогоОрганаИзИНН(КодНалоговогоОргана, ИНН)
	
	Если Не ЗначениеЗаполнено(КодНалоговогоОргана) Тогда
		КодНалоговогоОргана = Сред(ИНН, 1, 4);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПолучениеИдентификаторов

&НаСервере
Процедура ЗапуститьОбновлениеКешОператоровИФорматов()
	
	КонтекстДиагностики = ОбработкаНеисправностейБЭД.НовыйКонтекстДиагностики();
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Получение идентификаторов в сервисе ЭДО'");
	
	ДлительнаяОперацияОбновленияКешОператоровИФорматов = ДлительныеОперации.ВыполнитьФункцию(
		ПараметрыВыполнения, "СинхронизацияЭДО.ОбновитьКешиОператоровЭДОИФорматов", КонтекстДиагностики);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапуститьОжиданиеОбновленияКешОператоровИФорматов(ТекстСообщенияОжидания)
	
	Описание = ОткрытьФормуОжидания(ТекстСообщенияОжидания, "ЗапуститьПолучениеИдентификаторов");
	ЗапуститьОжиданиеВыполненияДлительнойОперации(Описание, ДлительнаяОперацияОбновленияКешОператоровИФорматов, ТекстСообщенияОжидания);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапуститьПолучениеИдентификаторов(Результат, КонтекстОжиданияОперации) Экспорт
	
	ОжиданиеОперацийБЭДКлиент.ЗакрытьФормуОжидания(КонтекстОжиданияОперации);
	ЗапуститьПолучениеИдентификаторовНаСервере();
	ЗапуститьОжиданиеПолученияИдентификаторовЭДО(КонтекстОжиданияОперации.ПараметрыОжиданияОперации.ТекстСообщения);
	
КонецПроцедуры

&НаСервере
Процедура ЗапуститьПолучениеИдентификаторовНаСервере()

	КонтекстДиагностики = ОбработкаНеисправностейБЭД.НовыйКонтекстДиагностики();
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Получение идентификаторов в сервисе ЭДО'");
	
	ДлительнаяОперацияПолученияИдентификаторов = ДлительныеОперации.ВыполнитьФункцию(
		ПараметрыВыполнения,
		"РаботаСАбонентамиЭДО.ПолучитьИдентификаторыВСервисе1СЭДОПоРеквизитам",
		Новый Структура("ИНН, КПП", ИНН, КПП),
		КонтекстДиагностики);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапуститьОжиданиеПолученияИдентификаторовЭДО(ТекстСообщенияОжидания)
	
	Описание = ОткрытьФормуОжидания(ТекстСообщенияОжидания, "ЗаполнитьИдентификаторыДляРегистрацииПослеПолученияДанных");
	ЗапуститьОжиданиеВыполненияДлительнойОперации(Описание, ДлительнаяОперацияПолученияИдентификаторов, ТекстСообщенияОжидания);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьИдентификаторыДляРегистрацииПослеПолученияДанных(Результат, КонтекстОжиданияОперации) Экспорт
	
	НеобходимПоискИдентификаторов = Ложь;
	ДлительнаяОперацияПолученияИдентификаторов = Неопределено;
	ОжиданиеОперацийБЭДКлиент.ЗакрытьФормуОжидания(КонтекстОжиданияОперации);
	
	Если Результат <> Неопределено
		И Результат.Статус = СостоянияПодключения().Выполнено Тогда
		ЗаполнитьИдентификаторыДляРегистрацииПоАдресуРезультата(Результат.АдресРезультата);
	ИначеЕсли Результат <> Неопределено Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(Результат.КраткоеПредставлениеОшибки);
	КонецЕсли;
	
	ПоказатьСписокВыбораИдентификаторов();
	ПроверитьНеобходимостьДоверенности();
	ПолучитьСпособОбменаПоИдентификатору();
	
	УстановитьВидимостьЭлементовФормы(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИдентификаторыДляРегистрацииПоАдресуРезультата(Знач АдресРезультата)
	
	ИдентификаторыОрганизации = ПолучитьИзВременногоХранилища(АдресРезультата); // См. УчетныеЗаписиЭДО.ДанныеПоИдентификаторамДляРегистрацииВЭДО
	УдалитьИзВременногоХранилища(АдресРезультата);
	
	ЗаполнитьСписокИдентификаторов(ИдентификаторыОрганизации);
	АбонентыИТребованияПриглашений = 
		Новый ФиксированноеСоответствие(РаботаСАбонентамиЭДО.АбонентыИТребованияПриглашений(ИдентификаторыОрганизации));
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокИдентификаторов(СписокИдентификаторов)
	
	Элементы.ИдентификаторЭДО.СписокВыбора.Очистить();
	
	Если Не ЗначениеЗаполнено(СписокИдентификаторов) Тогда
		Возврат;
	КонецЕсли;
	
	ИдентификаторЭДО = СписокИдентификаторов[0].Значение;
	
	Для Каждого СтрокаСписка Из СписокИдентификаторов Цикл
		АктуальнаяВерсия =
			СервисНастроекЭДОВызовСервера.ВерсияПоддерживаемогоРегистрационногоПакетаОператора(
				Лев(СтрокаСписка.Значение, 3));
		Если ВидОрганизацииДляПодключения = Перечисления.ВидУчетнойЗаписиЭДО.ФизическоеЛицо
				И СервисЭДОКлиентСервер.СравнитьВерсииФорматовРегистрации(АктуальнаяВерсия, "5.03") < 0 Тогда
			Продолжить;
		КонецЕсли;
		Элементы.ИдентификаторЭДО.СписокВыбора.Добавить(СтрокаСписка.Значение);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ПроверкаСохранениеПароля

&НаКлиенте
Процедура ПроверитьПароль()
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеПроверкиПароляПодписанием", ЭтотОбъект);
	КриптографияБЭДКлиент.ПроверитьПароль(Сертификат, СвойстваПароля.Пароль, ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеПроверкиПароляПодписанием(Результат, ДополнительныеПараметры) Экспорт
	
	ОчиститьСообщения();

	СвойстваПароля.ПарольВерен = Результат.Успех;
	СвойстваПароля.ПарольПроверен = Истина;
	
	Элементы.Пароль.РасширеннаяПодсказка.Заголовок = "";
	Если Не Результат.Успех Тогда
		КонтекстДиагностики = Результат.КонтекстДиагностики;
		ОбработатьОшибкиВКонтекстномРежиме(Элементы.Пароль.РасширеннаяПодсказка);
		ЭлектроннаяПодписьКлиент.УстановитьПарольСертификата(Сертификат, Неопределено);
	КонецЕсли;
	
	НачатьРегистрациюВСервисе();
	
КонецПроцедуры

#КонецОбласти

#Область ОператорыЭДО

&НаСервере
Процедура ПолучитьСпособОбменаПоИдентификатору()
	
	Для Каждого Оператор Из ОператорыЭДО Цикл
		
		ИдентификаторОператора = Оператор.Идентификатор;
		ДлинаИдентификатораОператора = СтрДлина(ИдентификаторОператора);
		
		Если Лев(ИдентификаторЭДО, ДлинаИдентификатораОператора) = ИдентификаторОператора Тогда
			СпособОбменаЭД = Оператор.СпособОбмена;
			ИдентификаторОператораЭДО = Элементы.ОператорЭДО.СписокВыбора.НайтиПоЗначению(ИдентификаторОператора).Значение;
			ОператорПоддерживаетНастройкуТребованияПриглашений =
				СервисНастроекЭДОПовтИсп.ОператорПоддерживаетВерсиюФорматаРегистрации(ИдентификаторОператораЭДО, "5.04");
		КонецЕсли;
		
	КонецЦикла;
	
	Если ЗначениеЗаполнено(ИдентификаторЭДО) Тогда
		
		СпособОбменаАбонента = ОбменСКонтрагентамиИнтеграция.СпособОбменаАбонентаЭДО(ИдентификаторЭДО);
		Если ЗначениеЗаполнено(СпособОбменаАбонента) Тогда
			СпособОбменаЭД = СпособОбменаАбонента;
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПодключенныхОператоровЭДО()
	
	ТаблицаОператоров = СервисНастроекЭДО.ОператорыЭлектронногоДокументооборота();
	
	Если Не ЗначениеЗаполнено(ТаблицаОператоров) Тогда
		Возврат;
	КонецЕсли;
	
	ОператорыЭДО.Загрузить(ТаблицаОператоров);
	
	Элементы.ОператорЭДО.СписокВыбора.Очистить();
	Для Каждого ДанныеОператораЭДО Из ОператорыЭДО Цикл
		Если ВидОрганизацииДляПодключения = ФизическоеЛицо() Тогда
			АктуальнаяВерсия =
				СервисНастроекЭДОВызовСервера.ВерсияПоддерживаемогоРегистрационногоПакетаОператора(
					ДанныеОператораЭДО.Идентификатор);
			Если СервисЭДОКлиентСервер.СравнитьВерсииФорматовРегистрации(АктуальнаяВерсия, "5.03") >= 0 Тогда
				Элементы.ОператорЭДО.СписокВыбора.Добавить(
					ДанныеОператораЭДО.Идентификатор, ДанныеОператораЭДО.Наименование);
			КонецЕсли;
		Иначе
			Элементы.ОператорЭДО.СписокВыбора.Добавить(
				ДанныеОператораЭДО.Идентификатор, ДанныеОператораЭДО.Наименование);
		КонецЕсли;
	КонецЦикла;
	Если ЗначениеЗаполнено(ИдентификаторОператораЭДО)
			И Элементы.ОператорЭДО.СписокВыбора.НайтиПоЗначению(ИдентификаторОператораЭДО) = Неопределено Тогда
		ИдентификаторОператораЭДО = СервисНастроекЭДОКлиентСервер.ИдентификаторКалуги();
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ИдентификаторОператораЭДО) Тогда
		ИдентификаторОператораЭДО = СервисНастроекЭДОКлиентСервер.ИдентификаторКалуги();
		ОператорПоддерживаетНастройкуТребованияПриглашений =
			СервисНастроекЭДОПовтИсп.ОператорПоддерживаетВерсиюФорматаРегистрации(ИдентификаторОператораЭДО, "5.04");
		УстановитьСпособОбменаПоОператору(СпособОбменаЭД, ОператорыЭДО, ИдентификаторОператораЭДО);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьСпособОбменаПоОператору(СпособОбменаЭД, ОператорыЭДО, ИдентификаторОператораЭДО)
	
	ОтборОператоров = Новый Структура("Идентификатор", ИдентификаторОператораЭДО);
	НайденныеОператоры = ОператорыЭДО.НайтиСтроки(ОтборОператоров);
	Если ЗначениеЗаполнено(НайденныеОператоры) Тогда
		СпособОбменаЭД = НайденныеОператоры[0].СпособОбмена;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СозданиеСертификата

&НаКлиенте
Процедура НайтиСоздатьСертификатКриптографии(КонтекстОжиданияОперации)
	
	Оповещение = Новый ОписаниеОповещения("ПослеПоискаСертификата", ЭтотОбъект, КонтекстОжиданияОперации);
	КриптографияБЭДКлиент.НайтиСоздатьСертификатКриптографии(ОтпечатокСертификата, Организация, Оповещение, ПрограммаКриптографии);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеПоискаСертификата(СертификатКриптографии, КонтекстОжиданияОперации) Экспорт
	
	Если ТипЗнч(СертификатКриптографии) <> Тип("СертификатКриптографии") Тогда
		Сертификат = СертификатКриптографии;
		ПолучитьДолжностьПоСертификату();
		СведенияПоРуководителю();
		ПроверитьНеобходимостьДоверенности();
		УстановитьВидимостьЭлементовФормы(ЭтотОбъект);
	Иначе
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='Не удалось записать сертификат в программе'"), , , "ОтпечатокСертификата");
	КонецЕсли;
	
	ОжиданиеОперацийБЭДКлиент.ЗакрытьФормуОжидания(КонтекстОжиданияОперации);
	
	Если (ВидОрганизацииДляПодключения = ЮридическоеЛицо()
				И Не (ВыбранСертификатИП
						Или ВыбранСертификатФизЛица))
			Или (ВидОрганизацииДляПодключения = ИндивидуальныйПредприниматель()
					И ВыбранСертификатИП) Тогда
		ЗапуститьПоискПоИНН();
		Если ВидПодключения = ВидыПодключения().Существующий Тогда
			ЗапуститьОжиданиеПолученияСведенийОрганизацииПоИНН(ТекстОжиданияПоискаИдентификаторовИСведенийПоОрганизации());
		Иначе
			ЗапуститьОжиданиеПолученияСведенийОрганизацииПоИНН(ТекстОжиданияПоискаСведенийПоОрганизации());
		КонецЕсли;
	КонецЕсли;
	
	Если ВидОрганизацииДляПодключения = ФизическоеЛицо() Тогда
		ВыполнитьПоискИдентификаторовОрганизации();
	КонецЕсли;
	
	СформироватьТекстПодвала(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьНеобходимостьДоверенности()
	
	ДоверенностьОбязательна = Ложь;
	Если (ВидОрганизацииДляПодключения = ЮридическоеЛицо()
			Или ВидОрганизацииДляПодключения = ИндивидуальныйПредприниматель())
		И Не ЗначениеЗаполнено(ИНН) Тогда
		ДоверенностьОбязательна = Истина
	КонецЕсли;
	
	Если ДоверенностьОбязательна
			И СозданиеУчетнойЗаписиИзСуществующейОрганизации 
			И ИдентификаторОператораЭДО = СервисНастроекЭДОКлиентСервер.ИдентификаторТакскома() Тогда
		ДоверенностьОбязательна = Ложь;
	КонецЕсли;
	
	ТребуетсяДоверенность = УчетныеЗаписиЭДОСлужебный.ТребуетсяДоверенностьДляРегистрацииУчетнойЗаписиПоИНН(ИНН,
		Сертификат, СпособОбменаЭД, ИдентификаторОператораЭДО);
	
	ТребуетсяДоверенность = ТребуетсяДоверенность
		Или ВидОрганизацииДляПодключения <> ФизическоеЛицо()
			И ВыбранСертификатФизЛица;
	
	Если ТребуетсяДоверенность И Не ПустаяСтрока(ИдентификаторОператораЭДО) Тогда
		Отбор = Новый Структура("Идентификатор", ИдентификаторОператораЭДО);
		НайденныеСтроки = ОператорыЭДО.НайтиСтроки(Отбор);
		Если НайденныеСтроки.Количество() Тогда
			ДанныеОператора = НайденныеСтроки[0];
			Если ДанныеОператора.ПриРегистрацииПредставителяТребуетсяМЧД = "Требуется" Тогда
				ДоверенностьОбязательна = Истина;
			ИначеЕсли ДанныеОператора.ПриРегистрацииПредставителяТребуетсяМЧД = "НеТребуется" Тогда
				ТребуетсяДоверенность = Ложь;
			ИначеЕсли ДанныеОператора.ПриРегистрацииПредставителяТребуетсяМЧД = "Опционально" Тогда
				ДоверенностьОбязательна = Ложь;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область РегистрацияВСервисе

&НаКлиентеНаСервереБезКонтекста
Процедура СформироватьТекстПодвала(Форма)
	
	Форма.Элементы.ДекорацияПодвалНаименованиеОрганизации.Заголовок = "";
	Форма.Элементы.ДекорацияПодвалРуководитель.Заголовок = "";
	Форма.Элементы.ДекорацияПодвалИННКПП.Заголовок = "";
	
	ШаблонИНН = ?(ЗначениеЗаполнено(Форма.ИНН), СтрШаблон(НСтр("ru='ИНН: %1'"), Форма.ИНН), "");
	ШаблонКПП = ?(Форма.ВидОрганизацииДляПодключения = ЮридическоеЛицо()
		И ЗначениеЗаполнено(Форма.КПП), СтрШаблон(НСтр("ru='КПП: %1'"), Форма.КПП), "");
	ШаблонОГРН = ?(Форма.ВидОрганизацииДляПодключения = ЮридическоеЛицо()
		И ЗначениеЗаполнено(Форма.ОГРН), СтрШаблон(НСтр("ru='ОГРН: %1'"), Форма.ОГРН), "");
	ШаблонОГРНИП = ?(Форма.ВидОрганизацииДляПодключения = ИндивидуальныйПредприниматель()
		И ЗначениеЗаполнено(Форма.ОГРН), СтрШаблон(НСтр("ru='ОГРНИП: %1'"), Форма.ОГРН), "");
	
	ШаблонИНН = ?(ЗначениеЗаполнено(ШаблонИНН), ШаблонИНН + " ", ШаблонИНН);
	ШаблонКПП = ?(ЗначениеЗаполнено(ШаблонКПП), ШаблонКПП + " ", ШаблонКПП);
	Форма.Элементы.ДекорацияПодвалИННКПП.Заголовок = СтрШаблон("%1%2%3%4", ШаблонИНН, ШаблонКПП, ШаблонОГРН, ШаблонОГРНИП);
	
	Если ЗначениеЗаполнено(Форма.НаименованиеОрганизации) Тогда
		Форма.Элементы.ДекорацияПодвалНаименованиеОрганизации.Заголовок = Форма.НаименованиеОрганизации;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Форма.Руководитель) Тогда
		Форма.Элементы.ДекорацияПодвалРуководитель.Заголовок = СтрШаблон(НСтр("ru='Руководитель: %1'"), Форма.Руководитель);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьРегистрациюВСервисе() Экспорт
	
	УстановитьОтображениеЗарегистрироватьЭДОТекст(ЭтотОбъект);
	
	ПарольВеренИПроверен = СвойстваПароля.ПарольВерен И СвойстваПароля.ПарольПроверен;
	Если Не ПарольВеренИПроверен Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='Не удалось проверить пароль. Смотрите ""Подробнее""'"), , , "Пароль");
		Возврат;
	КонецЕсли;
	
	СкрытьЗаголовкиУРасширеннойПодсказки(ЭтотОбъект);
	ПереключитьТекущуюСтраницуНаЭтапРегистрации(ЭтотОбъект);
	
	РегистрацияВыполнена = Ложь;
	ВыполняетсяРегистрация = Истина;
	УстановкаСостоянияПолученияИдентификатораЭД(Ложь);
	
	Если ИспользоватьЦентрЭДО Тогда
		ЗарегистрироватьСертификатЧерезЦентрЭДО();
	ИначеЕсли СпособОбменаЭД = ПредопределенноеЗначение("Перечисление.СпособыОбменаЭД.ЧерезСервис1СЭДО") Тогда
		ЗарегистрироватьСертификат1СЭДО();
	ИначеЕсли СпособОбменаЭД = ПредопределенноеЗначение("Перечисление.СпособыОбменаЭД.ЧерезОператораЭДОТакском") Тогда
		ТестСвязиСервисаЭДО();
	Иначе
		ВыполняетсяРегистрация = Ложь;
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПоддержанаРегистрацияЧерезФормат_5_03(Форма)
	
	АктуальнаяВерсия =
		СервисНастроекЭДОВызовСервера.ВерсияПоддерживаемогоРегистрационногоПакетаОператора(Форма.ИдентификаторОператораЭДО);
	
	Возврат СервисЭДОКлиентСервер.СравнитьВерсииФорматовРегистрации(АктуальнаяВерсия, "5.03") >= 0;
	
КонецФункции

#Область РегистрацияВСервисе1СЭДО

&НаКлиенте
Процедура ЗарегистрироватьСертификат1СЭДО()
	
	ПараметрыРегистрации = СервисЭДОКлиент.НовыеПараметрыРегистрацииВСервисе1СЭДО();
	ПараметрыРегистрации.Организация = Организация;
	ПараметрыРегистрации.ОператорЭДО = ИдентификаторОператораЭДО;
	ПараметрыРегистрации.СертификатыПодписейОрганизации.Добавить(Сертификат);
	ПараметрыРегистрации.НеИспользоватьПриглашения = Не ТребоватьПриглашенияПередНачаломЭДО;
	ПараметрыРегистрации.Комментарий = НазначениеУчетнойЗаписи;
	Если Не ПоддержанаРегистрацияЧерезФормат_5_03(ЭтотОбъект) Тогда
		ПараметрыРегистрации.АдресОрганизации = АдресОрганизации;
		ПараметрыРегистрации.АдресОрганизацииЗначение = ЗначениеПолейАдреса;
		ПараметрыРегистрации.КодНалоговогоОргана = КодНалоговогоОргана;
	КонецЕсли;
	Если ЗначениеЗаполнено(Доверенность) Тогда
		ПараметрыРегистрации.Доверенности.Вставить(Сертификат, Доверенность);
	КонецЕсли;
	Если ВидПодключения = ВидыПодключения().Существующий Тогда
		ПараметрыРегистрации.ИдентификаторОрганизации = СокрЛП(ИдентификаторЭДО);
	КонецЕсли;
	ПараметрыРегистрации.ВидУчетнойЗаписи = ВидОрганизацииДляПодключения;
	ПараметрыРегистрации.КодыТиповДокументовКОбмену = УчетныеЗаписиЭДОКлиентСервер.КодыТиповДокументов(КодыТиповДокументов);
	
	КонтекстДиагностики = ОбработкаНеисправностейБЭДКлиент.НовыйКонтекстДиагностики();
	Оповещение = Новый ОписаниеОповещения("ЗарегистрироватьСертификат1СЭДОЗавершение", ЭтотОбъект);
	УчетныеЗаписиЭДОКлиент.ЗарегистрироватьСертификатВСервисе1СЭДО(
		ЭтотОбъект, Оповещение, ПараметрыРегистрации, КонтекстДиагностики);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗарегистрироватьСертификат1СЭДОЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат.Успех Тогда
		УстановкаСостоянияПолученияИдентификатораЭД(Истина, Ложь);
		УникальныйИдентификаторЗаявки1СЭДО = Результат.УникальныйИдентификаторЗаявки1СЭДО;
		ПаролиСертификатов = Результат.ПаролиСертификатов;
		// Запустим обработчик ожидания результата регистрации организации у оператора.
		ОжиданиеОперацийБЭДКлиент.ИнициализироватьПараметрыОбработчикаОжидания(ПараметрыОбработчикаОжидания);
		ПодключитьОбработчикОжидания(
			"Подключаемый_ПроверитьВыполнениеЗаданияДляЭД", ПараметрыОбработчикаОжидания.ТекущийИнтервал, Истина);
	Иначе
		ВыполняетсяРегистрация = Ложь;
		УстановкаСостоянияПолученияИдентификатораЭД(СостоянияПодключения().Ошибка);
		КонтекстДиагностики = Результат.КонтекстДиагностики;
		ОбработатьОшибкиВКонтекстномРежиме(Элементы.ГруппаОтправкаЗаявленияНаРегистрацию.РасширеннаяПодсказка);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьОшибкиВКонтекстномРежиме(ЭлементДляОтображенияОшибок)
	
	ПараметрыОбработкиОшибок = ОбработкаНеисправностейБЭДКлиент.НовыеПараметрыОбработкиОшибок();
	ПараметрыОбработкиОшибок.КонтекстныйРежимОбработки = Истина;
	ПараметрыОбработкиОшибок.НадписьПредупреждение = ЭлементДляОтображенияОшибок;
	ПараметрыОбработкиОшибок.ТекстПредупреждения = ТекстПредупреждения();
	ОбработкаНеисправностейБЭДКлиент.ОбработатьОшибки(КонтекстДиагностики, ПараметрыОбработкиОшибок);
	
КонецПроцедуры

&НаКлиенте
Функция ТекстПредупреждения()
	
	Текст = СтрШаблон(
		НСтр("ru = 'Не удалось выполнить операцию. <a style=""font: %1"" href=""Подробнее"">Подробнее</a>.'"),
		"ЖирныйШрифтБЭД");
	Возврат СтроковыеФункцииКлиент.ФорматированнаяСтрока(Текст); 
	
КонецФункции

&НаКлиенте
Процедура Подключаемый_ПроверитьВыполнениеЗаданияДляЭД()
	
	Оповещение = Новый ОписаниеОповещения("ПолучениеСостоянияРегистрацииСертификатаВ1СЭДОЗавершение", ЭтотОбъект);
	СервисЭДОКлиент.ПолучитьСостояниеРегистрацииВСервисе1СЭДО(
		ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(УникальныйИдентификаторЗаявки1СЭДО), Оповещение,
		УникальныйИдентификатор);
		
КонецПроцедуры

&НаКлиенте
Процедура ПолучениеСостоянияРегистрацииСертификатаВ1СЭДОЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		УстановкаСостоянияПолученияИдентификатораЭД(Истина, СостоянияПодключения().Ошибка);
	КонецЕсли;
	
	Если Результат.Статус = СостоянияПодключения().Выполнено Тогда
		
		РезультатФункции = ПолучитьИзВременногоХранилища(Результат.АдресРезультата); // см. СервисЭДО.ПолучитьСостояниеРегистрацииВСервисе1СЭДО
		СостояниеЗаявки = РезультатФункции.СостояниеРегистрации[УникальныйИдентификаторЗаявки1СЭДО];
		ИдентификаторЭДО = СостояниеЗаявки.ИдентификаторОрганизации;
		
		Если ЗначениеЗаполнено(ИдентификаторЭДО) Тогда
			
			ТестСвязиСервисаЭДО();
			
		Иначе
			КонтекстДиагностики = РезультатФункции.КонтекстДиагностики;
			ОбработатьОшибкиВКонтекстномРежиме(Элементы.ГруппаОжиданиеОтветаОтОператора.РасширеннаяПодсказка);
			
			Если Не СостояниеЗаявки.Результат Тогда
				УстановкаСостоянияПолученияИдентификатораЭД(Истина, СостоянияПодключения().Ошибка);
				Возврат;
			КонецЕсли;
			
			ОжиданиеОперацийБЭДКлиент.ОбновитьПараметрыОбработчикаОжидания(ПараметрыОбработчикаОжидания);
			ПодключитьОбработчикОжидания("Подключаемый_ПроверитьВыполнениеЗаданияДляЭД",
					ПараметрыОбработчикаОжидания.ТекущийИнтервал, Истина);
		КонецЕсли;
		
	Иначе
		ТекстСообщения = НСтр("ru = 'Произошла ошибка при регистрации учетной записи у оператора ЭДО.
			|Подробности см. в журнале регистрации.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		УстановкаСостоянияПолученияИдентификатораЭД(Истина, СостоянияПодключения().Ошибка);
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ТестСвязиСервисаЭДО()
	
	УстановкаСостоянияПолученияИдентификатораЭД(Истина, Истина, Ложь);
	
	Если СпособОбменаЭД = ПредопределенноеЗначение("Перечисление.СпособыОбменаЭД.ЧерезСервис1СЭДО")
		И ВидПодключения = ВидыПодключения().Существующий Тогда
		ПолучитьПараметрыУведомлений();
	Иначе
		ВыполнитьОтправкуДанныхВСервисНастроек();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьПараметрыУведомлений()
	
	Оповещение = Новый ОписаниеОповещения("ПолучитьПараметрыУведомленийЗавершение", ЭтотОбъект);
	
	Если ИспользоватьЦентрЭДО Тогда
		ОбщийМодульУчетныеЗаписиЭДОИнтеграцияЦентраЭДОКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль(
			"УчетныеЗаписиЭДОИнтеграцияЦентраЭДОКлиент");
		ПараметрыПолучения = ОбщийМодульУчетныеЗаписиЭДОИнтеграцияЦентраЭДОКлиент.НовыеПараметрыПолученияНастройкиУведомленийУчетнойЗаписиЭДО();
		ПараметрыПолучения.ОповещениеОЗавершении = Оповещение;
		ПараметрыПолучения.ВыбранныйСертификат = Сертификат;
		ПараметрыПолучения.ИдентификаторУчетнойЗаписиЭДО = СокрЛП(ИдентификаторЭДО);
		ПараметрыПолучения.ПаролиСертификатов = ПаролиСертификатов;
		ПараметрыПолучения.ФормаВладелец = ЭтотОбъект;
		ПараметрыПолучения.УчетнаяЗаписьЦентраЭДО = УчетнаяЗаписьЦентраЭДО;
		ОбщийМодульУчетныеЗаписиЭДОИнтеграцияЦентраЭДОКлиент.ПолучитьНастройкиУведомленийУчетнойЗаписиЭДО(ПараметрыПолучения);
	Иначе
		КлючСинхронизации = СинхронизацияЭДОКлиентСервер.НовыйКлючСинхронизации();
		КлючСинхронизации.ИдентификаторУчетнойЗаписи = СокрЛП(ИдентификаторЭДО);
		КлючСинхронизации.СпособОбмена = СпособОбменаЭД;
		КлючСинхронизации.ВыбранныйСертификат = Сертификат;
		
		СервисЭДОКлиент.ПолучитьПараметрыУведомлений(КлючСинхронизации, КонтекстДиагностики, Оповещение, ЭтотОбъект,
			ПаролиСертификатов);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьПараметрыУведомленийЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ТекущиеНастройкиУведомлений = Результат.ПараметрыУведомлений;
	КонтекстДиагностики = Результат.КонтекстДиагностики;
	Если ТекущиеНастройкиУведомлений = Неопределено Тогда
		ОбработатьОшибкиВКонтекстномРежиме(Элементы.ГруппаСозданиеУчетнойЗаписиЭДО.РасширеннаяПодсказка);
		УстановкаСостоянияПолученияИдентификатораЭД(Истина, Истина, СостоянияПодключения().Ошибка);
		Возврат;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ТекущиеНастройкиУведомлений);
	
	ВыполнитьОтправкуДанныхВСервисНастроек();
	
КонецПроцедуры

#КонецОбласти

#Область РегистрацияЧерезЦентрЭДО

&НаКлиенте
Процедура ЗарегистрироватьСертификатЧерезЦентрЭДО()
	
	МодульУчетныеЗаписиЭДОИнтеграцияЦентраЭДОКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль(
		"УчетныеЗаписиЭДОИнтеграцияЦентраЭДОКлиент");
	
	ПараметрыРегистрации = МодульУчетныеЗаписиЭДОИнтеграцияЦентраЭДОКлиент.НовыеПараметрыРегистрацииСертификатовВЭДО();
	ПараметрыРегистрации.УчетнаяЗаписьЦентраЭДО = УчетнаяЗаписьЦентраЭДО;
	ПараметрыРегистрации.Организация = Организация;
	ПараметрыРегистрации.ОператорЭДО = ИдентификаторОператораЭДО;
	Если Не ПоддержанаРегистрацияЧерезФормат_5_03(ЭтотОбъект) Тогда
		ПараметрыРегистрации.АдресОрганизации = АдресОрганизации;
		ПараметрыРегистрации.АдресОрганизацииЗначение = ЗначениеПолейАдреса;
		ПараметрыРегистрации.КодНалоговогоОргана = КодНалоговогоОргана;
	КонецЕсли;
	ПараметрыРегистрации.СертификатыДляПодписания.Добавить(Сертификат);
	ПараметрыРегистрации.СертификатыДляРегистрации.Добавить(Сертификат);
	ПараметрыРегистрации.ВидУчетнойЗаписи = ВидОрганизацииДляПодключения;
	ПараметрыРегистрации.Назначение = НазначениеУчетнойЗаписи;
	Если ЗначениеЗаполнено(Доверенность) Тогда
		ПараметрыРегистрации.Доверенности.Вставить(Сертификат, Доверенность);
	КонецЕсли;
	Если ВидПодключения = ВидыПодключения().Существующий Тогда
		ПараметрыРегистрации.ИдентификаторОрганизации = СокрЛП(ИдентификаторЭДО);
	КонецЕсли;
	Если ЗначениеЗаполнено(ДолжностьПоСертификату) Тогда
		ПараметрыРегистрации.Должности.Вставить(Сертификат, ДолжностьПоСертификату);
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("ЗарегистрироватьСертификатЧерезЦентрЭДОЗавершение", ЭтотОбъект);
	МодульУчетныеЗаписиЭДОИнтеграцияЦентраЭДОКлиент.НачатьОтправкуСертификатовДляРегистрацииВЭДО(
		Оповещение, ПараметрыРегистрации, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗарегистрироватьСертификатЧерезЦентрЭДОЗавершение(Результат, Контекст) Экспорт
	
	Если Не ВыполняетсяРегистрация Тогда 
		Возврат;
	КонецЕсли;
	
	Если Результат.Успех Тогда
		УстановкаСостоянияПолученияИдентификатораЭД(Истина, Ложь);
		УникальныйИдентификаторЗаявки1СЭДО = Результат.ИдентификаторЗаявки;
		ПаролиСертификатов = Результат.ПаролиСертификатов;
		ОжиданиеОперацийБЭДКлиент.ИнициализироватьПараметрыОбработчикаОжидания(ПараметрыОбработчикаОжидания);
		ПодключитьОбработчикОжидания("ПроверитьРезультатРегистрацииСертификатЧерезЦентрЭДО",
			ПараметрыОбработчикаОжидания.ТекущийИнтервал, Истина);
			
	ИначеЕсли Результат.СертификатыУжеЗарегистрированы Тогда
		МодульУчетныеЗаписиЭДОИнтеграцияЦентраЭДОКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль(
			"УчетныеЗаписиЭДОИнтеграцияЦентраЭДОКлиент");
		УстановкаСостоянияПолученияИдентификатораЭД(Истина, Ложь);
		УникальныйИдентификаторЗаявки1СЭДО = Результат.ИдентификаторЗаявки;
		ПаролиСертификатов = Результат.ПаролиСертификатов;
		РезультатРегистрации = МодульУчетныеЗаписиЭДОИнтеграцияЦентраЭДОКлиент.НовыйРезультатРегистрацииСертификатовВЭДО();
		РезультатРегистрации.ИдентификаторыЭДО.Вставить(Результат.ИдентификаторЗаявки, ИдентификаторЭДО);
		ОбработатьРезультатРегистрацииСертификатаЧерезЦентрЭДО(РезультатРегистрации);
	Иначе
		ВыполняетсяРегистрация = Ложь;
		УстановкаСостоянияПолученияИдентификатораЭД(СостоянияПодключения().Ошибка);
		КонтекстДиагностики = Результат.КонтекстДиагностики;
		ОбработатьОшибкиВКонтекстномРежиме(Элементы.ГруппаОтправкаЗаявленияНаРегистрацию.РасширеннаяПодсказка);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьРезультатРегистрацииСертификатЧерезЦентрЭДО()
	
	Оповещение = Новый ОписаниеОповещения("ОбработатьРезультатРегистрацииСертификатаЧерезЦентрЭДО", ЭтотОбъект);
	
	ИдентификаторыЗаявок = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(УникальныйИдентификаторЗаявки1СЭДО);
	ИдентификаторыЗаявокПоУчетнымЗаписямЦентровЭДО = Новый Соответствие;
	ИдентификаторыЗаявокПоУчетнымЗаписямЦентровЭДО.Вставить(УчетнаяЗаписьЦентраЭДО, ИдентификаторыЗаявок);
	
	МодульУчетныеЗаписиЭДОИнтеграцияЦентраЭДОКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль(
		"УчетныеЗаписиЭДОИнтеграцияЦентраЭДОКлиент");
	МодульУчетныеЗаписиЭДОИнтеграцияЦентраЭДОКлиент.НачатьПолучениеРезультатаРегистрацииСертификатовЭДО(
		Оповещение, ИдентификаторыЗаявокПоУчетнымЗаписямЦентровЭДО, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьРезультатРегистрацииСертификатаЧерезЦентрЭДО(РезультатРегистрации, Контекст = Неопределено) Экспорт
	
	Если ЗначениеЗаполнено(РезультатРегистрации.ЗаявкиВОбработке) Тогда
		ОжиданиеОперацийБЭДКлиент.ОбновитьПараметрыОбработчикаОжидания(ПараметрыОбработчикаОжидания);
		ПодключитьОбработчикОжидания("ПроверитьРезультатРегистрацииСертификатЧерезЦентрЭДО",
				ПараметрыОбработчикаОжидания.ТекущийИнтервал, Истина);
		Возврат;
	КонецЕсли;
	
	ИдентификаторЭДО = РезультатРегистрации.ИдентификаторыЭДО[УникальныйИдентификаторЗаявки1СЭДО];
	
	Если ЗначениеЗаполнено(ИдентификаторЭДО) Тогда
		Элементы.ГруппаОжиданиеОтветаОтОператора.РасширеннаяПодсказка.Заголовок = "";
		ТестСвязиСервисаЭДО();
	Иначе
		ВыполняетсяРегистрация = Ложь;
		УстановкаСостоянияПолученияИдентификатораЭД(Истина, СостоянияПодключения().Ошибка);
		КонтекстДиагностики = РезультатРегистрации.КонтекстДиагностики;
		ОбработатьОшибкиВКонтекстномРежиме(Элементы.ГруппаОжиданиеОтветаОтОператора.РасширеннаяПодсказка);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ВыполнитьОтправкуДанныхВСервисНастроек()
	
	ДанныеСохранены = СохранитьУчетнуюЗапись();
	
	Если Не ДанныеСохранены Тогда 
		УстановкаСостоянияПолученияИдентификатораЭД(Истина, Истина, СостоянияПодключения().Ошибка);
		Возврат;
	КонецЕсли;
	
	ПереключитьТекущуюСтраницуНаЭтапРегистрации(ЭтотОбъект);
	
	Если ИспользоватьЦентрЭДО Тогда
		Оповещение = Новый ОписаниеОповещения("ОтправкаДанныхВСервисНастроекЧерезЦентрЭДОЗавершение", ЭтотОбъект, ИдентификаторЭДО);
		МодульУчетныеЗаписиЭДОИнтеграцияЦентраЭДОКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль(
			"УчетныеЗаписиЭДОИнтеграцияЦентраЭДОКлиент");
		ПараметрыОбновления = УчетныеЗаписиЭДОИнтеграцияЦентраЭДОКлиентСервер.НовыйИнформацияОбУчетнойЗаписи();
		ПараметрыОбновления.ИдентификаторЭДО = СокрЛП(ИдентификаторЭДО);
		ПараметрыОбновления.Назначение = НазначениеУчетнойЗаписи;
		МодульУчетныеЗаписиЭДОИнтеграцияЦентраЭДОКлиент.ОбновитьИнформациюОбУчетнойЗаписиЭДО(
			ПараметрыОбновления, Оповещение, ЭтотОбъект);
	Иначе
		Оповещение = Новый ОписаниеОповещения("ОтправкаДанныхВСервисНастроекЗавершение", ЭтотОбъект, ИдентификаторЭДО);
		СервисНастроекЭДОКлиент.ОтправитьДанныеАбонентаВСервисНастроек(
			ИдентификаторЭДО, Оповещение, ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправкаДанныхВСервисНастроекЗавершение(Результат, ИдентификаторЭДО) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = СостоянияПодключения().Выполнено Тогда
		Оповещение = Новый ОписаниеОповещения("ЗавершитьРегистрациюПослеВключенияАвтоматическогоПолученияЭДО",
			ЭтотОбъект, ИдентификаторЭДО);
		ВключитьАвтоматическоеПолучениеЭДО(Оповещение);
	Иначе
		УстановкаСостоянияПолученияИдентификатораЭД(Истина, Истина, СостоянияПодключения().Ошибка);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправкаДанныхВСервисНастроекЧерезЦентрЭДОЗавершение(Результат, ИдентификаторЭДО) Экспорт
	
	Если Не Результат.Успех Тогда
		ОбработкаНеисправностейБЭДКлиент.ОбработатьОшибки(Результат.КонтекстДиагностики);
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("ЗавершитьРегистрациюПослеВключенияАвтоматическогоПолученияЭДО",
		ЭтотОбъект, ИдентификаторЭДО);
	
	ВключитьАвтоматическоеПолучениеЭДО(Оповещение);
	
КонецПроцедуры

&НаСервере
Функция СохранитьУчетнуюЗапись()
	
	ШаблонНаименование = "%1, %2";
	НаименованиеУчетнойЗаписи = СтрШаблон(ШаблонНаименование, Организация, СпособОбменаЭД);
	
	ОписаниеУчетнойЗаписи = УчетныеЗаписиЭДОКлиентСервер.НовоеОписаниеУчетнойЗаписи();
	ОписаниеУчетнойЗаписи.Наименование = НаименованиеУчетнойЗаписи;
	ОписаниеУчетнойЗаписи.Организация = Организация;
	ОписаниеУчетнойЗаписи.АдресОрганизации = АдресОрганизации;
	ОписаниеУчетнойЗаписи.АдресОрганизацииЗначение = ЗначениеПолейАдреса;
	ОписаниеУчетнойЗаписи.СпособОбмена = СпособОбменаЭД;
	ОписаниеУчетнойЗаписи.Идентификатор = СокрЛП(ИдентификаторЭДО);
	ОписаниеУчетнойЗаписи.Сертификаты = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Сертификат);
	ОписаниеУчетнойЗаписи.Оператор = ИдентификаторОператораЭДО;
	ОписаниеУчетнойЗаписи.ПринятыУсловияИспользования = Истина;
	ОписаниеУчетнойЗаписи.ИспользоватьЦентрЭДО = ИспользоватьЦентрЭДО;
	ОписаниеУчетнойЗаписи.УчетнаяЗаписьЦентраЭДО = УчетнаяЗаписьЦентраЭДО;
	ОписаниеУчетнойЗаписи.Назначение = НазначениеУчетнойЗаписи;
	ОписаниеУчетнойЗаписи.ВидУчетнойЗаписи = ВидОрганизацииДляПодключения;
	ОписаниеУчетнойЗаписи.КодыТиповДокументовКОбмену = УчетныеЗаписиЭДОКлиентСервер.КодыТиповДокументов(КодыТиповДокументов);
	Если ВидОрганизацииДляПодключения <> ФизическоеЛицо() Тогда
		ОписаниеУчетнойЗаписи.КодНалоговогоОргана = КодНалоговогоОргана;
	КонецЕсли;
	Если ЗначениеЗаполнено(Доверенность) Тогда
		ОписаниеУчетнойЗаписи.Доверенности.Вставить(Сертификат, Доверенность);
	КонецЕсли;
	Если ЗначениеЗаполнено(ДолжностьПоСертификату) Тогда
		ОписаниеУчетнойЗаписи.Должности.Вставить(Сертификат, ДолжностьПоСертификату);
	КонецЕсли;
	Если ОператорПоддерживаетНастройкуТребованияПриглашений И Не ИспользоватьЦентрЭДО Тогда
		ОписаниеУчетнойЗаписи.НеИспользоватьПриглашения = Не ТребоватьПриглашенияПередНачаломЭДО;
	Иначе
		ОписаниеУчетнойЗаписи.НеИспользоватьПриглашения = Ложь;
	КонецЕсли;
	
	ОтборОператоров = Новый Структура("Идентификатор", ИдентификаторОператораЭДО);
	НайденныеОператоры = ОператорыЭДО.НайтиСтроки(ОтборОператоров);
	Если ЗначениеЗаполнено(НайденныеОператоры) Тогда
		ОписаниеУчетнойЗаписи.ПредставлениеОператора = НайденныеОператоры[0].Наименование;
	КонецЕсли;
		
	Возврат УчетныеЗаписиЭДО.СоздатьУчетнуюЗапись(ОписаниеУчетнойЗаписи, Ложь);
	
КонецФункции

&НаКлиенте
Процедура ЗавершитьРегистрациюПослеВключенияАвтоматическогоПолученияЭДО(Результат, Контекст) Экспорт
	
	ВыполняетсяРегистрация = Ложь;
	РегистрацияВыполнена = Истина;
	Оповестить("ОбновленСписокУчетныхЗаписей1СЭДО");
	Оповестить(УчетныеЗаписиЭДОКлиент.ИмяСобытияСозданаУчетнаяЗаписьЭДО(), Организация);
	УстановкаСостоянияПолученияИдентификатораЭД(Истина, Истина, Истина);
	УстановитьВидимостьЭлементовФормы(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область АвтоматическоеПолучениеЭДО

// Параметры:
//  ОповещениеОЗавершении - ОписаниеОповещения
//  ИдентификаторЭДО - Строка
&НаКлиенте
Процедура ВключитьАвтоматическоеПолучениеЭДО(ОповещениеОЗавершении)
	
	Если Не ИспользоватьЦентрЭДО 
		И (Не ИспользоватьАвтоматическоеПолучениеЭДО
			Или СпособОбменаЭД <> ПредопределенноеЗначение("Перечисление.СпособыОбменаЭД.ЧерезСервис1СЭДО")) Тогда
		ВыполнитьОбработкуОповещения(ОповещениеОЗавершении);
		Возврат;
	КонецЕсли;
	
	Контекст = Новый Структура;
	Контекст.Вставить("ОповещениеОЗавершении", ОповещениеОЗавершении);
	Контекст.Вставить("ИдентификаторЭДО", ИдентификаторЭДО);
	
	Оповещение = Новый ОписаниеОповещения("ВключитьАвтоматическоеПолучениеЭДОЗавершение", ЭтотОбъект, Контекст);
	
	ПараметрыАвторизации = УчетныеЗаписиЭДОКлиент.НовыеПараметрыАвторизацииВСервисеЭДО();
	ПараметрыАвторизации.ИдентификаторыЭДО = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ИдентификаторЭДО);
	ПараметрыАвторизации.ФормаВладелец = ЭтотОбъект;
	ПараметрыАвторизации.ПаролиСертификатов = ПаролиСертификатов;
	
	АвтоматическоеПолучениеЭДОКлиент.ВключитьПоУчетнымЗаписямЭДО(Оповещение, ПараметрыАвторизации);
	
КонецПроцедуры

// Параметры:
//  Результат - Неопределено
//            - см. АвтоматическоеПолучениеЭДО.ВключитьИспользованиеКлючаДоступаКСервисуЭДО
//  Контекст - Структура:
//  * ОповещениеОЗавершении - см. ВключитьАвтоматическоеПолучениеЭДО.ОповещениеОЗавершении
//  * ИдентификаторЭДО - Строка
&НаКлиенте
Процедура ВключитьАвтоматическоеПолучениеЭДОЗавершение(Результат, Контекст) Экспорт
	
	Если Результат = Неопределено Тогда
		ВыполнитьОбработкуОповещения(Контекст.ОповещениеОЗавершении);
		Возврат;
	КонецЕсли;
	
	ИзменениеСостояния = Результат.ИзменениеСостояния;
	Подключен = ИзменениеСостояния <> Неопределено
		И ИзменениеСостояния.СостояниеПоИдентификаторамЭДО[Контекст.ИдентификаторЭДО] <> Неопределено;
	
	ОбработкаНеисправностейБЭДКлиент.ОбработатьОшибки(Результат.КонтекстДиагностики);
	
	ВыполнитьОбработкуОповещения(Контекст.ОповещениеОЗавершении, Подключен);
	
КонецПроцедуры

#КонецОбласти

#Область ИнтеграцияЦентраЭДО

// Параметры:
//  Результат - см. ИнтеграцияЦентраЭДОВызовСервера.ПодключитьЦентрЭДО
//  Контекст - Неопределено
&НаКлиенте
Процедура УчетнаяЗаписьЦентраЭДОСозданиеЗавершение(Результат, Контекст = Неопределено) Экспорт
	
	Если ЗначениеЗаполнено(Результат)
		И ЗначениеЗаполнено(Результат.УчетнаяЗапись) Тогда
		УчетнаяЗаписьЦентраЭДО = Результат.УчетнаяЗапись;
	КонецЕсли;
	
КонецПроцедуры

// Параметры:
//  ИмяСобытия - Строка
//  Параметр - Структура
&НаКлиенте
Процедура ОбработатьЗаписьПользователяЦентраЭДО(ИмяСобытия, Параметр)
	
	Если Не ИспользоватьЦентрЭДО Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ИмяСобытия = "Запись_ПользователиЦентраЭДО" Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Параметр) Тогда
		Возврат;
	КонецЕсли;
	
	ПользовательЗаписи = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметр, "Пользователь");
	Если ПользовательЗаписи = ПользователиКлиент.ТекущийПользователь()
			И Не ЗначениеЗаполнено(ИдентификаторЭДО) Тогда
		ВыполнитьПоискИдентификаторовОрганизации();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

&НаСервере
Процедура ПолучитьДолжностьПоСертификату()
	
	Если Не ЗначениеЗаполнено(Сертификат) Тогда
		ДолжностьПоСертификату = "";
		Возврат;
	КонецЕсли;
	
	Если УчетныеЗаписиЭДОСлужебный.ТребуетсяЗаполнитьДолжностьДляСертификатаПоИНН(ИНН, Сертификат) Тогда
		ДолжностьПоСертификату = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Сертификат, "Должность");
	Иначе
		ДолжностьПоСертификату = "";
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЕстьУчетныеЗаписиПоИдентификаторуЭДО(ИдентификаторЭДО)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	УчетныеЗаписиЭДО.ИдентификаторЭДО КАК ИдентификаторЭДО
	|ИЗ
	|	РегистрСведений.УчетныеЗаписиЭДО КАК УчетныеЗаписиЭДО
	|ГДЕ
	|	УчетныеЗаписиЭДО.ИдентификаторЭДО = &ИдентификаторЭДО";
	Запрос.УстановитьПараметр("ИдентификаторЭДО", ИдентификаторЭДО);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ЕстьУчетныеЗаписи = Не РезультатЗапроса.Пустой();
	
	Возврат ЕстьУчетныеЗаписи;
	
КонецФункции

&НаКлиенте
Процедура ПроверкаКриптографии() Экспорт
	
	НовыйСвойстваПароля();
	ПроверитьУстановкуРасширенияКриптографии();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораДоверенности(РезультатВыбора, ДополнительныеПараметры) Экспорт
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Доверенность = РезультатВыбора;
	Если Не СозданиеУчетнойЗаписиИзСуществующейОрганизации Тогда
		ЗаполнитьОрганизациюПоДоверенности();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура АдресОрганизацииПриИзмененииНаСервере()
	
	ЗначениеПолейАдреса = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияПоПредставлению(
		АдресОрганизации, ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.Адрес"));
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуКонтактнойИнформацииЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(Результат) = Тип("Структура") Тогда
		АдресОрганизации = Результат.Представление;
		ЗначениеПолейАдреса = Результат.Значение;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПараметрыВидаКонтактнойИнформации(ВидКонтактнойИнформации)

	Возврат УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(ВидКонтактнойИнформации);

КонецФункции

&НаКлиенте
Процедура СертификатПриИзмененииПослеПолученияСертификата(РезультатПоиска, КонтекстОжиданияОперации) Экспорт
	
	Если РезультатПоиска = Неопределено Тогда
		ОжиданиеОперацийБЭДКлиент.ЗакрытьФормуОжидания(КонтекстОжиданияОперации);
		Возврат;
	КонецЕсли;
	
	СвойстваСертификата = ЭлектроннаяПодписьКлиент.СвойстваСубъектаСертификата(РезультатПоиска);
	ЗаполнитьСведенияОрганизацииСвойствамиСертификата(СвойстваСертификата);
	
	НайтиСоздатьСертификатКриптографии(КонтекстОжиданияОперации);
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьСертификатНаСервере()
	
	СертификатПоОтпечатку = ЭлектроннаяПодпись.ПолучитьСертификатПоОтпечатку(ОтпечатокСертификата, Ложь);
	СвойстваСертификата = ЭлектроннаяПодпись.СвойстваСубъектаСертификата(СертификатПоОтпечатку);
	ЗаполнитьСведенияОрганизацииСвойствамиСертификата(СвойстваСертификата);
	
	Сертификат = ЭлектроннаяПодпись.СсылкаНаСертификат(ОтпечатокСертификата);
	Если Не ЗначениеЗаполнено(Сертификат) Тогда
		ДополнительныеПараметры = Новый Структура("Организация", Организация);
		Сертификат = ЭлектроннаяПодпись.ЗаписатьСертификатВСправочник(СертификатПоОтпечатку, ДополнительныеПараметры);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСведенияОрганизацииСвойствамиСертификата(СвойстваСертификата)
	
	ВыбранСертификатФизЛица = ЭтоСертификатФизЛица(СвойстваСертификата);
	ВыбранСертификатИП = ЗначениеЗаполнено(СвойстваСертификата.ОГРНИП);
	
	СвойстваСертификатаИНН = ?(ЗначениеЗаполнено(СвойстваСертификата.ИННЮЛ), СвойстваСертификата.ИННЮЛ, СвойстваСертификата.ИНН);
	СвойстваСертификатаОГРН = ?(ЗначениеЗаполнено(СвойстваСертификата.ОГРН), СвойстваСертификата.ОГРН, СвойстваСертификата.ОГРНИП);
	
	ЗаполнитьДанныеФормыПоСертификату = 
		(ВидОрганизацииДляПодключения = ЮридическоеЛицо()
			И (Не ВыбранСертификатИП
				И Не ВыбранСертификатФизЛица))
		Или (ВидОрганизацииДляПодключения = ИндивидуальныйПредприниматель()
			И ВыбранСертификатИП)
		Или ВидОрганизацииДляПодключения = ФизическоеЛицо()
			И ВыбранСертификатФизЛица;
	
	Если Не СозданиеУчетнойЗаписиИзСуществующейОрганизации
			И ЗаполнитьДанныеФормыПоСертификату Тогда
		ИНН = СвойстваСертификатаИНН;
		ОГРН = СвойстваСертификатаОГРН;
		НаименованиеОрганизации = СвойстваСертификата.ОбщееИмя;
		
		ИзвлечьКодНалоговогоОрганаИзИНН(КодНалоговогоОргана, ИНН);
		
		НайтиОрганизацию();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОрганизациюПоДоверенности()
	
	Если Не ЗначениеЗаполнено(Доверенность) Тогда
		Возврат;
	КонецЕсли;
	
	СведенияДоверителя = МашиночитаемыеДоверенности.СведенияОсновногоДоверителя(Доверенность);
	
	Если ВидОрганизацииДляПодключения = ЮридическоеЛицо()
			И СтрДлина(СведенияДоверителя.ИНН) <> 10 Тогда
		ТекстСообщения = НСтр("ru='Выберите доверенность, выданную юридическим лицом'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Доверенность = Справочники.МЧД003.ПустаяСсылка();
		Возврат;
	ИначеЕсли ВидОрганизацииДляПодключения = ИндивидуальныйПредприниматель()
			И СтрДлина(СведенияДоверителя.ИНН) <> 12 Тогда
		ТекстСообщения = НСтр("ru='Выберите доверенность, выданную индивидуальным предпринимателем'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Доверенность = Справочники.МЧД003.ПустаяСсылка();
		Возврат;
	КонецЕсли;
	
	НаименованиеОрганизации = СведенияДоверителя.Наименование;
	ИНН = СведенияДоверителя.ИНН;
	ОГРН = СведенияДоверителя.ОГРН;
	Если Не ЗначениеЗаполнено(КПП) Тогда
		КПП = СведенияДоверителя.КПП;
	КонецЕсли;
	
	ИзвлечьКодНалоговогоОрганаИзИНН(КодНалоговогоОргана, ИНН);
	
	НайтиОрганизацию();
	СформироватьТекстПодвала(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДанныеОрганизации(Отказ = Ложь)
	
	ЕстьПравоИзменятьОрганизацию = ПравоДоступа("Изменение", Метаданные.ОпределяемыеТипы.Организация);;
	
	Если Не ЕстьПравоИзменятьОрганизацию Тогда
		ТекстСообщения = НСтр(
		"ru='При подключении данной учетной записи потребуется обновление реквизитов организации.
		|Недостаточно прав для выполнения этой операции.
		|Обратитесь к администратору системы для получения необходимых прав доступа.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ДанныеОрганизации = ОбменСКонтрагентамиКлиентСервер.НовыйДанныеОрганизации();
	ЗаполнитьЗначенияСвойств(ДанныеОрганизации, ЭтотОбъект);
	ДанныеОрганизации.ЮридическийАдрес = ЗначениеПолейАдреса;
	ДанныеОрганизации.НаименованиеСокращенное = НаименованиеОрганизации;
	ДанныеОрганизации.ВидОрганизации = Перечисления.ВидУчетнойЗаписиЭДО.ВидОрганизацииПоВидуУчетнойЗаписи(ВидОрганизацииДляПодключения);
	
	ОбменСКонтрагентамиПереопределяемый.ОбновитьДанныеОрганизации(ДанныеОрганизации);
	
КонецПроцедуры

&НаСервере
Функция ОткрытиеФормыНедоступно(Отказ)
	
	Если Не НастройкиЭДО.ЕстьПравоНастройкиОбмена(Истина) Тогда
		Отказ = Истина;
	КонецЕсли;
	
	Если ОбщегоНазначения.ЭтоМобильныйКлиент() Тогда
		Отказ = Истина;
		ИнтерфейсМобильногоЭДОКлиентСервер.СообщитьФункциональностьПокаНеДоступна();
	КонецЕсли;
	
	Возврат Отказ
	
КонецФункции

&НаКлиенте
Процедура ПередЗакрытиемЗавершение(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = КодВозвратаДиалога.Да Тогда
		ВыполняетсяРегистрация = Ложь;
		Закрыть();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОчиститьСертификат()
	
	ОтпечатокСертификата = "";
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьСведения()
	
	СвойстваПароля.Пароль = "";
	СвойстваПароля.ПарольВерен = Ложь;
	СвойстваПароля.ПарольПроверен = Ложь;
	Пароль = "";
	
	ТребуетсяДоверенность = Ложь;
	ДоверенностьОбязательна = Ложь;
	ВыбранСертификатФизЛица = Ложь;
	НеобходимПоискИдентификаторов = Истина;
	
	Организация = Неопределено;
	Доверенность = Неопределено;
	
	ОчиститьСведенияОрганизации();
	
	ИдентификаторЭДО = "";
	КодНалоговогоОргана = "";
	Элементы.ИдентификаторЭДО.СписокВыбора.Очистить();
	СформироватьТекстПодвала(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьСведенияОрганизации()
	
	ИНН = "";
	КПП = "";
	ОГРН = "";
	НаименованиеОрганизации = "";
	Руководитель = "";
	КодНалоговогоОргана = "";
	
	АдресОрганизации = "";
	ЗначениеПолейАдреса = "";
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура СкрытьЗаголовкиУРасширеннойПодсказки(Форма)
	
	Форма.Элементы.Пароль.РасширеннаяПодсказка.Заголовок = " ";
	Форма.Элементы.ГруппаОтправкаЗаявленияНаРегистрацию.РасширеннаяПодсказка.Заголовок = " ";
	Форма.Элементы.ГруппаОжиданиеОтветаОтОператора.РасширеннаяПодсказка.Заголовок = " ";
	Форма.Элементы.ГруппаСозданиеУчетнойЗаписиЭДО.РасширеннаяПодсказка.Заголовок = " ";
	
КонецПроцедуры

&НаКлиенте
Процедура НажатиеНаГиперссылкуДиагностики()
	
	КонтекстДиагностики.ЗаголовокОперации = НСтр("ru = 'При подключении к ЭДО'");
	ПараметрыОбработкиОшибок = ОбработкаНеисправностейБЭДКлиент.НовыеПараметрыОбработкиОшибок();
	КонтекстДиагностики.ОшибкиОбработаны = Ложь;
	ОбработкаНеисправностейБЭДКлиент.ОбработатьОшибки(КонтекстДиагностики, ПараметрыОбработкиОшибок);
	
КонецПроцедуры

&НаКлиенте
Функция КлючевыеПоляДляРегистрацииЗаполнены()
	
	ЕстьОшибки = Ложь;
	
	Если ВидОрганизацииДляПодключения = ЮридическоеЛицо()
			И СтрДлина(КПП) <> 9 Тогда
		Элементы.ГруппаЗаголовокКПП.Видимость = Истина;
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='КПП организации должен состоять из 9 цифр'"), , ,
			"КПП", ЕстьОшибки);
	КонецЕсли;
	
	Если ИдентификаторОператораЭДО = СервисНастроекЭДОКлиентСервер.ИдентификаторТакскома()
			И (ВидОрганизацииДляПодключения = ЮридическоеЛицо()
				Или ВидОрганизацииДляПодключения = ИндивидуальныйПредприниматель())
			И Не ЗначениеЗаполнено(НаименованиеОрганизации) Тогда
		Элементы.ГруппаЗаголовокНаименование.Видимость = Истина;
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='Наименование организации организации должно быть заполнено'"), , ,
			"НаименованиеОрганизации", ЕстьОшибки);
	КонецЕсли;
	
	Если ИдентификаторОператораЭДО = СервисНастроекЭДОКлиентСервер.ИдентификаторТакскома()
			И ВидОрганизацииДляПодключения = ЮридическоеЛицо()
			И СтрДлина(ИНН) <> 10 Тогда
		Элементы.ГруппаЗаголовокИНН.Видимость = Истина;
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='ИНН организации должен состоять из 10 цифр'"), , ,
			"ИНН", ЕстьОшибки);
	КонецЕсли;
	
	Если ИдентификаторОператораЭДО = СервисНастроекЭДОКлиентСервер.ИдентификаторТакскома()
			И ВидОрганизацииДляПодключения = ИндивидуальныйПредприниматель()
			И СтрДлина(ИНН) <> 12 Тогда
		Элементы.ГруппаЗаголовокИНН.Видимость = Истина;
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='ИНН организации должен состоять из 12 цифр'"), , ,
			"ИНН", ЕстьОшибки);
	КонецЕсли;
	
	Если ВидОрганизацииДляПодключения = ЮридическоеЛицо()
			И СтрДлина(ОГРН) <> 13 Тогда
		Элементы.ГруппаЗаголовокОГРН.Видимость = Истина;
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='ОГРН организации должен состоять из 13 цифр'"), , ,
			"ОГРН", ЕстьОшибки);
	КонецЕсли;
	
	Если ВидОрганизацииДляПодключения = ИндивидуальныйПредприниматель()
			И СтрДлина(ОГРН) <> 15 Тогда
		Элементы.ГруппаЗаголовокОГРН.Видимость = Истина;
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='ОГРНИП организации должен состоять из 15 цифр'"), , ,
			"ОГРН", ЕстьОшибки);
	КонецЕсли;
	
	ЕстьИдентификаторУчетнойЗаписи = ВидПодключения = ВидыПодключения().Новый
		Или ЗначениеЗаполнено(ИдентификаторЭДО);
	Если Не ЕстьИдентификаторУчетнойЗаписи Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='Не заполнен идентификатор ЭДО'"), , ,
			"ИдентификаторЭДО", ЕстьОшибки);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ОтпечатокСертификата) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='Не заполнен сертификат'"), , ,
		"ОтпечатокСертификата", ЕстьОшибки);
	КонецЕсли;
	
	Если ИспользоватьЦентрЭДО
			И Не ЗначениеЗаполнено(УчетнаяЗаписьЦентраЭДО) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Не заполнена учетная запись Центра ЭДО'"), , ,
			"УчетнаяЗаписьЦентраЭДО", ЕстьОшибки);
	КонецЕсли;
	
	Если ДоверенностьОбязательна
			И Не ЗначениеЗаполнено(Доверенность)
			И Не ИдентификаторОператораЭДО = СервисНастроекЭДОКлиентСервер.ИдентификаторТакскома() Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Не заполнена доверенность'"), , ,
			"Доверенность", ЕстьОшибки);
	КонецЕсли;
	
	Если Элементы.ГруппаАдресОрганизации.Видимость
			И Не ЗначениеЗаполнено(АдресОрганизации)
			И Не ВидОрганизацииДляПодключения = ФизическоеЛицо() Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Не заполнен адрес организации'"), , ,
			"АдресОрганизации", ЕстьОшибки);
	КонецЕсли;
	
	Если Элементы.ГруппаКодНалоговогоОргана.Видимость
			И (Не ЗначениеЗаполнено(СтроковыеФункцииКлиентСервер.СтрокаВЧисло(КодНалоговогоОргана))
				Или СтрДлина(СокрЛП(КодНалоговогоОргана)) <> 4) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Код налогового органа должен состоять из 4 цифр'"), , ,
			"КодНалоговогоОргана", ЕстьОшибки);
	КонецЕсли;
	
	Если Не СоглашаюсьСУсловиямиИспользования Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Согласитесь с условиями использования'"), , ,
			"СоглашаюсьСУсловиямиИспользования", ЕстьОшибки);
	КонецЕсли;
	
	МинимальнаяДлина = УчетныеЗаписиЭДОКлиентСервер.МинимальнаяДопустимаяДлинаНазначенияУчетнойЗаписи();
	ДлинаНазначения = СтрДлина(СокрЛП(НазначениеУчетнойЗаписи));
	
	Если ДлинаНазначения = 0 Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			НСтр("ru = 'Не заполнено назначение учетной записи'"), , "НазначениеУчетнойЗаписи", , ЕстьОшибки);
	ИначеЕсли ДлинаНазначения < МинимальнаяДлина Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			СтрШаблон(НСтр("ru = 'Длина назначения должна быть не менее %1 символов'"), МинимальнаяДлина), ,
			"Запись.НазначениеУчетнойЗаписи", , ЕстьОшибки);
	КонецЕсли;
	
	Если КодыТиповДокументов.НайтиСтроки(Новый Структура("Используется", Истина)).Количество() = 0 Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Не выбран ни один документ для обмена'"),,,
			"НаименованиеТиповДокументов", ЕстьОшибки);
	КонецЕсли;
		
	Возврат Не ЕстьОшибки;
	
КонецФункции

&НаКлиенте
Процедура ОбработатьПолеПароля()
	
	Элементы.Пароль.РежимПароля = Не Элементы.Пароль.РежимПароля;
	Если Элементы.Пароль.РежимПароля Тогда
		Элементы.Пароль.КартинкаКнопкиВыбора = БиблиотекаКартинок.ВводимыеСимволыВидны;
	Иначе
		Элементы.Пароль.КартинкаКнопкиВыбора = БиблиотекаКартинок.ВводимыеСимволыСкрыты;
	КонецЕсли;
	
	СкрытьКоличествоСимволовУПароля();
	
КонецПроцедуры

&НаКлиенте
Процедура СкрытьКоличествоСимволовУПароля()
	
	Если ЗначениеЗаполнено(Пароль) И Элементы.Пароль.РежимПароля Тогда
		Пароль = СкрытыйПароль();
	Иначе
		Пароль = СвойстваПароля.Пароль;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция СкрытыйПароль()
	
	Возврат "****************";
	
КонецФункции

&НаКлиенте
Процедура НовыйСвойстваПароля()
	
	СвойстваПароля = Новый Структура("Пароль, ПарольВерен, ПарольПроверен", "", Ложь, Ложь);
	
КонецПроцедуры

&НаСервере
Процедура НайтиОрганизацию()
	
	Если Не ЗначениеЗаполнено(ИНН) Тогда
		Возврат;
	КонецЕсли;
	
	Если ВидОрганизацииДляПодключения = ЮридическоеЛицо() Тогда
		ВидОрганизацииДляПоиска = "ЮЛ";
	ИначеЕсли ВидОрганизацииДляПодключения = ИндивидуальныйПредприниматель() Тогда
		ВидОрганизацииДляПоиска = "ИП";
	ИначеЕсли ВидОрганизацииДляПодключения = ФизическоеЛицо() Тогда
		ВидОрганизацииДляПоиска = "ФЛ";
	КонецЕсли;
	
	КлючевыеРеквизиты = ИнтеграцияЭДО.НовыеКлючевыеРеквизитыУчастникаЭДО();
	КлючевыеРеквизиты.ИНН = ИНН;
	КлючевыеРеквизиты.КПП = КПП;
	Организация = ИнтеграцияЭДО.ОрганизацияПоВидуИКлючевымРеквизитам(ВидОрганизацииДляПоиска, КлючевыеРеквизиты);
	
	ЗаполнитьДанныеДляРегистрационногоПакета();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеДляРегистрационногоПакета()
	
	Если ЗначениеЗаполнено(Организация) Тогда
		
		ИмяРеквизитаКППОрганизации = ИнтеграцияЭДО.ИмяНаличиеОбъектаРеквизитаВПрикладномРешении("КППОрганизации");
		ПараметрыЗаполнения = Новый Структура(ИмяРеквизитаКППОрганизации);
		ЗаполнитьЗначенияСвойств(ПараметрыЗаполнения, Организация);
		
		Если ЗначениеЗаполнено(ПараметрыЗаполнения[ИмяРеквизитаКППОрганизации])
				И ПараметрыЗаполнения[ИмяРеквизитаКППОрганизации] <> КПП Тогда
			КПП = ПараметрыЗаполнения[ИмяРеквизитаКППОрганизации];
		КонецЕсли;
		
		РеквизитыОрганизации = УчетныеЗаписиЭДОСлужебный.РеквизитыОрганизацииДляРегистрационногоПакета(Организация);
		Если Не ЗначениеЗаполнено(АдресОрганизации) Тогда
			АдресОрганизации = РеквизитыОрганизации.АдресОрганизации;
		КонецЕсли;
		Если Не ЗначениеЗаполнено(ЗначениеПолейАдреса) Тогда
			ЗначениеПолейАдреса = РеквизитыОрганизации.ЗначениеПолейАдреса;
		КонецЕсли;
		Если ЗначениеЗаполнено(РеквизитыОрганизации.КодНалоговогоОргана) Тогда
			КодНалоговогоОргана = РеквизитыОрганизации.КодНалоговогоОргана;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СоздатьОрганизацию(ПрограммаКриптографии, Отказ = Ложь)
	
	Если Не ЗначениеЗаполнено(Организация) Тогда
		
		ЕстьПравоДобавлятьОрганизацию = Ложь;
		ИмяСправочникаОрганизации = ОбщегоНазначенияБЭД.ИмяПрикладногоСправочника("Организации");
		Если ИмяСправочникаОрганизации <> Неопределено Тогда
			ЕстьПравоДобавлятьОрганизацию = ПравоДоступа("Добавление", Метаданные.Справочники[ИмяСправочникаОрганизации]);
		КонецЕсли;
		
		Если Не ЕстьПравоДобавлятьОрганизацию Тогда
			ТекстСообщения = НСтр(
			"ru='При подключении данной учетной записи потребуется создание организации.
			|Недостаточно прав для выполнения этой операции.
			|Обратитесь к администратору системы для получения необходимых прав доступа.'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			Отказ = Истина;
			Возврат;
		КонецЕсли;
		
		ДанныеОрганизации = ОбменСКонтрагентамиКлиентСервер.НовыйДанныеОрганизации();
		ДанныеОрганизации.ИНН = ИНН;
		ДанныеОрганизации.КПП = КПП;
		ДанныеОрганизации.ОГРН = ОГРН;
		ДанныеОрганизации.Наименование = НаименованиеОрганизации;
		ДанныеОрганизации.НаименованиеСокращенное = НаименованиеОрганизации;
		ДанныеОрганизации.НаименованиеПолное = НаименованиеОрганизации;
		ДанныеОрганизации.ЮридическийАдрес = ЗначениеПолейАдреса;
		ДанныеОрганизации.ВидОрганизации = Перечисления.ВидУчетнойЗаписиЭДО.ВидОрганизацииПоВидуУчетнойЗаписи(ВидОрганизацииДляПодключения);
		
		ОбменСКонтрагентамиПереопределяемый.СоздатьОрганизациюПоРеквизитам(ДанныеОрганизации, Организация);
		
		ОрганизацияВСертификате = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Сертификат, "Организация");
		Если ЗначениеЗаполнено(Сертификат)
				И Не ЗначениеЗаполнено(ОрганизацияВСертификате) Тогда
			
			ДанныеСертификата = КриптографияБЭД.ДвоичныеДанныеСертификата(Сертификат);
			Сертификат = ИнтеграцияБСПБЭДВызовСервера.НайтиСоздатьСертификатЭП(
				ДанныеСертификата, Организация, ПрограммаКриптографии);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ПереключитьТекущуюСтраницуНаЭтапВыбораВидаОрганизации(Форма)
	
	Форма.Элементы.СтраницаВводДанных.Видимость = Ложь;
	Форма.Элементы.СтраницаДиагностика.Видимость = Ложь;
	Форма.Элементы.СтраницаВыборВидаОрганизации.Видимость = Истина;
	Форма.Элементы.СтраницаРезультатПодключения.Видимость = Ложь;
	
	Форма.Элементы.Страницы.ТекущаяСтраница = Форма.Элементы.СтраницаВыборВидаОрганизации;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ПереключитьТекущуюСтраницуНаЭтапРегистрации(Форма)
	
	Форма.Элементы.СтраницаВводДанных.Видимость = Ложь;
	Форма.Элементы.СтраницаДиагностика.Видимость = Ложь;
	Форма.Элементы.СтраницаРезультатПодключения.Видимость = Истина;
	
	Форма.Элементы.Страницы.ТекущаяСтраница = Форма.Элементы.СтраницаРезультатПодключения;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ПереключитьТекущуюСтраницуНаЭтапВводаДанных(Форма)
	
	Форма.Элементы.СтраницаВводДанных.Видимость = Истина;
	Форма.Элементы.СтраницаДиагностика.Видимость = Ложь;
	Форма.Элементы.СтраницаРезультатПодключения.Видимость = Ложь;
	
	Форма.Элементы.Страницы.ТекущаяСтраница = Форма.Элементы.СтраницаВводДанных;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ПереключитьТекущуюСтраницуНаЭтапДиагностики(Форма)
	
	Форма.ВыполняетсяПроверкаНаличияРасширенияКриптографии = Ложь;
	
	Форма.Элементы.СтраницаВводДанных.Видимость = Ложь;
	Форма.Элементы.СтраницаДиагностика.Видимость= Истина;
	Форма.Элементы.СтраницаРезультатПодключения.Видимость = Ложь;
	
	Форма.Элементы.Страницы.ТекущаяСтраница = Форма.Элементы.СтраницаДиагностика;
	
	УстановитьВидимостьЭлементовДиагностики(Форма);
	УстановитьВидимостьЭлементовФормы(Форма);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОпределитьВидПодключенияПоОрганизации(Организация, ИНН, ВидПодключения)
	
	ТипУчастникаЭДО = ИнтеграцияЭДОПовтИсп.ТипУчастникаЭДО(Организация);
	Если ТипУчастникаЭДО.ЭтоФизЛицо Тогда
		ВидПодключения = ФизическоеЛицо();
	ИначеЕсли ТипУчастникаЭДО.ЭтоЮрЛицо Тогда
		ВидПодключения = ЮридическоеЛицо();
	ИначеЕсли ТипУчастникаЭДО.ЭтоИП Тогда
		ВидПодключения = ИндивидуальныйПредприниматель();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьЗначенияПоУмолчанию(Параметры)
	
	Параметры.Свойство("ИспользоватьЦентрЭДО", ИспользоватьЦентрЭДО);
	Параметры.Свойство("Организация", Организация);
	
	Элементы.ПовторитьДиагностику.Видимость = Ложь;
	
	ПоддержанаРаботаСФизическимиЛицами = ИнтеграцияЭДОВызовСервера.ПоддержанаРаботаСФизическимиЛицами();
	ВидОрганизацииДляПодключения = ЮридическоеЛицо();
	
	УстанавливатьРасширение = ОбщегоНазначения.ЭтоВебКлиент() Или ОбщегоНазначения.ЭтоМобильныйКлиент();
	СоздаватьЭлектронныеПодписиНаСервере = ЭлектроннаяПодпись.СоздаватьЭлектронныеПодписиНаСервере();
	
	СозданиеУчетнойЗаписиИзСуществующейОрганизации = ЗначениеЗаполнено(Организация);
	ВидОрганизацииВыбран = СозданиеУчетнойЗаписиИзСуществующейОрганизации;
	
	Если ЗначениеЗаполнено(Организация) Тогда
		
		СтруктураДанныхОрганизации = ИнтеграцияЭДО.НоваяСтруктураДанныхОрганизации();
		ОбменСКонтрагентамиПереопределяемый.ЗаполнитьРегистрационныеДанныеОрганизации(Организация, СтруктураДанныхОрганизации);
		НаименованиеОрганизации = СтруктураДанныхОрганизации.Наименование;
		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, СтруктураДанныхОрганизации);
		
		ИзвлечьКодНалоговогоОрганаИзИНН(КодНалоговогоОргана, ИНН);
		
		Если СозданиеУчетнойЗаписиИзСуществующейОрганизации Тогда
			ОпределитьВидПодключенияПоОрганизации(Организация, ИНН, ВидОрганизацииДляПодключения);
		КонецЕсли;
		
		СформироватьТекстПодвала(ЭтотОбъект);
		
	КонецЕсли;
	ЗаполнитьДанныеДляРегистрационногоПакета();
	
	ВыполняетсяПроверкаКриптографии = Истина;
	ВидПодключения = ВидыПодключения().Новый;
	ИспользоватьАвтоматическоеПолучениеЭДО = АвтоматическоеПолучениеЭДО.Использовать();
	
	ЗаполнитьПодключенныхОператоровЭДО();
	
	Если ИспользоватьЦентрЭДО Тогда
		ОбщийМодульИнтеграцияЦентраЭДО = ОбщегоНазначения.ОбщийМодуль("ИнтеграцияЦентраЭДО");
		УчетнаяЗаписьЦентраЭДО = ОбщийМодульИнтеграцияЦентраЭДО.ЕдинственнаяУчетнаяЗаписьЦентраЭДО();
		Если Не ЗначениеЗаполнено(УчетнаяЗаписьЦентраЭДО) Тогда
			ТекущийЭлемент = Элементы.УчетнаяЗаписьЦентраЭДО;
		КонецЕсли;
	КонецЕсли;
	
	ТребоватьПриглашенияПередНачаломЭДО =
		УчетныеЗаписиЭДОКлиентСервер.ТребоватьПриглашенияПередНачаломЭДОЗначениеПоУмолчанию();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановкаСостоянияПолученияИдентификатораЭД(
		ОтправкаЗаявления, ОжиданиеОтвета = Неопределено, СозданиеУчетнойЗаписи = Неопределено)
	
	Элементы.ГруппаЗаявлениеВыполнение.Видимость = ОтправкаЗаявления = Ложь;
	Элементы.ГруппаЗаявлениеВыполнено.Видимость = ОтправкаЗаявления = Истина;
	Элементы.ГруппаЗаявлениеОшибка.Видимость = ОтправкаЗаявления = СостоянияПодключения().Ошибка;
	
	УстановитьТекущийЭлементПоВидимостиГрупп(ЭтотОбъект, Элементы.ГруппаЗаявлениеВыполнение, Элементы.СтраницаРезультатПодключения);
	УстановитьТекущийЭлементПоВидимостиГрупп(ЭтотОбъект, Элементы.ГруппаЗаявлениеВыполнено, Элементы.СтраницаРезультатПодключения);
	УстановитьТекущийЭлементПоВидимостиГрупп(ЭтотОбъект, Элементы.ГруппаЗаявлениеОшибка, Элементы.СтраницаРезультатПодключения);
	
	Элементы.ГруппаОжиданияОтветаОжидание.Видимость = ОжиданиеОтвета = Неопределено;
	Элементы.ГруппаОжиданияОтветаВыполнение.Видимость = ОжиданиеОтвета = Ложь;
	Элементы.ГруппаОжиданияОтветаВыполнено.Видимость = ОжиданиеОтвета = Истина;
	Элементы.ГруппаОжиданияОтветаОшибка.Видимость = ОжиданиеОтвета = СостоянияПодключения().Ошибка;
	
	УстановитьТекущийЭлементПоВидимостиГрупп(ЭтотОбъект, Элементы.ГруппаОжиданияОтветаОжидание, Элементы.СтраницаРезультатПодключения);
	УстановитьТекущийЭлементПоВидимостиГрупп(ЭтотОбъект, Элементы.ГруппаОжиданияОтветаВыполнение, Элементы.СтраницаРезультатПодключения);
	УстановитьТекущийЭлементПоВидимостиГрупп(ЭтотОбъект, Элементы.ГруппаОжиданияОтветаВыполнено, Элементы.СтраницаРезультатПодключения);
	УстановитьТекущийЭлементПоВидимостиГрупп(ЭтотОбъект, Элементы.ГруппаОжиданияОтветаОшибка, Элементы.СтраницаРезультатПодключения);
	
	Элементы.ГруппаСозданиеУчетнойЗаписиЭДООжидание.Видимость = СозданиеУчетнойЗаписи = Неопределено;
	Элементы.ГруппаСозданиеУчетнойЗаписиЭДОВыполнение.Видимость = СозданиеУчетнойЗаписи = Ложь;
	Элементы.ГруппаСозданиеУчетнойЗаписиЭДОВыполнено.Видимость = СозданиеУчетнойЗаписи = Истина;
	Элементы.ГруппаСозданиеУчетнойЗаписиЭДООшибка.Видимость = СозданиеУчетнойЗаписи = СостоянияПодключения().Ошибка;
	
	УстановитьТекущийЭлементПоВидимостиГрупп(ЭтотОбъект, Элементы.ГруппаСозданиеУчетнойЗаписиЭДООжидание, Элементы.СтраницаРезультатПодключения);
	УстановитьТекущийЭлементПоВидимостиГрупп(ЭтотОбъект, Элементы.ГруппаСозданиеУчетнойЗаписиЭДОВыполнение, Элементы.СтраницаРезультатПодключения);
	УстановитьТекущийЭлементПоВидимостиГрупп(ЭтотОбъект, Элементы.ГруппаСозданиеУчетнойЗаписиЭДОВыполнено, Элементы.СтраницаРезультатПодключения);
	УстановитьТекущийЭлементПоВидимостиГрупп(ЭтотОбъект, Элементы.ГруппаСозданиеУчетнойЗаписиЭДООшибка, Элементы.СтраницаРезультатПодключения);
	
	Если ОтправкаЗаявления = СостоянияПодключения().Ошибка
		Или ОжиданиеОтвета = СостоянияПодключения().Ошибка
		Или СозданиеУчетнойЗаписи = СостоянияПодключения().Ошибка Тогда
			ВыполняетсяРегистрация = Ложь;
	КонецЕсли;
	
	УстановитьВидимостьЭлементовФормы(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьВидаПодключения(Форма)
	
	Форма.Элементы.ГруппаИдентификаторЭДО.Видимость = Форма.ВидПодключения = ВидыПодключения().Существующий;
	Форма.Элементы.ОператорЭДО.Доступность = Не Форма.Элементы.ГруппаИдентификаторЭДО.Видимость;
	Форма.Элементы.ДекорацияСертификатОтступ.Видимость = Не Форма.Элементы.ГруппаИдентификаторЭДО.Видимость;
	
	Форма.Элементы.ГруппаРаботаБезПриглашений.Видимость = 
		Форма.ОператорПоддерживаетНастройкуТребованияПриглашений И Не Форма.ИспользоватьЦентрЭДО;
		
	Форма.Элементы.ГруппаКодыДокументов.Видимость = Форма.ОператорПоддерживаетНастройкуТребованияПриглашений
		И Не Форма.ИспользоватьЦентрЭДО;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьЭлементовДиагностики(Форма)
	
	Форма.Элементы.ПовторитьДиагностику.Видимость = 
		Форма.Элементы.Страницы.ТекущаяСтраница = Форма.Элементы.СтраницаДиагностика
		И (Форма.ВыполняетсяПроверкаКриптографии
			Или Форма.ПроверкаКриптографииПровалена
			Или Форма.ВыполняетсяПроверкаНаличияСертификатов
			Или Форма.ПроверкаНаличияСертификатовПровалена
			Или Форма.ТребуетсяУстановкаРасширенияКриптографии);
	Форма.Элементы.ПовторитьДиагностику.КнопкаПоУмолчанию = Форма.Элементы.ПовторитьДиагностику.Видимость;
	
	Форма.Элементы.ГруппаПроверкиНаличияРасширения.Видимость = Форма.УстанавливатьРасширение;
	
	Форма.Элементы.ГруппаВыполнениеПроверкиНаличияРасширения.Видимость =
		Форма.ВыполняетсяПроверкаНаличияРасширенияКриптографии;
	УстановитьТекущийЭлементПоВидимостиГрупп(Форма, Форма.Элементы.ГруппаВыполнениеПроверкиНаличияРасширения, Форма.Элементы.СтраницаДиагностика);
	Форма.Элементы.ГруппаРезультатПроверкиРасширенияНеУспешно.Видимость =
		Форма.ТребуетсяУстановкаРасширенияКриптографии
		И Не Форма.ВыполняетсяПроверкаНаличияРасширенияКриптографии;
	УстановитьТекущийЭлементПоВидимостиГрупп(Форма, Форма.Элементы.ГруппаРезультатПроверкиРасширенияНеУспешно, Форма.Элементы.СтраницаДиагностика);
	Форма.Элементы.ГруппаРезультатПроверкиРасширенияУспешно.Видимость =
		Не Форма.ТребуетсяУстановкаРасширенияКриптографии
		И Не Форма.ВыполняетсяПроверкаНаличияРасширенияКриптографии;
	УстановитьТекущийЭлементПоВидимостиГрупп(Форма, Форма.Элементы.ГруппаРезультатПроверкиРасширенияУспешно, Форма.Элементы.СтраницаДиагностика);
	
	Форма.Элементы.ГруппаВыполнениеПроверкиКриптографии.Видимость =
		Форма.ВыполняетсяПроверкаКриптографии;
	УстановитьТекущийЭлементПоВидимостиГрупп(Форма, Форма.Элементы.ГруппаВыполнениеПроверкиКриптографии, Форма.Элементы.СтраницаДиагностика);
	Форма.Элементы.ГруппаРезультатПроверкиКриптографииНеУспешно.Видимость =
		Форма.ПроверкаКриптографииПровалена
		И Не Форма.ВыполняетсяПроверкаКриптографии;
	УстановитьТекущийЭлементПоВидимостиГрупп(Форма, Форма.Элементы.ГруппаРезультатПроверкиКриптографииНеУспешно, Форма.Элементы.СтраницаДиагностика);
	Форма.Элементы.ГруппаРезультатПроверкиКриптографииУспешно.Видимость =
		Не Форма.ПроверкаКриптографииПровалена
		И Не Форма.ВыполняетсяПроверкаКриптографии;
	УстановитьТекущийЭлементПоВидимостиГрупп(Форма, Форма.Элементы.ГруппаРезультатПроверкиКриптографииУспешно, Форма.Элементы.СтраницаДиагностика);
	
	Форма.Элементы.ГруппаВыполнениеПроверкиНаличияСертификатов.Видимость =
		Форма.ВыполняетсяПроверкаНаличияСертификатов
		Или Форма.ВыполняетсяПроверкаКриптографии;
	УстановитьТекущийЭлементПоВидимостиГрупп(Форма, Форма.Элементы.ГруппаВыполнениеПроверкиНаличияСертификатов, Форма.Элементы.СтраницаДиагностика);
	Форма.Элементы.ГруппаРезультатПроверкиНаличияСертификатовНеУспешно.Видимость =
		(Форма.ПроверкаНаличияСертификатовПровалена
			Или Форма.ПроверкаКриптографииПровалена)
		И Не Форма.ВыполняетсяПроверкаНаличияСертификатов
		И Не Форма.ВыполняетсяПроверкаКриптографии;
	УстановитьТекущийЭлементПоВидимостиГрупп(Форма, Форма.Элементы.ГруппаРезультатПроверкиНаличияСертификатовНеУспешно, Форма.Элементы.СтраницаДиагностика);
	Форма.Элементы.ГруппаРезультатПроверкиНаличияСертификатовУспешно.Видимость =
		Не Форма.ПроверкаНаличияСертификатовПровалена
		И Не Форма.ВыполняетсяПроверкаНаличияСертификатов
		И Не Форма.ВыполняетсяПроверкаКриптографии
		И Не Форма.ПроверкаКриптографииПровалена;
	УстановитьТекущийЭлементПоВидимостиГрупп(Форма, Форма.Элементы.ГруппаРезультатПроверкиНаличияСертификатовУспешно, Форма.Элементы.СтраницаДиагностика);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьОтображениеЗарегистрироватьЭДОКартинкаИТекст(Форма)
	
	Форма.Элементы.ЗарегистрироватьЭДО.Отображение = ОтображениеКнопки.КартинкаИТекст;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьОтображениеЗарегистрироватьЭДОТекст(Форма)
	
	Форма.Элементы.ЗарегистрироватьЭДО.Отображение = ОтображениеКнопки.Текст;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьЭлементовФормы(Форма)
	
	Форма.Элементы.ГруппаСостояниеВыполнения.Видимость = Не Форма.РегистрацияВыполнена;
	Форма.Элементы.ГруппаШапкаИнформации.Видимость = Форма.РегистрацияВыполнена;
	
	Если ЗначениеЗаполнено(Форма.ИдентификаторОператораЭДО) Тогда
		Форма.ПредставлениеОператораЭДО =
			Форма.Элементы.ОператорЭДО.СписокВыбора.НайтиПоЗначению(Форма.ИдентификаторОператораЭДО).Представление;
	КонецЕсли;
	
	Форма.Элементы.ГруппаЗаголовокКПП.Видимость = Форма.ВидОрганизацииДляПодключения = ЮридическоеЛицо()
		И Не Форма.СозданиеУчетнойЗаписиИзСуществующейОрганизации;
	Форма.Элементы.ГруппаКодНалоговогоОргана.Видимость = Не ПоддержанаРегистрацияЧерезФормат_5_03(Форма);
	Форма.Элементы.ГруппаАдресОрганизации.Видимость = Не ПоддержанаРегистрацияЧерезФормат_5_03(Форма);
	
	ДляЮрЛицаВыбранСертификатНеЮрЛица = Форма.ВидОрганизацииДляПодключения = ЮридическоеЛицо()
		И (Форма.ВыбранСертификатФизЛица
			Или Форма.ВыбранСертификатИП);
	ДляИпВыбранСертификатНеИп = Форма.ВидОрганизацииДляПодключения = ИндивидуальныйПредприниматель()
		И Не Форма.ВыбранСертификатИП;
	
	Форма.Элементы.ГруппаЗаголовокИНН.Видимость =
		Не Форма.СозданиеУчетнойЗаписиИзСуществующейОрганизации
		И Форма.ИдентификаторОператораЭДО = СервисНастроекЭДОКлиентСервер.ИдентификаторТакскома()
		И (ДляЮрЛицаВыбранСертификатНеЮрЛица
			Или ДляИпВыбранСертификатНеИп);
	
	Форма.Элементы.ГруппаЗаголовокОГРН.Видимость = Форма.Элементы.ГруппаЗаголовокИНН.Видимость;
	Форма.Элементы.ГруппаЗаголовокНаименование.Видимость = Форма.Элементы.ГруппаЗаголовокИНН.Видимость;
	Форма.Элементы.ДекорацияЗаголовокОГРН.Заголовок = ?(Форма.ВидОрганизацииДляПодключения = ЮридическоеЛицо(), "ОГРН:","ОГРНИП:");
	
	Форма.Элементы.ГруппаЗаголовокДоверенность.Видимость = Не Форма.ВидОрганизацииДляПодключения = ФизическоеЛицо()
		И Не Форма.ИдентификаторОператораЭДО = СервисНастроекЭДОКлиентСервер.ИдентификаторТакскома();
	Форма.Элементы.Доверенность.АвтоОтметкаНезаполненного = Форма.ДоверенностьОбязательна;
	Если Форма.СозданиеУчетнойЗаписиИзСуществующейОрганизации Тогда
		Форма.Элементы.ГруппаЗаголовокДоверенность.Видимость = Форма.ДоверенностьОбязательна;
	КонецЕсли;
	
	Форма.Элементы.ЗарегистрироватьЭДО.Видимость =
		Форма.Элементы.Страницы.ТекущаяСтраница = Форма.Элементы.СтраницаВводДанных
		И Не Форма.РегистрацияВыполнена
		И Не Форма.Элементы.Страницы.ТекущаяСтраница = Форма.Элементы.СтраницаВыборВидаОрганизации;
	Форма.Элементы.ЗарегистрироватьЭДО.КнопкаПоУмолчанию = Форма.Элементы.ЗарегистрироватьЭДО.Видимость;
	
	Форма.Элементы.Далее.Видимость =
		Форма.Элементы.Страницы.ТекущаяСтраница = Форма.Элементы.СтраницаВыборВидаОрганизации;
	Форма.Элементы.Далее.КнопкаПоУмолчанию = Форма.Элементы.Далее.Видимость;
	
	Форма.Элементы.Назад.Видимость =
		Не Форма.ВыполняетсяРегистрация
		И Не Форма.РегистрацияВыполнена
		И Не Форма.Элементы.Страницы.ТекущаяСтраница = Форма.Элементы.СтраницаДиагностика
		И Не Форма.Элементы.Страницы.ТекущаяСтраница = Форма.Элементы.СтраницаВыборВидаОрганизации;
	
	Если Форма.Элементы.Страницы.ТекущаяСтраница = Форма.Элементы.СтраницаВводДанных
			И Форма.Элементы.Назад.Видимость Тогда
		Форма.Элементы.Назад.Видимость = Не Форма.СозданиеУчетнойЗаписиИзСуществующейОрганизации
			И Форма.ПоддержанаРаботаСФизическимиЛицами
	КонецЕсли;
	
	Форма.Элементы.Закрыть.Видимость =
		Форма.Элементы.Страницы.ТекущаяСтраница = Форма.Элементы.СтраницаРезультатПодключения
		И Форма.РегистрацияВыполнена;
	Форма.Элементы.Закрыть.КнопкаПоУмолчанию = Форма.Элементы.Закрыть.Видимость;
	
	Форма.Элементы.ГруппаУсловияИспользования.Видимость =
		Форма.Элементы.Страницы.ТекущаяСтраница = Форма.Элементы.СтраницаВводДанных;
	
	Форма.Элементы.ГруппаПодвалИнформации.Видимость =
		Форма.Элементы.Страницы.ТекущаяСтраница = Форма.Элементы.СтраницаВводДанных
		Или Форма.Элементы.Страницы.ТекущаяСтраница = Форма.Элементы.СтраницаРезультатПодключения;
	
	Форма.Элементы.ГруппаЗаголовокУчетнаяЗаписьЦентраЭДО.Видимость = Форма.ИспользоватьЦентрЭДО;
	
	Форма.Элементы.ГруппаРаботаБезПриглашений.Видимость = 
		Форма.ОператорПоддерживаетНастройкуТребованияПриглашений И Не Форма.ИспользоватьЦентрЭДО;
		
	Форма.Элементы.ГруппаКодыДокументов.Видимость = 
		Форма.ОператорПоддерживаетНастройкуТребованияПриглашений И Не Форма.ИспользоватьЦентрЭДО;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьТекущийЭлементПоВидимостиГрупп(Форма, Группа, ТекущаяСтраница)
	
	Если Форма.Элементы.Страницы.ТекущаяСтраница = ТекущаяСтраница
		И Группа.Видимость Тогда
		Форма.ТекущийЭлемент = Группа;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ОткрытьФормуОжидания(ТекстСообщенияОжидания, МетодОбработкиРезультата)
	
	ПараметрыОжиданияБЭД = ОжиданиеОперацийБЭДКлиент.НовыеПараметры();
	ПараметрыОжиданияБЭД.ТекстСообщения = ТекстСообщенияОжидания;
	
	КонтекстОжиданияОперации = ОжиданиеОперацийБЭДКлиент.НовыйКонтекст(ПараметрыОжиданияБЭД);
	ОжиданиеОперацийБЭДКлиент.ОткрытьФормуОжидания(ЭтотОбъект, КонтекстОжиданияОперации);
	
	ОписаниеОповещения = Новый ОписаниеОповещения(МетодОбработкиРезультата, ЭтотОбъект, КонтекстОжиданияОперации);
	
	Возврат ОписаниеОповещения;
	
КонецФункции

&НаКлиенте
Процедура ЗапуститьОжиданиеВыполненияДлительнойОперации(Оповещение, ДлительнаяОперация, ТекстСообщенияОжидания)
	
	Если ДлительнаяОперация = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, Оповещение, ПараметрыОжидания);
	
КонецПроцедуры

&НаСервере
Процедура СведенияПоРуководителю()
	
	Руководитель = "";
	СвойстваСубъекта = КриптографияБЭД.СвойстваСубъектаСертификатаПоСсылке(Сертификат);
	
	Если Не СозданиеУчетнойЗаписиИзСуществующейОрганизации Тогда
		Если ВидОрганизацииДляПодключения = ЮридическоеЛицо()
				И (ВыбранСертификатФизЛица
					Или ВыбранСертификатИП) Тогда
			Возврат;
		КонецЕсли;
		Если ВидОрганизацииДляПодключения = ИндивидуальныйПредприниматель()
				И Не ВыбранСертификатИП Тогда
			Возврат;
		КонецЕсли;
		Если ВидОрганизацииДляПодключения = ФизическоеЛицо()
				И Не ВыбранСертификатФизЛица Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Если (СозданиеУчетнойЗаписиИзСуществующейОрганизации
				Или ЗначениеЗаполнено(Доверенность))
			И ЗначениеЗаполнено(ИНН)
			И Не (СвойстваСубъекта.ИНН = ИНН
					Или СвойстваСубъекта.ИННЮЛ = ИНН) Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеОрганизации = ИнтеграцияЭДО.РегистрационныеДанныеОрганизации(Организация);
	Если ЗначениеЗаполнено(ДанныеОрганизации.Фамилия)
			И ЗначениеЗаполнено(ДанныеОрганизации.Имя) Тогда
		Руководитель = СтрШаблон("%1 %2",
			ДанныеОрганизации.Фамилия,
			ДанныеОрганизации.Имя);
	ИначеЕсли ВыбранСертификатФизЛица Тогда
		Руководитель = СтрШаблон("%1 %2",
			СвойстваСубъекта.Фамилия,
			СвойстваСубъекта.Имя);
	Иначе
		ЗначенияРеквизитов = ИнтеграцияБСПБЭД.ЗначенияРеквизитовСертификатаПоФамилииИмениДолжности(Сертификат);
		Если ЗначениеЗаполнено(ЗначенияРеквизитов.Должность) Тогда
			Руководитель = СтрШаблон("%1 %2, %3",
				ЗначенияРеквизитов.Фамилия,
				ЗначенияРеквизитов.Имя,
				ЗначенияРеквизитов.Должность);
		Иначе
			Руководитель = СтрШаблон("%1 %2",
				ЗначенияРеквизитов.Фамилия,
				ЗначенияРеквизитов.Имя);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция СостоянияПодключения()
	
	СостоянияПодключения = Новый Структура();
	СостоянияПодключения.Вставить("Выполнено", "Выполнено");
	СостоянияПодключения.Вставить("Завершить", "Завершить");
	СостоянияПодключения.Вставить("Ошибка", "Ошибка");
	
	Возврат СостоянияПодключения;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ВидыПодключения()
	
	ВидыПодключения = Новый Структура();
	ВидыПодключения.Вставить("Новый", "Новый");
	ВидыПодключения.Вставить("Существующий", "Существующий");
	
	Возврат ВидыПодключения;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ФизическоеЛицо()
	
	Возврат ПредопределенноеЗначение("Перечисление.ВидУчетнойЗаписиЭДО.ФизическоеЛицо");
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ИндивидуальныйПредприниматель()
	
	Возврат ПредопределенноеЗначение("Перечисление.ВидУчетнойЗаписиЭДО.ИндивидуальныйПредприниматель");
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ЮридическоеЛицо()
	
	Возврат ПредопределенноеЗначение("Перечисление.ВидУчетнойЗаписиЭДО.ЮридическоеЛицо");
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ТекстОжиданияПоискаИдентификаторов()
	
	Возврат НСтр("ru='Выполняется получение идентификаторов ЭДО.'");
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ТекстОжиданияПоискаСведенийПоОрганизации()
	
	Возврат НСтр("ru='Выполняется получение сведений по организации.'");
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ТекстОжиданияПоискаИдентификаторовИСведенийПоОрганизации()
	
	Возврат НСтр("ru='Выполняется получение идентификаторов ЭДО и сведений по организации.'");
	
КонецФункции

&НаКлиенте
Асинх Процедура ПоказатьСписокВыбораИдентификаторов()
	
	Если Элементы.ИдентификаторЭДО.СписокВыбора.Количество() > 1
		И ВидПодключения = ВидыПодключения().Существующий Тогда
		Элементы.ИдентификаторЭДО.КнопкаВыпадающегоСписка = Истина;
		
		ТекущийЭлемент = Элементы.ИдентификаторЭДО;
		Обещание = ВыбратьИзСпискаАсинх(Элементы.ИдентификаторЭДО.СписокВыбора);
		Результат = Ждать Обещание;
		Если Результат <> Неопределено Тогда
			ИдентификаторЭДО = Результат.Значение;
			ПолучитьСпособОбменаПоИдентификатору();
			ПроверитьНеобходимостьДоверенности();
			УстановитьВидимостьЭлементовФормы(ЭтотОбъект);
		КонецЕсли;
	Иначе
		Элементы.ИдентификаторЭДО.КнопкаВыпадающегоСписка = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПоискИдентификаторовОрганизации()
	
	Если ВидПодключения = ВидыПодключения().Существующий
			И ЗначениеЗаполнено(ИНН)
			И НеобходимПоискИдентификаторов Тогда
		ЗапуститьОбновлениеКешОператоровИФорматов();
		ЗапуститьОжиданиеОбновленияКешОператоровИФорматов(ТекстОжиданияПоискаИдентификаторов());
	Иначе
		ПоказатьСписокВыбораИдентификаторов();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораОтпечаткаСертификата()
	
	СертификатНаСервере = СписокСертификатов.НайтиСтроки(Новый Структура("Отпечаток", ОтпечатокСертификата))[0].НаСервере;
	
	Если ЗначениеЗаполнено(ОтпечатокСертификата) Тогда
		
		ПараметрыОжиданияБЭД = ОжиданиеОперацийБЭДКлиент.НовыеПараметры();
		ПараметрыОжиданияБЭД.ТекстСообщения = НСтр("ru = 'Идет загрузка сведений о выбранном сертификате.
		|Пожалуйста, подождите…'");
		
		КонтекстОжиданияОперации = ОжиданиеОперацийБЭДКлиент.НовыйКонтекст(ПараметрыОжиданияБЭД);
		ОжиданиеОперацийБЭДКлиент.ОткрытьФормуОжидания(ЭтотОбъект, КонтекстОжиданияОперации);
		
		Если Не СертификатНаСервере Тогда
			ОписаниеОповещения = Новый ОписаниеОповещения("СертификатПриИзмененииПослеПолученияСертификата", ЭтотОбъект, КонтекстОжиданияОперации);
			ЭлектроннаяПодписьКлиент.ПолучитьСертификатПоОтпечатку(ОписаниеОповещения, ОтпечатокСертификата, Ложь);
		Иначе
			ПолучитьСертификатНаСервере();
			ПослеПоискаСертификата(Сертификат, КонтекстОжиданияОперации);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьТребованиеПриглашенияПоДаннымАбонента()
	
	Если Не ОператорПоддерживаетНастройкуТребованияПриглашений Или ИспользоватьЦентрЭДО Тогда
		Возврат;
	КонецЕсли;
	
	Если ВидПодключения = ВидыПодключения().Новый Тогда
		ТребоватьПриглашенияПередНачаломЭДО =
			УчетныеЗаписиЭДОКлиентСервер.ТребоватьПриглашенияПередНачаломЭДОЗначениеПоУмолчанию();
		Возврат;
	КонецЕсли;
	
	Если АбонентыИТребованияПриглашений = Неопределено Тогда
		ТребоватьПриглашенияПередНачаломЭДО = 
			Не РаботаСАбонентамиЭДОВызовСервера.АбонентНеТребуетПриглашений(ИдентификаторЭДО);
		Возврат;
	КонецЕсли;
	
	Если АбонентыИТребованияПриглашений.Получить(ИдентификаторЭДО) = Неопределено Тогда
		ТребоватьПриглашенияПередНачаломЭДО = 
			Не РаботаСАбонентамиЭДОВызовСервера.АбонентНеТребуетПриглашений(ИдентификаторЭДО);
		Возврат;
	КонецЕсли;
	
	ТребоватьПриглашенияПередНачаломЭДО = Не АбонентыИТребованияПриглашений[ИдентификаторЭДО];
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПредставлениеПоддерживаемыхТиповДокументов()
	
	МассивНаименований = Новый Массив;
	
	Для Каждого СтрокаКода Из КодыТиповДокументов Цикл
		
		Если СтрокаКода.Используется Тогда
			МассивНаименований.Добавить(СтрокаКода.Наименование);
		КонецЕсли;
		
	КонецЦикла;
	
	ТипыДокументовВыбраны = Не МассивНаименований.Количество() = 0;
	НаименованиеТиповДокументов = ?(ТипыДокументовВыбраны, СтрСоединить(МассивНаименований, ", "),
		НСтр("ru = 'Не выбраны'"));
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВыборТиповДокументов(ЗначенияЭлементов, ДополнительныеПараметры) Экспорт

	Если ЗначенияЭлементов = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого СтрокаКода Из КодыТиповДокументов Цикл
		СтрокаКода.Используется = ЗначенияЭлементов.НайтиПоЗначению(СтрокаКода.Код).Пометка;
	КонецЦикла;
	
	ЗаполнитьПредставлениеПоддерживаемыхТиповДокументов();
	
КонецПроцедуры

#КонецОбласти

//@skip-check module-structure-top-region
#Область Инициализация

НеобходимПоискИдентификаторов = Истина;
РучноеОбновлениеСертификатов = Ложь;

#КонецОбласти
