///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2026, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// Подсистема "ИнтернетПоддержкаПользователей.СистемаБыстрыхПлатежей.БазоваяФункциональностьСБП".
// ОбщийМодуль.СистемаБыстрыхПлатежейКлиентСобытия.
//
// Клиентские процедуры  обработки событий подсистемы Система быстрых платежей:
//  - обработка событий настройки кассовых ссылок.
//
////////////////////////////////////////////////////////////////////////////////


#Область СлужебныйПрограммныйИнтерфейс

// Вызывает открытие формы кассовых ссылок из формы настройки подключения СБП.
//
// Параметры:
//  ВариантНастройки - ПеречислениеСсылка.ВариантыНастройкиСБП - вариант настройки
//   подключения к Системе быстрых платежей.
//  ПараметрыНастройки - Структура - содержит в себе описание настроек подключения:
//    * НастройкаПодключения - СправочникСсылка.НастройкиПодключенияКСистемеБыстрыхПлатежей -
//      настройка подключения к Системе быстрых платежей.
//  ОповещениеПослеЗакрытияФормыКассовыхСсылок - ОписаниеОповещения - оповещение,вызывает метод "ПриЗакрытииФормыКассовыхСсылок",
//    необходимо передать количество кассовых ссылок по настройке интеграции.
//
Процедура ПриНастройкеКассовыхСсылок(
		ВариантНастройки,
		ПараметрыНастройки,
		ОповещениеПослеЗакрытияФормыКассовыхСсылок) Экспорт
		
	Если Не ЗначениеЗаполнено(ВариантНастройки) Тогда
		ВариантНастройки = СистемаБыстрыхПлатежейВызовСервера.ВариантНастройки(
			ПараметрыНастройки.НастройкаПодключения);
	КонецЕсли;
	
	ПараметрыОплаты = СистемаБыстрыхПлатежейВызовСервера.ПараметрыОплатыПоНастройке(
		ВариантНастройки,
		ПараметрыНастройки.НастройкаПодключения);
	
	Если ВариантНастройки = ПредопределенноеЗначение("Перечисление.ВариантыНастройкиСБП.c2b") Тогда
		
		МодульПереводыСБПc2bКлиентПереопределяемый =
			ОбщегоНазначенияКлиент.ОбщийМодуль("ПереводыСБПc2bКлиентПереопределяемый");
		
		ИнтеграцияПодсистемБИПКлиент.ПриНастройкеКассовыхСсылок(
			ПараметрыНастройки,
			ПараметрыОплаты,
			ОповещениеПослеЗакрытияФормыКассовыхСсылок);
		
		МодульПереводыСБПc2bКлиентПереопределяемый.ПриНастройкеКассовыхСсылок(
			ПараметрыНастройки,
			ПараметрыОплаты,
			ОповещениеПослеЗакрытияФормыКассовыхСсылок);
		
	ИначеЕсли ВариантНастройки = ПредопределенноеЗначение("Перечисление.ВариантыНастройкиСБП.c2g") Тогда
		
		МодульПереводыСБПc2gКлиентПереопределяемый =
			ОбщегоНазначенияКлиент.ОбщийМодуль("ПереводыСБПc2gКлиентПереопределяемый");
		
		ИнтеграцияПодсистемБИПКлиент.ПриНастройкеКассовыхСсылокc2g(
			ПараметрыНастройки,
			ПараметрыОплаты,
			ОповещениеПослеЗакрытияФормыКассовыхСсылок);
		
		МодульПереводыСБПc2gКлиентПереопределяемый.ПриНастройкеКассовыхСсылок(
			ПараметрыНастройки,
			ПараметрыОплаты,
			ОповещениеПослеЗакрытияФормыКассовыхСсылок);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

