///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2026, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// Подсистема "ИнтернетПоддержкаПользователей.СистемаБыстрыхПлатежей.ПереводыСБПc2b.
// ОбщийМодуль.ПереводыСБПc2bКлиентСервер.
//
// Клиент-серверные процедуры общих настроек и статических идентификаторов:
//  - преобразование функциональных ссылок.
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

#Область УстаревшиеПроцедурыИФункции

// Устарела. Следует использовать СистемаБыстрыхПлатежейКлиентСервер.СтруктураURLФункциональнойСсылки.
// Определяет валидность URL переданной кассовой ссылки.
//
// Параметры:
//  КассоваяСсылка - Строка - URL кассовой ссылки.
//  ПроверкаПутиНаСервере - Булево - признак проверки заполненности пути в переданном URL.
//
// Возвращаемое значение:
//  Структура - Содержит результат проверки:
//    *URLВалиден - Булево - если Истина, URL валиден.
//    *СтруктураURI - Структура, Неопределено - составные части URL в виде структуры.
//
Функция ПроверкаURLКассовойСсылки(Знач КассоваяСсылка, Знач ПроверкаПутиНаСервере) Экспорт
	
	РезультатПроверки = Новый Структура;
	РезультатПроверки.Вставить("URLВалиден", Истина);
	РезультатПроверки.Вставить("СтруктураURI", Неопределено);
	
	СтруктураURI = ОбщегоНазначенияКлиентСервер.СтруктураURI(
		КассоваяСсылка);
	
	Если СтруктураURI.Схема <> "https"
		Или (СтруктураURI.Порт <> Неопределено И СтруктураURI.Порт <> 443)
		Или (ПроверкаПутиНаСервере И ПустаяСтрока(СтруктураURI.ПутьНаСервере)) Тогда
		РезультатПроверки.URLВалиден = Ложь;
	КонецЕсли;
	
	РезультатПроверки.СтруктураURI = СтруктураURI;
	
	Возврат РезультатПроверки;
	
КонецФункции

// Устарела. Следует использовать СистемаБыстрыхПлатежейКлиентСервер.ФункциональнаяСсылкаNFC.
// Формирует URL функциональной ссылки СБП для записи на NFC.
//
// Параметры:
//  ФункциональнаяСсылка - Строка - URL кассовой ссылки или платежной ссылки СБП.
//
// Возвращаемое значение:
//  Строка - функциональная ссылка СБП для записи на NFC.
//
Функция ФункциональнаяСсылкаNFC(ФункциональнаяСсылка) Экспорт
	
	Возврат СистемаБыстрыхПлатежейКлиентСервер.ФункциональнаяСсылкаNFC(ФункциональнаяСсылка);
	
КонецФункции

#КонецОбласти

#КонецОбласти
