
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	НепроверяемыеРеквизиты = Новый Массив;
	
	Если Тип = Перечисления.ТипыТСПИоТ.Внутренний1С Тогда
		
		НепроверяемыеРеквизиты.Добавить("Сервер");
		НепроверяемыеРеквизиты.Добавить("Порт");
		НепроверяемыеРеквизиты.Добавить("Таймаут");
		
	ИначеЕсли Тип = Перечисления.ТипыТСПИоТ.Внешний Тогда
		
		НепроверяемыеРеквизиты.Добавить("ПутьКДрайверу");
		НепроверяемыеРеквизиты.Добавить("ПутьДанныхЭкземпляра");
		
	КонецЕсли;
	
	ОбщегоНазначенияБПО.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, НепроверяемыеРеквизиты);
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(ИдентификаторЭкземпляра) Тогда
		ИдентификаторЭкземпляра = Строка(Новый УникальныйИдентификатор());
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ЭтотОбъект.Тип = Перечисления.ТипыТСПИоТ.Внутренний1С И Не ЭтотОбъект.ПометкаУдаления Тогда
		Константы.СуществуетВнутреннийТСПИоТ.Установить(Истина);
		МенеджерОборудованияТСПИоТПереопределяемый.СоздатьПолитикуПаролейТСПИоТ();
	ИначеЕсли ЭтотОбъект.Тип = Перечисления.ТипыТСПИоТ.Внутренний1С И ЭтотОбъект.ПометкаУдаления 
		И Не МенеджерОборудованияТСПИОТ.СуществуетВнутреннийТСПИоТ() Тогда
		Константы.СуществуетВнутреннийТСПИоТ.Установить(Ложь);
	КонецЕсли;
	
КонецПроцедуры;

#КонецОбласти

#КонецЕсли
