#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановленныеСвязи = Новый Массив;
	ОжидающиеСвязи = Новый Массив;
	ИдентификаторОператораЭДО = "";
	СтатусПринято = 3;
	СтатусОжидаемСогласия = 2;
	
	Если ЗначениеЗаполнено(Параметры.ИдентификаторыКонтрагента) Тогда
	
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(СписокАбонентов, "ИдентификаторЭДО",
			Параметры.ИдентификаторыКонтрагента,,, Истина);

		Если ЗначениеЗаполнено(Параметры.Контрагент) И ЗначениеЗаполнено(Параметры.ИдентификаторОрганизации) Тогда
	
			ПараметрыПолучения = РаботаСАбонентамиЭДО.НовыеПараметрыПолученияСвязиИдентификаторов();
			ЗаполнитьЗначенияСвойств(ПараметрыПолучения, Параметры, "Контрагент");
			ПараметрыПолучения.ИдентификаторыОрганизации = Параметры.ИдентификаторОрганизации;
			ПараметрыПолучения.ИдентификаторыКонтрагента =  Параметры.ИдентификаторыКонтрагента.ВыгрузитьЗначения();
			ПараметрыПолучения.ФормироватьСписокВыбора = Ложь;
	
			ПараметрыСвязи = РаботаСАбонентамиЭДОСлужебный.ПараметрыСвязиИдентификаторов(ПараметрыПолучения);
			
			Для Каждого ПараметрСвязи Из ПараметрыСвязи Цикл
				
				Если ПараметрСвязи.СтатусПодключения = СтатусПринято Тогда
					УстановленныеСвязи.Добавить(ПараметрСвязи.ИдентификаторКонтрагента);
				ИначеЕсли ПараметрСвязи.СтатусПодключения = СтатусОжидаемСогласия Тогда
					ОжидающиеСвязи.Добавить(ПараметрСвязи.ИдентификаторКонтрагента);
				Иначе
					Продолжить;
				КонецЕсли;
				
			КонецЦикла;
		
		КонецЕсли;
	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Параметры.ИдентификаторОрганизации) Тогда
		ИдентификаторОператораЭДО = 
			УчетныеЗаписиЭДОКлиентСервер.ИдентификаторОператора(Параметры.ИдентификаторОрганизации);
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(СписокАбонентов, "МассивУстановленных", 
		УстановленныеСвязи);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(СписокАбонентов, "МассивОжидающих", 
		ОжидающиеСвязи);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(СписокАбонентов, "Требуются", 
		НСтр("ru='Требуются'"));
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(СписокАбонентов, "НеТребуются", 
		НСтр("ru='Не требуются'"));
	
	ОператорПоддерживаетНастройкуТребованияПриглашений =
		СервисНастроекЭДОПовтИсп.ОператорПоддерживаетВерсиюФорматаРегистрации(ИдентификаторОператораЭДО, "5.04");
		
	Элементы.СписокАбонентовПриглашения.Видимость = ОператорПоддерживаетНастройкуТребованияПриглашений;
	Элементы.СписокАбонентовТипыДокументов.Видимость = ОператорПоддерживаетНастройкуТребованияПриглашений;
	
	ОбщегоНазначенияБЭД.СброситьРазмерыИПоложениеОкна(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокАбонентов

&НаСервереБезКонтекста
Процедура СписокАбонентовПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	
	// Получим описание кодов типов документов
	МассивНаименований = Новый Массив;
	ТаблицаТиповДокументов = РегистрыСведений.ОператорыЭДО.КодыПоддерживаемыхТиповДокументов();
	
	Для Каждого СтрокаСписка Из Строки Цикл
		
		СтрокаКодов = СтрокаСписка.Значение.Данные.КодыТиповДокументовКОбмену;
		
		Если Не ЗначениеЗаполнено(СтрокаКодов) Тогда
			СтрокаСписка.Значение.Данные.КодыТиповДокументовКОбмену = НСтр("ru = 'Все'");
			Продолжить;
		КонецЕсли;
		
		МассивНаименований.Очистить();
		
		// Прочитаем коды типов документов, которые поддерживает контрагент
		КодыТипов = ОбщегоНазначения.JSONВЗначение(СтрокаКодов);
		
		// Переведем коды типов документов в их названия, для вывода пользователю
		Для Каждого КодТипа Из КодыТипов Цикл
			
			НайденнаяСтрока = ТаблицаТиповДокументов.Найти(КодТипа, "Код");
			Если НайденнаяСтрока <> Неопределено Тогда
				МассивНаименований.Добавить(НайденнаяСтрока.Наименование);
			КонецЕсли;
			
		КонецЦикла;
		
		СтрокаСписка.Значение.Данные.ТипыДокументов = СтрСоединить(МассивНаименований, ", ");
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокАбонентовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ПередатьВыбранноеЗначение();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Выбрать(Команда)
	
	ПередатьВыбранноеЗначение();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПередатьВыбранноеЗначение()
	
	ТекущиеДанные = Элементы.СписокАбонентов.ТекущиеДанные;
	Идентификатор = ?(ТекущиеДанные = Неопределено, "", ТекущиеДанные.ИдентификаторЭДО);
	
	Закрыть(Идентификатор);
	
КонецПроцедуры

#КонецОбласти
