// @strict-types

#Область СлужебныйПрограммныйИнтерфейс

// Возвращаемое значение:
//  Структура - Информация об учетной записи:
// * ИдентификаторЭДО - Строка
// * Наименование - Строка
// * Назначение - Строка
// * ПодробноеОписание - Строка
Функция НовыйИнформацияОбУчетнойЗаписи() Экспорт
	Результат = Новый Структура;
	Результат.Вставить("ИдентификаторЭДО", "");
	Результат.Вставить("Наименование", "");
	Результат.Вставить("Назначение", "");
	Результат.Вставить("ПодробноеОписание", "");
	Возврат Результат; 
КонецФункции

// Возвращаемое значение:
//  Структура:
//  * УчетнаяЗаписьЦентраЭДО - Неопределено,СправочникСсылка.УчетныеЗаписиЦентровЭДО
//  * Организация - Неопределено,ОпределяемыйТип.Организация
//  * НаименованиеОрганизации - Строка - если не заполнено, данные по Наименованию, ИНН, КПП и ОГРН будут взяты из справочника Организации.
//  * ИННОрганизации - Строка
//  * КППОрганизации - Строка
//  * ОГРНОрганизации - Строка
//  * ИдентификаторОрганизации - Строка
//  * ОператорЭДО - Строка
//  * АдресОрганизации - Строка
//  * АдресОрганизацииЗначение - Строка
//  * КодНалоговогоОргана - Строка
//  * ЭлектроннаяПочта - Строка
//  * СертификатыДляПодписания - Массив из СправочникСсылка.СертификатыКлючейЭлектроннойПодписиИШифрования
//  * СертификатыДляРегистрации - Массив из СправочникСсылка.СертификатыКлючейЭлектроннойПодписиИШифрования
//  * Доверенности - Соответствие из КлючИЗначение:
//  ** Ключ - СправочникСсылка.СертификатыКлючейЭлектроннойПодписиИШифрования
//  ** Значение - СправочникСсылка.МашиночитаемыеДоверенностиОрганизаций
//  * Должности - Соответствие из КлючИЗначение:
//  ** Ключ - СправочникСсылка.СертификатыКлючейЭлектроннойПодписиИШифрования
//  ** Значение - Строка
//  * Назначение - Строка
//  * ПодробноеОписание - Строка
//  * ДатаПолученияДокументов - Число
//  * РежимПереходаВЦентрЭДО - Булево
//  * ВидУчетнойЗаписи - ПеречислениеСсылка.ВидУчетнойЗаписиЭДО
Функция НовыеПараметрыРегистрацииСертификатовВЭДО() Экспорт
	ПараметрыРегистрации = Новый Структура;
	ПараметрыРегистрации.Вставить("УчетнаяЗаписьЦентраЭДО", Неопределено);
	ПараметрыРегистрации.Вставить("Организация", Неопределено);
	ПараметрыРегистрации.Вставить("НаименованиеОрганизации", "");
	ПараметрыРегистрации.Вставить("ИННОрганизации", "");
	ПараметрыРегистрации.Вставить("КППОрганизации", "");
	ПараметрыРегистрации.Вставить("ОГРНОрганизации", "");
	ПараметрыРегистрации.Вставить("ИдентификаторОрганизации", "");
	ПараметрыРегистрации.Вставить("ОператорЭДО", "");
	ПараметрыРегистрации.Вставить("АдресОрганизации", "");
	ПараметрыРегистрации.Вставить("АдресОрганизацииЗначение", "");
	ПараметрыРегистрации.Вставить("КодНалоговогоОргана", "");
	ПараметрыРегистрации.Вставить("ЭлектроннаяПочта", "");
	ПараметрыРегистрации.Вставить("СертификатыДляПодписания", Новый Массив);
	ПараметрыРегистрации.Вставить("СертификатыДляРегистрации", Новый Массив);
	ПараметрыРегистрации.Вставить("Доверенности", Новый Соответствие);
	ПараметрыРегистрации.Вставить("Должности", Новый Соответствие);
	ПараметрыРегистрации.Вставить("Назначение", "");
	ПараметрыРегистрации.Вставить("ПодробноеОписание", "");
	ПараметрыРегистрации.Вставить("ДатаПолученияДокументов", 0);
	ПараметрыРегистрации.Вставить("РежимПереходаВЦентрЭДО", Ложь);
	ПараметрыРегистрации.Вставить("ВидУчетнойЗаписи", ПредопределенноеЗначение("Перечисление.ВидУчетнойЗаписиЭДО.ПустаяСсылка"));
	Возврат ПараметрыРегистрации;
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ПереходВЦентрЭДО

// Возвращаемое значение:
//  Строка
Функция ВидОперацииПереходВЦентрЭДО() Экспорт
	
	Возврат НСтр("ru = 'Переход в центр ЭДО'");
	
КонецФункции

#КонецОбласти

#КонецОбласти