#Область СлужебныйПрограммныйИнтерфейс

#Область ФормаПроверкиИПодбора

Процедура ПередОткрытиемФормыПроверкиПодбора(Форма, ПараметрыОткрытияФормыПроверки, ПараметрыФормы, Отказ) Экспорт
	
	Если ШтрихкодированиеИСКлиентСервер.ЭтоКонтекстОбъекта(Форма, "Документ.АктПостановкиНаБалансЕГАИС")
		Или ШтрихкодированиеИСКлиентСервер.ЭтоКонтекстОбъекта(Форма, "Документ.АктСписанияЕГАИС")
		Или ШтрихкодированиеИСКлиентСервер.ЭтоКонтекстОбъекта(Форма, "Документ.ОтчетОбИмпортеЕГАИС")
		Или ШтрихкодированиеИСКлиентСервер.ЭтоКонтекстОбъекта(Форма, "Документ.ТТНИсходящаяЕГАИС")
		Или ШтрихкодированиеИСКлиентСервер.ЭтоКонтекстОбъекта(Форма, "Документ.ЧекЕГАИС")
		Или ШтрихкодированиеИСКлиентСервер.ЭтоКонтекстОбъекта(Форма, "Документ.ЧекЕГАИСВозврат")
		Или (ШтрихкодированиеИСКлиентСервер.ЭтоКонтекстОбъекта(Форма, "Документ.ОтчетОПроизводствеЕГАИС")
			И ПараметрыОткрытияФормыПроверки.Сценарий = 0)
	Тогда
		
		ПроверитьЗаполнениеНоменклатуры(Форма, "Товары", Отказ);
		
	ИначеЕсли ШтрихкодированиеИСКлиентСервер.ЭтоКонтекстОбъекта(Форма, "Документ.ТТНВходящаяЕГАИС") Тогда
		
		ПроверитьЗаполнениеПризнакМаркированнойПродукции(Форма, Отказ);
		
	ИначеЕсли ШтрихкодированиеИСКлиентСервер.ЭтоКонтекстОбъекта(Форма, "Документ.ОтчетОПроизводствеЕГАИС")
		И ПараметрыОткрытияФормыПроверки.Сценарий = 1 Тогда
		
		ПроверитьЗаполнениеНоменклатуры(Форма, "Сырье", Отказ);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриУстановкеПараметровОткрытияФормыПроверкиИПодбора(Форма, ПараметрыОткрытия) Экспорт
	
	Если ШтрихкодированиеИСКлиентСервер.ЭтоКонтекстОбъекта(Форма, "Документ.ТТНВходящаяЕГАИС") Тогда
		
		ОбщиеПараметрыОткрытияФормыПроверкиИПодбора(Форма, ПараметрыОткрытия);
		ПараметрыОткрытия.ОрганизацияЕГАИС = Форма.Объект.Грузополучатель;
		ПараметрыОткрытия.ПроверкаЭлектронногоДокумента = Истина;
		ПараметрыОткрытия.РежимПодбораСуществующихУпаковок = Ложь;
		ПараметрыОткрытия.ДоступноСозданиеНовыхУпаковок = Истина;
		ПараметрыОткрытия.ИспользоватьСтатусПроверкаЗавершена = Истина;
		
	ИначеЕсли ШтрихкодированиеИСКлиентСервер.ЭтоКонтекстОбъекта(Форма, "Документ.АктПостановкиНаБалансЕГАИС")
		Или ШтрихкодированиеИСКлиентСервер.ЭтоКонтекстОбъекта(Форма, "Документ.АктСписанияЕГАИС")
		Или ШтрихкодированиеИСКлиентСервер.ЭтоКонтекстОбъекта(Форма, "Документ.ЧекЕГАИС")
		Или ШтрихкодированиеИСКлиентСервер.ЭтоКонтекстОбъекта(Форма, "Документ.ЧекЕГАИСВозврат")
		Или (ШтрихкодированиеИСКлиентСервер.ЭтоКонтекстОбъекта(Форма, "Документ.ОтчетОПроизводствеЕГАИС")
			И ПараметрыОткрытия.Сценарий = 1)
	Тогда
		
		ОбщиеПараметрыОткрытияФормыПроверкиИПодбора(Форма, ПараметрыОткрытия);
		ПараметрыОткрытия.ОрганизацияЕГАИС = Форма.Объект.ОрганизацияЕГАИС;
		ПараметрыОткрытия.ДоступноСозданиеНовыхУпаковок = Истина;
		
	ИначеЕсли ШтрихкодированиеИСКлиентСервер.ЭтоКонтекстОбъекта(Форма, "Документ.ТТНИсходящаяЕГАИС") Тогда
		
		ОбщиеПараметрыОткрытияФормыПроверкиИПодбора(Форма, ПараметрыОткрытия);
		ПараметрыОткрытия.ОрганизацияЕГАИС = Форма.Объект.Грузоотправитель;
		ПараметрыОткрытия.ДоступноСозданиеНовыхУпаковок = Истина;
		
		Если ПараметрыОткрытия.Сценарий = 1 Тогда
			ПараметрыОткрытия.РедактированиеФормыНедоступно = Ложь;
		КонецЕсли;
		
	ИначеЕсли ШтрихкодированиеИСКлиентСервер.ЭтоКонтекстОбъекта(Форма, "Документ.ОтчетОПроизводствеЕГАИС")
		Или ШтрихкодированиеИСКлиентСервер.ЭтоКонтекстОбъекта(Форма, "Документ.ОтчетОбИмпортеЕГАИС")
	Тогда
		
		ОбщиеПараметрыОткрытияФормыПроверкиИПодбораКодовМаркировки(ПараметрыОткрытия);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриОпределенииВариантовЗаполненияКодовМаркировки(Форма, ВариантыЗаполнения) Экспорт
	Возврат;
КонецПроцедуры

Процедура ПриОбработкеВариантаЗаполненияКодовМаркировки(Форма, РезультатВопроса, СтандартнаяОбработка) Экспорт
	Возврат;
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ФормаПроверкиИПодбора

Процедура ОбщиеПараметрыОткрытияФормыПроверкиИПодбора(Форма, ПараметрыОткрытия)
	
	ПараметрыОткрытия.ИмяРеквизитаОрганизация = "";
	ПараметрыОткрытия.ИмяРеквизитаСклад = "";
	ПараметрыОткрытия.ЕГАИС = Истина;
	
	Если Форма.РедактированиеФормыНеДоступно Тогда
		ПараметрыОткрытия.РедактированиеФормыНедоступно = Истина;
	Иначе
		ПараметрыОткрытия.РедактированиеФормыНедоступно = НЕ Форма.ПравоИзменения;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбщиеПараметрыОткрытияФормыПроверкиИПодбораКодовМаркировки(ПараметрыОткрытия)
	
	ПараметрыОткрытия.ИмяРеквизитаСклад = "";
	
КонецПроцедуры

Процедура ПроверитьЗаполнениеНоменклатуры(Форма, ИмяТабличнойЧасти, Отказ)
	
	ШаблонОшибки = НСтр("ru = 'В строке %1 таблицы %2 не заполнена номенклатура'");
	Для Каждого СтрокаТЧ Из Форма.Объект[ИмяТабличнойЧасти] Цикл
		Если Не ЗначениеЗаполнено(СтрокаТЧ.Номенклатура) Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(СтрШаблон(ШаблонОшибки, СтрокаТЧ.НомерСтроки, ИмяТабличнойЧасти),,,,Отказ);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ПроверитьЗаполнениеПризнакМаркированнойПродукции(Форма, Отказ)
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	ПризнакиМаркировки = ИнтеграцияЕГАИСВызовСервера.ПризнакиМаркировки(Форма.Объект.Товары);
	ШаблонОшибки1 = НСтр("ru = 'В строке %1 таблицы %2 не заполнена номенклатура'");
	ШаблонОшибки2 = НСтр("ru = 'В строке %1 таблицы %2 не заполнена алкогольная продукция'");
	ШаблонОшибки3 = НСтр("ru = 'В строке %1 таблицы %2 номенклатура не настроена как алкогольная продукция'");
	ШаблонОшибки4 = НСтр("ru = 'В строке %1 таблицы %2 номенклатура маркируемая, вид алкогольной продукции - немаркируемый'");
	ШаблонОшибки5 = НСтр("ru = 'В строке %1 таблицы %2 номенклатура немаркируемая, вид алкогольной продукции - маркируемый'");
	Для Каждого СтрокаТЧ Из Форма.Объект.Товары Цикл
		Шаблон = Неопределено;
		Путь = Неопределено;
		Номенклатура = ПризнакиМаркировки.Номенклатура[СтрокаТЧ.Номенклатура];
		АлкогольнаяПродукция = ПризнакиМаркировки.АлкогольнаяПродукция[СтрокаТЧ.АлкогольнаяПродукция];
		Если Не ЗначениеЗаполнено(СтрокаТЧ.Номенклатура) Тогда
			Шаблон = ШаблонОшибки1;
		ИначеЕсли Не ЗначениеЗаполнено(СтрокаТЧ.АлкогольнаяПродукция) Тогда
			Шаблон = ШаблонОшибки2;
			Путь = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Объект.Товары", СтрокаТЧ.НомерСтроки, "АлкогольнаяПродукция");
		ИначеЕсли Не КонструкторИСОбщегоНазначенияКлиентСервер.ЭтоПродукцияЕГАИС(Номенклатура.КлючВидовПродукции) Тогда
			Шаблон = ШаблонОшибки3;
		ИначеЕсли КонструкторИСОбщегоНазначенияКлиентСервер.ЭтоМаркируемаяПродукцияЕГАИС(Номенклатура.КлючВидовПродукции) <> АлкогольнаяПродукция Тогда
			Шаблон = ?(АлкогольнаяПродукция, ШаблонОшибки5, ШаблонОшибки4);
		КонецЕсли;
		Если Шаблон <> Неопределено Тогда
			Ошибка = СтрШаблон(Шаблон, СтрокаТЧ.НомерСтроки, "Товары");
			Путь = ?(Путь <> Неопределено, Путь,
				ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Объект.Товары", СтрокаТЧ.НомерСтроки, "Номенклатура"));
			ОбщегоНазначенияКлиент.СообщитьПользователю(Ошибка,,Путь,,Отказ);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
