///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2026, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Получить регистрационню информацию ТС ПИоТ
//
// Возвращаемое значение:
//  Параметры -      
//    РегистрационнаяИнформация - Структура -
//    * БиблиотекаИдентификатор - Строка -
//    * БиблиотекаНазвание - Строка -
//    * БиблиотекаВерсия - Строка -
//    * КонфигурацииИдентификатор - Строка -
//    * КонфигурацииНазвание - Строка -
//
Процедура РегистрационнаяИнформацияТСПИоТ(РегистрационнаяИнформация) Экспорт
	
	//++ НЕ ГОСИС
	ДанныеКлиента = ИнтеграцияТСПИоТ.ДанныеКассовогоПОДляНастройкиТСПИоТ();
	
	РегистрационнаяИнформация.БиблиотекаИдентификатор   = ДанныеКлиента.ИдентификаторБГосИС;
	РегистрационнаяИнформация.БиблиотекаНазвание        = ДанныеКлиента.НаименованиеКассовогоПО;
	РегистрационнаяИнформация.БиблиотекаВерсия          = ДанныеКлиента.ВерсияКассовогоПО;
	РегистрационнаяИнформация.КонфигурацииИдентификатор = ДанныеКлиента.ИдентификаторПрикладногоРешения;
	РегистрационнаяИнформация.КонфигурацииНазвание      = Метаданные.Синоним;
	
	Если Не ЗначениеЗаполнено(РегистрационнаяИнформация.КонфигурацииИдентификатор) Тогда
		РегистрационнаяИнформация.КонфигурацииИдентификатор = РегистрационнаяИнформация.БиблиотекаИдентификатор;
		РегистрационнаяИнформация.КонфигурацииНазвание      = РегистрационнаяИнформация.БиблиотекаНазвание;
	КонецЕсли;
	//-- НЕ ГОСИС
	
КонецПроцедуры

// Создать политику паролей ТСПИоТ
Процедура СоздатьПолитикуПаролейТСПИоТ() Экспорт

КонецПроцедуры

#КонецОбласти