
#Область ПрограммныйИнтерфейс

// Параметры пробития чека для фиксации продажи в ЛМ ЧЗ.
// 
// Возвращаемое значение:
//  Структура - Параметры пробития чека:
// * ККТ - Неопределено - ККТ, через которую осуществляется пробитие
// * Операция - Строка - см. ИнтерфейсИСМПОбщегоНазначенияКлиентСервер.ОперацииПриРаботеСКодамиМаркировки()
// * ДанныеКИ - Массив из см. ДанныеКодовИдентификации
Функция ПараметрыПробитияЧека() Экспорт
	
	СтруктураВозврата = Новый Структура();
	
	СтруктураВозврата.Вставить("ККТ",      Неопределено);
	СтруктураВозврата.Вставить("Операция", "");
	СтруктураВозврата.Вставить("ДанныеКИ", Новый Массив);
	
	Возврат СтруктураВозврата;
	
КонецФункции

// Структура описания кодов идентификации для фиксации продажи в ЛМ ЧЗ.
// 
// Возвращаемое значение:
//  Структура - Данные кодов идентификации:
// * КодИдентификации             - Строка - нормализованный код идентификации
// * ДробноеКоличествоЧислитель   - Число - числитель
// * ДробноеКоличествоЗнаменатель - Число - знаменатель
// * Количество                   - Число - количество выбытия
Функция ДанныеКодовИдентификации() Экспорт
	
	СтруктураВозврата = Новый Структура();
	
	СтруктураВозврата.Вставить("КодИдентификации",             "");
	СтруктураВозврата.Вставить("ДробноеКоличествоЧислитель",   0);
	СтруктураВозврата.Вставить("ДробноеКоличествоЗнаменатель", 0);
	СтруктураВозврата.Вставить("Количество",                   0);
	
	Возврат СтруктураВозврата;
	
КонецФункции

// Получение настроек экземпляра ТС ПИоТ по адресу подключения
// 
// Параметры:
//  ПараметрыНастройки      - см. ОбщегоНазначенияИСМПКлиентСервер.ПараметрыПодключенияТСПИоТ
//  УникальныйИдентификатор - УникальныйИдентификатор, Неопределено - Уникальный идентификатор формы
// 
// Возвращаемое значение:
//  Структура:
//   * ЕстьОшибки - Булево - Истина, если есть ошибки
//   * НастройкиЭкземпляраТСПИоТ - см. ИнтеграцияТСПИоТКлиентСервер.КонструкторНастройкиЭкземпляраТСПИоТ
//   * ТекстОшибки - Строка - полный текст ошибки
Функция ПолучитьДанныеНастройкиТСПИоТ(ПараметрыНастройки, УникальныйИдентификатор = Неопределено) Экспорт
	
	ВозвращаемоеЗначение = Новый Структура;
	ВозвращаемоеЗначение.Вставить("ЕстьОшибки",                Ложь);
	ВозвращаемоеЗначение.Вставить("ТекстОшибки",               "");
	ВозвращаемоеЗначение.Вставить("НастройкиЭкземпляраТСПИоТ", ИнтеграцияТСПИоТКлиентСервер.КонструкторНастройкиЭкземпляраТСПИоТ());
	
	РезультатОбновления = ИнтеграцияТСПИоТКлиентСервер.ПолучитьНастройкиЭкземпляраТСПИоТ(ПараметрыНастройки);
	
	ВозвращаемоеЗначение.ЕстьОшибки                 = ЗначениеЗаполнено(РезультатОбновления.ТекстОшибки);
	ВозвращаемоеЗначение.ТекстОшибки                = РезультатОбновления.ТекстОшибки;
	ВозвращаемоеЗначение.НастройкиЭкземпляраТСПИоТ  = РезультатОбновления.НастройкиЭкземпляраТСПИоТ;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

// Функция возвращает признак, что библиотека БПО поддерживает работу через внутренний ТС ПИоТ
// 
// Возвращаемое значение:
//   - Булево - Истина, если версия БПО поддерживает работу через ТС ПИоТ.
//
Функция ИспользуетсяВерсияБПОСПроверкойЧерезТСПИоТ() Экспорт
	
	ИменаПараметровРаботыКлиента = ОбщегоНазначенияИСМПКлиентСервер.ИменаПараметровРаботыКлиента();
	
	ПараметрыРаботыКлиента = СтандартныеПодсистемыКлиент.ПараметрыРаботыКлиента();
	Возврат ПараметрыРаботыКлиента[ИменаПараметровРаботыКлиента.ВерсияБПОПоддерживаетПроверкуКМЧерезТСПИоТ];
	
КонецФункции

// Функция возвращает результат асинхронного получения идентификаторов разрешительного режима на ТС ПИоТ
//
// Параметры:
//  ПараметрыЗавершенияОбработкиШтрихкода - Структура - (См. ШтрихкодированиеОбщегоНазначенияИСКлиент.ПараметрыЗавершенияОбработкиШтрихкода)
//  ОписаниеПослеЗавершения               - ОписаниеОповещения - процедура, выполняемая после обработки штрихкода на ТС ПИоТ
//  ОперацияПробития                      - Булево - Истина, если обработка штрихкода на ТС ПИоТ осуществляется при пробитии чека в рамках обновления идентификаторов РР
// Возвращаемое значение:
//  Булево - Истина, если обработка штрихкода на ТС ПИоТ проведена успешно.
Асинх Функция ОбработатьАсинхронноШтрихкод(ПараметрыЗавершенияОбработкиШтрихкода, ОписаниеПослеЗавершения, ОперацияПробития = Ложь) Экспорт
	
	ПроверкаЗавершена     = Ложь;
	РезультатОбработки    = ПараметрыЗавершенияОбработкиШтрихкода.РезультатОбработкиШтрихкода;
	ПараметрыСканирования = ПараметрыЗавершенияОбработкиШтрихкода.ПараметрыСканирования;
	
	Если ШтрихкодированиеОбщегоНазначенияИСКлиент.ПрисутствуетПродукцияИСМП(ПараметрыСканирования.ДопустимыеВидыПродукции, Истина)
		И ШтрихкодированиеОбщегоНазначенияИСКлиент.ПрисутствуетПродукцияИСМП(РезультатОбработки.ВидыПродукции, Истина)
		И Не РезультатОбработки.ТребуетсяУточнениеДанных Тогда
		
		Результат = Ждать ОбработатьАсинхронноШтрихкодНаТСПИоТ(ПараметрыЗавершенияОбработкиШтрихкода, ОписаниеПослеЗавершения);
		ПроверкаЗавершена = ЗавершитьПроверкуШтрихкодаПослеПолученияДанныхТСПИоТ(Результат, ОписаниеПослеЗавершения, ОперацияПробития);
		
	Иначе
		
		ДанныеШтрихкода = ОбщегоНазначенияКлиент.СкопироватьРекурсивно(РезультатОбработки.ДанныеШтрихкода);
		РезультатОбработки.ТребуетсяПроверкаРазрешительногоРежимаНаТСПИоТ = Ложь;
		
		ВыполнитьОбработкуОповещения(ОписаниеПослеЗавершения, Новый Структура("ДанныеВыбора, ЗапомнитьВыбор", ДанныеШтрихкода, Ложь));
		
	КонецЕсли;
	
	Возврат ПроверкаЗавершена;
	
КонецФункции

// Обработка штрихкода на ТС ПИоТ.
// 
// Параметры:
//  ДанныеКМПроверки                          - Массив из см. ШтрихкодированиеОбщегоНазначенияИС.ИнициализацияДанныхПоШтрихкодам
//  ПараметрыПроверки                         - см. ШтрихкодированиеОбщегоНазначенияИСКлиент.НовыеПараметрыПроверкиНаККТ
//  ПараметрыСканирования                     - см. ШтрихкодированиеОбщегоНазначенияИС.ПараметрыСканирования
//  ПараметрыПодключенияТСПИоТ                - см. ОбщегоНазначенияИСМПКлиентСервер.ПараметрыПодключенияТСПИоТ
//  ОповещениеПослеВыполненияПроверкиНаТСПИоТ - ОписаниеОповещения - действие, выполняемое после проверки при пробитии
// 
// Возвращаемое значение:
//  Обещание - Обработать асинхронно штрихкоды на ТС ПИоТ
Асинх Функция ОбработатьАсинхронноШтрихкодыНаТСПИоТПриПробитии(Знач ДанныеКМПроверки, ПараметрыПроверки, ПараметрыПодключенияТСПИоТ, ОповещениеПослеВыполненияПроверкиНаТСПИоТ) Экспорт
	
	ВозвращаемоеЗначение = Новый Структура();
	ВозвращаемоеЗначение.Вставить("ОтсутствуютУстановленныеЛМЧЗ",             Ложь);
	ВозвращаемоеЗначение.Вставить("НачатаПроверкаНаВнутреннемТСПИоТ",         Ложь);
	ВозвращаемоеЗначение.Вставить("АварийныйРежим",                           Ложь);
	ВозвращаемоеЗначение.Вставить("ТекстОшибки",                              "");
	ВозвращаемоеЗначение.Вставить("РезультатыОбработкиШтрихкода",             Новый Соответствие);
	ВозвращаемоеЗначение.Вставить("ПодключаемоеОборудование",                 Неопределено);
	ВозвращаемоеЗначение.Вставить("ТребуетсяОбработкаМарокНаЛокальномМодуле", Новый Соответствие);
	
	НастройкиПодключенияТСПИоТ   = ПараметрыПодключенияТСПИоТ.НастройкиПодключенияТСПИоТ.НастройкиПодключения;
	УникальныйИдентификаторФормы = ПараметрыПроверки.ФормаОсновногоОбъекта.УникальныйИдентификатор;
	ПараметрыСканирования        = ПараметрыПроверки.ПараметрыСканирования;
	
	МодульОборудованиеКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ОборудованиеЧекопечатающиеУстройстваКлиентСервер");
	СтатусыСостоянияТСПИоТ   = МодульОборудованиеКлиент.ПараметрыСтатусСостоянияПИоТ();
	
	СтатусыКодовМаркировки   = Новый Соответствие();
	ЗапросыДляЛогирования    = Новый Массив;
	
	Если НастройкиПодключенияТСПИоТ.ВнутреннийТСПИоТ Тогда
		
		ДанныеКМНаПроверкуТСПИоТ = ОбщегоНазначенияКлиент.СкопироватьРекурсивно(ДанныеКМПроверки);
		
		Если ДанныеКМНаПроверкуТСПИоТ.Количество() = 0 Тогда
			Возврат ВозвращаемоеЗначение;
		КонецЕсли;
		
		Если Не ИспользуетсяВерсияБПОСПроверкойЧерезТСПИоТ() Тогда
			
			ВызватьИсключение НСтр("ru = 'Текущая версия БПО не поддерживает работу с внутренним ТС ПИоТ.
				|Необходимо наличие версии библиотеки подключаемого оборудование не ниже - 3.2.9.8.'");
			
		КонецЕсли;
		
		ИндексТекущейСтрокиПроверки     = 0;
		ТекущаяСтрокаПроверки           = ДанныеКМНаПроверкуТСПИоТ[ИндексТекущейСтрокиПроверки];
		
		МодульМенеджерОборудования = ОбщегоНазначенияКлиент.ОбщийМодуль("МенеджерОборудованияКлиентСервер");
		ДополнительныеПараметры    = МодульМенеджерОборудования.ДополнительныеПараметрыОперации(Истина);
		
		МодульОборудованиеКлиентСервер = ОбщегоНазначенияКлиент.ОбщийМодуль("ОборудованиеЧекопечатающиеУстройстваКлиентСервер");
		ПараметрыОперации              = МодульОборудованиеКлиентСервер.ПараметрыПроверкиКМПИоТ();
		
		СтруктураПередачиКода = Новый Структура();
		СтруктураПередачиКода.Вставить("cis",   ТекущаяСтрокаПроверки.ШтрихкодBase64);
		СтруктураПередачиКода.Вставить("sntin", ТекущаяСтрокаПроверки.ПолныйКодМаркировки);
		СтруктураПередачиКода.Вставить("ki",    ТекущаяСтрокаПроверки.КодИдентификацииДляОтправкиВЛокальныйМодуль);
		СтруктураПередачиКода.Вставить("pg",    ИнтерфейсИСМПОбщегоНазначенияКлиентСервер.ТоварнаяГруппаЧислом(ТекущаяСтрокаПроверки.ВидПродукции));
		
		МассивПередачиКода = Новый Массив;
		МассивПередачиКода.Добавить(СтруктураПередачиКода);
		
		СтруктураПередачиКодовМаркировки = Новый Структура("codes", МассивПередачиКода);
		
		ПараметрыОперации.ЗапросJSON = ОбщегоНазначенияИСКлиентСервер.ОбъектВТекстJSON(СтруктураПередачиКодовМаркировки);
		
		ПараметрыОбработки = Новый Структура();
		ПараметрыОбработки.Вставить("ДанныеКМПроверки",              ДанныеКМНаПроверкуТСПИоТ);
		ПараметрыОбработки.Вставить("ТекущаяСтрокаПроверки",         ТекущаяСтрокаПроверки);
		ПараметрыОбработки.Вставить("ОбработанныеСтрокиПроверки",    Новый Массив);
		ПараметрыОбработки.Вставить("УникальныйИдентификаторФормы",  УникальныйИдентификаторФормы);
		ПараметрыОбработки.Вставить("ПараметрыПроверки",             ПараметрыПроверки);
		ПараметрыОбработки.Вставить("ПараметрыПодключенияТСПИоТ",    ПараметрыПодключенияТСПИоТ);
		ПараметрыОбработки.Вставить("ПослеВыполненияПроверокТСПИоТ", ОповещениеПослеВыполненияПроверкиНаТСПИоТ);
		
		ДанныеКМНаПроверкуТСПИоТ.Удалить(ИндексТекущейСтрокиПроверки);
		
		ОповещениеПослеВыполнения = Новый ОписаниеОповещения("ЗавершитьПроверкуШтрихкодаПослеПолученияДанныхТСПИоТПриПробитии", ЭтотОбъект, ПараметрыОбработки);
		
		ПодключаемоеОборудованиеККТ = ПараметрыСканирования.ККТФФД12ИСМП;
		
		МодульОборудованиеКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ОборудованиеЧекопечатающиеУстройстваКлиент");
		МодульОборудованиеКлиент.НачатьПроверкаКМПИоТ(
			ОповещениеПослеВыполнения,
			УникальныйИдентификаторФормы,
			ПодключаемоеОборудованиеККТ,
			ПараметрыОперации,
			ДополнительныеПараметры);
		
		ВозвращаемоеЗначение.НачатаПроверкаНаВнутреннемТСПИоТ = Истина;
		
		Возврат ВозвращаемоеЗначение;
		
	Иначе
		
		#Если ВебКлиент Тогда
			
			СистемнаяИнфо = Новый СистемнаяИнформация;
			Если ОбщегоНазначенияКлиентСервер.СравнитьВерсии(СистемнаяИнфо.ВерсияПриложения, "8.3.21.0") < 0 Тогда
				ВозвращаемоеЗначение.ТекстОшибки = НСтр("ru = 'Обмен с ТС ПИоТ из веб-клиента недоступен для текущей версии платформы.
					|Используйте тонкий клиент.'");
				Возврат ВозвращаемоеЗначение;
			КонецЕсли;
			
			РезультатЗапросаТСПИоТ = Ждать ИнтеграцияТСПИоТВебКлиент.ДанныеПоКодуМаркировкиПриРозничнойПродаже(
				НастройкиПодключенияТСПИоТ,
				ДанныеКМПроверки,
				ПараметрыСканирования,
				ПараметрыПодключенияТСПИоТ.ДополнительныеПараметры);
			
		#Иначе
		
			РезультатЗапросаТСПИоТ = ИнтеграцияТСПИоТКлиентСервер.ДанныеПоКодуМаркировкиПриРозничнойПродаже(
				НастройкиПодключенияТСПИоТ,
				ДанныеКМПроверки,
				ПараметрыСканирования,
				ПараметрыПодключенияТСПИоТ.ДополнительныеПараметры);
		
		#КонецЕсли
		
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ЗапросыДляЛогирования, РезультатЗапросаТСПИоТ.ЗапросыДляЛогирования);
		СтатусыКодовМаркировки = РезультатЗапросаТСПИоТ.СтатусыКодовМаркировкиГИСМТ;
		
		ВозвращаемоеЗначение.ТребуетсяОбработкаМарокНаЛокальномМодуле = РезультатЗапросаТСПИоТ.ТребуетсяОбработкаМарокНаЛокальномМодуле;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(РезультатЗапросаТСПИоТ.ТекстОшибки) Тогда
		
		Для Каждого СтрокаОбработки Из ДанныеКМПроверки Цикл
			СтрокаОбработки.ТекстОшибки = РезультатЗапросаТСПИоТ.ТекстОшибки;
		КонецЦикла;
		
		Возврат ВозвращаемоеЗначение;
		
	КонецЕсли;
	
	Если РезультатЗапросаТСПИоТ.АварийныйРежим Тогда
		
		Для Каждого СтрокаОбработки Из ДанныеКМПроверки Цикл
			СтрокаОбработки.РазрешительныйРежимКодОтвета = ОбщегоНазначенияИСМПКлиентСерверПовтИсп.АварийныйРежимКодОтветаСервисаГИСМТ();
		КонецЦикла;
		
		ВозвращаемоеЗначение.АварийныйРежим          = РезультатЗапросаТСПИоТ.АварийныйРежим;
		
		Возврат ВозвращаемоеЗначение;
		
	КонецЕсли;
	
	ШтрихкодированиеОбщегоНазначенияИСМПКлиент.ЗаполнитьДанныеКодаМаркировкиПоПолученнымДаннымРазрешительногоРежима(ДанныеКМПроверки, СтатусыКодовМаркировки);
	
	СтатусыСостоянияТСПИоТ.ГотовКПроверкеКМ       = Истина;
	СтатусыСостоянияТСПИоТ.АвторизацияПройдена    = Истина;
	СтатусыСостоянияТСПИоТ.РегистрацияПройдена    = Истина;
	СтатусыСостоянияТСПИоТ.ГотовКПроверкеКМ       = Истина;
	СтатусыСостоянияТСПИоТ.ГотовКПроверкеКМOnline = Истина;
	
	ШтрихкодированиеОбщегоНазначенияИСМПВызовСервера.ЛогироватьРезультатыОперацийПроверкиКМ(ЗапросыДляЛогирования);
	
	Если СтатусыКодовМаркировки.Количество() Тогда
		
		ДанныеАварийногоРежима = Новый Структура("АварийныйРежим, АварийныйРежимДо", РезультатЗапросаТСПИоТ.АварийныйРежим, Дата(1, 1, 1));
		
		ВозвращаемоеЗначение.РезультатыОбработкиШтрихкода = ИнтеграцияТСПИоТВызовСервера.ОбработатьСписокШтрихкодовПослеУточненияНаТСПИоТ(
			ДанныеКМПроверки,
			ПараметрыПодключенияТСПИоТ.НастройкиПодключенияТСПИоТ,
			ПараметрыСканирования,
			УникальныйИдентификаторФормы,
			ДанныеАварийногоРежима,
			СтатусыСостоянияТСПИоТ,
			ЗапросыДляЛогирования);
			
	КонецЕсли;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

// Процедура, вызываемая после фискализации чека с маркированными товарами
// 
// Параметры:
//  ПараметрыПробитияЧека - см. ПараметрыПробитияЧека
Асинх Процедура ПослеФискализацииЧекаСМаркированнымиТоварами(ПараметрыПробитияЧека) Экспорт
	
	Если ПараметрыПробитияЧека.ДанныеКИ.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ЗафиксироватьФактПродажиВозвратаКодовМаркировки(ПараметрыПробитияЧека.ДанныеКИ, ПараметрыПробитияЧека.ККТ, ПараметрыПробитияЧека.Операция);
	
КонецПроцедуры

// Запуск процедуры актуализации токенов ТС ПИоТ по переданному экземпляру.
// 
// Параметры:
//  ККТПИоТ - СправочникСсылка.ПодключаемоеОборудование, ОпределяемыйТип.ТСПИоТ - ККТ или ТС ПИоТ, по которой требуется получить токены для работы ЛМ ЧЗ
//
// Возвращаемое значение:
//  Обещание
Асинх Функция АктуализацияТокеновЛокальногоМодуляЧерезТСПИоТ(ККТПИоТ) Экспорт
	
	ПараметрыПодключенияТСПИоТПоККТ = ИнтеграцияТСПИоТВызовСервера.НастройкиПодключенияЭкземпляраТСПИоТПоККТ(ККТПИоТ);
	
	Если Не ПараметрыПодключенияТСПИоТПоККТ.Настроено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	НастройкиПодключения = ПараметрыПодключенияТСПИоТПоККТ.НастройкиПодключения;
	
	Если Не НастройкиПодключения.ВнутреннийТСПИоТ Тогда
		
		Если Не НастройкиПодключения.ОбменНаСервере Тогда
			
			РезультатНастроекЭкземпляра = ИнтеграцияТСПИоТКлиентСервер.ПолучитьНастройкиЭкземпляраТСПИоТ(НастройкиПодключения);
		
			Если РезультатНастроекЭкземпляра.НастройкиЭкземпляраТСПИоТ <> Неопределено Тогда
				
				ДанныеНастройкиЛокальногоМодуля = РезультатНастроекЭкземпляра.НастройкиЭкземпляраТСПИоТ.ДанныеНастройкиЛокальногоМодуля;
				
				Если ДанныеНастройкиЛокальногоМодуля <> Неопределено И ДанныеНастройкиЛокальногоМодуля.Подключено Тогда
					ИнтеграцияТСПИоТВызовСервера.ЗафиксироватьНастройкиЛокальногоМодуляИТокенПоДаннымТСПИоТ(ДанныеНастройкиЛокальногоМодуля, НастройкиПодключения.ТСПИоТ);
				КонецЕсли;
				
			КонецЕсли;
			
		Иначе
			ИнтеграцияТСПИоТВызовСервера.АктуализацияТокеновЛокальногоМодуляЧерезТСПИоТ(НастройкиПодключения);
		КонецЕсли;
		
	Иначе
		
		МодульМенеджерОборудования = ОбщегоНазначенияКлиент.ОбщийМодуль("МенеджерОборудованияКлиент");
		Если МодульМенеджерОборудования.ПроверкаИнициализацияПИоТПройдена(НастройкиПодключения.ПодключаемоеОборудование) Тогда
			
			ВремяНачалаЗапроса = ТекущаяУниверсальнаяДатаВМиллисекундах();
			
			ДополнительныеПараметры = Новый Структура("ККТ, ТСПИоТ, ВремяНачалаЗапроса", НастройкиПодключения.ПодключаемоеОборудование, НастройкиПодключения.ТСПИоТ, ВремяНачалаЗапроса);
			ОповещениеПриЗавершении = Новый ОписаниеОповещения("ПослеПолученияТокеновЛокальногоМодуляТСПИоТ", ЭтотОбъект, ДополнительныеПараметры);
			
			МодульОборудованиеКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ОборудованиеЧекопечатающиеУстройстваКлиент");
			МодульОборудованиеКлиент.НачатьПолучениеИнформацииЛМЧЗПИоТ(ОповещениеПриЗавершении, Новый УникальныйИдентификатор, НастройкиПодключения.ПодключаемоеОборудование);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ЗавершитьПроверкуШтрихкодаПослеПолученияДанныхТСПИоТ(Результат, ОписаниеПослеЗавершения, ОперацияПробития = Ложь) Экспорт
	
	ПроверкаЗавершена                     = Ложь;
	ПараметрыЗавершенияОбработкиШтрихкода = Результат.ПараметрыЗавершенияВводаШтрихкода;
	ПараметрыСканирования                 = ПараметрыЗавершенияОбработкиШтрихкода.ПараметрыСканирования;
	РезультатОбработки                    = ПараметрыЗавершенияОбработкиШтрихкода.РезультатОбработкиШтрихкода;
	ДанныеНастройкиТСПИоТ                 = РезультатОбработки.ДанныеНастройкиТСПИоТ.НастройкиПодключенияТСПИоТ;
	
	ДанныеШтрихкода = ОбщегоНазначенияКлиент.СкопироватьРекурсивно(ПараметрыЗавершенияОбработкиШтрихкода.РезультатОбработкиШтрихкода.ДанныеШтрихкода);
	Форма           = ПараметрыЗавершенияОбработкиШтрихкода.Форма;
	
	Если Результат.НачатаПроверкаНаВнутреннемТСПИоТ Тогда
		Возврат ПроверкаЗавершена;
	КонецЕсли;
	
	Если Не Результат.СтатусыТСПИоТ = Неопределено Тогда
		РезультатОбработки.СтатусыГотовностиТСПИоТ = Результат.СтатусыТСПИоТ;
	КонецЕсли;
	
	Если Не Результат.КодОбработанНаТСПИоТ
		И Не РезультатОбработки.СтатусыГотовностиТСПИоТ = Неопределено
		И Не ИнтеграцияТСПИоТКлиентСервер.ПроверкаГотовностиТСПИоТаКПроверкеКМ(РезультатОбработки.СтатусыГотовностиТСПИоТ) Тогда
		
		РезультатОбработки.СтатусыГотовностиТСПИоТ = Результат.СтатусыТСПИоТ;
		
		ПараметрыОткрытия = Новый Структура();
		ПараметрыОткрытия.Вставить("ПодключаемоеОборудование", Результат.ПодключаемоеОборудование);
		ПараметрыОткрытия.Вставить("ДанныеСтатусаТСПИоТ",      Результат.СтатусыТСПИоТ);
		
		ДополнительныеПараметры = Новый Структура();
		ДополнительныеПараметры.Вставить("ПараметрыЗавершенияОбработкиШтрихкода", ПараметрыЗавершенияОбработкиШтрихкода);
		ДополнительныеПараметры.Вставить("ОписаниеПослеЗавершения",               ОписаниеПослеЗавершения);
		
		ПослеЗакрытияПроверкиСтатусов = Новый ОписаниеОповещения("ПослеЗавершенияПроверкиГотовностиСтатусаТСПИоТ", ЭтотОбъект, ДополнительныеПараметры);
		
		ОткрытьФорму("ОбщаяФорма.ФормаПроверкиСтатусовГотовностиТСПИоТ", ПараметрыОткрытия, Форма,,,, ПослеЗакрытияПроверкиСтатусов);
		Возврат ПроверкаЗавершена;
		
	КонецЕсли;
	
	ДанныеАварийногоРежима = Новый Структура("АварийныйРежим, АварийныйРежимДо", Результат.АварийныйРежим, Результат.АварийныйРежимДо);
	РезультатОбработкиШтрихкода = ИнтеграцияТСПИоТВызовСервера.ОбработатьШтрихкодыПослеУточненияНаТСПИоТ(ДанныеШтрихкода,
		ДанныеНастройкиТСПИоТ,
		ПараметрыСканирования,
		Форма.УникальныйИдентификатор,
		ДанныеАварийногоРежима,
		РезультатОбработки.СтатусыГотовностиТСПИоТ,
		Результат.ЗапросыДляЛогирования);
	
	РезультатОбработкиШтрихкода.ТребуетсяПроверкаРазрешительногоРежимаНаТСПИоТ = Ложь;
	
	Если РезультатОбработкиШтрихкода <> Неопределено Тогда
		
		Если ПараметрыСканирования.ИспользуетсяСоответствиеШтрихкодовСтрокДерева
			И РезультатОбработкиШтрихкода.ТребуетсяВыборНоменклатуры Тогда
			
			Если Форма.СоответствиеШтрихкодовСтрокДерева.Получить(ДанныеШтрихкода.Штрихкод) <> Неопределено Тогда
				РезультатОбработкиШтрихкода.ТребуетсяВыборНоменклатуры = Ложь;
			КонецЕсли;
			
		КонецЕсли;
		
		ШтрихкодированиеОбщегоНазначенияИСМПКлиент.ДополнительныеПроверкиПередЗавершениемОбработкиШтрихкода(Форма, ПараметрыСканирования, РезультатОбработкиШтрихкода);
		
		ПроверкаЗавершена = Истина;
		ПараметрыЗавершенияОбработкиШтрихкода.РезультатОбработкиШтрихкода = РезультатОбработкиШтрихкода;
		
		Если ОперацияПробития Тогда
			Возврат ПроверкаЗавершена;
		КонецЕсли;
		
		Если РезультатОбработкиШтрихкода.ЕстьОшибкиВДеревеУпаковок
			Или Не ПустаяСтрока(РезультатОбработкиШтрихкода.ТекстОшибки)
			Или РезультатОбработкиШтрихкода.ТребуетсяУточнениеДанных
			Или РезультатОбработкиШтрихкода.ТребуетсяУточнениеСоставаУпаковки
			Или (РезультатОбработкиШтрихкода.ТребуетсяПроверкаСредствамиККТ
				И Не РезультатОбработкиШтрихкода.ПроверкаСредствамиККТЗавершена
			Или ШтрихкодированиеОбщегоНазначенияИСКлиент.ТребуетсяУточнениеДанныхУПользователя(Форма, РезультатОбработкиШтрихкода, ПараметрыСканирования)) Тогда
			
			Если Не ПараметрыСканирования.РасширеннаяВерсияГосИС Тогда
				ШтрихкодированиеОбщегоНазначенияИСКлиент.ДополнитьДанныеШтрихкодаМиниВерсия(РезультатОбработкиШтрихкода, ДанныеШтрихкода);
			КонецЕсли;
			
			ШтрихкодированиеОбщегоНазначенияИСКлиент.ЗавершитьОбработкуШтрихкода(ПараметрыЗавершенияОбработкиШтрихкода);
			
		Иначе
			
			ПараметрыЗавершения = Новый Структура("ДанныеВыбора, ЗапомнитьВыбор", РезультатОбработки, Ложь);
			ВыполнитьОбработкуОповещения(ОписаниеПослеЗавершения, ПараметрыЗавершения);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ПроверкаЗавершена;
	
КонецФункции

Процедура ЗавершитьПроверкуШтрихкодаПослеПолученияДанныхТСПИоТПриПробитии(Результат, ДополнительныеПараметры) Экспорт
	
	ВозвращаемоеЗначение = Новый Структура();
	ВозвращаемоеЗначение.Вставить("ОбработанныеСтрокиПроверки",        Новый Массив);
	ВозвращаемоеЗначение.Вставить("АварийныйРежим",                    Ложь);
	ВозвращаемоеЗначение.Вставить("АварийныйРежимДо",                  Дата(1, 1, 1));
	ВозвращаемоеЗначение.Вставить("Отказ",                             Ложь);
	ВозвращаемоеЗначение.Вставить("ТекстОшибки",                       "");
	ВозвращаемоеЗначение.Вставить("ПодключаемоеОборудование",          Неопределено);
	ВозвращаемоеЗначение.Вставить("СтатусыТСПИоТ",                     Неопределено);
	
	ТекстОбщейОшибки            = "";
	ЗавершитьОбработкуШтрихкода = Ложь;
	
	СтрокаДанныхПоШтрихкодам   = ДополнительныеПараметры.ТекущаяСтрокаПроверки;
	НастройкиПодключенияТСПИоТ = ДополнительныеПараметры.ПараметрыПодключенияТСПИоТ.НастройкиПодключенияТСПИоТ.НастройкиПодключения;
	
	Если Результат.Свойство("СтатусСостояния") Тогда
		
		МодульОборудованиеКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ОборудованиеЧекопечатающиеУстройстваКлиентСервер");
		ВозвращаемоеЗначение.СтатусыТСПИоТ = МодульОборудованиеКлиент.ПараметрыСтатусСостоянияПИоТ();
		
		ЗаполнитьЗначенияСвойств(ВозвращаемоеЗначение.СтатусыТСПИоТ, Результат.СтатусСостояния);
		ВозвращаемоеЗначение.ПодключаемоеОборудование = НастройкиПодключенияТСПИоТ.ПодключаемоеОборудование;
		
	КонецЕсли;
	
	Если Не Результат.Результат Тогда
		
		ПараметрыЛогирования = ШтрихкодированиеОбщегоНазначенияИСМПКлиентСервер.ЗаписатьВЛогОтветРазрешительногоРежимаГИСМТ(
			Строка(Результат.ИдентификаторУстройства),
			0,
			СтрокаДанныхПоШтрихкодам,
			Результат.ОписаниеОшибки,
			?(Результат.Свойство("ЗапросПроверки"), Результат.ЗапросПроверки, ""));
				
		ЗапросыДляЛогирования = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ПараметрыЛогирования);
		
		Если ТипЗнч(Результат.СтатусСостояния) = Тип("Структура")
			И Результат.СтатусСостояния.Свойство("АварийныйРежим")
			И Результат.СтатусСостояния.АварийныйРежим Тогда
			// действует аварийный режим, не проверять статус марки
			
			ВозвращаемоеЗначение.АварийныйРежим = Истина;
			ЗавершитьОбработкуШтрихкода         = Истина;
			
			Если Результат.СтатусСостояния.Свойство("АварийныйРежимДо") Тогда
				ВозвращаемоеЗначение.АварийныйРежимДо = Результат.СтатусСостояния.АварийныйРежимДо;
			КонецЕсли;
			
			Если ДополнительныеПараметры.ПараметрыПроверки.ВыполняетсяЛогирование Тогда
				ИнтеграцияТСПИоТВызовСервера.ЛогироватьОтветОтВнутреннегоТСПИоТ(НастройкиПодключенияТСПИоТ.ПодключаемоеОборудование,
					ЗапросыДляЛогирования,
					?(Результат.Свойство("ЗапросПроверки"), Результат.ЗапросПроверки, ""),
					Результат.ОписаниеОшибки,
					Истина);
			КонецЕсли;
			
		Иначе
			
			// ошибка при подключении компоненты, ошибка при проверке
			
			ТекстОбщейОшибки            = Результат.ОписаниеОшибки;
			ЗавершитьОбработкуШтрихкода = Истина;
			
			ВозвращаемоеЗначение.Отказ  = Истина;
			
			Если ДополнительныеПараметры.ПараметрыПроверки.ВыполняетсяЛогирование Тогда
				ИнтеграцияТСПИоТВызовСервера.ЛогироватьОтветОтВнутреннегоТСПИоТ(НастройкиПодключенияТСПИоТ.ПодключаемоеОборудование,
					ЗапросыДляЛогирования,
					?(Результат.Свойство("ЗапросПроверки"), Результат.ЗапросПроверки, ""),
					ТекстОбщейОшибки,
					Истина);
			КонецЕсли;
			
		КонецЕсли;
		
	Иначе
		
		ТекстОтветаПроверкиПоМарке        = Результат.РезультатПроверки;
		СтруктураПолучательДляЛогирования = ИнтеграцияТСПИоТКлиентСервер.ИнициализироватьСтруктуруДанныхПолучателяДляЛогирования();
		
		СтруктураПолучательДляЛогирования.URLЗапроса       = Результат.ЗапросПроверки;
		СтруктураПолучательДляЛогирования.АдресПодключения = Строка(Результат.ИдентификаторУстройства);
		
		ДополнительныеПараметрыЗапроса = ДополнительныеПараметры.ПараметрыПодключенияТСПИоТ.ДополнительныеПараметры;
		
		МассивПроверки            = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(СтрокаДанныхПоШтрихкодам);
		РезультатПроверкиНаТСПИоТ = ИнтеграцияТСПИоТКлиентСервер.РазобратьДанныеОтветаОтТСПИоТ(МассивПроверки, ТекстОтветаПроверкиПоМарке, СтруктураПолучательДляЛогирования, ДополнительныеПараметрыЗапроса);
		
		Если РезультатПроверкиНаТСПИоТ.ФорматОтветаНекорректен Тогда
			
			ШаблонСообщенияОбОшибке     = НСтр("ru = 'Формат ответа ТС ПИоТ не соответствует ожидаемому. Текст ответа от ТС ПИоТ - %1.'");
			ТекстОбщейОшибки            = СтрШаблон(ШаблонСообщенияОбОшибке, ТекстОтветаПроверкиПоМарке);
			ЗавершитьОбработкуШтрихкода = Истина;
			
		ИначеЕсли ЗначениеЗаполнено(РезультатПроверкиНаТСПИоТ.ТекстОшибки) Тогда
			
			ТекстОбщейОшибки            = РезультатПроверкиНаТСПИоТ.ТекстОшибки;
			ЗавершитьОбработкуШтрихкода = Истина;
			
		КонецЕсли;
		
		Если ДополнительныеПараметры.ПараметрыПроверки.ВыполняетсяЛогирование Тогда
			ИнтеграцияТСПИоТВызовСервера.ЛогироватьОтветОтВнутреннегоТСПИоТ(НастройкиПодключенияТСПИоТ.ПодключаемоеОборудование,
				РезультатПроверкиНаТСПИоТ.ЗапросыДляЛогирования,
				?(Результат.Свойство("ЗапросПроверки"), Результат.ЗапросПроверки, ""),
				ТекстОтветаПроверкиПоМарке,
				Истина);
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗавершитьОбработкуШтрихкода Тогда
		
		Если ЗначениеЗаполнено(ТекстОбщейОшибки) Тогда
			
			СтрокаДанныхПоШтрихкодам.ТекстОшибки = Результат.ОписаниеОшибки;
			СтрокаДанныхПоШтрихкодам.КонтролиРазрешительногоРежима.Добавить(СтрокаДанныхПоШтрихкодам.ТекстОшибки);
			
		КонецЕсли;
		
		ВозвращаемоеЗначение.ОбработанныеСтрокиПроверки.Добавить(СтрокаДанныхПоШтрихкодам);
		
		ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ПослеВыполненияПроверокТСПИоТ, ВозвращаемоеЗначение);
		Возврат;
		
	КонецЕсли;
	
	МассивСтрокОбработки = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(СтрокаДанныхПоШтрихкодам);
	ШтрихкодированиеОбщегоНазначенияИСМПКлиент.ЗаполнитьДанныеКодаМаркировкиПоПолученнымДаннымРазрешительногоРежима(МассивСтрокОбработки, РезультатПроверкиНаТСПИоТ.СтатусыКодовМаркировкиГИСМТ);
	
	ДополнительныеПараметры.ОбработанныеСтрокиПроверки.Добавить(СтрокаДанныхПоШтрихкодам);
	
	Если ДополнительныеПараметры.ДанныеКМПроверки.Количество() Тогда
		
		ИндексТекущейСтрокиПроверки    = 0;
		ТекущаяСтрокаПроверки          = ДополнительныеПараметры.ДанныеКМПроверки[ИндексТекущейСтрокиПроверки];
		ДополнительныеПараметрыЗапроса = МенеджерОборудованияКлиентСервер.ДополнительныеПараметрыОперации(Истина);
		
		ПараметрыОперации = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыПроверкиКМПИоТ();
		
		СтруктураПередачиКода = Новый Структура();
		СтруктураПередачиКода.Вставить("cis",   ТекущаяСтрокаПроверки.ШтрихкодBase64);
		СтруктураПередачиКода.Вставить("sntin", ТекущаяСтрокаПроверки.ПолныйКодМаркировки);
		СтруктураПередачиКода.Вставить("ki",    ТекущаяСтрокаПроверки.КодИдентификацииДляОтправкиВЛокальныйМодуль);
		СтруктураПередачиКода.Вставить("pg",    ИнтерфейсИСМПОбщегоНазначенияКлиентСервер.ТоварнаяГруппаЧислом(ТекущаяСтрокаПроверки.ВидПродукции));
		
		МассивПередачиКода = Новый Массив;
		МассивПередачиКода.Добавить(СтруктураПередачиКода);
		
		СтруктураПередачиКодовМаркировки = Новый Структура("codes", МассивПередачиКода);
		
		ПараметрыОперации.ЗапросJSON = ОбщегоНазначенияИСКлиентСервер.ОбъектВТекстJSON(СтруктураПередачиКодовМаркировки);
		
		ПараметрыОбработки = Новый Структура();
		ПараметрыОбработки.Вставить("ДанныеКМПроверки",              ДополнительныеПараметры.ДанныеКМПроверки);
		ПараметрыОбработки.Вставить("ТекущаяСтрокаПроверки",         ТекущаяСтрокаПроверки);
		ПараметрыОбработки.Вставить("ОбработанныеСтрокиПроверки",    ДополнительныеПараметры.ОбработанныеСтрокиПроверки);
		ПараметрыОбработки.Вставить("УникальныйИдентификаторФормы",  ДополнительныеПараметры.УникальныйИдентификаторФормы);
		ПараметрыОбработки.Вставить("ПараметрыПроверки",             ДополнительныеПараметры.ПараметрыПроверки);
		ПараметрыОбработки.Вставить("ПараметрыПодключенияТСПИоТ",    ДополнительныеПараметры.ПараметрыПодключенияТСПИоТ);
		ПараметрыОбработки.Вставить("ПослеВыполненияПроверокТСПИоТ", ДополнительныеПараметры.ПослеВыполненияПроверокТСПИоТ);
		
		ДополнительныеПараметры.ДанныеКМПроверки.Удалить(ИндексТекущейСтрокиПроверки);
		
		ОповещениеПослеВыполнения = Новый ОписаниеОповещения("ЗавершитьПроверкуШтрихкодаПослеПолученияДанныхТСПИоТПриПробитии", ЭтотОбъект, ПараметрыОбработки);
		
		ПодключаемоеОборудованиеККТ = ДополнительныеПараметры.ПараметрыПроверки.ПараметрыСканирования.ККТФФД12ИСМП;
		
		МодульОборудованиеКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ОборудованиеЧекопечатающиеУстройстваКлиент");
		МодульОборудованиеКлиент.НачатьПроверкаКМПИоТ(
			ОповещениеПослеВыполнения,
			ДополнительныеПараметры.УникальныйИдентификаторФормы,
			ПодключаемоеОборудованиеККТ,
			ПараметрыОперации,
			ДополнительныеПараметрыЗапроса);
			
		Возврат;
		
	КонецЕсли;
	
	ДанныеАварийногоРежима = Новый Структура("АварийныйРежим, АварийныйРежимДо", ВозвращаемоеЗначение.АварийныйРежим, ВозвращаемоеЗначение.АварийныйРежимДо);
	
	Для Каждого ОбработанныйШтрихкодНаТСПИоТ Из ДополнительныеПараметры.ОбработанныеСтрокиПроверки Цикл
		
		РезультатОбработкиШтрихкода = ИнтеграцияТСПИоТВызовСервера.ОбработатьШтрихкодыПослеУточненияНаТСПИоТ(ОбработанныйШтрихкодНаТСПИоТ,
			ДополнительныеПараметры.ПараметрыПодключенияТСПИоТ.НастройкиПодключенияТСПИоТ,
			ДополнительныеПараметры.ПараметрыПроверки.ПараметрыСканирования,
			ДополнительныеПараметры.УникальныйИдентификаторФормы,
			ДанныеАварийногоРежима,
			ВозвращаемоеЗначение.СтатусыТСПИоТ);
		
		ВозвращаемоеЗначение.ОбработанныеСтрокиПроверки.Добавить(РезультатОбработкиШтрихкода.ДанныеШтрихкода);
		
	КонецЦикла;
	
	ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ПослеВыполненияПроверокТСПИоТ, ВозвращаемоеЗначение);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Асинх Функция ОбработатьАсинхронноШтрихкодНаТСПИоТ(ПараметрыЗавершенияВводаШтрихкода, ОписаниеПослеЗавершения)
	
	ВозвращаемоеЗначение = Новый Структура();
	ВозвращаемоеЗначение.Вставить("НачатаПроверкаНаВнутреннемТСПИоТ",  Ложь);
	ВозвращаемоеЗначение.Вставить("КодОбработанНаТСПИоТ",              Ложь);
	ВозвращаемоеЗначение.Вставить("ПараметрыЗавершенияВводаШтрихкода", ПараметрыЗавершенияВводаШтрихкода);
	ВозвращаемоеЗначение.Вставить("ПодключаемоеОборудование",          Неопределено);
	ВозвращаемоеЗначение.Вставить("СтатусыТСПИоТ",                     Неопределено);
	ВозвращаемоеЗначение.Вставить("ЗапросыДляЛогирования",             Новый Массив);
	ВозвращаемоеЗначение.Вставить("АварийныйРежим",                    Ложь);
	ВозвращаемоеЗначение.Вставить("АварийныйРежимДо",                  Дата(1, 1, 1));
	ВозвращаемоеЗначение.Вставить("Отказ",                             Ложь);
	ВозвращаемоеЗначение.Вставить("ТекстОшибки",                       "");
	
	РезультатОбработкиШтрихкода = ПараметрыЗавершенияВводаШтрихкода.РезультатОбработкиШтрихкода;
	
	ТребуетсяПроверкаРазрешительногоРежимаНаТСПИоТ = РезультатОбработкиШтрихкода.Свойство("ТребуетсяПроверкаРазрешительногоРежимаНаТСПИоТ")
		И РезультатОбработкиШтрихкода.ТребуетсяПроверкаРазрешительногоРежимаНаТСПИоТ;
	
	ПроверкаНаТСПИоТЗавершена = РезультатОбработкиШтрихкода.Свойство("ПроверкаНаТСПИоТЗавершена")
		И РезультатОбработкиШтрихкода.ПроверкаНаТСПИоТЗавершена;
	
	Если Не ТребуетсяПроверкаРазрешительногоРежимаНаТСПИоТ Или ПроверкаНаТСПИоТЗавершена Тогда
		Возврат ВозвращаемоеЗначение;
	Иначе
		
		РезультатОбработки = Ждать ЗавершитьОбработкуКодаМаркировкиАсинхронноПослеВыполненияЗапросаНаТСПИоТ(ПараметрыЗавершенияВводаШтрихкода, ОписаниеПослеЗавершения);
		
		ПараметрыЗавершенияВводаШтрихкода = РезультатОбработки.ПараметрыЗавершенияВводаШтрихкода;
		РезультатОбработкиШтрихкода       = ПараметрыЗавершенияВводаШтрихкода.РезультатОбработкиШтрихкода;
		
		ВозвращаемоеЗначение.НачатаПроверкаНаВнутреннемТСПИоТ  = РезультатОбработки.НачатаПроверкаНаВнутреннемТСПИоТ;
		ВозвращаемоеЗначение.КодОбработанНаТСПИоТ              = Не РезультатОбработки.НачатаПроверкаНаВнутреннемТСПИоТ;
		ВозвращаемоеЗначение.ПараметрыЗавершенияВводаШтрихкода = РезультатОбработки.ПараметрыЗавершенияВводаШтрихкода;
		ВозвращаемоеЗначение.ТекстОшибки                       = РезультатОбработки.ТекстОшибки;
		ВозвращаемоеЗначение.АварийныйРежим                    = РезультатОбработки.АварийныйРежим;
		ВозвращаемоеЗначение.АварийныйРежимДо                  = РезультатОбработки.АварийныйРежимДо;
		ВозвращаемоеЗначение.ПодключаемоеОборудование          = РезультатОбработки.ПодключаемоеОборудование;
		ВозвращаемоеЗначение.СтатусыТСПИоТ                     = РезультатОбработки.СтатусыТСПИоТ;
		ВозвращаемоеЗначение.ЗапросыДляЛогирования             = РезультатОбработки.ЗапросыДляЛогирования;
		
		Возврат ВозвращаемоеЗначение;
		
	КонецЕсли;
	
КонецФункции

Асинх Функция ЗавершитьОбработкуКодаМаркировкиАсинхронноПослеВыполненияЗапросаНаТСПИоТ(ПараметрыЗавершенияВводаШтрихкода, ОписаниеПослеЗавершения)
	
	СтрокаОбработки = ПараметрыЗавершенияВводаШтрихкода.РезультатОбработкиШтрихкода.ДанныеШтрихкода;
	
	ВозвращаемоеЗначение = Новый Структура();
	ВозвращаемоеЗначение.Вставить("НачатаПроверкаНаВнутреннемТСПИоТ",  Ложь);
	ВозвращаемоеЗначение.Вставить("ОтсутствуютУстановленныеЛМЧЗ",      Ложь);
	ВозвращаемоеЗначение.Вставить("АварийныйРежим",                    Ложь);
	ВозвращаемоеЗначение.Вставить("АварийныйРежимДо",                  Дата(1, 1, 1));
	ВозвращаемоеЗначение.Вставить("ТекстОшибки",                       "");
	ВозвращаемоеЗначение.Вставить("ПараметрыЗавершенияВводаШтрихкода", ПараметрыЗавершенияВводаШтрихкода);
	ВозвращаемоеЗначение.Вставить("ПодключаемоеОборудование",          Неопределено);
	ВозвращаемоеЗначение.Вставить("СтатусыТСПИоТ",                     Неопределено);
	ВозвращаемоеЗначение.Вставить("ЗапросыДляЛогирования",             Новый Массив);
	
	Если Не СтрокаОбработки.ТребуетсяПроверкаРазрешительногоРежимаНаТСПИоТ Тогда
		Возврат ВозвращаемоеЗначение;
	КонецЕсли;
	
	ПараметрыСканирования  = ПараметрыЗавершенияВводаШтрихкода.ПараметрыСканирования;
	ПараметрыЗапросаТСПИоТ = ПараметрыЗавершенияВводаШтрихкода.РезультатОбработкиШтрихкода.ДанныеНастройкиТСПИоТ;
	
	ДанныеКМПроверки = Новый Массив;
	ДанныеКМПроверки.Добавить(СтрокаОбработки);
	
	НастройкиПодключенияТСПИоТ = ПараметрыЗапросаТСПИоТ.НастройкиПодключенияТСПИоТ.НастройкиПодключения;
	
	Если НастройкиПодключенияТСПИоТ.ВнутреннийТСПИоТ Тогда
		
		Если Не ИспользуетсяВерсияБПОСПроверкойЧерезТСПИоТ() Тогда
			
			ВызватьИсключение НСтр("ru = 'Текущая версия БПО не поддерживает работу с внутренним ТС ПИоТ.
				|Необходимо наличие версии библиотеки подключаемого оборудование не ниже - 3.2.9.8.'");
			
		КонецЕсли;
		
		ПараметрыПроверки = Новый Структура();
		ПараметрыПроверки.Вставить("ПараметрыЗавершенияВводаШтрихкода", ПараметрыЗавершенияВводаШтрихкода);
		ПараметрыПроверки.Вставить("ОписаниеПослеЗавершения",           ОписаниеПослеЗавершения);
		
		ОповещениеПослеВыполнения = Новый ОписаниеОповещения("ВыполнитьПослеЗавершенияПроверкиНаВнутреннемТСПИоТ", ЭтотОбъект, ПараметрыПроверки);
		
		МодульМенеджерОборудования = ОбщегоНазначенияКлиент.ОбщийМодуль("МенеджерОборудованияКлиентСервер");
		ДополнительныеПараметры    = МодульМенеджерОборудования.ДополнительныеПараметрыОперации(Истина);
		
		МодульОборудованиеКлиентСервер = ОбщегоНазначенияКлиент.ОбщийМодуль("ОборудованиеЧекопечатающиеУстройстваКлиентСервер");
		
		ПараметрыОперации               = МодульОборудованиеКлиентСервер.ПараметрыПроверкиКМПИоТ();
		
		СтруктураПередачиКода = Новый Структура();
		СтруктураПередачиКода.Вставить("cis",   СтрокаОбработки.ШтрихкодBase64);
		СтруктураПередачиКода.Вставить("sntin", СтрокаОбработки.ПолныйКодМаркировки);
		СтруктураПередачиКода.Вставить("ki",    СтрокаОбработки.КодИдентификацииДляОтправкиВЛокальныйМодуль);
		СтруктураПередачиКода.Вставить("pg",    ИнтерфейсИСМПОбщегоНазначенияКлиентСервер.ТоварнаяГруппаЧислом(СтрокаОбработки.ВидПродукции));
		
		МассивПередачиКода = Новый Массив;
		МассивПередачиКода.Добавить(СтруктураПередачиКода);
		
		СтруктураПередачиКодовМаркировки = Новый Структура("codes", МассивПередачиКода);
		
		ПараметрыОперации.ЗапросJSON = ОбщегоНазначенияИСКлиентСервер.ОбъектВТекстJSON(СтруктураПередачиКодовМаркировки);
		
		ПодключаемоеОборудованиеККТ = ПараметрыСканирования.ККТФФД12ИСМП;
		
		УникальныйИдентификаторФормы = "";
		Если ТипЗнч(ПараметрыЗавершенияВводаШтрихкода.Форма) = Тип("ФормаКлиентскогоПриложения") Тогда
			УникальныйИдентификаторФормы = ПараметрыЗавершенияВводаШтрихкода.Форма.УникальныйИдентификатор;
		Иначе
			УникальныйИдентификаторФормы = ПараметрыЗавершенияВводаШтрихкода.Форма;
		КонецЕсли;
		
		МодульОборудованиеКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ОборудованиеЧекопечатающиеУстройстваКлиент");
		МодульОборудованиеКлиент.НачатьПроверкаКМПИоТ(
			ОповещениеПослеВыполнения,
			УникальныйИдентификаторФормы,
			ПодключаемоеОборудованиеККТ,
			ПараметрыОперации,
			ДополнительныеПараметры);
		
		ВозвращаемоеЗначение.НачатаПроверкаНаВнутреннемТСПИоТ = Истина;
		Возврат ВозвращаемоеЗначение;
		
	Иначе
		
		#Если ВебКлиент Тогда
			
			СистемнаяИнфо = Новый СистемнаяИнформация;
			Если ОбщегоНазначенияКлиентСервер.СравнитьВерсии(СистемнаяИнфо.ВерсияПриложения, "8.3.21.0") < 0 Тогда
				ВозвращаемоеЗначение.ТекстОшибки = НСтр("ru = 'Обмен с ТС ПИоТ из веб-клиента недоступен для текущей версии платформы.
					|Используйте тонкий клиент.'");
				Возврат ВозвращаемоеЗначение;
			КонецЕсли;
			
			РезультатЗапросаТСПИоТ = Ждать ИнтеграцияТСПИоТВебКлиент.ДанныеПоКодуМаркировкиПриРозничнойПродаже(
				НастройкиПодключенияТСПИоТ,
				ДанныеКМПроверки,
				ПараметрыСканирования,
				ПараметрыЗапросаТСПИоТ.ДополнительныеПараметры);
		
		#Иначе
			
			РезультатЗапросаТСПИоТ = ИнтеграцияТСПИоТКлиентСервер.ДанныеПоКодуМаркировкиПриРозничнойПродаже(
				НастройкиПодключенияТСПИоТ,
				ДанныеКМПроверки,
				ПараметрыСканирования,
				ПараметрыЗапросаТСПИоТ.ДополнительныеПараметры);
		
		#КонецЕсли
		
	КонецЕсли;
	
	МодульОборудованиеКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ОборудованиеЧекопечатающиеУстройстваКлиентСервер");
	ВозвращаемоеЗначение.СтатусыТСПИоТ            = МодульОборудованиеКлиент.ПараметрыСтатусСостоянияПИоТ();
	ВозвращаемоеЗначение.ПодключаемоеОборудование = НастройкиПодключенияТСПИоТ.ПодключаемоеОборудование;
	ВозвращаемоеЗначение.ЗапросыДляЛогирования    = РезультатЗапросаТСПИоТ.ЗапросыДляЛогирования;
	
	Если ЗначениеЗаполнено(РезультатЗапросаТСПИоТ.ТекстОшибки) Тогда
	
		ПараметрыЗавершенияВводаШтрихкода.РезультатОбработкиШтрихкода.ЕстьОшибки                = Истина;
		ПараметрыЗавершенияВводаШтрихкода.РезультатОбработкиШтрихкода.ТекстОшибки               = РезультатЗапросаТСПИоТ.ТекстОшибки;
		ПараметрыЗавершенияВводаШтрихкода.РезультатОбработкиШтрихкода.ПроверкаНаТСПИоТЗавершена = Истина;
	
		СтрокаОбработки.ТекстОшибки = РезультатЗапросаТСПИоТ.ТекстОшибки;
		ШтрихкодированиеОбщегоНазначенияИСМПВызовСервера.ЛогироватьРезультатыОперацийПроверкиКМ(РезультатЗапросаТСПИоТ.ЗапросыДляЛогирования);

		Возврат ВозвращаемоеЗначение;
	
	КонецЕсли;
	
	ВозвращаемоеЗначение.СтатусыТСПИоТ.АвторизацияПройдена    = Истина;
	ВозвращаемоеЗначение.СтатусыТСПИоТ.РегистрацияПройдена    = Истина;
	ВозвращаемоеЗначение.СтатусыТСПИоТ.ГотовКПроверкеКМ       = Истина;
	ВозвращаемоеЗначение.СтатусыТСПИоТ.ГотовКПроверкеКМOnline = Истина;
	
	Если РезультатЗапросаТСПИоТ.АварийныйРежим Тогда
		
		СтрокаОбработки.РазрешительныйРежимКодОтвета = ОбщегоНазначенияИСМПКлиентСерверПовтИсп.АварийныйРежимКодОтветаСервисаГИСМТ();
		ВозвращаемоеЗначение.АварийныйРежим          = РезультатЗапросаТСПИоТ.АварийныйРежим;
		
		ВозвращаемоеЗначение.СтатусыТСПИоТ.АварийныйРежим         = Истина;
		ШтрихкодированиеОбщегоНазначенияИСМПВызовСервера.ЛогироватьРезультатыОперацийПроверкиКМ(РезультатЗапросаТСПИоТ.ЗапросыДляЛогирования);
		
		Возврат ВозвращаемоеЗначение;
		
	КонецЕсли;
	
	МассивСтрокОбработки = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(СтрокаОбработки);
	ШтрихкодированиеОбщегоНазначенияИСМПКлиент.ЗаполнитьДанныеКодаМаркировкиПоПолученнымДаннымРазрешительногоРежима(МассивСтрокОбработки, РезультатЗапросаТСПИоТ.СтатусыКодовМаркировкиГИСМТ);
	
	ДанныеКМОффлайнПроверки = Новый Массив;
	
	Если Не РезультатЗапросаТСПИоТ.ТребуетсяОбработкаМарокНаЛокальномМодуле.Количество() Тогда
		Возврат ВозвращаемоеЗначение;
	КонецЕсли;
	
	Для Каждого СтрокаДанных Из РезультатЗапросаТСПИоТ.ТребуетсяОбработкаМарокНаЛокальномМодуле Цикл
		
		Если Не СтрокаДанных.Значение Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаДанныхПоШтрихкодам = СтрокаДанных.Ключ;
		ДанныеКМОффлайнПроверки.Добавить(СтрокаДанныхПоШтрихкодам);
		
	КонецЦикла;
	
	#Если ВебКлиент Тогда
			
		СистемнаяИнфо = Новый СистемнаяИнформация;
		Если ОбщегоНазначенияКлиентСервер.СравнитьВерсии(СистемнаяИнфо.ВерсияПриложения, "8.3.21.0") < 0 Тогда
			ВозвращаемоеЗначение.ТекстОшибки = НСтр("ru = 'Обмен с Локальным модулем из веб-клиента недоступен для текущей версии платформы.
				|Используйте тонкий клиент.'");
			Возврат ВозвращаемоеЗначение;
		КонецЕсли;
		
		РезультатОффлайнЗапроса = Ждать ОбщегоНазначенияИСМПВебКлиент.ДанныеЛокальногоМодуляЧЗПоКИПриРозничнойПродаже(ДанныеКМОффлайнПроверки,
			ПараметрыСканирования.Организация,
			ПараметрыСканирования.НомерФискальногоНакопителя,
			ПараметрыСканирования.РабочееМесто,
			НастройкиПодключенияТСПИоТ.ТСПИоТ,
			ПараметрыЗавершенияВводаШтрихкода.РезультатОбработкиШтрихкода.СписокЛокальныхМодулейДляОбработки);
			
	#Иначе
			
		РезультатОффлайнЗапроса = ИнтерфейсИСМПОбщегоНазначенияКлиентСервер.ДанныеЛокальногоМодуляЧЗПоКИПриРозничнойПродаже(ДанныеКМОффлайнПроверки,
			ПараметрыСканирования.Организация,
			ПараметрыСканирования.НомерФискальногоНакопителя,
			ПараметрыСканирования.РабочееМесто,
			НастройкиПодключенияТСПИоТ.ТСПИоТ,
			ПараметрыЗавершенияВводаШтрихкода.РезультатОбработкиШтрихкода.СписокЛокальныхМодулейДляОбработки);
		
	#КонецЕсли	
		
	Если ЗначениеЗаполнено(РезультатОффлайнЗапроса.ТекстОшибки) Тогда
		
		ПараметрыЗавершенияВводаШтрихкода.РезультатОбработкиШтрихкода.ЕстьОшибки                = Истина;
		ПараметрыЗавершенияВводаШтрихкода.РезультатОбработкиШтрихкода.ТекстОшибки               = РезультатОффлайнЗапроса.ТекстОшибки;
		ПараметрыЗавершенияВводаШтрихкода.РезультатОбработкиШтрихкода.ПроверкаНаТСПИоТЗавершена = Истина;
		
		СтрокаОбработки.ТекстОшибки = РезультатОффлайнЗапроса.ТекстОшибки;
		
		Возврат ВозвращаемоеЗначение;
		
	КонецЕсли;
	
	ПараметрыЗавершенияВводаШтрихкода.РезультатОбработкиШтрихкода.ОтсутствуютУстановленныеЛМЧЗ = РезультатОффлайнЗапроса.ОтсутствуютУстановленныеЛМ;
	
	// код подлежит оффлайн проверке, был выполнен запрос к ЛМ
	Если РезультатОффлайнЗапроса.ОтсутствуютУстановленныеЛМ Тогда
		
		Если ПараметрыСканирования.РасширеннаяВерсияГосИС Тогда
		
			//@skip-check wrong-string-literal-content
			Модуль = ОбщегоНазначенияКлиент.ОбщийМодуль("ШтрихкодированиеИСМПКлиентСервер");
		
			ВидДополнения = Модуль.ПараметрыРасширенногоОписанияОшибки();
			ВидДополнения.УстановитьЛокальныйМодульЧЗ = Истина;
			ВидДополнения.ВидОперацииИСМП             = ПараметрыСканирования.ВидОперацииИСМП;
			ВидДополнения.Организация                 = ПараметрыСканирования.Организация;
			Модуль.ДополнитьПредставлениеОшибки(СтрокаДанныхПоШтрихкодам, ВидДополнения);
			
		КонецЕсли;
		
		СтрокаДанныхПоШтрихкодам.ТекстОшибки = НСтр("ru = 'Локальный модуль Честный знак не установлен.'");
		СтрокаДанныхПоШтрихкодам.КонтролиРазрешительногоРежима.Добавить(СтрокаДанныхПоШтрихкодам.ТекстОшибки);
		
	ИначеЕсли РезультатОффлайнЗапроса.НезавершеннаяНастройкаЛМ Тогда
		
		Если ПараметрыСканирования.РасширеннаяВерсияГосИС Тогда
			
			//@skip-check wrong-string-literal-content
			Модуль = ОбщегоНазначенияКлиент.ОбщийМодуль("ШтрихкодированиеИСМПКлиентСервер");
			
			ВидДополнения                                      = Модуль.ПараметрыРасширенногоОписанияОшибки();
			ВидДополнения.НекорректныйСтатусЛокальногоМодуляЧЗ = Истина;
			ВидДополнения.ВидОперацииИСМП                      = ПараметрыСканирования.ВидОперацииИСМП;
			ВидДополнения.Организация                          = ПараметрыСканирования.Организация;
			ВидДополнения.ПараметрыНастройкиЛМЧЗ               = РезультатОффлайнЗапроса.ПараметрыНастройкиЛМЧЗ;
			Модуль.ДополнитьПредставлениеОшибки(СтрокаДанныхПоШтрихкодам, ВидДополнения);
			
		КонецЕсли;
		
		СтрокаДанныхПоШтрихкодам.КонтролиРазрешительногоРежима.Добавить(СтрокаДанныхПоШтрихкодам.ТекстОшибки);
		
	ИначеЕсли РезультатОффлайнЗапроса.НекорректныеДанныеАвторизации Тогда
		
		Если ПараметрыСканирования.РасширеннаяВерсияГосИС Тогда
			
			//@skip-check wrong-string-literal-content
			Модуль = ОбщегоНазначенияКлиент.ОбщийМодуль("ШтрихкодированиеИСМПКлиентСервер");
			
			ВидДополнения                                                 = Модуль.ПараметрыРасширенногоОписанияОшибки();
			ВидДополнения.НекорректныеДанныеАвторизацииЛокальногоМодуляЧЗ = Истина;
			ВидДополнения.ВидОперацииИСМП                                 = ПараметрыСканирования.ВидОперацииИСМП;
			ВидДополнения.Организация                                     = ПараметрыСканирования.Организация;
			ВидДополнения.ПараметрыНастройкиЛМЧЗ                          = РезультатОффлайнЗапроса.ПараметрыНастройкиЛМЧЗ;
			Модуль.ДополнитьПредставлениеОшибки(СтрокаДанныхПоШтрихкодам, ВидДополнения);
			
		КонецЕсли;
		
		ШаблонТекстаОшибки                   = НСтр("ru = 'Указаны некорректные логин/пароль подключения к Локальному модулю ""Честный знак"".'");
		СтрокаДанныхПоШтрихкодам.ТекстОшибки = ШаблонТекстаОшибки;
		СтрокаДанныхПоШтрихкодам.КонтролиРазрешительногоРежима.Добавить(СтрокаДанныхПоШтрихкодам.ТекстОшибки);
		
	ИначеЕсли РезультатОффлайнЗапроса.НекорректныйТокенПМСР Тогда
		
		Если ПараметрыСканирования.РасширеннаяВерсияГосИС Тогда
			
			//@skip-check wrong-string-literal-content
			Модуль = ОбщегоНазначенияКлиент.ОбщийМодуль("ШтрихкодированиеИСМПКлиентСервер");
			
			ВидДополнения                                                 = Модуль.ПараметрыРасширенногоОписанияОшибки();
			ВидДополнения.НекорректныйТокенПМСРЛокальногоМодуляЧЗ         = Истина;
			ВидДополнения.ВидОперацииИСМП                                 = ПараметрыСканирования.ВидОперацииИСМП;
			ВидДополнения.Организация                                     = ПараметрыСканирования.Организация;
			ВидДополнения.ПараметрыНастройкиЛМЧЗ                          = РезультатОффлайнЗапроса.ПараметрыНастройкиЛМЧЗ;
			Модуль.ДополнитьПредставлениеОшибки(СтрокаДанныхПоШтрихкодам, ВидДополнения);
			
		КонецЕсли;
		
		ШаблонТекстаОшибки                   = НСтр("ru = 'Указан некорректный или истекший временный идентификатор для работы с Локальным модулем ""Честный знак"". 
			|Проверка марок возможна только через ТС ПИоТ.'");
		СтрокаДанныхПоШтрихкодам.ТекстОшибки = ШаблонТекстаОшибки;
		СтрокаДанныхПоШтрихкодам.КонтролиРазрешительногоРежима.Добавить(СтрокаДанныхПоШтрихкодам.ТекстОшибки);
		
	ИначеЕсли РезультатОффлайнЗапроса.ОтсутствиеСинхронизацииЛМ Тогда
		
		Если ПараметрыСканирования.РасширеннаяВерсияГосИС Тогда
			
			//@skip-check wrong-string-literal-content
			Модуль = ОбщегоНазначенияКлиент.ОбщийМодуль("ШтрихкодированиеИСМПКлиентСервер");
			
			ВидДополнения                                      = Модуль.ПараметрыРасширенногоОписанияОшибки();
			ВидДополнения.НекорректныйСтатусЛокальногоМодуляЧЗ = Истина;
			ВидДополнения.ВидОперацииИСМП                      = ПараметрыСканирования.ВидОперацииИСМП;
			ВидДополнения.Организация                          = ПараметрыСканирования.Организация;
			ВидДополнения.ПараметрыНастройкиЛМЧЗ               = РезультатОффлайнЗапроса.ПараметрыНастройкиЛМЧЗ;
			Модуль.ДополнитьПредставлениеОшибки(СтрокаДанныхПоШтрихкодам, ВидДополнения);
			
		КонецЕсли;
		
		СтрокаДанныхПоШтрихкодам.КонтролиРазрешительногоРежима.Добавить(СтрокаДанныхПоШтрихкодам.ТекстОшибки);
		
	КонецЕсли;
	
	ШтрихкодированиеОбщегоНазначенияИСМПКлиент.ЗаполнитьДанныеКодаМаркировкиПоПолученнымДаннымРазрешительногоРежима(МассивСтрокОбработки, РезультатОффлайнЗапроса.СтатусыКодовМаркировкиГИСМТ);
	
	ПараметрыЗавершенияВводаШтрихкода.РезультатОбработкиШтрихкода.ПараметрыОшибки = СтрокаОбработки.ПараметрыОшибки;
	ПараметрыЗавершенияВводаШтрихкода.РезультатОбработкиШтрихкода.ТекстОшибки     = СтрокаОбработки.ТекстОшибки;
	ПараметрыЗавершенияВводаШтрихкода.РезультатОбработкиШтрихкода.ЕстьОшибки      = ЗначениеЗаполнено(СтрокаОбработки.ТекстОшибки);
	
	ПараметрыЗавершенияВводаШтрихкода.РезультатОбработкиШтрихкода.ПроверкаНаТСПИоТЗавершена = Истина;
	
	ВозвращаемоеЗначение.ПараметрыЗавершенияВводаШтрихкода = ПараметрыЗавершенияВводаШтрихкода;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

Процедура ВыполнитьПослеЗавершенияПроверкиНаВнутреннемТСПИоТ(Результат, ДополнительныеПараметры) Экспорт
	
	ПараметрыЗавершенияВводаШтрихкода = ДополнительныеПараметры.ПараметрыЗавершенияВводаШтрихкода;
	СтрокаДанныхПоШтрихкодам          = ПараметрыЗавершенияВводаШтрихкода.РезультатОбработкиШтрихкода.ДанныеШтрихкода;
	ПараметрыСканирования             = ПараметрыЗавершенияВводаШтрихкода.ПараметрыСканирования;
	ДанныеНастройкиТСПИоТ             = ПараметрыЗавершенияВводаШтрихкода.РезультатОбработкиШтрихкода.ДанныеНастройкиТСПИоТ;
	НастройкиПодключенияТСПИоТ        = ДанныеНастройкиТСПИоТ.НастройкиПодключенияТСПИоТ.НастройкиПодключения;
	ДополнительныеПараметрыЗапроса    = ДанныеНастройкиТСПИоТ.ДополнительныеПараметры;
	
	ВозвращаемоеЗначение = Новый Структура();
	ВозвращаемоеЗначение.Вставить("НачатаПроверкаНаВнутреннемТСПИоТ",  Ложь);
	ВозвращаемоеЗначение.Вставить("КодОбработанНаТСПИоТ",              Истина);
	ВозвращаемоеЗначение.Вставить("ПараметрыЗавершенияВводаШтрихкода", ПараметрыЗавершенияВводаШтрихкода);
	ВозвращаемоеЗначение.Вставить("ПодключаемоеОборудование",          Неопределено);
	ВозвращаемоеЗначение.Вставить("СтатусыТСПИоТ",                     Неопределено);
	ВозвращаемоеЗначение.Вставить("ЗапросыДляЛогирования",             Новый Массив);
	ВозвращаемоеЗначение.Вставить("АварийныйРежим",                    Ложь);
	ВозвращаемоеЗначение.Вставить("АварийныйРежимДо",                  Дата(1, 1, 1));
	ВозвращаемоеЗначение.Вставить("Отказ",                             Ложь);
	ВозвращаемоеЗначение.Вставить("ТекстОшибки",                       "");
	
	ТекстОбщейОшибки            = "";
	ЗавершитьОбработкуШтрихкода = Ложь;
	
	Если Результат.Свойство("СтатусСостояния") Тогда
		
		МодульОборудованиеКлиентСервер = ОбщегоНазначенияКлиент.ОбщийМодуль("ОборудованиеЧекопечатающиеУстройстваКлиентСервер");
		ВозвращаемоеЗначение.СтатусыТСПИоТ = МодульОборудованиеКлиентСервер.ПараметрыСтатусСостоянияПИоТ();
		
		ЗаполнитьЗначенияСвойств(ВозвращаемоеЗначение.СтатусыТСПИоТ, Результат.СтатусСостояния);
		ВозвращаемоеЗначение.ПодключаемоеОборудование = НастройкиПодключенияТСПИоТ.ПодключаемоеОборудование;
		
	КонецЕсли;
	
	Если Не Результат.Результат Тогда
		
		ПараметрыЛогирования = ШтрихкодированиеОбщегоНазначенияИСМПКлиентСервер.ЗаписатьВЛогОтветРазрешительногоРежимаГИСМТ(
			Строка(Результат.ИдентификаторУстройства),
			0,
			СтрокаДанныхПоШтрихкодам,
			Результат.ОписаниеОшибки,
			?(Результат.Свойство("ЗапросПроверки"), Результат.ЗапросПроверки, ""));
				
		ЗапросыДляЛогирования = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ПараметрыЛогирования);
		
		Если Результат.Свойство("СтатусСостояния")
			И ТипЗнч(Результат.СтатусСостояния) = Тип("Структура")
			И Результат.СтатусСостояния.Свойство("АварийныйРежим")
			И Результат.СтатусСостояния.АварийныйРежим Тогда
			// действует аварийный режим, не проверять статус марки
			
			ПараметрыЗавершенияВводаШтрихкода.РезультатОбработкиШтрихкода.ПроверкаНаТСПИоТЗавершена = Истина;
			
			ВозвращаемоеЗначение.АварийныйРежим   = Истина;
			
			Если Результат.СтатусСостояния.Свойство("АварийныйРежимДо") Тогда
				ВозвращаемоеЗначение.АварийныйРежимДо = Результат.СтатусСостояния.АварийныйРежимДо;
			КонецЕсли;
			
			ЗавершитьОбработкуШтрихкода           = Истина;
			
			ИнтеграцияТСПИоТВызовСервера.ЛогироватьОтветОтВнутреннегоТСПИоТ(НастройкиПодключенияТСПИоТ.ПодключаемоеОборудование,
				ЗапросыДляЛогирования,
				?(Результат.Свойство("ЗапросПроверки"), Результат.ЗапросПроверки, ""),
				Результат.ОписаниеОшибки);
			
		Иначе
		
			// ошибка при подключении компоненты, ошибка при проверке
			
			ТекстОбщейОшибки            = Результат.ОписаниеОшибки;
			ЗавершитьОбработкуШтрихкода = Истина;
			
			ВозвращаемоеЗначение.КодОбработанНаТСПИоТ = Ложь;
			
			ИнтеграцияТСПИоТВызовСервера.ЛогироватьОтветОтВнутреннегоТСПИоТ(НастройкиПодключенияТСПИоТ.ПодключаемоеОборудование,
				ЗапросыДляЛогирования,
				?(Результат.Свойство("ЗапросПроверки"), Результат.ЗапросПроверки, ""),
				ТекстОбщейОшибки);
			
		КонецЕсли;
		
	Иначе
		
		ТекстОтветаПроверкиПоМарке        = Результат.РезультатПроверки;
		СтруктураПолучательДляЛогирования = ИнтеграцияТСПИоТКлиентСервер.ИнициализироватьСтруктуруДанныхПолучателяДляЛогирования();
		
		СтруктураПолучательДляЛогирования.URLЗапроса       = Результат.ЗапросПроверки;
		СтруктураПолучательДляЛогирования.АдресПодключения = Строка(Результат.ИдентификаторУстройства);
		
		МассивПроверки            = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(СтрокаДанныхПоШтрихкодам);
		РезультатПроверкиНаТСПИоТ = ИнтеграцияТСПИоТКлиентСервер.РазобратьДанныеОтветаОтТСПИоТ(МассивПроверки, ТекстОтветаПроверкиПоМарке, СтруктураПолучательДляЛогирования, ДополнительныеПараметрыЗапроса);
		
		Если РезультатПроверкиНаТСПИоТ.ФорматОтветаНекорректен Тогда
			
			ШаблонСообщенияОбОшибке     = НСтр("ru = 'Формат ответа ТС ПИоТ не соответствует ожидаемому. Текст ответа от ТС ПИоТ - %1.'");
			ТекстОбщейОшибки            = СтрШаблон(ШаблонСообщенияОбОшибке, ТекстОтветаПроверкиПоМарке);
			ЗавершитьОбработкуШтрихкода = Истина;
			
		ИначеЕсли ЗначениеЗаполнено(РезультатПроверкиНаТСПИоТ.ТекстОшибки) Тогда
			
			ТекстОбщейОшибки            = РезультатПроверкиНаТСПИоТ.ТекстОшибки;
			ЗавершитьОбработкуШтрихкода = Истина;
			
		КонецЕсли;
		
		ИнтеграцияТСПИоТВызовСервера.ЛогироватьОтветОтВнутреннегоТСПИоТ(НастройкиПодключенияТСПИоТ.ПодключаемоеОборудование,
			РезультатПроверкиНаТСПИоТ.ЗапросыДляЛогирования,
			?(Результат.Свойство("ЗапросПроверки"), Результат.ЗапросПроверки, ""),
			ТекстОтветаПроверкиПоМарке);
		
	КонецЕсли;
	
	Если ЗавершитьОбработкуШтрихкода Тогда
		
		Если ЗначениеЗаполнено(ТекстОбщейОшибки) Тогда
			
			СтрокаДанныхПоШтрихкодам.ТекстОшибки = ТекстОбщейОшибки;
			
			Если ПараметрыСканирования.РасширеннаяВерсияГосИС Тогда
				
				//@skip-check wrong-string-literal-content
				Модуль = ОбщегоНазначенияКлиент.ОбщийМодуль("ШтрихкодированиеИСМПКлиентСервер");
				
				ВидДополнения = Модуль.ПараметрыРасширенногоОписанияОшибки();
				ВидДополнения.ОшибкаПроверкиНаТСПИоТ = Истина;
				ВидДополнения.ТСПИоТ                 = НастройкиПодключенияТСПИоТ.ТСПИоТ;
				Модуль.ДополнитьПредставлениеОшибки(СтрокаДанныхПоШтрихкодам, ВидДополнения);
				
			КонецЕсли;
			
			Если Не ПараметрыЗавершенияВводаШтрихкода = Неопределено Тогда
				
				ПараметрыЗавершенияВводаШтрихкода.РезультатОбработкиШтрихкода.ЕстьОшибки                = Истина;
				ПараметрыЗавершенияВводаШтрихкода.РезультатОбработкиШтрихкода.ТекстОшибки               = СтрокаДанныхПоШтрихкодам.ТекстОшибки;
				ПараметрыЗавершенияВводаШтрихкода.РезультатОбработкиШтрихкода.ПараметрыОшибки           = СтрокаДанныхПоШтрихкодам.ПараметрыОшибки;
				ПараметрыЗавершенияВводаШтрихкода.РезультатОбработкиШтрихкода.ПроверкаНаТСПИоТЗавершена = Истина;
				
			КонецЕсли;
			
		КонецЕсли;
		
		ЗавершитьПроверкуШтрихкодаПослеПолученияДанныхТСПИоТ(ВозвращаемоеЗначение, ДополнительныеПараметры.ОписаниеПослеЗавершения);
		
		Возврат;
		
	КонецЕсли;
	
	МассивСтрокОбработки = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(СтрокаДанныхПоШтрихкодам);
	ШтрихкодированиеОбщегоНазначенияИСМПКлиент.ЗаполнитьДанныеКодаМаркировкиПоПолученнымДаннымРазрешительногоРежима(МассивСтрокОбработки, РезультатПроверкиНаТСПИоТ.СтатусыКодовМаркировкиГИСМТ);
	
	Если Не ПараметрыЗавершенияВводаШтрихкода = Неопределено Тогда
		
		ПараметрыЗавершенияВводаШтрихкода.РезультатОбработкиШтрихкода.ПараметрыОшибки = СтрокаДанныхПоШтрихкодам.ПараметрыОшибки;
		ПараметрыЗавершенияВводаШтрихкода.РезультатОбработкиШтрихкода.ТекстОшибки     = СтрокаДанныхПоШтрихкодам.ТекстОшибки;
		ПараметрыЗавершенияВводаШтрихкода.РезультатОбработкиШтрихкода.ЕстьОшибки      = ЗначениеЗаполнено(СтрокаДанныхПоШтрихкодам.ТекстОшибки);
		
		ПараметрыЗавершенияВводаШтрихкода.РезультатОбработкиШтрихкода.ПроверкаНаТСПИоТЗавершена = Истина;
		
	КонецЕсли;
	
	ЗавершитьПроверкуШтрихкодаПослеПолученияДанныхТСПИоТ(ВозвращаемоеЗначение, ДополнительныеПараметры.ОписаниеПослеЗавершения);
	
КонецПроцедуры

Процедура ЗафиксироватьФактПродажиВозвратаКодовМаркировки(ДанныеКИ, ККТ, Операция)

	ДанныеУстановленныхЛокальныхМодулей = 
		ОбщегоНазначенияИСМПВызовСервера.НастройкиОсновногоПодключенияЛокальномуМодулюЧестныйЗнакПоККТ(ККТ);

	Если Не ДанныеУстановленныхЛокальныхМодулей.НастроеноПодключение Тогда
		// если локальных модулей не установлено, то не фиксировать продажу/возврат
		Возврат;
	КонецЕсли;
	
	МассивКИ = Новый Массив;
	
	Для Каждого СтрокаДанныхКИ Из ДанныеКИ Цикл
		
		Если ЗначениеЗаполнено(СтрокаДанныхКИ.ДробноеКоличествоЧислитель)
			Или ЗначениеЗаполнено(СтрокаДанныхКИ.ДробноеКоличествоЗнаменатель)
			Или Не СтрокаДанныхКИ.Количество = 1 Тогда
			Продолжить;
		КонецЕсли;
		
		МассивКИ.Добавить(СтрокаДанныхКИ.КодИдентификации);
		
	КонецЦикла;
	
	Если Не ДанныеУстановленныхЛокальныхМодулей.Настройки.ОбменНаСервере Тогда
		ИнтерфейсИСМПОбщегоНазначенияКлиентСервер.ЗафиксироватьФактПродажиВозвратаКодовМаркировки(МассивКИ, Операция, ДанныеУстановленныхЛокальныхМодулей.Настройки);
	Иначе
		ИнтеграцияТСПИоТВызовСервера.ЗафиксироватьФактПродажиВозвратаКодовМаркировки(МассивКИ, Операция, ДанныеУстановленныхЛокальныхМодулей.Настройки);
	КонецЕсли;

КонецПроцедуры

Процедура ПослеЗавершенияПроверкиГотовностиСтатусаТСПИоТ(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыЗавершенияОбработкиШтрихкода = ДополнительныеПараметры.ПараметрыЗавершенияОбработкиШтрихкода;
	ОписаниеПослеЗавершения               = ДополнительныеПараметры.ОписаниеПослеЗавершения;
	
	ПараметрыЗавершенияОбработкиШтрихкода.РезультатОбработкиШтрихкода.ЕстьОшибки                = Ложь;
	ПараметрыЗавершенияОбработкиШтрихкода.РезультатОбработкиШтрихкода.ТекстОшибки               = "";
	ПараметрыЗавершенияОбработкиШтрихкода.РезультатОбработкиШтрихкода.ПараметрыОшибки           = Неопределено;
	ПараметрыЗавершенияОбработкиШтрихкода.РезультатОбработкиШтрихкода.ПроверкаНаТСПИоТЗавершена = Ложь;
	
	ПараметрыЗавершенияОбработкиШтрихкода.РезультатОбработкиШтрихкода.ДанныеШтрихкода.ТекстОшибки = "";
	
	ОбработатьАсинхронноШтрихкод(ПараметрыЗавершенияОбработкиШтрихкода, ОписаниеПослеЗавершения);
	
КонецПроцедуры

Процедура ПослеПолученияТокеновЛокальногоМодуляТСПИоТ(Результат, ДополнительныеПараметры) Экспорт
	
	ВремяОкончанияЗапроса = ТекущаяУниверсальнаяДатаВМиллисекундах();
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Не Результат.Свойство("Информация") Тогда
		Возврат;
	КонецЕсли;
	
	Если Не Результат.Информация.Свойство("LM") Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеНастройкиЛокальногоМодуля = ИнтеграцияТСПИоТКлиентСервер.НастройкиЛокальногоМодуляПоДаннымВнутреннегоТСПИоТ(Результат);
	ДанныеНастройкиЛокальногоМодуля.СреднееВремяОтветаТСПИоТ = ВремяОкончанияЗапроса - ДополнительныеПараметры.ВремяНачалаЗапроса;
	
	Если ДанныеНастройкиЛокальногоМодуля.Подключено Тогда
		ИнтеграцияТСПИоТВызовСервера.ЗафиксироватьНастройкиЛокальногоМодуляИТокенПоДаннымТСПИоТ(ДанныеНастройкиЛокальногоМодуля, ДополнительныеПараметры.ТСПИоТ);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
