
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1СДокументооборотом
	
	СобытияФорм.ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	
	СтандартныеПодсистемыСервер.УстановитьУсловноеОформлениеПоляДата(ЭтотОбъект, "Список.Дата", Элементы.Дата.Имя);

	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	
	Элементы.ФормаСоздатьНаОсновании.Видимость = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОжидаетсяПоставкаПриИзменении(Состояние);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СоздатьПриобретениеТоваровУслугНаОсновании(Команда)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;

	Если ТекущиеДанные = Неопределено Тогда
		ОчиститьСообщения();
		ТекстСообщения = НСтр("ru = 'Не выбран документ о предстоящей поставке'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	// Получаем массив идентификаторов выделенных строк
	МассивИД = Элементы.Список.ВыделенныеСтроки;
	МассивВыделенныхСтрок = Новый Массив();
	// Обходим массив и получаем данные по каждому идентификатору
	Для Каждого Идентификатор Из МассивИД Цикл
		ДанныеСтроки = Элементы.Список.ДанныеСтроки(Идентификатор);
		// Обязательно проверяем на Неопределено (данные могут быть не загружены в кэш)
		Если ДанныеСтроки <> Неопределено Тогда
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если ДанныеСтроки <> Неопределено Тогда
		СписокСкладов = Новый СписокЗначений;
		Если Не УсловияВыбораВариантаВыполнены(ДанныеСтроки.ЗаказПоставщику, СписокСкладов) Тогда
			ОткрытьПриобретениеНаОсновании(Неопределено, ДанныеСтроки.Ссылка);
			Возврат;
		КонецЕсли;
		
		Оповещение = Новый ОписаниеОповещения("СоздатьПриобретениеТоваровУслугНаОснованииЗавершение", ЭтотОбъект, ДанныеСтроки.Ссылка);
		СписокСкладов.ПоказатьВыборЭлемента(Оповещение, НСтр("ru = 'Выберите Склад'"));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьСписаниеБДСНаОсновании(Команда)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;

	Если ТекущиеДанные = Неопределено Тогда
		ОчиститьСообщения();
		ТекстСообщения = НСтр("ru = 'Не выбран документ о предстоящей поставке'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	// Получаем массив идентификаторов выделенных строк
	МассивИД = Элементы.Список.ВыделенныеСтроки;
	МассивВыделенныхСтрок = Новый Массив();
		
	ДОПП = ПредопределенноеЗначение("Документ.ДокументОПредстоящейПоставке.ПустаяСсылка");

	// Обходим массив и получаем данные по каждому идентификатору
	Для Каждого Идентификатор Из МассивИД Цикл
		ДанныеСтроки = Элементы.Список.ДанныеСтроки(Идентификатор);
		// Обязательно проверяем на Неопределено (данные могут быть не загружены в кэш)
		Если ДанныеСтроки <> Неопределено Тогда
			ДОПП = ДанныеСтроки.Ссылка;
			Прервать;
		КонецЕсли;
	КонецЦикла;

	ПараметрыОткрытия = Новый Структура();
	ПараметрыОткрытия.Вставить("Основание", ДОПП);
	
	ОткрытьФорму("Документ.СписаниеБезналичныхДенежныхСредств.Форма.ФормаДокумента", ПараметрыОткрытия, ЭтотОбъект);
	
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Элементы.Список);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Элементы.Список);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Элементы.Список);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

// ИнтеграцияС1СДокументооборотом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграции(Команда)
	
	ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ВыполнитьПодключаемуюКомандуИнтеграции(Команда, ЭтотОбъект, Элементы.Список);
	
КонецПроцедуры
// Конец ИнтеграцияС1СДокументооборотом

&НаКлиенте
Процедура Подключаемый_ВыполнитьПереопределяемуюКоманду(Команда)
	
	СобытияФормКлиент.ВыполнитьПереопределяемуюКоманду(ЭтотОбъект, Команда);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОжидаетсяПоставкаПриИзменении(Элемент)
	
	Использовать = ЗначениеЗаполнено(Состояние);
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
			Список,
			"ОжидаетсяПоставка",
			Состояние,
			ВидСравненияКомпоновкиДанных.Равно,,
			Использовать);
	
КонецПроцедуры

&НаКлиенте
Процедура СостояниеОчистка(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Состояние = Неопределено;
	ОжидаетсяПоставкаПриИзменении(Элемент);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура СоздатьПриобретениеТоваровУслугНаОснованииЗавершение(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныйЭлемент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОткрытьПриобретениеНаОсновании(ВыбранныйЭлемент.Значение, ДополнительныеПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПриобретениеНаОсновании(Склад, ДОПП)
	
	Основание = Новый Структура();
	Основание.Вставить("ДокументОснование", ДОПП);
	Основание.Вставить("Склад", Склад);
	
	ПараметрыОткрытия = Новый Структура();
	ПараметрыОткрытия.Вставить("Основание", Основание);
	
	ОткрытьФорму("Документ.ПриобретениеТоваровУслуг.Форма.ФормаДокумента", ПараметрыОткрытия, ЭтотОбъект);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция УсловияВыбораВариантаВыполнены(ЗаказПоставщику, СписокСкладов)
	
	Если Не ЗначениеЗаполнено(ЗаказПоставщику) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Склад = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЗаказПоставщику, "Склад");
	Если Не ЗначениеЗаполнено(Склад) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ВыборГруппы = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Склад, "ВыборГруппы");
	
	РазрешитьВЗаказах = ВыборГруппы = Перечисления.ВыборГруппыСкладов.РазрешитьВЗаказах;
	
	Если РазрешитьВЗаказах Тогда
		СписокСкладов = СкладыЗаказаПоставщику(ЗаказПоставщику);
	КонецЕсли;
	
	Возврат РазрешитьВЗаказах;
	
КонецФункции

&НаСервереБезКонтекста
Функция СкладыЗаказаПоставщику(ЗаказПоставщику)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Товары.Склад КАК Склад
		|ИЗ
		|	Документ.ЗаказПоставщику.Товары КАК Товары
		|ГДЕ
		|	Товары.Ссылка = &Ссылка
		|	И Товары.Склад <> ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
		|УПОРЯДОЧИТЬ ПО
		|	Склад";
	Запрос.УстановитьПараметр("Ссылка", ЗаказПоставщику);
	
	СписокСкладов = Новый СписокЗначений;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СписокСкладов.Добавить(Выборка.Склад);
	КонецЦикла;
	
	Возврат СписокСкладов;
	
КонецФункции

#КонецОбласти
