
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПараметрыОткрытия = ОбеспечениеКлиент.ПараметрыОткрытияФормыОбработкиОбеспечениеПотребностей();
	ПараметрыОткрытия.ОтборПоТипуОбеспечения = ПредопределенноеЗначение("Перечисление.ТипыОбеспечения.Покупка"); // Доступно формирование только заявок на закупку.
	ПараметрыОткрытия.КлючНазначенияИспользования = ОбеспечениеКлиентСервер.КлючНазначенияИспользованияФормированияЗаявокПоПотребностям();
	
	ОткрытьФорму("Обработка.ОбеспечениеПотребностей.Форма",
		ПараметрыОткрытия,
		ПараметрыВыполненияКоманды.Источник, 
		ПараметрыВыполненияКоманды.Уникальность, 
		ПараметрыВыполненияКоманды.Окно, 
		ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	
КонецПроцедуры

#КонецОбласти