#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	УстановитьСвойстваЭлементовФормы();
	
	СтатусПерехода = СтатусПерехода();
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, СтатусПерехода);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ПереходЗавершен Тогда
		ОповеститьОбОкончанииПерехода();
	КонецЕсли;
	
	УстановитьВидимостьКомандыЗавершенияПерехода();
	
	УстановитьВидимостьЭлементовСтраницы(Элементы.Страницы.ТекущаяСтраница);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если НавигационнаяСсылкаФорматированнойСтроки = "ОткрытьСписокПередачКОформлению" Тогда
		ПараметрыОткрытияФормы = Новый Структура;
		ПараметрыОткрытияФормы.Вставить("СтруктураБыстрогоОтбора", Новый Структура);
		ПараметрыОткрытияФормы.СтруктураБыстрогоОтбора.Вставить("СоглашениеКомиссионныеПродажи25", Ложь);
		ПараметрыОткрытияФормы.СтруктураБыстрогоОтбора.Вставить("СоглашениеХозяйственнаяОперация",
			ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ПередачаНаКомиссию"));
		ОткрытьФорму("Обработка.ЖурналДокументовПродажи.Форма.КОформлениюНакладных", ПараметрыОткрытияФормы);
	КонецЕсли;
	
	Если НавигационнаяСсылкаФорматированнойСтроки = "ОткрытьСписокОтчетовКОформлению" Тогда
		ПараметрыОткрытияФормы = Новый Структура;
		ПараметрыОткрытияФормы.Вставить("ИмяТекущейСтраницы", "СтраницаКомиссионеры");
		ОткрытьФорму("Обработка.ЖурналДокументовОтчетыКомиссионеров.Форма.СписокДокументов", ПараметрыОткрытияФормы);
	КонецЕсли;
	
	Если НавигационнаяСсылкаФорматированнойСтроки = "ОткрытьСписокНезавершенныхЗаказов" Тогда
		ПараметрыОткрытияФормы = Новый Структура;
		ПараметрыОткрытияФормы.Вставить("СтруктураБыстрогоОтбора", Новый Структура);
		ПараметрыОткрытияФормы.СтруктураБыстрогоОтбора.Вставить("СоглашениеКомиссионныеПродажи25", Ложь);
		ПараметрыОткрытияФормы.СтруктураБыстрогоОтбора.Вставить("СоглашениеХозяйственнаяОперация",
			ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ПередачаНаКомиссию"));
		ОткрытьФорму("Обработка.ЖурналДокументовПродажи.Форма.КОформлениюНакладных", ПараметрыОткрытияФормы);
	КонецЕсли;

	Если НавигационнаяСсылкаФорматированнойСтроки = "ОткрытьСписокДоговоров" Тогда
		ПараметрыОткрытияФормы = Новый Структура;
		ПараметрыОткрытияФормы.Вставить("СтруктураБыстрогоОтбора", Новый Структура);
		ПараметрыОткрытияФормы.СтруктураБыстрогоОтбора.Вставить("Статус",
			ПредопределенноеЗначение("Перечисление.СтатусыДоговоровКонтрагентов.Действует"));
		ПараметрыОткрытияФормы.СтруктураБыстрогоОтбора.Вставить("ХозяйственнаяОперация",
			ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ПередачаНаКомиссию"));
		ПараметрыОткрытияФормы.СтруктураБыстрогоОтбора.Вставить("КомиссионныеПродажи25", Ложь);
		ОткрытьФорму("Справочник.ДоговорыКонтрагентов.Форма.ФормаСпискаПродажи", ПараметрыОткрытияФормы);
	КонецЕсли;

	Если НавигационнаяСсылкаФорматированнойСтроки = "ОткрытьСписокСоглашений" Тогда
		ПараметрыОткрытияФормы = Новый Структура;
		ПараметрыОткрытияФормы.Вставить("СтруктураБыстрогоОтбора", Новый Структура);
		ПараметрыОткрытияФормы.СтруктураБыстрогоОтбора.Вставить("Статус",
			ПредопределенноеЗначение("Перечисление.СтатусыСоглашенийСКлиентами.Действует"));
		ПараметрыОткрытияФормы.СтруктураБыстрогоОтбора.Вставить("ХозяйственнаяОперация",
			ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ПередачаНаКомиссию"));
		ПараметрыОткрытияФормы.СтруктураБыстрогоОтбора.Вставить("КомиссионныеПродажи25", Ложь);
		ОткрытьФорму("Справочник.СоглашенияСКлиентами.Форма.ФормаСписка", ПараметрыОткрытияФормы);
	КонецЕсли;
	
	//++ Локализация
	Если НавигационнаяСсылкаФорматированнойСтроки = "ОткрытьСписокСчетовФактур" Тогда
		ОткрытьФорму("Документ.СчетФактураКомиссионеру.Форма.ФормаРабочееМесто");
	КонецЕсли;
	
	//-- Локализация
	Если НавигационнаяСсылкаФорматированнойСтроки = "ОткрытьЖурналРегистрации" Тогда
		ОткрытьЖурналРегистрации();
	КонецЕсли;
	
	Если НавигационнаяСсылкаФорматированнойСтроки = "ЗавершитьПереход" Тогда
		ЗавершитьПереход();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Далее(Команда)

	Если Элементы.Страницы.ТекущаяСтраница = Элементы.ГруппаШаг1 Тогда
		ОткрытьСтраницу(Элементы.ГруппаШаг2);
	ИначеЕсли Элементы.Страницы.ТекущаяСтраница = Элементы.ГруппаШаг2 Тогда
		ОткрытьСтраницу(Элементы.ГруппаШаг3);
	Иначе
		ОткрытьСтраницу(Элементы.ГруппаШаг1);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Назад(Команда)
	
	Если Элементы.Страницы.ТекущаяСтраница = Элементы.ГруппаШаг2 Тогда
		ОткрытьСтраницу(Элементы.ГруппаШаг1);
	ИначеЕсли Элементы.Страницы.ТекущаяСтраница = Элементы.ГруппаШаг3 Тогда
		ОткрытьСтраницу(Элементы.ГруппаШаг2);
	Иначе
		ОткрытьСтраницу(Элементы.ГруппаШаг3);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапуститьПереход(Команда)
	
	ЕстьОшибки = Ложь;
	
	ПараметрыПроцедуры = Новый Структура;
	ПараметрыПроцедуры.Вставить("СобытиеЖурналаРегистрации", СобытиеЖурналаРегистрации);

	Элементы.ГруппаПереносДанныхЗаголовок.Видимость = Истина;
	Элементы.ДекорацияСтатусПереносаДанных.Картинка = БиблиотекаКартинок.ДлительнаяОперация48;
	Элементы.ДекорацияЗаголовокПереносаДанных.Заголовок = НСтр("ru = 'Выполняется перенос данных.'");
	
	ДлительнаяОперация = ПеренестиДанныеНаСервере(
							ПараметрыПроцедуры, 
							УникальныйИдентификатор);
	
	АдресРезультата = ДлительнаяОперация.АдресРезультата;
	ИдентификаторЗадания = ДлительнаяОперация.ИдентификаторЗадания;
	
	ТекущийИнтервалПроверкиРезультата = 1;
	
	ПроверитьВыполнениеЗадания(ДлительнаяОперация);
	
	УстановитьВидимостьЭлементовСтраницы(Элементы.Страницы.ТекущаяСтраница);

КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьПомощник(Команда)
	
	Закрыть();

КонецПроцедуры

&НаКлиенте
Процедура ОбновлениеСтатусаПерехода()
	
	СтатусПерехода = СтатусПерехода();
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, СтатусПерехода);
	
	ОбновитьШаги();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьСвойстваЭлементовФормы()
	
	СкорректироватьВерсиюКомиссии(Заголовок);
	СкорректироватьВерсиюКомиссии(Элементы.Шаг1ДекорацияИнформацияЗаголовок.Заголовок);
	СкорректироватьВерсиюКомиссии(Элементы.Шаг1ДекорацияИнформация3.Подсказка);
	СкорректироватьВерсиюКомиссии(Элементы.ГруппаШаг2Пункт1ДекорацияИнформацияПодсказка.Заголовок);
	СкорректироватьВерсиюКомиссии(Элементы.ГруппаШаг2Пункт2ДекорацияИнформацияПодсказка.Заголовок);
	СкорректироватьВерсиюКомиссии(Элементы.ГруппаШаг2Пункт3ДекорацияИнформацияПодсказка.Заголовок);
	СкорректироватьВерсиюКомиссии(Элементы.Шаг3Декорация1.Заголовок);
	
	ТекстЗавершенияПерехода = НСтр("ru = 'отключить режим ""Комиссионных продаж версии 2.0""'");
	СкорректироватьВерсиюКомиссии(ТекстЗавершенияПерехода);
	
	ЗаголовокСтатусаЗавершения = Новый Массив;
	ЗаголовокСтатусаЗавершения.Добавить(НСтр("ru = 'В процессе перевода не возникло ошибок, все операции были выполнены.
		|Для завершения перехода необходимо '"));
	ЗаголовокСтатусаЗавершения.Добавить(Новый ФорматированнаяСтрока(ТекстЗавершенияПерехода,,,,"ЗавершитьПереход"));
	ЗаголовокСтатусаЗавершения.Добавить(".");
	
	Элементы.Шаг3Декорация3.Заголовок = Новый ФорматированнаяСтрока(ЗаголовокСтатусаЗавершения);
	
	СобытиеЖурналаРегистрации = НСтр("ru = 'Переход на новые комиссионные продажи'");
	
	ТекстПроверкиАктивныхСеансов = Обработки.ПомощникПереходаНаКомиссионныеПродажиВерсии25.ТекстПроверкиАктивныхСеансов();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьЭлементовСтраницы(Страница)
	
	Элементы.Назад.Видимость = Ложь;
	Элементы.Далее.Видимость = Ложь;
	Элементы.ЗапуститьПереход.Видимость = Ложь;
	Элементы.ОбновитьСтатусПерехода.Видимость = Ложь;
	
	Если Страница = Элементы.ГруппаШаг1 Тогда
		
		Элементы.Далее.Видимость = Истина;
		Элементы.Далее.КнопкаПоУмолчанию = Истина;
		//++ Локализация
		Элементы.Шаг1ДекорацияИнформация4.Видимость = Истина;
		//-- Локализация
		
	ИначеЕсли Страница = Элементы.ГруппаШаг2 Тогда
		
		Элементы.ОбновитьСтатусПерехода.Видимость = Истина;
		
		Элементы.ЗапуститьПереход.Видимость = Не ДанныеОбработаны;
		Элементы.Далее.Видимость = ДанныеОбработаны;
		
		Элементы.ЗапуститьПереход.КнопкаПоУмолчанию = Не ДанныеОбработаны;
		Элементы.Далее.КнопкаПоУмолчанию = ДанныеОбработаны;
		
		Элементы.Назад.Видимость = Истина;
		
	ИначеЕсли Страница = Элементы.ГруппаШаг3 Тогда
		
		Элементы.Шаг3Декорация3.Видимость = Не ПереходЗавершен;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьКомандыЗавершенияПерехода()
	
	Если ДанныеОбработаны Или ПереходЗавершен Тогда
		ОткрытьСтраницу(Элементы.ГруппаШаг3);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьВыполнениеЗадания(Задание = Неопределено)
	
	Если Задание = Неопределено Тогда
		Задание = ПроверитьЗаданиеВыполнено(ИдентификаторЗадания, АдресРезультата);
	КонецЕсли;
	
	ОбновлениеСтатусаПерехода();
	
	Если Задание.Статус = "Выполнено" 
		Или Задание.Статус = "Ошибка" Тогда
		
		ОбработатьЗавершениеПереносаДанных(РезультатВыполненияЗадания(Задание));

	Иначе
		
		ТекущийИнтервалПроверкиРезультата = ТекущийИнтервалПроверкиРезультата * 1.4;
		Если ТекущийИнтервалПроверкиРезультата > 5 Тогда
			ТекущийИнтервалПроверкиРезультата = 5;
		КонецЕсли;
		
		ПодключитьОбработчикОжидания("Подключаемый_ПроверитьВыполнениеЗадания", ТекущийИнтервалПроверкиРезультата, Истина);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПроверитьВыполнениеЗадания()

	ПроверитьВыполнениеЗадания();
	ОбновлениеСтатусаПерехода();

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПроверитьЗаданиеВыполнено(Знач ИдентификаторЗадания, Знач АдресРезультата)
	
	Задание = ДлительныеОперации.ОперацияВыполнена(ИдентификаторЗадания);
	
	ДобавитьРезультатыВыполненияЗадания(Задание, ИдентификаторЗадания, АдресРезультата);
	
	Возврат Задание;
	
КонецФункции

&НаСервереБезКонтекста
Процедура ДобавитьРезультатыВыполненияЗадания(Задание, ИдентификаторЗадания, АдресРезультата)

	Если ИдентификаторЗадания <> Неопределено Тогда
		Прогресс = ДлительныеОперации.ПрочитатьПрогресс(ИдентификаторЗадания);
	Иначе
		Прогресс = Неопределено;
	КонецЕсли;
	Задание.Вставить("СостояниеЭтапов", ?(Прогресс <> Неопределено, Прогресс.ДополнительныеПараметры, Неопределено));
	Задание.Вставить("Результат", ПолучитьИзВременногоХранилища(АдресРезультата));

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция РезультатВыполненияЗадания(Задание)
	
	Если Задание = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Результат = Новый Структура;
	Результат.Вставить("Статус", Задание.Статус);
	Результат.Вставить("КраткоеПредставлениеОшибки", Задание.КраткоеПредставлениеОшибки);
	Результат.Вставить("ПодробноеПредставлениеОшибки", Задание.ПодробноеПредставлениеОшибки);
	Результат.Вставить("Результат", Задание.Результат);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ОбработатьЗавершениеПереносаДанных(РезультатВыполненияЗадания)

	Если РезультатВыполненияЗадания <> Неопределено 
		И РезультатВыполненияЗадания.Статус = "Ошибка"
		И НЕ ЗначениеЗаполнено(РезультатВыполненияЗадания.ПодробноеПредставлениеОшибки)
		И НЕ ЗначениеЗаполнено(ИдентификаторЗадания) Тогда
		РезультатВыполненияЗадания.Статус = "Отменено";
	КонецЕсли; 
	
	ИдентификаторЗадания = Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000");
	
	Если РезультатВыполненияЗадания <> Неопределено Тогда
		СтатусФоновогоЗадания = РезультатВыполненияЗадания.Статус;
		ПодробноеПредставлениеОшибки = РезультатВыполненияЗадания.ПодробноеПредставлениеОшибки;
	Иначе
		СтатусФоновогоЗадания = "Ошибка";
		ПодробноеПредставлениеОшибки = Неопределено;
	КонецЕсли; 
	
	РезультатВыполненияФоновогоЗадания = Новый ФиксированнаяСтруктура(
		"СтатусФоновогоЗадания,ПодробноеПредставлениеОшибки",
		СтатусФоновогоЗадания,
		ПодробноеПредставлениеОшибки);
	
	Если РезультатВыполненияЗадания <> Неопределено Тогда
		
		ЕстьОшибки = СтатусФоновогоЗадания = "Ошибка"
			Или РезультатВыполненияЗадания.Результат.ОшибкиДоговорыСКлиентами > 0
			Или РезультатВыполненияЗадания.Результат.ОшибкиДокументовВозвратОтКомиссионера > 0
			Или РезультатВыполненияЗадания.Результат.ОшибкиДокументовПередачаКомиссионеру > 0
			Или РезультатВыполненияЗадания.Результат.ОшибкиСоглашенияСКлиентами > 0
		
	КонецЕсли;
	
	Если РезультатВыполненияФоновогоЗадания.СтатусФоновогоЗадания = "Отменено"
		ИЛИ РезультатВыполненияФоновогоЗадания.СтатусФоновогоЗадания = "Ошибка" Тогда
		
		Если РезультатВыполненияФоновогоЗадания.СтатусФоновогоЗадания = "Ошибка"
			И Не ВводДоступен() Тогда
		
			ТекстОповещения = НСтр("ru = 'Перенос данных не завершен'");
			ПоказатьОповещениеПользователя(НСтр("ru = 'Помощник перехода'"),, ТекстОповещения, БиблиотекаКартинок.Ошибка32);
			
		КонецЕсли;
		
	Иначе
		
		Если Не ВводДоступен() Тогда
			ТекстОповещения = НСтр("ru = 'Перенос данных завершен'");
			ПоказатьОповещениеПользователя(НСтр("ru = 'Помощник перехода'"),, ТекстОповещения);
		КонецЕсли; 
		
	КонецЕсли; 
	
	ОбновитьШаги();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПеренестиДанныеНаСервере(Знач ПараметрыПроцедуры, Знач УникальныйИдентификатор)

	ИмяПроцедуры = "Обработки.ПомощникПереходаНаКомиссионныеПродажиВерсии25.ВыполнитьПереносДанных";
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	
	НаименованиеФоновогоЗадания = НСтр("ru = 'Выполнение помощника перехода на комиссионные продажи 2.5 (выполняется перенос данных)'");
	СкорректироватьВерсиюКомиссии(НаименованиеФоновогоЗадания);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НаименованиеФоновогоЗадания;
	
	КлючФоновогоЗадания = "ПомощникПереходаНаКомиссионныеПродажиВерсии25";
	ПараметрыВыполнения.КлючФоновогоЗадания = КлючФоновогоЗадания;
	
	ДлительнаяОперация = ДлительныеОперации.ВыполнитьВФоне(ИмяПроцедуры, ПараметрыПроцедуры, ПараметрыВыполнения);
	
	ДобавитьРезультатыВыполненияЗадания(
		ДлительнаяОперация, 
		ДлительнаяОперация.ИдентификаторЗадания,
		ДлительнаяОперация.АдресРезультата);
	
	Возврат ДлительнаяОперация;

КонецФункции

&НаСервереБезКонтекста
Процедура СкорректироватьВерсиюКомиссии(Строка)
	
	Обработки.ПомощникПереходаНаКомиссионныеПродажиВерсии25.СкорректироватьВерсиюКомиссии(Строка);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СтатусПерехода()
	
	СтатусПерехода = Обработки.ПомощникПереходаНаКомиссионныеПродажиВерсии25.СтатусПереходаНаКомиссионныеПродажи25();
	Возврат СтатусПерехода;
	
КонецФункции

&НаКлиенте
Процедура ОбновитьШаги()
	
	ЖирныйШрифт = Новый Шрифт(, , Истина);
	ОбычныйШрифт = Новый Шрифт();
	
	Если СоглашенияОбработаны Тогда
		Элементы.ГруппаШаг2Пункт1Картинка.Картинка = БиблиотекаКартинок.ВыполнениеЗавершено32;
		Элементы.ГруппаШаг2Пункт1ДекорацияИнформация.Шрифт = ЖирныйШрифт;
		Элементы.ГруппаШаг2Пункт1ДекорацияИнформация.Заголовок
			= НСтр("ru = '1. Перенос соглашений с клиентами выполнен.'");
	Иначе
		Элементы.ГруппаШаг2Пункт1Картинка.Картинка = БиблиотекаКартинок.ВыполнениеНачалось32;
		Элементы.ГруппаШаг2Пункт1ДекорацияИнформация.Шрифт = ОбычныйШрифт;
		Элементы.ГруппаШаг2Пункт1ДекорацияИнформация.Заголовок
			= НСтр("ru = '1. Перенос соглашений с клиентами.'");
	КонецЕсли;

	Если ДоговорыОбработаны Тогда
		Элементы.ГруппаШаг2Пункт2Картинка.Картинка = БиблиотекаКартинок.ВыполнениеЗавершено32;
		Элементы.ГруппаШаг2Пункт2ДекорацияИнформация.Шрифт = ЖирныйШрифт;
		Элементы.ГруппаШаг2Пункт2ДекорацияИнформация.Заголовок
			= НСтр("ru = '2. Перенос договоров с клиентами выполнен.'");
	Иначе
		Элементы.ГруппаШаг2Пункт2Картинка.Картинка = БиблиотекаКартинок.ВыполнениеНачалось32;
		Элементы.ГруппаШаг2Пункт2ДекорацияИнформация.Шрифт = ОбычныйШрифт;
		Элементы.ГруппаШаг2Пункт2ДекорацияИнформация.Заголовок
			= НСтр("ru = '2. Перенос договоров с клиентами.'");
	КонецЕсли;

	Если ОстаткиОбработаны Тогда
		Элементы.ГруппаШаг2Пункт3Картинка.Картинка = БиблиотекаКартинок.ВыполнениеЗавершено32;
		Элементы.ГруппаШаг2Пункт3ДекорацияИнформация.Шрифт = ЖирныйШрифт;
		Элементы.ГруппаШаг2Пункт3ДекорацияИнформация.Заголовок 
			= НСтр("ru = '3. Перенос остатков товаров, переданных на комиссию выполнен.'");
	Иначе
		Элементы.ГруппаШаг2Пункт3Картинка.Картинка = БиблиотекаКартинок.ВыполнениеНачалось32;
		Элементы.ГруппаШаг2Пункт3ДекорацияИнформация.Шрифт = ОбычныйШрифт;
		Элементы.ГруппаШаг2Пункт3ДекорацияИнформация.Заголовок 
			= НСтр("ru = '3. Перенос остатков товаров, переданных на комиссию.'");
	КонецЕсли;
	
	Если ДанныеОбработаны И Не ЕстьОшибки Тогда
		Элементы.ГруппаПереносДанныхЗаголовок.Видимость = Ложь;
	КонецЕсли;
	
	Если ЕстьОшибки Тогда
		Элементы.ГруппаПереносДанныхЗаголовок.Видимость = Истина;
		Элементы.ДекорацияСтатусПереносаДанных.Картинка = БиблиотекаКартинок.Внимание32;
		
		ЗаголовокСтатусаЗавершения = Новый Массив;
		ЗаголовокСтатусаЗавершения.Добавить(НСтр("ru = 'В процессе перехода возникли ошибки, подробности см. в '"));
		ЗаголовокСтатусаЗавершения.Добавить(Новый ФорматированнаяСтрока(НСтр("ru = 'Журнале регистрации'"),,,,"ОткрытьЖурналРегистрации"));
		ЗаголовокСтатусаЗавершения.Добавить(".");
		
		Элементы.ДекорацияЗаголовокПереносаданных.Заголовок = Новый ФорматированнаяСтрока(ЗаголовокСтатусаЗавершения);
	КонецЕсли;
	
	Если ПереходЗавершен Тогда
		
		Элементы.Шаг3Декорация1.Заголовок = НСтр("ru = 'Переход произведен!'");
		
	КонецЕсли;
	
	УстановитьВидимостьЭлементовСтраницы(Элементы.Страницы.ТекущаяСтраница);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСтраницу(Страница)
	
	Элементы.Страницы.ТекущаяСтраница = Страница;
	
	УстановитьВидимостьЭлементовСтраницы(Страница);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьЖурналРегистрации()
	
	Отбор = Новый Структура;
	Отбор.Вставить("СобытиеЖурналаРегистрации", СобытиеЖурналаРегистрации);
	ЖурналРегистрацииКлиент.ОткрытьЖурналРегистрации(Отбор);
	
КонецПроцедуры

&НаКлиенте
Процедура ОповеститьОбОкончанииПерехода()
	
	Оповестить("ОкончаниеПереходаНаКомиссионныеПродажи25");
	ОбновитьШаги();
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура ЗавершитьПереход()
	
	ИнформацияОСоединениях = ИнформацияОСоединениях();
	Если ИнформацияОСоединениях.НаличиеАктивныхСоединений Тогда
		
		ТекстСообщения = ТекстПроверкиАктивныхСеансов;
		ПредупреждениеАсинх(ТекстСообщения);
		
		Возврат;
		
	КонецЕсли;
	
	ЗавершитьПереходНаСервере();
	ОбщегоНазначенияКлиент.ОбновитьИнтерфейсПрограммы();
	ОповеститьОбОкончанииПерехода();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ИнформацияОСоединениях()
	
	Информация = СоединенияИБ.ИнформацияОСоединениях();
	Возврат Информация;
	
КонецФункции

&НаСервереБезКонтекста
Процедура ЗавершитьПереходНаСервере()
	
	Обработки.ПомощникПереходаНаКомиссионныеПродажиВерсии25.ЗавершитьПереходНаКомиссию25();
	
КонецПроцедуры

#КонецОбласти