
#Область ПрограммныйИнтерфейс

// Проверяет документ на обязательные параметры.
// 
// Параметры:
//  Данные - см. ДенежныеСредстваСервер.ДанныеДокумента.
//  Ошибка - Булево - признак наличия ошибки.
// 
Процедура ПроверитьДанныеДокументаДляВводаПлатежнойСсылки(Данные, Ошибка) Экспорт

	СистемаБыстрыхПлатежейУТ.ПроверитьДанныеДокументаДляВводаПлатежнойСсылки(Данные, Ошибка);

КонецПроцедуры

// Возвращает настройки подключения по документу.
// 
// Параметры:
//  Данные - см. ДенежныеСредстваСервер.ДанныеДокумента.
// 
// Возвращаемое значение:
//  см. СистемаБыстрыхПлатежейУТ.ДоступныеНастройкиПодключения.
Функция ДоступныеНастройкиПодключения(Данные) Экспорт

	Возврат СистемаБыстрыхПлатежейУТ.ДоступныеНастройкиПодключения(Данные);

КонецФункции

// Возвращает ключ записи регистра сведений, хранящий идентификаторы оплат по СБП.
// 
// Параметры:
//  Документ - ДокументСсылка - документ, по которому выполняется поиск идентификатора.
// 
// Возвращаемое значение:
//  РегистрСведенийКлючЗаписи.ИдентификаторыОперацийСБПc2b, РегистрСведенийКлючЗаписи.ИдентификаторыОперацийСБПb2b - Ключ записи идентификатора СБП
Функция КлючЗаписиИдентификатораСБП(Документ) Экспорт

	Возврат СистемаБыстрыхПлатежейУТ.КлючЗаписиИдентификатораСБППоДокументу(Документ)

КонецФункции

// Возвращает ключ записи регистра сведений, хранящий входящие ссылки СБП.
// 
// Параметры:
//  Документ - ДокументСсылка - документ, по которому выполняется поиск платежной ссылки.
// 
// Возвращаемое значение:
//  РегистрСведенийКлючЗаписи.ВходящиеПлатежныеСсылкиСБП - Ключ записи входящей ссылки СБП.
//
Функция КлючЗаписиВходящейСсылкиСБП(Документ) Экспорт

	Возврат СистемаБыстрыхПлатежейУТ.КлючЗаписиВходящейСсылкиСБП(Документ)

КонецФункции

// см. СистемаБыстрыхПлатежейУТ.ЗаданиеНаПолучениеДанныхПоПлатежнойСсылке
Функция ЗаданиеНаПолучениеДанныхПоПлатежнойСсылке(ПараметрыПроцедуры) Экспорт

	Возврат СистемаБыстрыхПлатежейУТ.ЗаданиеНаПолучениеДанныхПоПлатежнойСсылке(ПараметрыПроцедуры);

КонецФункции 

// см. СистемаБыстрыхПлатежейУТ.ЗаданиеНаЗагрузкуСтатусовОпераций
Функция ЗаданиеНаЗагрузкуСтатусовОпераций() Экспорт

	Возврат СистемаБыстрыхПлатежейУТ.ЗаданиеНаЗагрузкуСтатусовОпераций();

КонецФункции

// см. СистемаБыстрыхПлатежейУТ.ЗаданиеНаОбновлениеСтатусаОплатыПоДокументу
Функция ЗаданиеНаОбновлениеСтатусаОплатыПоДокументу(ПараметрыПроцедуры) Экспорт

	Возврат СистемаБыстрыхПлатежейУТ.ЗаданиеНаОбновлениеСтатусаОплатыПоДокументу(ПараметрыПроцедуры);

КонецФункции

// Возвращает признак наличия оплаты документа по платежной ссылке СБП.
// 
// Параметры:
//  ДокументОперации - ДокументСсылка - Документ, для которого выполняется проверка.
//  Контрагент - СправочникСсылка.Контрагенты - плательщик по документу.
// 
// Возвращаемое значение:
//  Булево - признак оплаты.
Функция ЕстьТекущаяОплатаПлатежнойСсылкиСБП(ДокументОперации, Контрагент) Экспорт

	Если Не ЗначениеЗаполнено(Контрагент) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ВидКонтрагента = ДенежныеСредстваСервер.ВидКонтрагентаДокументаОперации(ДокументОперации, Перечисления.ТипыРасчетовСПартнерами.РасчетыСКлиентом);
	
	Если ВидКонтрагента = Перечисления.ЮрФизЛицо.ФизЛицо Тогда
		ИмяИсточника = Метаданные.РегистрыСведений.ИдентификаторыОперацийСБПc2b.ПолноеИмя();
	ИначеЕсли ВидКонтрагента <> Перечисления.ЮрФизЛицо.ФизЛицо
		И ВидКонтрагента <> Перечисления.ЮрФизЛицо.ПустаяСсылка() Тогда
		ИмяИсточника = Метаданные.РегистрыСведений.ИдентификаторыОперацийСБПb2b.ПолноеИмя();
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
	ДокументыОперации = СистемаБыстрыхПлатежейУТ.ДокументыОперации(ДокументОперации);
	
	СхемаЗапроса = Новый СхемаЗапроса;
	ЗапросВыбора = СхемаЗапроса.ПакетЗапросов[0];
	ОператорВыбора = ЗапросВыбора.Операторы[0];
	ОператорВыбора.Источники.Добавить(ИмяИсточника, "ИдентификаторыОперацийСБП");
	ОператорВыбора.Отбор.Добавить("ИдентификаторыОперацийСБП.ДокументОперации В (&ДокументыОпераций)");
	ОператорВыбора.Отбор.Добавить("ИдентификаторыОперацийСБП.СтатусОперации = &СтатусОперации");
	ОператорВыбора.Отбор.Добавить("ИдентификаторыОперацийСБП.ДатаОперации >= &НачалоТекущегоДня");
	ОператорВыбора.ВыбираемыеПоля.Добавить("ДокументОперации");
	
	ТекстЗапроса = СхемаЗапроса.ПолучитьТекстЗапроса();
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("ДокументыОпераций", ДокументыОперации);
	Запрос.УстановитьПараметр("СтатусОперации", НастройкиПлатежныхСистемСлужебный.ИдентификаторСтатусаВыполнена());
	Запрос.УстановитьПараметр("НачалоТекущегоДня", НачалоДня(ТекущаяДатаСеанса()));
	
	УстановитьПривилегированныйРежим(Истина);
	РезультатЗапроса = Запрос.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Если Не РезультатЗапроса.Пустой() Тогда
	
		СтруктураПараметров = ДенежныеСредстваСервер.ПараметрыПоТипуРасчетов(
			ДокументОперации, Перечисления.ТипыРасчетовСПартнерами.РасчетыСКлиентом);
			
		Если СтруктураПараметров = Неопределено Тогда
			Возврат Ложь;
		КонецЕсли;
		
		СостояниеВзаиморасчетов = ВзаиморасчетыСервер.СостояниеВзаиморасчетов(ДокументОперации, СтруктураПараметров);
		
		Если СостояниеВзаиморасчетов.ПроцентОплат = 0 Тогда
			Возврат Ложь;
		Иначе
			Возврат Истина;
		КонецЕсли;
		
	Иначе
		Возврат Ложь;
	КонецЕсли;

КонецФункции

#КонецОбласти
