///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2026, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// Подсистема "ИнтернетПоддержкаПользователей.СистемаБыстрыхПлатежей.ПереводыСБПc2b".
// ОбщийМодуль.ПереводыСБПc2bКлиент.
//
// Клиентские процедуры переводов СБП (c2b):
//  - Переход к инструкциям и отчетам.
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Открывает форму подключения кассовой ссылки.
//
// Параметры:
//  НастройкаПодключения - СправочникСсылка.НастройкиПодключенияКСистемеБыстрыхПлатежей - настройка выполнения оплаты.
//  ОписаниеОповещение - ОписаниеОповещения, Неопределенно - оповещение, которое будет вызвано после завершения операции.
//   Если подключение не удалось завершить будет возвращено Неопределенно. В случае успешного подключения
//   результат выполнения будет содержать структуру:
//    * КассоваяСсылка - Строка - ссылка, по которой будет выполнятся оплата;
//    * ИдентификаторОплаты - Строка - идентификатор зарегистрированной ссылки;
//  Владелец - ФормаКлиентскогоПриложения - форма которая будет установлена в качестве владельца. 
//
Процедура ПодключитьКассовуюСсылку(
		НастройкаПодключения,
		ОписаниеОповещение,
		Владелец) Экспорт
	
	// Проверка входных параметров
	ИмяФункции = "ПереводыСБПc2bКлиент.ПодключитьКассовуюСсылку";
	ОбщегоНазначенияКлиентСервер.ПроверитьПараметр(
		ИмяФункции,
		"НастройкаПодключения",
		НастройкаПодключения,
		Тип("СправочникСсылка.НастройкиПодключенияКСистемеБыстрыхПлатежей"));
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("НастройкаПодключения", НастройкаПодключения);
	
	ОткрытьФорму(
		"ОбщаяФорма.ПодключениеКассовойСсылки",
		ПараметрыФормы,
		Владелец,
		,
		,
		,
		ОписаниеОповещение);
	
КонецПроцедуры

// Открывает форму реестра операций.
//
// Параметры:
//  Владелец - ФормаКлиентскогоПриложения - форма которая будет установлена в качестве владельца.
//
Процедура РеестрОперацийСБПc2b(Владелец) Экспорт
	
	ОткрытьФорму(
		"Отчет.РеестрОперацийСБПc2b.ФормаОбъекта",
		,
		Владелец);
	
КонецПроцедуры

#Область УстаревшиеПроцедурыИФункции

// Устарела. Следует использовать СистемаБыстрыхПлатежейКлиент.ОткрытьИнструкциюПоПрограммированиюNFCМетки.
// Открывает инструкцию по программированию NFC меток.
//
Процедура ОткрытьИнструкциюПоПрограммированиюNFCМетки() Экспорт
	
	СистемаБыстрыхПлатежейКлиент.ОткрытьИнструкциюПоПрограммированиюNFCМетки();
	
КонецПроцедуры

// Устарела. Следует использовать СистемаБыстрыхПлатежейКлиент.ОткрытьОписаниеКассовыхСсылок.
// Открывает описание функциональности кассовых ссылок.
//
Процедура ОткрытьОписаниеКассовыхСсылок() Экспорт
	
	СистемаБыстрыхПлатежейКлиент.ОткрытьОписаниеКассовыхСсылок();
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// См. ОтчетыКлиентПереопределяемый.ОбработкаВыбораТабличногоДокумента.
//
Процедура ПриОбработкеВыбораТабличногоДокумента(ФормаОтчета, Элемент, Область, СтандартнаяОбработка) Экспорт
	
	Если ТипЗнч(Область) = Тип("РисунокТабличногоДокумента")
		Или Область.ТипОбласти <> ТипОбластиЯчеекТабличногоДокумента.Прямоугольник Тогда
		Возврат;
	КонецЕсли;
	
	Если Область.Расшифровка = "ПодключитьИнтернетПоддержкуПользователейРеестрСБП" Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("ФормаОтчета", ФормаОтчета);
		
		ОписаниеОповещения = Новый ОписаниеОповещения(
			"ПослеПодключенияИнтернетПоддержкиПользователей",
			ЭтотОбъект,
			ДополнительныеПараметры);
		
		ИнтернетПоддержкаПользователейКлиент.ПодключитьИнтернетПоддержкуПользователей(
			ОписаниеОповещения,
			ФормаОтчета);
		
	КонецЕсли;
	
КонецПроцедуры

// Выполняет формирование отчета после ввода данных аутентификации.
//
// Параметры:
//  Результат - Строка - результат ввода логина и пароля;
//  ДополнительныеПараметры - Структура - дополнительные параметры.
//
Процедура ПослеПодключенияИнтернетПоддержкиПользователей(
		Результат,
		ДополнительныеПараметры) Экспорт
	
	Если Не ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.ВариантыОтчетов") Тогда
		ВызватьИсключение НСтр("ru = 'Не внедрена подсистема ""Варианты отчетов"".'");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Результат) Тогда
		МодульОтчетыКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ОтчетыКлиент");
		МодульОтчетыКлиент.СформироватьОтчет(ДополнительныеПараметры.ФормаОтчета);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти